
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Режим 									= РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла 					= Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла 		= "";
	ДиалогОткрытияФайла.Заголовок 			= НСтр("ru='Выберите каталог'");
	ДиалогОткрытияФайла.МножественныйВыбор 	= Ложь;
	
	// Синхронный вызов
	//Если ДиалогОткрытияФайла.Выбрать() Тогда
	//	ПутьСохранения = ДиалогОткрытияФайла.Каталог;
	//	ВыгрузитьНаСервере(ПараметрКоманды,ПутьСохранения);
	//КонецЕсли;
	
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораКаталога", ЭтотОбъект, ПараметрКоманды);
	ДиалогОткрытияФайла.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораКаталога(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			ВыгрузитьНаСервере(ДополнительныеПараметры,ТекЭлемент);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере(МассивЛС,Путь)
	ОбработкаОбъект = Обработки.СМ_ОбменESTML.Создать();
	ОбработкаОбъект.ВыгрузитьНаСервере(Путь,МассивЛС);
КонецПроцедуры

#КонецОбласти
