
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ВидимостьСтроительныхРабот = ПолучитьФункциональнуюОпцию("УСОERP_ИспользоватьСтарыйВариантСценариев");
	
	Элементы.ОткрытьСправочникСтроительныеРаботы.Видимость = ВидимостьСтроительныхРабот;
	Элементы.ДекорацияСтроительныеРаботы.Видимость = ВидимостьСтроительныхРабот;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбщиеСправочники

&НаКлиенте
Процедура ОткрытьСправочникОбъектыСтроительства(Команда)
	
	ОткрытьФорму("Справочник.СМ_ОбъектыСтроительства.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСтроительныеРаботы(Команда)
	
	ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникНоменклатура(Команда)
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникВидыРабот(Команда)
	
	ОткрытьФорму("Справочник.УСОERP_ВидыРабот.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникШаблоныСтроительныхРабот(Команда)
	
	ОткрытьФорму("Справочник.УСОERP_ШаблоныСтроительныхРабот.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСклады(Команда)
	
	ОткрытьФорму("Справочник.Склады.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникКонтрагенты(Команда)
	
	ОткрытьФорму("Справочник.Контрагенты.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникПартнеры(Команда)
	
	ОткрытьФорму("Справочник.Партнеры.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникРесурсы(Команда)
	
	ОткрытьФорму("Справочник.УСОERP_Ресурсы.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСоставРесурсов(Команда)
	
	ОткрытьФорму("Справочник.УСОERP_СоставРесурсов.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникДолжности(Команда)
	
	ОткрытьФорму("Справочник.Должности.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникСценарииПланированияПроектовСтроительства(Команда)
	
	ОткрытьФорму("Справочник.УСОERP_СценарииПланированияПроектовСтроительства.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникКонструктив(Команда)
	
	ОткрытьФорму("Справочник.УСОERP_Конструктив.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникГрафикиРаботыСотрудников(Команда)
	
	ОткрытьФорму("Справочник.ГрафикиРаботыСотрудников.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСправочникТипыМашинИМеханизмов(Команда)
	
	ОткрытьФорму("Справочник.ТипыТранспортныхСредств.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


