
#Область ОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	// Контроль заполнения таблицы датчиков
	
	Для Каждого СтрокаДатчики Из Датчики Цикл
		Если СтрокаДатчики.Датчик.Пустая() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Таблица датчиков, строка №'")+СтрокаДатчики.НомерСтроки
															  +НСтр("ru = ', не указан датчик!'"));		
		КонецЕсли;
		
		Если СтрокаДатчики.Назначение.Пустая() Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Таблица датчиков, строка №'")+СтрокаДатчики.НомерСтроки
															  +НСтр("ru = ', не указано назначение датчика!'"));		
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти 
