#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	// Проверяем период
	ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных("Период");
	Если ПараметрКомпоновкиДанных <> Неопределено Тогда
		ПараметрКомпоновкиДанных = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
		Если ПараметрКомпоновкиДанных <> Неопределено Тогда
			Если НЕ ЗначениеЗаполнено(ПараметрКомпоновкиДанных.Значение.ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ПараметрКомпоновкиДанных.Значение.ДатаОкончания) Тогда
				Отказ = Ложь;
				УстановитьГраницыПериодаПоЗаписямРегистров(ПараметрКомпоновкиДанных.Значение, Отказ);
				Если Отказ Тогда
					Возврат;
				КонецЕсли;
			КонецЕсли;
			ПараметрКомпоновкиДанных.Использование = Истина;
			Период = ПараметрКомпоновкиДанных.Значение;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных("НачалоПериода");
	Если ПараметрКомпоновкиДанных <> Неопределено Тогда
		ПараметрКомпоновкиДанных = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
		Если ПараметрКомпоновкиДанных <> Неопределено Тогда
			ПараметрКомпоновкиДанных.Значение = Период.ДатаНачала;
			ПараметрКомпоновкиДанных.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных("КонецПериода");
	Если ПараметрКомпоновкиДанных <> Неопределено Тогда
		ПараметрКомпоновкиДанных = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
		Если ПараметрКомпоновкиДанных <> Неопределено Тогда
			ПараметрКомпоновкиДанных.Значение = Период.ДатаОкончания;
			ПараметрКомпоновкиДанных.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрКомпоновкиДанных = Новый ПараметрКомпоновкиДанных("ДатаСрез");
	Если ПараметрКомпоновкиДанных <> Неопределено Тогда
		ПараметрКомпоновкиДанных = НастройкиОтчета.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновкиДанных);
		Если ПараметрКомпоновкиДанных <> Неопределено Тогда
			ПараметрКомпоновкиДанных.Значение = Период.ДатаОкончания;
			ПараметрКомпоновкиДанных.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);
	
	КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(ПолучитьСтруктуруЗаголовковПолей(), МакетКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьГраницыПериодаПоЗаписямРегистров(Период, Отказ)
	
	Запрос = Новый Запрос;
	
	// Если период задан, то просто возьмем все периоды
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	УСОERP_ВыполнениеРаботЗаказчика.Период КАК Период
	|ПОМЕСТИТЬ ВыполнениеРаботЗаказчика_МинимальныйПериод
	|ИЗ
	|	РегистрНакопления.УСОERP_ВыполнениеРаботЗаказчика КАК УСОERP_ВыполнениеРаботЗаказчика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	УСОERP_ВыполнениеРаботЗаказчика.Период КАК Период
	|ПОМЕСТИТЬ ВыполнениеРаботЗаказчика_МаксимальныйПериод
	|ИЗ
	|	РегистрНакопления.УСОERP_ВыполнениеРаботЗаказчика КАК УСОERP_ВыполнениеРаботЗаказчика
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	УСОERP_ВыполнениеРаботСубподрядчиком.Период КАК Период
	|ПОМЕСТИТЬ ВыполнениеРаботСубподрядчиком_МинимальныйПериод
	|ИЗ
	|	РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком КАК УСОERP_ВыполнениеРаботСубподрядчиком
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	УСОERP_ВыполнениеРаботСубподрядчиком.Период КАК Период
	|ПОМЕСТИТЬ ВыполнениеРаботСубподрядчиком_МаксимальныйПериод
	|ИЗ
	|	РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком КАК УСОERP_ВыполнениеРаботСубподрядчиком
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыполнениеРаботЗаказчика_МинимальныйПериод.Период КАК Период
	|ИЗ
	|	ВыполнениеРаботЗаказчика_МинимальныйПериод КАК ВыполнениеРаботЗаказчика_МинимальныйПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыполнениеРаботЗаказчика_МаксимальныйПериод.Период
	|ИЗ
	|	ВыполнениеРаботЗаказчика_МаксимальныйПериод КАК ВыполнениеРаботЗаказчика_МаксимальныйПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыполнениеРаботСубподрядчиком_МинимальныйПериод.Период
	|ИЗ
	|	ВыполнениеРаботСубподрядчиком_МинимальныйПериод КАК ВыполнениеРаботСубподрядчиком_МинимальныйПериод
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыполнениеРаботСубподрядчиком_МаксимальныйПериод.Период
	|ИЗ
	|	ВыполнениеРаботСубподрядчиком_МаксимальныйПериод КАК ВыполнениеРаботСубподрядчиком_МаксимальныйПериод
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	ТаблицаПериодов = Запрос.Выполнить().Выгрузить();
	
	// Если есть записи, то выбираем первую строку как начало периода и последнюю - как конец периода
	Если ТаблицаПериодов.Количество() Тогда
		Если НЕ ЗначениеЗаполнено(Период.ДатаНачала) Тогда
			Период.ДатаНачала = ТаблицаПериодов[0].Период;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
			Период.ДатаОкончания = ТаблицаПериодов[ТаблицаПериодов.Количество()-1].Период;
		КонецЕсли;
	Иначе
		// Если записей вообще нет, то и данных не будет.
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не указаны границы периода!'"));
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьСтруктуруЗаголовковПолей()
	
	Возврат КомпоновкаДанныхСервер.СтруктураЗаголовковПолейЕдиницИзмерений(КомпоновщикНастроек);
	
КонецФункции

#КонецОбласти

#КонецЕсли