
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Функция ПоискСуществующегоКОАТУУ(Знач ПараметрыФормы)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторКОАТУУ.Ссылка
	|ИЗ
	|	Справочник.КлассификаторКОАТУУ КАК КлассификаторКОАТУУ
	|ГДЕ
	|	КлассификаторКОАТУУ.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", ПараметрыФормы.ЗначенияЗаполнения.Код);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьВыбор(ТекущаяОбласть)
	
	Код         = ТабДокумент.Область(ТекущаяОбласть.Верх, ОбластьКодЛево,
		ТекущаяОбласть.Низ, ОбластьКодПраво).Текст;
	Наименование = ТабДокумент.Область(ТекущаяОбласть.Верх, ОбластьНаименованиеЛево,
		ТекущаяОбласть.Низ, ОбластьНаименованиеПраво).Текст;
	
	ЗначенияЗаполнения = Новый Структура("Код, Наименование",
		Код, СтрПолучитьСтроку(Наименование, 1));
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ТекущийКОАТУУ = ПоискСуществующегоКОАТУУ(ПараметрыФормы);
	
	Если ТекущийКОАТУУ <> Неопределено Тогда
		
		ПараметрыФормы = Новый Структура("Ключ", ТекущийКОАТУУ);

		Сообщить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='В справочнике ""Классификатор КОАТУУ"" уже существует элемент с кодом ""%1""! Открыт существующий';uk='У довіднику ""Класифікатор КОАТУУ"" вже існує елемент з кодом ""%1""! Відкритий існуючий'"), Код));
		
		ОткрытьФорму("Справочник.КлассификаторКОАТУУ.Форма.ФормаЭлемента",
			ПараметрыФормы, ЭтаФорма);
	Иначе	
		
		ОткрытьФорму("Справочник.КлассификаторКОАТУУ.Форма.ФормаЭлемента",
			ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПоискаПриИзменении(Элемент)
	
	ИскатьСтрокуВТаблице(Неопределено);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Выбрать(Команда)
	
	Область = Элементы.ТабДокумент.ТекущаяОбласть;
	ВыполнитьВыбор(Область);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Область = Элементы.ТабДокумент.ТекущаяОбласть;
	ВыполнитьВыбор(Область);
	
КонецПроцедуры

&НаКлиенте
Процедура ИскатьСтрокуВТаблице(Команда)
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		ПоказатьПредупреждение( , НСтр("ru='Не задана строка поиска';uk='Не заданий рядок пошуку'"));
		ТекущийЭлемент = Элементы.СтрокаПоиска;
		Возврат;
	КонецЕсли;
	
	НайденнаяОбласть = ТабДокумент.НайтиТекст(СтрокаПоиска, Элементы.ТабДокумент.ТекущаяОбласть,
		,,,, Истина);
	Если НайденнаяОбласть = Неопределено Тогда
		НайденнаяОбласть = ТабДокумент.НайтиТекст(СтрокаПоиска, , , , , , Истина);
		Если НайденнаяОбласть = Неопределено Тогда
			ОбщегоНазначенияБПКлиентСервер.СообщитьОбОшибке(
				НСтр("ru='Строка не найдена';uk='Рядок не знайдено'"));
			ТекущийЭлемент = Элементы.СтрокаПоиска;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Переведем фокус с кнопки поиска (или строки поиска) на найденное значение макета
	ТекущийЭлемент = Элементы.ТабДокумент;
	ТекущийЭлемент.ТекущаяОбласть = НайденнаяОбласть;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЭтаФорма.Параметры.Свойство("СтрокаПоиска") Тогда
		СтрокаПоиска = ЭтаФорма.Параметры.СтрокаПоиска;
	КонецЕсли;
	
	Макет = НСИССервер.ПолучитьМакет("КлассификаторКОАТУУ", Справочники.КлассификаторКОАТУУ.ПолучитьМакет("КлассификаторКОАТУУ"));
	
	Макет.КодЯзыкаМакета = "ru";

	ТабДокумент.Вывести(Макет);
	ТабДокумент.ФиксацияСверху      = 2;
	
	ОбластьКодЛево          	= Макет.Области.Код.Лево;
	ОбластьКодПраво         	= Макет.Области.Код.Право;
	ОбластьНаименованиеЛево  	= Макет.Области.Наименование.Лево;
	ОбластьНаименованиеПраво 	= Макет.Области.Наименование.Право;

	
КонецПроцедуры

