#Область ПрограммныйИнтерфейс

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// Параметры:
// ОписанияПрофилей	- Массив
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт

#Область Описание_профилей_Учет_производства
	ДобавитьПрофильЛокальногоДиспетчера(ОписанияПрофилей);
	ДобавитьПрофильТехнолог(ОписанияПрофилей);
	ДобавитьПрофильМенеджераПоПроизводствуНаСтороне(ОписанияПрофилей);
	ДобавитьПрофильЭкономистПроизводства(ОписанияПрофилей);
	ДобавитьПрофильУчастникПланированияПроизводства(ОписанияПрофилей);
#КонецОбласти

#Область Описание_профилей_Регламентированный_учет
	ДобавитьПрофильБухгалтерВнеоборотныхАктивов(ОписанияПрофилей);
#КонецОбласти

//++ НЕ УХ
#Область Описание_профилей_Бюджетирование
	ДобавитьПрофильАдминистраторБюджетнойМодели(ОписанияПрофилей);
	ДобавитьПрофильИсполнительБюджетногоПроцесса(ОписанияПрофилей);
	ДобавитьПрофильКонтролерБюджетирования(ОписанияПрофилей);
	ДобавитьПрофильКоординаторБюджетирования(ОписанияПрофилей);
	ДобавитьПрофильУправлениеЛимитамиПоДаннымБюджетирования(ОписанияПрофилей);
#КонецОбласти
//-- НЕ УХ

	УправлениеДоступомЛокализация.ДополнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Общие

// Служебная функция. Сделана экспортной для удобства внедренцев.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	УправлениеДоступомУТ.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область Учет_производства

Процедура ДобавитьПрофильЛокальногоДиспетчера(ОписанияПрофилей)

	// Профиль "Локальный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ЛокальныйДиспетчер";
	ОписаниеПрофиля.Идентификатор = "2c1871fb-5fef-408d-adf8-4edcb6ab6c5c";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Локальный диспетчер производства';uk='Локальний диспетчер виробництва'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли к элементарным функциям.
	ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Зона ответственности - один или несколько этапов производства.
|Под профилем выполняются задачи:
|1. формирование маршрутных листов по графику производства;
|2. управление незначительными отклонениями внутри этапа;
|3. корректировка состава технологических операций внутри этапа;
|4. корректировка используемых ресурсов внутри этапа;
|5. оперативный анализ загрузки оборудования и наличия ресурсов при выполнении этапа;
|6. анализ наличия ТМЦ на центральных складах и в цеховой кладовой;
|7. формирование заявок на перемещение с центральных складов;
|8. ввод данных инвентаризации НЗП;
|9. уведомление Главного диспетчера о возникновении глобальных отклонений.'
|;uk='Зона відповідальності - один або декілька етапів виробництва.
|Під профілем виконуються задачі:
|1. формування маршрутних листів за графіком виробництва;
|2. управління незначними відхиленнями всередині етапу;
|3. коригування складу технологічних операцій всередині етапу;
|4. коригування ресурсів, які використовуються, всередині етапу;
|5. оперативний аналіз завантаження устаткування і наявності ресурсів при виконанні етапу;
|6. аналіз наявності ТМЦ на центральних складах і в цеховій коморі;
|7. формування заявок на переміщення з центральних складів;
|8. введення даних інвентаризації НЗВ;
|9. повідомлення Головного диспетчера про виникнення глобальних відхилень.'");

	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильТехнолог(ОписанияПрофилей)
	
	// Профиль "Технолог".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Технолог";
	ОписаниеПрофиля.Идентификатор = "fd7b587b-ad0a-486e-9512-ad99447c8b89";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Технолог';uk='Технолог'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	//-- НЕ УТКА
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	// Документы, добавление.
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазрешенийНаЗаменуМатериалов");
	//-- НЕ УТКА
	
	// Регистры, чтение.
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПередачиМатериаловВПроизводство");
	//-- Устарело_Производство21
	//++ НЕ УТКА
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	
	// Регистры, добавление изменение.
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОсновныхМаршрутныхКарт");
	//-- НЕ УТКА
	
	// Обработки, отчеты.
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДереваРесурсныхСпецификаций");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРедактированиеСпецификацииСтрокиЗаказа");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем выполняются задачи:
|1. анализ существующих, доработка и разработка новых технологических процессов;
|2. расчет расходования сырья и материалов;
|3. разработка технологической документации (технологических нормативов, инструкций, маршрутных карт и др.);
|4. разработка технических заданий на проектирование и производство оборудования;
|5. проведение экспериментальных работ по освоению новых технологических процессов;
|6. выявление брака, нарушений при работе оборудования на технологических линиях (новых и существующих), анализ причин и их устранение;
|7. контроль соблюдения технологии производственного процесса и эксплуатации оборудования.'
|;uk='Під профілем виконуються задачі:
|1. аналіз існуючих, доопрацювання та розробка нових технологічних процесів;
|2. розрахунок витрачання сировини і матеріалів;
|3. розробка технологічної документації (технологічних нормативів, інструкцій, маршрутних карт тощо);
|4. розробка технічних завдань на проєктування та виробництво устаткування;
|5. проведення експериментальних робіт з освоєння нових технологічних процесів;
|6. виявлення браку, порушень при роботі устаткування на технологічних лініях (нових та існуючих), аналіз причин та їх усунення;
|7. контроль дотримання технології виробничого процесу та експлуатації устаткування.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильМенеджераПоПроизводствуНаСтороне(ОписанияПрофилей)
	
	// Профиль "Менеджер по производству на стороне".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоПроизводствуНаСтороне";
	ОписаниеПрофиля.Идентификатор = "7387da7a-e932-11e2-a832-c86000df10d3";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Менеджер по производству на стороне';uk='Менеджер з виробництва на стороні'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	///////////////////////////////////////////////////////////////////////
	// Базовые права.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСделок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	//-- НЕ УТКА
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	
	///////////////////////////////////////////////////////////////////////
	// Регистры, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюТаможенныхДеклараций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМоделейФормированияСтоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПереданнойВозвратнойТары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПереданныхПереработчику");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюТаможенныхДеклараций");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	//-- НЕ УТ
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАналоговМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	///////////////////////////////////////////////////////////////////////
	// Документы, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАвансовыхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенийРасходовБудущихПериодов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства2_2");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	///////////////////////////////////////////////////////////////////////
	// Документы, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПереработчикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовПереработчиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачСырьяПереработчикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийОтПереработчиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовОтПереработчиков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыданныхДоверенностей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРабочегоМестаЗаказыПереработчикам");
	//-- НЕ УТКА

	///////////////////////////////////////////////////////////////////////
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПроизводстваНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЭтаповОплатыПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	
	///////////////////////////////////////////////////////////////////////
	// Видимые подсистемы КИ
	
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	///////////////////////////////////////////////////////////////////////
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров",		"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц",	"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры",	"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",			"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",				"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",		"ВначалеВсеРазрешены");
	
	///////////////////////////////////////////////////////////////////////
	// Дополнительные права.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастройкиПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеНастроекПечатиОбъектовПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахЗакупки");
	
	УправлениеДоступомЛокализация.ДобавитьРолиМенеджераПоПроизводствуНаСтороне(ОписаниеПрофиля);
	
	///////////////////////////////////////////////////////////////////////
	// Описание поставляемого профиля.
	
	ОписаниеПрофиля.Описание =
		НСтр("ru='Под профилем выполняются задачи:
|1. Оформление заказов переработчикам;
|2. Отражения поступлений от переработчиков и передач переработчикам;
|3. Оформление отчетов переработчиков о выполнении услуг по переработке.'
|;uk='Під профілем виконуються задачі:
|1. Оформлення замовлень переробникам;
|2. Відображення надходжень від переробників і передач переробникам;
|3. Оформлення звітів переробників про виконання послуг з переробки.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля) Экспорт
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДиспетчированиеЭтаповПроизводства");
	//-- НЕ УТКА
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПараметровПооперационногоПланирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассовОбъектовЭксплуатации");
	//-- НЕ УТКА
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМоделейФормированияСтоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	//-- НЕ УТ
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановыхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАналоговМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПооперационногоРасписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоТрудозатраты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБракаВПроизводстве");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСторонеБезПросмотра");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановыхКалькуляций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботыРабочихЦентров");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПричинЗадержекВыполненияЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПричинОтменыПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПараметровПооперационногоПланирования");
	//-- НЕ УТКА
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЗаказовНаПередачуВПроизводствоПоПлану");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	//++ Локализация
	//-- Локализация
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДвиженийПродукцииИМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовМатериаловВПроизводство");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенияМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыпускаПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовМатериаловИзПроизводства");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокЗаказаМатериаловВПроизводство");
	//-- НЕ УТКА
	//-- Устарело_Производство21
	
	//++ НЕ УТКА
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОпераций2_2");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСменныхЗаданий");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаршрутныхЛистовПроизводства");
	//-- Устарело_Производство21
	
	//-- НЕ УТКА
	
	// Регистры, добавление изменение.
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафикаЭтаповПроизводства2_2");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасписанияРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекПередачиМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПооперационногоРасписания");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыЛокальногоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОформленияПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрФормированияЗаказовПоПланамРаспределениеИПеренос");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрКомандыСостояниеОбеспеченияЗаказов");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПолученияМатериаловПоЗаказамНаВнутреннееПотребление");
	//-- Устарело_Производство21
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполнениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоступностиДляРасписанияРаботы");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоВыполнениюМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовОЗагрузкеРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполненияОпераций");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполнениеМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеНастроекПередачиМатериаловВПроизводствоПоНоменклатуре");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	//++ НЕ УТКА
	ОперативныйУчетПроизводстваПриПланированииСервер.ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	//-- НЕ УТКА
	
	УправлениеДоступомЛокализация.ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильЭкономистПроизводства(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ЭкономистПроизводства";
	ОписаниеПрофиля.Идентификатор = "86f1e49f-7c35-11e7-9719-708bcd551b9e";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Экономист производства';uk='Економіст виробництва'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНематериальныхАктивов");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассовОбъектовЭксплуатации");
	//-- НЕ УТКА
	
	// Документы, чтение.
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафиковРаботыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаРемонт");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхЛистовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковВзаиморасчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковОПродажахЗаПрошлыеПериоды");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоФинансовымИнструментам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочиеРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовПоЭквайрингу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковСПодотчетниками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспределенияПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровНаСклад");
	//++ Локализация
	//-- Локализация
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенияМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукции");
	//-- Устарело_Производство21
	
	// Документы, добавление.
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановыхКалькуляций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНормативовЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановыхКалькуляций");
	//-- НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПрочихЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПроизводственныхЗатрат");
	//++ Локализация
	//-- Локализация
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтатейКалькуляций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовНастроекДоходовРасходов");
	// Регистры, чтение.
	//++ Локализация
	//-- Локализация
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийОбеспеченияМаршрутныхЛистов");
	//-- Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратНезавершенногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихРасходовНезавершенногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМоделейФормированияСтоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровПолученныхОтПереработчика");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	//++ НЕ УТ
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	//-- НЕ УТ
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАналоговМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановыхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановыхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасписанияРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПооперационногоРасписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоТрудозатраты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБракаВПроизводстве");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеНастроекРаспределенияПостатейныхРасходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗначенийПоказателейДляРаспределенияРасходов");
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыГлавногоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОформленияПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПлановойПотребности");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДереваРесурсныхСпецификаций");
	//-- НЕ УТКА
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполнениеЭтаповПроизводства");
	//++ Устарело_Производство21
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполненияОпераций");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполнениеМаршрутныхЛистов");
	//-- Устарело_Производство21
	//-- НЕ УТКА
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиЭкономистПроизводства(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Описание = НСтр("ru='Зона ответственности - планирование и анализ производственной деятельности.
|Под профилем выполняются задачи:
|1. управление распределением расходов на себестоимость продукции;
|2. формирование и контроль исполнения планов производства;
|3. план-фактный анализ производственной деятельности;
|4. анализ себестоимости произведенной продукции.'
|;uk='Зона відповідальності - планування і аналіз виробничої діяльності. 
|Під профілем виконуються задачі: 
|1. управління розподілом витрат на собівартість продукції; 
|2. формування і контроль виконання планів виробництва; 
|3. план-фактний аналіз виробничої діяльності; 
|4. аналіз собівартості виробленої продукції.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
КонецПроцедуры

Процедура ДобавитьПрофильУчастникПланированияПроизводства(ОписанияПрофилей)
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УчастникПланированияПроизводства";
	ОписаниеПрофиля.Идентификатор = "47c3f3e8-f57c-11e9-8805-1831bf523f09";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Участник планирования производства';uk='Учасник планування виробництва'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСценариевПланирования");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОстатков");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановОстатков");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановОстатков");
	
	// Регистры чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиУправлениеПроцессомПланирования");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСбалансированностьПланов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПроизводства");
	// Дополнительные роли для чтения отчета исполнимости
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПроизводствуНаСтороне");
	//-- НЕ УТКА
		
	// Дополнительные права.
	
	//КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("СценарииТоварногоПланирования", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыПланов","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	
	УправлениеДоступомЛокализация.ДобавитьРолиУчастникПланированияПроизводства(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Под профилем происходит формирование планов производства и контроль их исполнения.';uk='Під профілем відбувається формування планів виробництва і контроль їх виконання.'",ОбщегоНазначения.КодОсновногоЯзыка());
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область Регламентированный_учет

Процедура ДобавитьПрофильБухгалтерВнеоборотныхАктивов(ОписанияПрофилей)
	
	// Профиль "Бухгалтер по внеоборотным активам".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "БухгалтерПоВнеоборотнымАктивам";
	ОписаниеПрофиля.Идентификатор = "ddb10492-ea5e-11e3-b754-c86000df10d3";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Бухгалтер по внеоборотным активам';uk='Бухгалтер по необоротних активах'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГруппФинансовогоУчетаВнеоборотныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНематериальныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъектовСтроительства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрисоединенныхФайловДокументовВНА");
	
	// Прочие справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоказателейНаработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассовОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловОбъектовЭксплуатации");
	//-- НЕ УТКА
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАмортизацииНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАмортизацииОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковВнеоборотныхАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИзмененийПараметровНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИзмененийПараметровОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМодернизацийОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПереоценкиНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПереоценкиОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодготовкиКПередачеНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодготовкиКПередачеОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПринятийКУчетуНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПринятийКУчетуОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазукомплектацийОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНаработкиОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокСтоимостиИАмортизацииОС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокСтоимостиИАмортизацииНМА");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачиОСАрендатору");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовОСОтАрендатора");
	
	// Прочие документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриобретенийУслугПрочихАктивов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацийУслугПрочихАктивов");
	
	// Прочие документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаВнутреннееПотребление");
	
	// Отчеты и обработки.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовОС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовНМА");
	
	// Чтение регистров.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАмортизацииНМА");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАмортизацииОС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНематериальнымАктивам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоОсновнымСредствам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтоимостиНМА");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтоимостиОС");
	
	// Чтение прочих регистров.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихАктивовПассивов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	
	// Отчеты.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиБухгалтераПоВнеоборотнымАктивам");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации", "ВначалеВсеРазрешены");
	
	// Видимые подсистемы КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаВнеоборотныеАктивы");
	ОписаниеПрофиля.Роли.Добавить("РазделВнеоборотныеАктивы");
	
	УправлениеДоступомЛокализация.ДополнитьПрофильБухгалтерПоВнеоборотнымАктивам(ОписаниеПрофиля);
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = 
		НСтр("ru='Дополнительный профиль, назначаемый пользователям для выполнения задач учета необоротных активов:
|1. Сопровождения нормативно-справочной информации
|2. Ведения документов движений необоротных активов
|3. Получение отчетов по данным бухгалтерского и налогового учета.'
|;uk='Додатковий профіль, що призначається користувачам для виконання задач обліку необоротних активів:
|1. Супроводження нормативно-довідкової інформації
|2. Ведення документів рухів необоротних активів
|3. Отримання звітів за даними бухгалтерського та податкового обліку.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УХ
#Область Бюджетирование

Процедура ДобавитьПрофильАдминистраторБюджетнойМодели(ОписанияПрофилей)
	
	// Профиль "Администратор бюджетной модели".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "АдминистраторБюджетнойМодели";
	ОписаниеПрофиля.Идентификатор = "932703ca-6520-11e6-84c0-c860008a2a34";
	
	ОписаниеПрофиля.Наименование  = НСтр("ru='Администратор бюджетной модели (дополнительный)';uk='Адміністратор бюджетної моделі (додатковий)'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетногоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБюджетногоПроцесса");
	//-- НЕ УТКА
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, который назначается пользователям, 
|выполняющим редактирование НСИ бюджетов и настроек бюджетного процесса.'
|;uk='Додатковий профіль, який призначається користувачам, 
|які виконують редагування НДІ бюджетів і настройок бюджетного процесу.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильИсполнительБюджетногоПроцесса(ОписанияПрофилей)
	
	// Профиль "Исполнитель бюджетного процесса (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ИсполнительБюджетногоПроцесса";
	ОписаниеПрофиля.Идентификатор = "932703c8-6520-11e6-84c0-c860008a2a34";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Исполнитель бюджетного процесса (дополнительный)';uk='Виконавець бюджетного процесу (додатковий)'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭкземпляровБюджетов");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеЭкземпляровБюджетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетногоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыполнениеБюджетныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийКОтражениюВБюджетировании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроцессовПодготовкиБюджетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФактическихДанныхБюджетирования");
	//-- НЕ УТКА
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	//ЦеныСкидкиНаценки
	 ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, который назначается пользователям, выполняющим задачи ввода данных бюджетирования. 
|При изменении и вводе бюджетов, анализируется наличие бюджетных задач, если включено управление бюджетным процессом.'
|;uk='Додатковий профіль, який призначається користувачам, які виконують задачі введення даних бюджетування. 
|При зміні та введенні бюджетів, аналізується наявність бюджетних задач, якщо включено управління бюджетним процесом.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильКонтролерБюджетирования(ОписанияПрофилей)
	
	// Профиль "Контролер бюджетирования (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "КонтролерБюджетирования";
	ОписаниеПрофиля.Идентификатор = "932703c7-6520-11e6-84c0-c860008a2a34";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Контролер бюджетирования (дополнительный)';uk='Контролер бюджетування (додатковий)'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ФормированиеБюджетныхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетногоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыполнениеБюджетныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийКОтражениюВБюджетировании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроцессовПодготовкиБюджетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФактическихДанныхБюджетирования");
	//-- НЕ УТКА
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, который назначается пользователям для просмотра бюджетов и формирования отчетов.';uk='Додатковий профіль, який призначається користувачам для перегляду бюджетів та формування звітів.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильКоординаторБюджетирования(ОписанияПрофилей)
	
	// Профиль "Координатор бюджетирования (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "КоординаторБюджетирования";
	ОписаниеПрофиля.Идентификатор = "932703c9-6520-11e6-84c0-c860008a2a34";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Координатор бюджетирования (дополнительный)';uk='Координатор бюджетування (додатковий)'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭкземпляровБюджетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗначенийНефинансовыхПоказателей");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеЭкземпляровБюджетов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеДанныхБюджетированияВнеДатЗапрета");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетногоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыполнениеБюджетныхЗадач");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВыполнениеЗадачБюджетногоПроцесса");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаМониторБюджетныхПроцессов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийКОтражениюВБюджетировании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроцессовПодготовкиБюджетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФактическихДанныхБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеДанныхБюджетированияВнеПроцессов");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеБюджетныхЗадачВнеПроцессов");
	//-- НЕ УТКА
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, который назначается пользователям, выполняющим задачи ввода данных бюджетирования 
|и управления бюджетным процессом. Изменения бюджетов возможны без наличия бюджетных задач и без учета дат запрета изменения данных'
|;uk='Додатковий профіль, який призначається користувачам, які виконують задачі введення даних бюджетування 
|та управління бюджетним процесом. Зміни бюджетів можливі без наявності бюджетних задач і без урахування дат заборони зміни даних'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильУправлениеЛимитамиПоДаннымБюджетирования(ОписанияПрофилей)
	
	// Профиль "Управление лимитами по данным бюджетирования (дополнительный)".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "УправлениеЛимитамиПоДаннымБюджетирования";
	ОписаниеПрофиля.Идентификатор = "17e62c67-8973-11e6-b5a9-c860008a2a34";
	ОписаниеПрофиля.Наименование  = НСтр("ru='Управление лимитами по данным бюджетирования (дополнительный)';uk='Управління лімітами за даними бюджетування (додатковий)'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетирования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЛимитовРасходаДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛимитовРасходаДенежныхСредств");
	
	//++ НЕ УТКА
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБюджетногоПроцесса");
	//-- НЕ УТКА
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",   "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи",  "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыВидовБюджетов",              "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыСтатейИПоказателейБюджетов", "ВначалеВсеЗапрещены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Сценарии",  "ВначалеВсеЗапрещены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru='Дополнительный профиль, который назначается пользователям, выполняющим задачу настройки правил лимитов по данным бюджетирования';uk='Додатковий профіль, який призначається користувачам, які виконують задачу настройки правил лімітів за даними бюджетування'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти
//-- НЕ УХ

#КонецОбласти
