///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя, используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры) можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииВидовДоступа(ВидыДоступа);
	УправлениеДоступомЛокализация.ЗаполнитьВидыДоступа(ВидыДоступа);
	//-- НЕ ГОСИС
	
	//<{УСО 2.4}:{Управление строительным предприятием}
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ОбъектыСтроительства";
	ВидДоступа.Представление    = НСтр("ru = 'Объекты строительства'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.СМ_ОбъектыСтроительства");
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СценарииПланированияОбъектовСтроительства";
	ВидДоступа.Представление    = НСтр("ru = 'Сценарии планирования объектов строительства'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.УСОERP_СценарииПланированияПроектовСтроительства");
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "СтроительныеРаботы";
	ВидДоступа.Представление    = НСтр("ru = 'Строительные работы'");
	ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.УСОERP_СтроительныеРаботы");
	//<{/УСО 2.4}:{Управление строительным предприятием}
	
	// Сметная подсистема
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ГруппыРесурсов";
	ВидДоступа.Представление = НСтр("ru = 'Группа ресурсов и НС'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.СМ_ГруппыРесурсов");
	// Сметная подсистема
	
КонецПроцедуры

// Позволяет указать списки, у которых объекты метаданных содержат описание логики ограничения
// доступа в модулях менеджеров или переопределяемом модуле.
//
// В модулях менеджеров указанных списков должна быть размещена процедура обработчика,
// в которую передаются следующие параметры.
// 
//  Ограничение - Структура - со свойствами:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                            Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                            Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                            если Истина, тогда не записывать ключи доступа,
//                                            а использовать ключи доступа владельца (требуется,
//                                            чтобы ограничение было строго по объекту-владельцу).
///   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - см.
//                                            описание предыдущего параметра.
//
// Далее пример процедуры для модуля менеджера.
//
//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	//++ НЕ ГОСИС
	
	УправлениеДоступомУТ.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	УправлениеДоступомЛокализация.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
	Списки.Вставить(Метаданные.Справочники.АвансовыйОтчетПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.АктВыполненныхРаботПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчетаКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.БанковскиеСчетаОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.ВариантыКомплектацииНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Справочники.ВзаимозачетЗадолженностиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыЗапасов, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыНоменклатурыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыЦен, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыЦенПоставщиков, Истина);
	Списки.Вставить(Метаданные.Справочники.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВозвратТоваровОтКлиентаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВозвратТоваровПоставщикуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ГруппыДоступаПартнеров, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентов, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКонтрагентовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКредитовИДепозитов, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыКредитовИДепозитовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Справочники.ДоговорыМеждуОрганизациямиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаданиеНаПеревозкуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗадачиПроектов, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказКлиентаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказПоставщикуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Кассы, Истина);
	Списки.Вставить(Метаданные.Справочники.КассыККМ, Истина);
	Списки.Вставить(Метаданные.Справочники.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.КонтактныеЛицаПартнеров, Истина);
	Списки.Вставить(Метаданные.Справочники.Контрагенты, Истина);
	Списки.Вставить(Метаданные.Справочники.КорректировкаПриобретенияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.КорректировкаРеализацииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Номенклатура, Истина);
	Списки.Вставить(Метаданные.Справочники.НоменклатураПоставщиков, Истина);
	Списки.Вставить(Метаданные.Справочники.НоменклатураПоставщиковПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.НоменклатураПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОбластиХранения, Истина);
	Списки.Вставить(Метаданные.Справочники.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Организации, Истина);
	Списки.Вставить(Метаданные.Справочники.ОрганизацииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтветственныеЛицаОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетКомиссионераОСписанииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетКомиссионераПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетКомитентуОСписанииПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетКомитентуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.Партнеры, Истина);
	Списки.Вставить(Метаданные.Справочники.ПартнерыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланЗакупокПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПродажПоКатегориямПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПродажПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПодпискиНаРассылкиИОповещенияКлиентам, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоступлениеТоваровНаСкладПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПретензииКлиентов, Истина);
	Списки.Вставить(Метаданные.Справочники.ПретензииКлиентовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПриобретениеТоваровУслугПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РабочиеУчастки, Истина);
	Списки.Вставить(Метаданные.Справочники.РассылкаКлиентамПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РеализацияТоваровУслугПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РеализацияУслугПрочихАктивовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СверкаВзаиморасчетовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СделкиСКлиентами, Истина);
	Списки.Вставить(Метаданные.Справочники.СделкиСКлиентамиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СкладскиеПомещения, Истина);
	Списки.Вставить(Метаданные.Справочники.СкладскиеЯчейки, Истина);
	Списки.Вставить(Метаданные.Справочники.Склады, Истина);
	Списки.Вставить(Метаданные.Справочники.СоглашенияСКлиентами, Истина);
	Списки.Вставить(Метаданные.Справочники.СоглашенияСКлиентамиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СоглашенияСПоставщиками, Истина);
	Списки.Вставить(Метаданные.Справочники.СоглашенияСПоставщикамиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СписаниеЗадолженностиПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СтруктураПредприятия, Истина);
	Списки.Вставить(Метаданные.Справочники.СчетНаОплатуКлиентуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.УпаковкиЕдиницыИзмерения, Истина);
	Списки.Вставить(Метаданные.Справочники.УсловияОбслуживанияПартнеровТорговымиПредставителями, Истина);
	Списки.Вставить(Метаданные.Справочники.УстановкаЦенНоменклатурыПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ХарактеристикиНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Справочники.ЭквайринговыеТерминалы, Истина);
	Списки.Вставить(Метаданные.Документы.АвансовыйОтчет, Истина);
	Списки.Вставить(Метаданные.Документы.АктВыполненныхРабот, Истина);
	Списки.Вставить(Метаданные.Документы.АктОРасхожденияхПослеОтгрузки, Истина);
	Списки.Вставить(Метаданные.Документы.АктОРасхожденияхПослеПеремещения, Истина);
	Списки.Вставить(Метаданные.Документы.АктОРасхожденияхПослеПриемки, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.ВзаимозачетЗадолженности, Истина);
	Списки.Вставить(Метаданные.Документы.ВнутреннееПотреблениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровОтКлиента, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ВыкупВозвратнойТарыКлиентом, Истина);
	Списки.Вставить(Метаданные.Документы.ВыкупВозвратнойТарыУПоставщика, Истина);
	Списки.Вставить(Метаданные.Документы.ДвижениеПрочихАктивовПассивов, Истина);
	Списки.Вставить(Метаданные.Документы.ДоверенностьВыданная, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаданиеНаПеревозку, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаданиеТорговомуПредставителю, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказКлиента, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаВнутреннееПотребление, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаПеремещение, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаСборку, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВозвратТоваровОтКлиента, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеАссортимента, Истина);
	Списки.Вставить(Метаданные.Документы.ИнвентаризационнаяОпись, Истина);
	Списки.Вставить(Метаданные.Документы.ИнвентаризацияНаличныхДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.УдалитьКассовыйЧекКоррекции, Истина);
	Списки.Вставить(Метаданные.Документы.КоммерческоеПредложениеКлиенту, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаЗадолженностиПоФинансовымИнструментам, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаИзлишковНедостачПоТоварнымМестам, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаНазначенияТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаОбособленногоУчетаЗапасов, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаПоОрдеруНаТовары, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаПриобретения, Истина);
	Списки.Вставить(Метаданные.Документы.КорректировкаРеализации, Истина);
	Списки.Вставить(Метаданные.Документы.ЛимитыРасходаДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.НачисленияКредитовИДепозитов, Истина);
	Списки.Вставить(Метаданные.Документы.ОжидаемоеПоступлениеДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ОперацияПоПлатежнойКарте, Истина);
	Списки.Вставить(Метаданные.Документы.ОприходованиеИзлишковТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеИзлишковТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеНедостачТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеПересортицыТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеПорчиТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаПеремещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОтборРазмещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОтражениеРасхожденийПриИнкассацииДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетБанкаПоОперациямЭквайринга, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомиссионера, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомиссионераОСписании, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомитенту, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомитентуОСписании, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетОРозничныхПродажах, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетПоКомиссииМеждуОрганизациямиОСписании, Истина);
	Списки.Вставить(Метаданные.Документы.ПервичныйДокумент, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПересортицаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПересчетТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПланЗакупок, Истина);
	Списки.Вставить(Метаданные.Документы.ПланОстатков, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПродаж, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПродажПоКатегориям, Истина);
	Списки.Вставить(Метаданные.Документы.ПоручениеЭкспедитору, Истина);
	Списки.Вставить(Метаданные.Документы.ПорчаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеБезналичныхДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеТоваровНаСклад, Истина);
	Списки.Вставить(Метаданные.Документы.ПриобретениеТоваровУслуг, Истина);
	Списки.Вставить(Метаданные.Документы.ПриобретениеУслугПрочихАктивов, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходныйОрдерНаТовары, Истина);
	Списки.Вставить(Метаданные.Документы.ПрочееОприходованиеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПрочиеДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.Документы.РаспоряжениеНаПеремещениеДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.РаспределениеДоходовИРасходовПоНаправлениямДеятельности, Истина);
	Списки.Вставить(Метаданные.Документы.РаспределениеРасходовБудущихПериодов, Истина);
	Списки.Вставить(Метаданные.Документы.РасходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.РасходныйОрдерНаТовары, Истина);
	Списки.Вставить(Метаданные.Документы.РасчетКурсовыхРазниц, Истина);
	Списки.Вставить(Метаданные.Документы.РасчетСебестоимостиТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.РеализацияТоваровУслуг, Истина);
	Списки.Вставить(Метаданные.Документы.РеализацияУслугПрочихАктивов, Истина);
	Списки.Вставить(Метаданные.Документы.РегистраторГрафикаДвиженияТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.РегистрацияЦенНоменклатурыПоставщика, Истина);
	Списки.Вставить(Метаданные.Документы.СборкаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.СверкаВзаиморасчетов, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеБезналичныхДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеЗадолженности, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеНедостачТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.СправкаОПодтверждающихДокументах, Истина);
	Списки.Вставить(Метаданные.Документы.СчетНаОплатуКлиенту, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОЗачисленииВалюты, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаБлокировокЯчеек, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаЦенНоменклатуры, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ОтчетыКомиссионеров, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.ОтчетыКомитентам, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.СкладскиеОрдера, Истина);
	Списки.Вставить(Метаданные.ЖурналыДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ABCXYZКлассификацияКлиентов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВариантыОбеспеченияТоварами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ГрафикПлатежей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДанныеПервичныхДокументов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДокументыФизическихЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДоступностьТоваровДляВнешнихПользователей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДоступныеОстаткиПланируемыхПоступлений, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаданияКРаспределениюРасчетовСКлиентами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаданияКРаспределениюРасчетовСПоставщиками, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИсточникиПервичногоИнтереса, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.КорзинаПокупателя, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкаКонтроляОбеспечения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкаПередачиТоваровМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиАдресныхСкладов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОстаткиНаБанковскихСчетахПоДаннымВыписок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ОшибкиРасчетаПартийИСебестоимости, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПартнерыСегмента, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПравилаРазмещенияТоваровВЯчейках, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрогнозыРасходаУпаковок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РеестрДокументов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ABCXYZКлассификацияНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СвязиМеждуПартнерами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СостоянияИРеквизитыДоставки, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтатистикаСделокСКлиентами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СтоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СхемыОбеспечения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ТоварныеОграничения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УчетнаяПолитикаОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЦеныНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЦеныНоменклатурыПоставщиков, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ВыручкаИСебестоимостьПродаж, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ГрафикОтгрузкиТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ГрафикПоступленияТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвижениеТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДенежныеСредстваДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДенежныеСредстваКонтрагент, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияКонтрагентДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияКонтрагентКонтрагент, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураДоходыРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияНоменклатураНоменклатура, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваБезналичные, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВКассахККМ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваВПути, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваКВыплате, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваНаличные, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваУПодотчетныхЛиц, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыКлиентов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыНаВнутреннееПотребление, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыНаПеремещение, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыНаСборку, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыПоставщикам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Закупки, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаявкиНаВозвратТоваровОтКлиентов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЛимитыРасходаДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.МатериалыИРаботыВПроизводстве, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОбеспечениеЗаказов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииЗатратНаВыпуск, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПроизводственныхЗатрат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииПрочихРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииРасходовНаСебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииТоваровПереданныеНаКомиссию, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПереданнаяВозвратнаяТара, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПринятаяВозвратнаяТара, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПрочиеАктивыПассивы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПрочиеДоходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПрочиеРасходы, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоФинансовымИнструментам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыПоЭквайрингу, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентами, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоДокументам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПоСрокам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОплат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентамиПланОтгрузок, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоДокументам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПоСрокам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланОплат, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщикамиПланПоставок, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РезервыТоваровОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СвободныеОстатки, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СебестоимостьТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварныеМестаКОтражениюИзлишковНедостач, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыВЯчейках, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОтгрузке, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОформлениюИзлишковНедостач, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОформлениюОтчетовКомитенту, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКПоступлению, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыНаСкладах, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизацийКПередаче, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыПереданныеНаКомиссию, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.УслугиКОформлениюОтчетовПринципалу, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ФинансовыеРезультаты, Истина);
	Списки.Вставить(Метаданные.БизнесПроцессы.СогласованиеЦенНоменклатуры, Истина);
	Списки.Вставить(Метаданные.БизнесПроцессы.ТиповаяПродажа, Истина);
	Списки.Вставить(Метаданные.Справочники.ФизическиеЛицаПрисоединенныеФайлы, Истина);
	//++ НЕ УТ
	Списки.Вставить(Метаданные.Справочники.АктВыполненныхВнутреннихРаботПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыБюджетов, Истина);
	Списки.Вставить(Метаданные.Справочники.ДокументыВНАПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ВыкупТоваровХранителемПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказПереработчикуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.НефинансовыеПоказателиБюджетов, Истина);
	Списки.Вставить(Метаданные.Справочники.НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетПереработчикаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПартииПроизводства, Истина);
	Списки.Вставить(Метаданные.Справочники.ПередачаСырьяПереработчикуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПередачаТоваровХранителюПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПланПроизводстваПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоказателиБюджетов, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоступлениеОтПереработчикаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоступлениеТоваровОтХранителяПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПравилаЛимитовПоДаннымБюджетирования, Истина);
	Списки.Вставить(Метаданные.Справочники.ПриемкаТоваровНаХранениеПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПроизводствоБезЗаказаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.РаспределениеВозвратныхОтходовПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СписаниеТоваровУХранителяПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.СтатьиБюджетов, Истина);
	Списки.Вставить(Метаданные.Справочники.Сценарии, Истина);
	Списки.Вставить(Метаданные.Справочники.ЭкземплярБюджетаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.АктВыполненныхВнутреннихРабот, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратСырьяОтПереработчика, Истина);
	Списки.Вставить(Метаданные.Документы.ВыкупПринятыхНаХранениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ВыкупТоваровХранителем, Истина);
	Списки.Вставить(Метаданные.Документы.ДвижениеПродукцииИМатериалов, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказМатериаловВПроизводство, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПереработчику, Истина);
	Списки.Вставить(Метаданные.Документы.НачислениеСписаниеРезервовПоСомнительнымДолгам, Истина);
	Списки.Вставить(Метаданные.Документы.ОтгрузкаТоваровСХранения, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетПереработчика, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаСырьяПереработчику, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаТоваровХранителю, Истина);
	Списки.Вставить(Метаданные.Документы.ПланПроизводства, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеОтПереработчика, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеТоваровОтХранителя, Истина);
	Списки.Вставить(Метаданные.Документы.ПриемкаТоваровНаХранение, Истина);
	Списки.Вставить(Метаданные.Документы.ПроизводствоБезЗаказа, Истина);
	Списки.Вставить(Метаданные.Документы.РаспределениеВозвратныхОтходов, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеПринятыхНаХранениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеТоваровУХранителя, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаЗначенийНефинансовыхПоказателей, Истина);
	Списки.Вставить(Метаданные.Документы.ЭкземплярБюджета, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДолиСписанияКосвенныхРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаданияКРасчетуАмортизацииОС, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаданияКРасчетуАмортизацииНМА, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаданияКРасчетуСтоимостиВНА, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗаданияКФормированиюДвиженийПоВНА, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЗначенияНефинансовыхПоказателей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СвязиПоказателейБюджетов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СхемыОбеспеченияПроизводства, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыМатериаловВПроизводство, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ОборотыБюджетов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПартииНезавершенногоПроизводства, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РезервыПоСомнительнымДолгам, Истина);
	//-- НЕ УТ
	//++ НЕ УТКА
	Списки.Вставить(Метаданные.Справочники.ВозвратСырьяДавальцуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ДвижениеПродукцииИМатериаловПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ЗаказДавальцаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ОтчетДавальцуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПередачаДавальцуПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Справочники.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратСырьяДавальцу, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказДавальца, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетДавальцу, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаДавальцу, Истина);
	Списки.Вставить(Метаданные.Документы.ПлановаяКалькуляция2_2, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеСырьяОтДавальца, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаНормативовПроизводственныхРасходов, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РаспоряженияНаПередачуИзПроизводства, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ФактическиеДанныеБюджетирования, Истина);
	Списки.Вставить(Метаданные.Задачи.БюджетнаяЗадача, Истина);
	//-- НЕ УТКА	
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", Метаданные.ОсновнойЯзык.КодЯзыка);
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	//++ НЕ УТ
	УправлениеДоступомКА.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	//-- НЕ УТ
	//++ НЕ УТКА
	УправлениеДоступомУП.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	//-- НЕ УТКА
	УправлениеДоступомЛокализация.ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления);
	//-- НЕ ГОСИС
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта (например, задачи ЗадачаИсполнителя),
// от "ведущего" объекта (например,  бизнес-процесса Задание), которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте 2 вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками:
//   ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   Имя          - Строка - идентификатор права, например ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии ОбщаяФорма.НастройкиПравОбъектов.
//
//   Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   Подсказка    - Строка - подсказка к заголовку права,
//                  например "Добавление, изменение и пометка удаления папок".
//
//   НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   ТребуемыеПрава - Массив строк - имена прав, требуемых для этого права -
//                  например, право "ДобавлениеФайлов" требует права "ИзменениеФайлов".
//
//   ЧтениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц",
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   ИзменениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа, заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриЗаполненииОграниченияДоступа(Список, Ограничение);
	УправлениеДоступомЛокализация.ПриЗаполненииОграниченияДоступа(Список, Ограничение);
	//-- НЕ ГОСИС
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа, могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт

	Описание = Описание + "
//++ НЕ ГОСИС
//++ НЕ УТКА
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратСырьяДавальцуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказДавальцаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Чтение.Организации
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.ГруппыПартнеров
	|Справочник.КлассификаторОрганизацийЕГАИС.Изменение.Организации
	|Справочник.МаршрутыПодписания.Чтение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.НастройкиЯндексКассы.Чтение.Организации
	|Справочник.НастройкиЯндексКассы.Изменение.Организации
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетДавальцуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПакетЭДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаДавальцуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПоступлениеСырьяОтДавальцаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПрофилиНастроекЭДО.Чтение.Организации
	|Справочник.СоглашенияОбИспользованииЭД.Чтение.Организации
	|Справочник.ТиповыеОперацииМеждународныйУчет.Чтение.Организации
	|Справочник.ЭДПрисоединенныеФайлы.Чтение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Организации
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Организации
	|Документ.АктСписанияЕГАИС.Чтение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Чтение.Организации
	|Документ.АктСписанияЕГАИС.Изменение.ГруппыПартнеров
	|Документ.АктСписанияЕГАИС.Изменение.Организации
	|Документ.АмортизацияНМАМеждународныйУчет.Чтение.Организации
	|Документ.АмортизацияНМАМеждународныйУчет.Изменение.Организации
	|Документ.АмортизацияОСМеждународныйУчет.Чтение.Организации
	|Документ.АмортизацияОСМеждународныйУчет.Изменение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Организации
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Организации
	|Документ.ВозвратСырьяДавальцу.Чтение.ГруппыПартнеров
	|Документ.ВозвратСырьяДавальцу.Чтение.Организации
	|Документ.ВозвратСырьяДавальцу.Чтение.Подразделения
	|Документ.ВозвратСырьяДавальцу.Чтение.Склады
	|Документ.ВозвратСырьяДавальцу.Изменение.ГруппыПартнеров
	|Документ.ВозвратСырьяДавальцу.Изменение.Организации
	|Документ.ВозвратСырьяДавальцу.Изменение.Подразделения
	|Документ.ВозвратСырьяДавальцу.Изменение.Склады
	|Документ.ЗаказДавальца.Чтение.ГруппыПартнеров
	|Документ.ЗаказДавальца.Чтение.Организации
	|Документ.ЗаказДавальца.Чтение.Подразделения
	|Документ.ЗаказДавальца.Чтение.Склады
	|Документ.ЗаказДавальца.Изменение.ГруппыПартнеров
	|Документ.ЗаказДавальца.Изменение.Организации
	|Документ.ЗаказДавальца.Изменение.Подразделения
	|Документ.ЗаказДавальца.Изменение.Склады
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Организации
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ИзменениеПараметровНМАМеждународныйУчет.Чтение.Организации
	|Документ.ИзменениеПараметровНМАМеждународныйУчет.Изменение.Организации
	|Документ.ИзменениеПараметровОСМеждународныйУчет.Чтение.Организации
	|Документ.ИзменениеПараметровОСМеждународныйУчет.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.МаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.МаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.МаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.ОперацияМеждународный.Чтение.Организации
	|Документ.ОперацияМеждународный.Изменение.Организации
	|Документ.ОстаткиЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Чтение.Организации
	|Документ.ОстаткиЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОстаткиЕГАИС.Изменение.Организации
	|Документ.ОтчетДавальцу.Чтение.ГруппыПартнеров
	|Документ.ОтчетДавальцу.Чтение.Организации
	|Документ.ОтчетДавальцу.Чтение.Подразделения
	|Документ.ОтчетДавальцу.Изменение.ГруппыПартнеров
	|Документ.ОтчетДавальцу.Изменение.Организации
	|Документ.ОтчетДавальцу.Изменение.Подразделения
	|Документ.ОтчетЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Чтение.Организации
	|Документ.ОтчетЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ОтчетЕГАИС.Изменение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПакетЭД.Чтение.Организации
	|Документ.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.Чтение.Организации
	|Документ.ПереводОсновныхСредствИнвестиционногоИмуществаМеждународныйУчет.Изменение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Организации
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Организации
	|Документ.ПередачаДавальцу.Чтение.ГруппыПартнеров
	|Документ.ПередачаДавальцу.Чтение.Организации
	|Документ.ПередачаДавальцу.Чтение.Подразделения
	|Документ.ПередачаДавальцу.Чтение.Склады
	|Документ.ПередачаДавальцу.Изменение.ГруппыПартнеров
	|Документ.ПередачаДавальцу.Изменение.Организации
	|Документ.ПередачаДавальцу.Изменение.Подразделения
	|Документ.ПередачаДавальцу.Изменение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Склады
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Организации
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Склады
	|Документ.ПеремещениеНМАМеждународныйУчет.Чтение.Организации
	|Документ.ПеремещениеНМАМеждународныйУчет.Изменение.Организации
	|Документ.ПеремещениеОСМеждународныйУчет.Чтение.Организации
	|Документ.ПеремещениеОСМеждународныйУчет.Изменение.Организации
	|Документ.ПисьмоОбменСБанками.Чтение.Организации
	|Документ.ПлановаяКалькуляция2_2.Чтение.Организации
	|Документ.ПлановаяКалькуляция2_2.Изменение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Подразделения
	|Документ.ПоступлениеСырьяОтДавальца.Чтение.Склады
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Организации
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Подразделения
	|Документ.ПоступлениеСырьяОтДавальца.Изменение.Склады
	|Документ.ПринятиеКУчетуНМАМеждународныйУчет.Чтение.Организации
	|Документ.ПринятиеКУчетуНМАМеждународныйУчет.Изменение.Организации
	|Документ.ПринятиеКУчетуОСМеждународныйУчет.Чтение.Организации
	|Документ.ПринятиеКУчетуОСМеждународныйУчет.Изменение.Организации
	|Документ.РегламентнаяОперацияМеждународныйУчет.Чтение.Организации
	|Документ.РегламентнаяОперацияМеждународныйУчет.Изменение.Организации
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СписаниеНМАМеждународныйУчет.Чтение.Организации
	|Документ.СписаниеНМАМеждународныйУчет.Изменение.Организации
	|Документ.СписаниеОСМеждународныйУчет.Чтение.Организации
	|Документ.СписаниеОСМеждународныйУчет.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНВходящаяЕГАИС.Чтение.Склады
	|Документ.ТТНВходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНВходящаяЕГАИС.Изменение.Организации
	|Документ.ТТНВходящаяЕГАИС.Изменение.Склады
	|Документ.ТТНИсходящаяЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Организации
	|Документ.ТТНИсходящаяЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.ГруппыПартнеров
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.УстановкаНормативовПроизводственныхРасходов.Чтение.Организации
	|Документ.УстановкаНормативовПроизводственныхРасходов.Чтение.Подразделения
	|Документ.УстановкаНормативовПроизводственныхРасходов.Изменение.Организации
	|Документ.УстановкаНормативовПроизводственныхРасходов.Изменение.Подразделения
	|Документ.ЧекЕГАИС.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Чтение.Организации
	|Документ.ЧекЕГАИС.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИС.Изменение.Организации
	|Документ.ЧекЕГАИСВозврат.Чтение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Чтение.Организации
	|Документ.ЧекЕГАИСВозврат.Изменение.ГруппыПартнеров
	|Документ.ЧекЕГАИСВозврат.Изменение.Организации
	|Документ.ЭкземплярФинансовогоОтчета.Чтение.Организации
	|Документ.ЭкземплярФинансовогоОтчета.Изменение.Организации
	|Документ.ЭлектронныйДокументВходящий.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящий.Чтение.Организации
	|ЖурналДокументов.РегламентныеДокументыМеждународныйУчет.Чтение.Организации
	|РегистрСведений.ОтражениеДокументовВМеждународномУчете.Чтение.Организации
	|РегистрСведений.ОтражениеДокументовВМеждународномУчете.Изменение.Организации
	|РегистрСведений.СостоянияЭД.Чтение.Организации
	|РегистрСведений.СтатусОбменовСЯндексКассой.Чтение.Организации
	|РегистрСведений.СтатусОбменовСЯндексКассой.Изменение.Организации
	|РегистрНакопления.РаспоряженияНаПередачуИзПроизводства.Чтение.Подразделения
	|РегистрНакопления.РаспоряженияНаПередачуИзПроизводства.Чтение.Склады
	|РегистрНакопления.ФактическиеДанныеБюджетирования.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|РегистрНакопления.ФактическиеДанныеБюджетирования.Чтение.Организации
	|РегистрНакопления.ФактическиеДанныеБюджетирования.Чтение.Подразделения
	|Задача.БюджетнаяЗадача.Чтение.Пользователи
	|Задача.БюджетнаяЗадача.Изменение.Пользователи
	|РегистрБухгалтерии.Международный.Чтение.Организации
	|РегистрБухгалтерии.Международный.Изменение.Организации
//-- НЕ УТКА
//++ НЕ УТ
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АвансовыйПлатежИностранцаПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктВыполненныхВнутреннихРаботПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктВыполненныхВнутреннихРаботПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АктВыполненныхВнутреннихРаботПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктВыполненныхВнутреннихРаботПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АктПриемкиВыполненныхРаботОказанныхУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АктПроверкиСтраховыхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БольничныйЛистПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БронированиеГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.БухучетНачисленийСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВариантыГрафиковЛизинга.Чтение.ГруппыПартнеров
	|Справочник.ВариантыГрафиковЛизинга.Чтение.Организации
	|Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВводНачальныхОстатковОтпусковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВБанкПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыВКассуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыПеречислениемПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьНаВыплатуЗарплатыРаздатчикомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовВБанкПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовВКассуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВедомостьПрочихДоходовПеречислениемПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВедомостьУплатыАДВ_11ПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВедомостьУплатыАДВ_11ПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.РегистрУчета
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.РегистрУчета
	|Справочник.ВидыБюджетов.Чтение.ГруппыДоступаВидовБюджетов
	|Справочник.ВидыБюджетов.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ВидыБюджетов.Изменение.ГруппыДоступаВидовБюджетов
	|Справочник.ВидыБюджетов.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВозвратНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВосстановлениеВДолжностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыкупПринятыхНаХранениеТоваровПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВыкупТоваровХранителемПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВыкупТоваровХранителемПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупТоваровХранителемПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВыкупТоваровХранителемПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВыкупТоваровХранителемПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыкупТоваровХранителемПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ВыплатаБывшимСотрудникамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ГрафикОтпусковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ГрафикОтпусковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ГрафикОтпусковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ГрафикОтпусковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДанныеДляРасчетаЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРРПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДвижениеПродукцииИМатериаловПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДвижениеПродукцииИМатериаловПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ДвижениеПродукцииИМатериаловПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДвижениеПродукцииИМатериаловПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ДоверенностиНалогоплательщика.Чтение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Изменение.Организации
	|Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДоговорАвторскогоЗаказаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДоговорРаботыУслугиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыЛизинга.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыЛизинга.Чтение.Организации
	|Справочник.ДоговорыЛизинга.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыЛизинга.Изменение.Организации
	|Справочник.ДоговорыЛизингаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыЛизингаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыЛизингаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыЛизингаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДокументыВНАПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДокументыВНАПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ДоходВНатуральнойФормеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЕдиновременноеПособиеЗаСчетФССПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказПереработчикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗапросВФССОПроверкеРаботодателяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗарплатныеПроекты.Чтение.Организации
	|Справочник.ЗарплатныеПроекты.Изменение.Организации
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеВФССОВозмещенииРасходовНаПогребениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеИЗапросВПФРОЗаработкеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеОНазначенииПенсии.Чтение.Организации
	|Справочник.ЗаявлениеОНазначенииПенсии.Изменение.Организации
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявлениеСотрудникаНаВыплатуПособияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеАвансаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеАвансаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеАвансаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеАвансаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеГрафикаРаботыСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеКвалификационногоРазрядаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеМестРаботыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеМестРаботыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеМестРаботыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеМестРаботыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеОплатыТрудаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеПлановыхНачисленийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИзменениеУсловийИсполнительногоЛистаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИзменениеШтатногоРасписанияПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Справочник.ИнвентаризацияРасчетовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнвентаризацияРасчетовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИндексацияЗаработкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИндексацияЗаработкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИндексацияЗаработкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИндексацияЗаработкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИндексацияШтатногоРасписанияПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИндивидуальныйГрафикПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИсполнительныйЛистПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ИсходящаяСправкаОЗаработкеДляРасчетаПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КадровыйПереводСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КадровыйПереводСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КадровыйПереводСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КомандировкиСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КомандировкиСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КомандировкиСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КомандировкиСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.КомпенсацияЗаЗадержкуЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КомплектыОтчетностиПерсучета.Чтение.Организации
	|Справочник.КомплектыОтчетностиПерсучета.Изменение.Организации
	|Справочник.МакетыПенсионныхДел.Чтение.Организации
	|Справочник.МакетыПенсионныхДел.Изменение.Организации
	|Справочник.МатериальнаяПомощьПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.МатериальнаяПомощьПрисоединенныеФайлы.Чтение.Организации
	|Справочник.МатериальнаяПомощьПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.МатериальнаяПомощьПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НазначениеПлановогоНачисленияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НазначениеПодработкиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НазначениеПодработкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НазначениеПодработкиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НазначениеПодработкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачальнаяЗадолженностьПоЗарплатеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачальнаяШтатнаяРасстановкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗаПервуюПоловинуМесяцаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеОценочныхОбязательствПоОтпускамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеПоДоговорамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.НачислениеПоДоговорамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеПоДоговорамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.НачислениеПоДоговорамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеСписаниеРезервовПоСомнительнымДолгамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НачислениеСписаниеРезервовПредстоящихРасходовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.НачислениеСписаниеРезервовПредстоящихРасходовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.НефинансовыеПоказателиБюджетов.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.НефинансовыеПоказателиБюджетов.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ОбразованиеФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.ОбразованиеФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.ОбъектыУчетаРезервовПредстоящихРасходов.Чтение.Организации
	|Справочник.ОбъектыУчетаРезервовПредстоящихРасходов.Изменение.Организации
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОперацияНалоговогоУчетаПоНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОперацияУчетаПоСтраховымВзносамПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Чтение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Изменение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Чтение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Изменение.Организации
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОписьЗаявленийСотрудниковНаВыплатуПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОплатаДнейУходаЗаДетьмиИнвалидамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтгрузкаТоваровСХраненияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ОтгулПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтгулПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтгулПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтгулПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтгулСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтгулСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтгулСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтгулСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтменаБронированияГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтменаДоплатыДоСреднегоЗаработкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтправкиМинобороны.Чтение.Организации
	|Справочник.ОтправкиМинобороны.Изменение.Организации
	|Справочник.ОтправкиРПН.Чтение.Организации
	|Справочник.ОтправкиРПН.Изменение.Организации
	|Справочник.ОтправкиФСРАР.Чтение.Организации
	|Справочник.ОтправкиФСРАР.Изменение.Организации
	|Справочник.ОтправкиФСС.Чтение.Организации
	|Справочник.ОтправкиФСС.Изменение.Организации
	|Справочник.ОтправкиФТС.Чтение.Организации
	|Справочник.ОтправкиФТС.Изменение.Организации
	|Справочник.ОтпускаСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтпускаСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтпускаСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтпускаСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ОтражениеЗарплатыВФинансовомУчетеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетПереработчикаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПартииПроизводства.Чтение.Организации
	|Справочник.ПартииПроизводства.Изменение.Организации
	|Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПереводКДругомуРаботодателюПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаМатериаловВПроизводствоПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаСырьяПереработчикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПередачаТоваровХранителюПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПередачаТоваровХранителюПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаТоваровХранителюПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаТоваровХранителюПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаТоваровХранителюПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаТоваровХранителюПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаТоваровХранителюПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаТоваровХранителюПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПеремещениеВДругоеПодразделениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПеремещениеМеждуТерриториямиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПереносЗатратНаПерсоналМеждуСтатьямиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Чтение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Изменение.Организации
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПерерасчетСтраховыхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПериодыОплаченныеДоНачалаЭксплуатацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПланПроизводстваПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПроизводстваПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПогашениеЗадолженностиПоВзысканиямПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Изменение.Организации
	|Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеЗачисленияЗарплатыПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПодтверждениеОткрытияЛицевыхСчетовСотрудниковПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоказателиБюджетов.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ПоказателиБюджетов.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПостоянноеУдержаниеВПользуТретьихЛицПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПоступлениеОтПереработчикаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПоступлениеТоваровОтХранителяПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровОтХранителяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеТоваровОтХранителяПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеТоваровОтХранителяПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровОтХранителяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеТоваровОтХранителяПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПравилаЛимитовПоДаннымБюджетирования.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ПравилаЛимитовПоДаннымБюджетирования.Чтение.Сценарии
	|Справочник.ПравилаЛимитовПоДаннымБюджетирования.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ПравилаЛимитовПоДаннымБюджетирования.Изменение.Сценарии
	|Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеПлановогоНачисленияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПрекращениеПодработкиПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеПодработкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрекращениеПодработкиПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеПодработкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрекращениеСтандартныхВычетовНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриемкаТоваровНаХранениеПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПриемкаТоваровНаХранениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемкаТоваровНаХранениеПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПриемкаТоваровНаХранениеПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПриемкаТоваровНаХранениеПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПриемкаТоваровНаХранениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриемкаТоваровНаХранениеПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПриемкаТоваровНаХранениеПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриемНаРаботуСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПризПодарокПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПризПодарокПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПризПодарокПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПризПодарокПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПриказНаДоплатуДоСреднегоЗаработкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПрогулНеявкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПрогулНеявкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПрогулНеявкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПрогулНеявкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ПродлениеКонтрактаДоговораПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПроизводствоБезЗаказаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПроизводствоБезЗаказаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПроизводствоБезЗаказаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПроизводствоБезЗаказаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РазовоеНачислениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РазовоеНачислениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РазовоеНачислениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РазовоеНачислениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РаспределениеВозвратныхОтходовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РаспределениеВозвратныхОтходовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РаспределениеВозвратныхОтходовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РаспределениеВозвратныхОтходовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РаспределениеОсновногоЗаработкаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацияПереработокПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РегистрацияПереработокПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацияПереработокПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РегистрацияПереработокПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РегистрацияПрочихДоходовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеестрДанныхЭЛНЗаполняемыхРаботодателемПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособийПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РодственникиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.РодственникиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Чтение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Изменение.Организации
	|Справочник.СовмещениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СовмещениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СовмещениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СовмещениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Сотрудники.Чтение.ГруппыФизическихЛиц
	|Справочник.Сотрудники.Чтение.Организации
	|Справочник.Сотрудники.Изменение.ГруппыФизическихЛиц
	|Справочник.Сотрудники.Изменение.Организации
	|Справочник.СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СписаниеПринятыхНаХранениеТоваровПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.СписаниеТоваровУХранителяПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеТоваровУХранителяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеТоваровУХранителяПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.СписаниеТоваровУХранителяПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеТоваровУХранителяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СписаниеТоваровУХранителяПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкаНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкиНДФЛДляПередачиВНалоговыйОрганПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыльПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СправкиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|Справочник.СправкиФизическихЛицПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СправкиФизическихЛицПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СтатьиБюджетов.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.СтатьиБюджетов.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.Сценарии.Чтение.Сценарии
	|Справочник.Сценарии.Изменение.Сценарии
	|Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ТабельУчетаРабочегоВремениПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТерриторииВыполненияРабот.Чтение.Организации
	|Справочник.ТерриторииВыполненияРабот.Изменение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПравеНаИмущественныйВычетДляНДФЛПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенкомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УвольнениеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УвольнениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УвольнениеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УвольнениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УвольнениеСпискомПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УвольнениеСпискомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УвольнениеСпискомПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УвольнениеСпискомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УдержаниеВСчетРасчетовПоПрочимОперациямПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УдержаниеДобровольныхВзносовВНПФПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УдержаниеДобровольныхСтраховыхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.УдержаниеПрофсоюзныхВзносовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УтверждениеШтатногоРасписанияПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Справочник.Файлы.Чтение.Объект.Документ.РегистрУчета
	|Справочник.Файлы.Изменение.Объект.Документ.РегистрУчета
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ХодатайствоОБронированииГражданПребывающихВЗапасеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ШтатноеРасписание.Чтение.Организации
	|Справочник.ШтатноеРасписание.Чтение.ПодразделенияОрганизаций
	|Справочник.ШтатноеРасписание.Изменение.Организации
	|Справочник.ШтатноеРасписание.Изменение.ПодразделенияОрганизаций
	|Справочник.ШтатноеРасписаниеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ШтатноеРасписаниеПрисоединенныеФайлы.Чтение.ПодразделенияОрганизаций
	|Справочник.ШтатноеРасписаниеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ШтатноеРасписаниеПрисоединенныеФайлы.Изменение.ПодразделенияОрганизаций
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Чтение.ГруппыДоступаВидовБюджетов
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Чтение.Сценарии
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Изменение.ГруппыДоступаВидовБюджетов
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЭкземплярБюджетаПрисоединенныеФайлы.Изменение.Сценарии
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Чтение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Изменение.Организации
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Чтение.Организации
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Изменение.Организации
	|Документ.АктВыполненныхВнутреннихРабот.Чтение.Организации
	|Документ.АктВыполненныхВнутреннихРабот.Чтение.Подразделения
	|Документ.АктВыполненныхВнутреннихРабот.Изменение.Организации
	|Документ.АктВыполненныхВнутреннихРабот.Изменение.Подразделения
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Чтение.ГруппыФизическихЛиц
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Чтение.Организации
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Изменение.ГруппыФизическихЛиц
	|Документ.АктПриемкиВыполненныхРаботОказанныхУслуг.Изменение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.Организации
	|Документ.АмортизацияНМА.Чтение.Организации
	|Документ.АмортизацияНМА.Изменение.Организации
	|Документ.АмортизацияНМА2_4.Чтение.Организации
	|Документ.АмортизацияНМА2_4.Изменение.Организации
	|Документ.АмортизацияОС.Чтение.Организации
	|Документ.АмортизацияОС.Изменение.Организации
	|Документ.АмортизацияОС2_4.Чтение.Организации
	|Документ.АмортизацияОС2_4.Изменение.Организации
	|Документ.БольничныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Чтение.Организации
	|Документ.БольничныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Изменение.Организации
	|Документ.БронированиеГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.БронированиеГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.БронированиеГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.БронированиеГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.БухучетНачисленийСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.БухучетНачисленийСотрудников.Чтение.Организации
	|Документ.БухучетНачисленийСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.БухучетНачисленийСотрудников.Изменение.Организации
	|Документ.ВводНачальныхОстатковОтпусков.Чтение.ГруппыФизическихЛиц
	|Документ.ВводНачальныхОстатковОтпусков.Чтение.Организации
	|Документ.ВводНачальныхОстатковОтпусков.Изменение.ГруппыФизическихЛиц
	|Документ.ВводНачальныхОстатковОтпусков.Изменение.Организации
	|Документ.ВводОстатковВнеоборотныхАктивов.Чтение.Организации
	|Документ.ВводОстатковВнеоборотныхАктивов.Изменение.Организации
	|Документ.ВводОстатковВнеоборотныхАктивов2_4.Чтение.Организации
	|Документ.ВводОстатковВнеоборотныхАктивов2_4.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыПеречислением.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыРаздатчиком.Изменение.Организации
	|Документ.ВедомостьПрочихДоходовВБанк.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовВБанк.Чтение.Организации
	|Документ.ВедомостьПрочихДоходовВБанк.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовВБанк.Изменение.Организации
	|Документ.ВедомостьПрочихДоходовВКассу.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовВКассу.Чтение.Организации
	|Документ.ВедомостьПрочихДоходовВКассу.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовВКассу.Изменение.Организации
	|Документ.ВедомостьПрочихДоходовПеречислением.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовПеречислением.Чтение.Организации
	|Документ.ВедомостьПрочихДоходовПеречислением.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьПрочихДоходовПеречислением.Изменение.Организации
	|Документ.ВедомостьУплатыАДВ_11.Чтение.Организации
	|Документ.ВедомостьУплатыАДВ_11.Изменение.Организации
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ВозвратИзОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Подразделения
	|Документ.ВозвратМатериаловИзПроизводства.Чтение.Склады
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Организации
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Подразделения
	|Документ.ВозвратМатериаловИзПроизводства.Изменение.Склады
	|Документ.ВозвратНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ВозвратНДФЛ.Чтение.Организации
	|Документ.ВозвратНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ВозвратНДФЛ.Изменение.Организации
	|Документ.ВозвратОСОтАрендатора.Чтение.Организации
	|Документ.ВозвратОСОтАрендатора.Изменение.Организации
	|Документ.ВозвратОСОтАрендатора2_4.Чтение.Организации
	|Документ.ВозвратОСОтАрендатора2_4.Изменение.Организации
	|Документ.ВозвратСырьяОтПереработчика.Чтение.ГруппыПартнеров
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Организации
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Подразделения
	|Документ.ВозвратСырьяОтПереработчика.Чтение.Склады
	|Документ.ВозвратСырьяОтПереработчика.Изменение.ГруппыПартнеров
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Организации
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Подразделения
	|Документ.ВозвратСырьяОтПереработчика.Изменение.Склады
	|Документ.ВосстановлениеВДолжности.Чтение.ГруппыФизическихЛиц
	|Документ.ВосстановлениеВДолжности.Чтение.Организации
	|Документ.ВосстановлениеВДолжности.Изменение.ГруппыФизическихЛиц
	|Документ.ВосстановлениеВДолжности.Изменение.Организации
	|Документ.ВосстановлениеНДСПоОбъектамНедвижимости.Чтение.Организации
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.Организации
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ВходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.Организации
	|Документ.ВыбытиеАрендованныхОС.Чтение.Организации
	|Документ.ВыбытиеАрендованныхОС.Изменение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Чтение.ГруппыПартнеров
	|Документ.ВыбытиеДенежныхДокументов.Чтение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Чтение.Подразделения
	|Документ.ВыбытиеДенежныхДокументов.Изменение.ГруппыПартнеров
	|Документ.ВыбытиеДенежныхДокументов.Изменение.Организации
	|Документ.ВыбытиеДенежныхДокументов.Изменение.Подразделения
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыкупПринятыхНаХранениеТоваров.Чтение.ГруппыПартнеров
	|Документ.ВыкупПринятыхНаХранениеТоваров.Чтение.Организации
	|Документ.ВыкупПринятыхНаХранениеТоваров.Чтение.Подразделения
	|Документ.ВыкупПринятыхНаХранениеТоваров.Изменение.ГруппыПартнеров
	|Документ.ВыкупПринятыхНаХранениеТоваров.Изменение.Организации
	|Документ.ВыкупПринятыхНаХранениеТоваров.Изменение.Подразделения
	|Документ.ВыкупТоваровХранителем.Чтение.ГруппыПартнеров
	|Документ.ВыкупТоваровХранителем.Чтение.Организации
	|Документ.ВыкупТоваровХранителем.Чтение.Подразделения
	|Документ.ВыкупТоваровХранителем.Изменение.ГруппыПартнеров
	|Документ.ВыкупТоваровХранителем.Изменение.Организации
	|Документ.ВыкупТоваровХранителем.Изменение.Подразделения
	|Документ.ВыплатаБывшимСотрудникам.Чтение.ГруппыФизическихЛиц
	|Документ.ВыплатаБывшимСотрудникам.Чтение.Организации
	|Документ.ВыплатаБывшимСотрудникам.Изменение.ГруппыФизическихЛиц
	|Документ.ВыплатаБывшимСотрудникам.Изменение.Организации
	|Документ.ВыработкаНМА.Чтение.Организации
	|Документ.ВыработкаНМА.Изменение.Организации
	|Документ.ГрафикОтпусков.Чтение.ГруппыФизическихЛиц
	|Документ.ГрафикОтпусков.Чтение.Организации
	|Документ.ГрафикОтпусков.Изменение.ГруппыФизическихЛиц
	|Документ.ГрафикОтпусков.Изменение.Организации
	|Документ.ДанныеДляРасчетаЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеДляРасчетаЗарплаты.Чтение.Организации
	|Документ.ДанныеДляРасчетаЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеДляРасчетаЗарплаты.Изменение.Организации
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Чтение.Организации
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Изменение.Организации
	|Документ.ДвижениеПродукцииИМатериалов.Чтение.Организации
	|Документ.ДвижениеПродукцииИМатериалов.Чтение.Подразделения
	|Документ.ДвижениеПродукцииИМатериалов.Чтение.Склады
	|Документ.ДвижениеПродукцииИМатериалов.Изменение.Организации
	|Документ.ДвижениеПродукцииИМатериалов.Изменение.Подразделения
	|Документ.ДвижениеПродукцииИМатериалов.Изменение.Склады
	|Документ.ДоговорАвторскогоЗаказа.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорАвторскогоЗаказа.Чтение.Организации
	|Документ.ДоговорАвторскогоЗаказа.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорАвторскогоЗаказа.Изменение.Организации
	|Документ.ДоговорЗаймаСотруднику.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорЗаймаСотруднику.Чтение.Организации
	|Документ.ДоговорЗаймаСотруднику.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорЗаймаСотруднику.Изменение.Организации
	|Документ.ДоговорРаботыУслуги.Чтение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Чтение.Организации
	|Документ.ДоговорРаботыУслуги.Изменение.ГруппыФизическихЛиц
	|Документ.ДоговорРаботыУслуги.Изменение.Организации
	|Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ДоходВНатуральнойФорме.Чтение.ГруппыФизическихЛиц
	|Документ.ДоходВНатуральнойФорме.Чтение.Организации
	|Документ.ДоходВНатуральнойФорме.Изменение.ГруппыФизическихЛиц
	|Документ.ДоходВНатуральнойФорме.Изменение.Организации
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Чтение.ГруппыФизическихЛиц
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Чтение.Организации
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Изменение.ГруппыФизическихЛиц
	|Документ.ЕдиновременноеПособиеЗаСчетФСС.Изменение.Организации
	|Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ЗаказМатериаловВПроизводство.Чтение.Организации
	|Документ.ЗаказМатериаловВПроизводство.Чтение.Подразделения
	|Документ.ЗаказМатериаловВПроизводство.Чтение.Склады
	|Документ.ЗаказМатериаловВПроизводство.Изменение.Организации
	|Документ.ЗаказМатериаловВПроизводство.Изменение.Подразделения
	|Документ.ЗаказМатериаловВПроизводство.Изменение.Склады
	|Документ.ЗаказПереработчику.Чтение.ГруппыПартнеров
	|Документ.ЗаказПереработчику.Чтение.Организации
	|Документ.ЗаказПереработчику.Чтение.Подразделения
	|Документ.ЗаказПереработчику.Чтение.Склады
	|Документ.ЗаказПереработчику.Изменение.ГруппыПартнеров
	|Документ.ЗаказПереработчику.Изменение.Организации
	|Документ.ЗаказПереработчику.Изменение.Подразделения
	|Документ.ЗаказПереработчику.Изменение.Склады
	|Документ.ЗаписьКУДиР.Чтение.Организации
	|Документ.ЗаписьКУДиР.Изменение.Организации
	|Документ.ЗапросВФССОПроверкеРаботодателя.Чтение.ГруппыФизическихЛиц
	|Документ.ЗапросВФССОПроверкеРаботодателя.Чтение.Организации
	|Документ.ЗапросВФССОПроверкеРаботодателя.Изменение.ГруппыФизическихЛиц
	|Документ.ЗапросВФССОПроверкеРаботодателя.Изменение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Изменение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Чтение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Изменение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Чтение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Изменение.Организации
	|Документ.ЗаявлениеИЗапросВПФРОЗаработке.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеИЗапросВПФРОЗаработке.Чтение.Организации
	|Документ.ЗаявлениеИЗапросВПФРОЗаработке.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеИЗапросВПФРОЗаработке.Изменение.Организации
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Чтение.Организации
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Изменение.Организации
	|Документ.ИзменениеАванса.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеАванса.Чтение.Организации
	|Документ.ИзменениеАванса.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеАванса.Изменение.Организации
	|Документ.ИзменениеГрафикаРаботыСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеГрафикаРаботыСписком.Чтение.Организации
	|Документ.ИзменениеГрафикаРаботыСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеГрафикаРаботыСписком.Изменение.Организации
	|Документ.ИзменениеКвалификационногоРазряда.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеКвалификационногоРазряда.Чтение.Организации
	|Документ.ИзменениеКвалификационногоРазряда.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеКвалификационногоРазряда.Изменение.Организации
	|Документ.ИзменениеМестРаботы.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеМестРаботы.Чтение.Организации
	|Документ.ИзменениеМестРаботы.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеМестРаботы.Изменение.Организации
	|Документ.ИзменениеОплатыТруда.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеОплатыТруда.Чтение.Организации
	|Документ.ИзменениеОплатыТруда.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеОплатыТруда.Изменение.Организации
	|Документ.ИзменениеПараметровНМА.Чтение.Организации
	|Документ.ИзменениеПараметровНМА.Изменение.Организации
	|Документ.ИзменениеПараметровНМА2_4.Чтение.Организации
	|Документ.ИзменениеПараметровНМА2_4.Изменение.Организации
	|Документ.ИзменениеПараметровОС.Чтение.Организации
	|Документ.ИзменениеПараметровОС.Изменение.Организации
	|Документ.ИзменениеПараметровОС2_4.Чтение.Организации
	|Документ.ИзменениеПараметровОС2_4.Изменение.Организации
	|Документ.ИзменениеПлановыхНачислений.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеПлановыхНачислений.Чтение.Организации
	|Документ.ИзменениеПлановыхНачислений.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеПлановыхНачислений.Изменение.Организации
	|Документ.ИзменениеСостоянияОС.Чтение.Организации
	|Документ.ИзменениеСостоянияОС.Изменение.Организации
	|Документ.ИзменениеСпособаОтраженияИмущественныхНалогов.Чтение.Организации
	|Документ.ИзменениеСпособаОтраженияИмущественныхНалогов.Изменение.Организации
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Чтение.Организации
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийДоговораЗаймаСотруднику.Изменение.Организации
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Чтение.Организации
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийИсполнительногоЛиста.Изменение.Организации
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ИзменениеУсловийОплатыОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.ИзменениеШтатногоРасписания.Чтение.Организации
	|Документ.ИзменениеШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.ИзменениеШтатногоРасписания.Изменение.Организации
	|Документ.ИзменениеШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ИнвентаризацияНМА.Чтение.Организации
	|Документ.ИнвентаризацияНМА.Изменение.Организации
	|Документ.ИнвентаризацияОС.Чтение.Организации
	|Документ.ИнвентаризацияОС.Изменение.Организации
	|Документ.ИнвентаризацияРасчетов.Чтение.Организации
	|Документ.ИнвентаризацияРасчетов.Изменение.Организации
	|Документ.ИндексацияЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ИндексацияЗаработка.Чтение.Организации
	|Документ.ИндексацияЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ИндексацияЗаработка.Изменение.Организации
	|Документ.ИндексацияШтатногоРасписания.Чтение.Организации
	|Документ.ИндексацияШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.ИндексацияШтатногоРасписания.Изменение.Организации
	|Документ.ИндексацияШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ИндивидуальныйГрафик.Чтение.ГруппыФизическихЛиц
	|Документ.ИндивидуальныйГрафик.Чтение.Организации
	|Документ.ИндивидуальныйГрафик.Изменение.ГруппыФизическихЛиц
	|Документ.ИндивидуальныйГрафик.Изменение.Организации
	|Документ.ИсполнительныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Чтение.Организации
	|Документ.ИсполнительныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Изменение.Организации
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.Организации
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.Организации
	|Документ.КадровыйПеревод.Чтение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Чтение.Организации
	|Документ.КадровыйПеревод.Изменение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Изменение.Организации
	|Документ.КадровыйПереводСписком.Чтение.ГруппыФизическихЛиц
	|Документ.КадровыйПереводСписком.Чтение.Организации
	|Документ.КадровыйПереводСписком.Изменение.ГруппыФизическихЛиц
	|Документ.КадровыйПереводСписком.Изменение.Организации
	|Документ.КнигаПокупокДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.КнигаПокупокДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.КнигаПродажДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.КнигаПродажДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.Командировка.Чтение.ГруппыФизическихЛиц
	|Документ.Командировка.Чтение.Организации
	|Документ.Командировка.Изменение.ГруппыФизическихЛиц
	|Документ.Командировка.Изменение.Организации
	|Документ.КомандировкиСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.КомандировкиСотрудников.Чтение.Организации
	|Документ.КомандировкиСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.КомандировкиСотрудников.Изменение.Организации
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Чтение.Организации
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.КомпенсацияЗаЗадержкуЗарплаты.Изменение.Организации
	|Документ.КонтролируемаяСделка.Чтение.Организации
	|Документ.КонтролируемаяСделка.Изменение.Организации
	|Документ.МатериальнаяПомощь.Чтение.ГруппыФизическихЛиц
	|Документ.МатериальнаяПомощь.Чтение.Организации
	|Документ.МатериальнаяПомощь.Изменение.ГруппыФизическихЛиц
	|Документ.МатериальнаяПомощь.Изменение.Организации
	|Документ.МодернизацияОС.Чтение.Организации
	|Документ.МодернизацияОС.Изменение.Организации
	|Документ.МодернизацияОС2_4.Чтение.Организации
	|Документ.МодернизацияОС2_4.Изменение.Организации
	|Документ.НазначениеПлановогоНачисления.Чтение.ГруппыФизическихЛиц
	|Документ.НазначениеПлановогоНачисления.Чтение.Организации
	|Документ.НазначениеПлановогоНачисления.Изменение.ГруппыФизическихЛиц
	|Документ.НазначениеПлановогоНачисления.Изменение.Организации
	|Документ.НазначениеПодработки.Чтение.ГруппыФизическихЛиц
	|Документ.НазначениеПодработки.Чтение.Организации
	|Документ.НазначениеПодработки.Изменение.ГруппыФизическихЛиц
	|Документ.НазначениеПодработки.Изменение.Организации
	|Документ.НаработкаТМЦВЭксплуатации.Чтение.Организации
	|Документ.НаработкаТМЦВЭксплуатации.Чтение.Подразделения
	|Документ.НаработкаТМЦВЭксплуатации.Изменение.Организации
	|Документ.НаработкаТМЦВЭксплуатации.Изменение.Подразделения
	|Документ.НачальнаяЗадолженностьПоЗарплате.Чтение.ГруппыФизическихЛиц
	|Документ.НачальнаяЗадолженностьПоЗарплате.Чтение.Организации
	|Документ.НачальнаяЗадолженностьПоЗарплате.Изменение.ГруппыФизическихЛиц
	|Документ.НачальнаяЗадолженностьПоЗарплате.Изменение.Организации
	|Документ.НачальнаяШтатнаяРасстановка.Чтение.ГруппыФизическихЛиц
	|Документ.НачальнаяШтатнаяРасстановка.Чтение.Организации
	|Документ.НачальнаяШтатнаяРасстановка.Изменение.ГруппыФизическихЛиц
	|Документ.НачальнаяШтатнаяРасстановка.Изменение.Организации
	|Документ.НачислениеДивидендов.Чтение.Организации
	|Документ.НачислениеДивидендов.Изменение.Организации
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Чтение.Организации
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеЗаПервуюПоловинуМесяца.Изменение.Организации
	|Документ.НачислениеЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Чтение.Организации
	|Документ.НачислениеЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Изменение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.Организации
	|Документ.НачислениеПоДоговорам.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеПоДоговорам.Чтение.Организации
	|Документ.НачислениеПоДоговорам.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеПоДоговорам.Изменение.Организации
	|Документ.НачислениеСписаниеРезервовПоСомнительнымДолгам.Чтение.Организации
	|Документ.НачислениеСписаниеРезервовПоСомнительнымДолгам.Изменение.Организации
	|Документ.НачислениеСписаниеРезервовПредстоящихРасходов.Чтение.Организации
	|Документ.НачислениеСписаниеРезервовПредстоящихРасходов.Изменение.Организации
	|Документ.ОграничениеВзысканий.Чтение.ГруппыФизическихЛиц
	|Документ.ОграничениеВзысканий.Чтение.Организации
	|Документ.ОграничениеВзысканий.Изменение.ГруппыФизическихЛиц
	|Документ.ОграничениеВзысканий.Изменение.Организации
	|Документ.ОперацияБух.Чтение.Организации
	|Документ.ОперацияБух.Изменение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.Организации
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Чтение.Организации
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Изменение.Организации
	|Документ.ОписьОДВ_1.Чтение.Организации
	|Документ.ОписьОДВ_1.Изменение.Организации
	|Документ.ОписьПачекСЗВ_6.Чтение.Организации
	|Документ.ОписьПачекСЗВ_6.Изменение.Организации
	|Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Чтение.ГруппыФизическихЛиц
	|Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Чтение.Организации
	|Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Изменение.ГруппыФизическихЛиц
	|Документ.ОплатаДнейУходаЗаДетьмиИнвалидами.Изменение.Организации
	|Документ.ОплатаПоСреднемуЗаработку.Чтение.ГруппыФизическихЛиц
	|Документ.ОплатаПоСреднемуЗаработку.Чтение.Организации
	|Документ.ОплатаПоСреднемуЗаработку.Изменение.ГруппыФизическихЛиц
	|Документ.ОплатаПоСреднемуЗаработку.Изменение.Организации
	|Документ.ОтгрузкаТоваровСХранения.Чтение.ГруппыПартнеров
	|Документ.ОтгрузкаТоваровСХранения.Чтение.Организации
	|Документ.ОтгрузкаТоваровСХранения.Чтение.Подразделения
	|Документ.ОтгрузкаТоваровСХранения.Чтение.Склады
	|Документ.ОтгрузкаТоваровСХранения.Изменение.ГруппыПартнеров
	|Документ.ОтгрузкаТоваровСХранения.Изменение.Организации
	|Документ.ОтгрузкаТоваровСХранения.Изменение.Подразделения
	|Документ.ОтгрузкаТоваровСХранения.Изменение.Склады
	|Документ.Отгул.Чтение.ГруппыФизическихЛиц
	|Документ.Отгул.Чтение.Организации
	|Документ.Отгул.Изменение.ГруппыФизическихЛиц
	|Документ.Отгул.Изменение.Организации
	|Документ.ОтгулСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ОтгулСписком.Чтение.Организации
	|Документ.ОтгулСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ОтгулСписком.Изменение.Организации
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаБронированияГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Чтение.Организации
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаДоплатыДоСреднегоЗаработка.Изменение.Организации
	|Документ.ОтменаРегистрацииЗемельныхУчастков.Чтение.Организации
	|Документ.ОтменаРегистрацииЗемельныхУчастков.Изменение.Организации
	|Документ.ОтменаРегистрацииТранспортныхСредств.Чтение.Организации
	|Документ.ОтменаРегистрацииТранспортныхСредств.Изменение.Организации
	|Документ.ОтменаСовмещения.Чтение.ГруппыФизическихЛиц
	|Документ.ОтменаСовмещения.Чтение.Организации
	|Документ.ОтменаСовмещения.Изменение.ГруппыФизическихЛиц
	|Документ.ОтменаСовмещения.Изменение.Организации
	|Документ.Отпуск.Чтение.ГруппыФизическихЛиц
	|Документ.Отпуск.Чтение.Организации
	|Документ.Отпуск.Изменение.ГруппыФизическихЛиц
	|Документ.Отпуск.Изменение.Организации
	|Документ.ОтпускаСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускаСотрудников.Чтение.Организации
	|Документ.ОтпускаСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускаСотрудников.Изменение.Организации
	|Документ.ОтпускБезСохраненияОплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплаты.Чтение.Организации
	|Документ.ОтпускБезСохраненияОплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплаты.Изменение.Организации
	|Документ.ОтпускБезСохраненияОплатыСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплатыСписком.Чтение.Организации
	|Документ.ОтпускБезСохраненияОплатыСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускБезСохраненияОплатыСписком.Изменение.Организации
	|Документ.ОтпускПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.ОтпускПоУходуЗаРебенком.Чтение.Организации
	|Документ.ОтпускПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.ОтпускПоУходуЗаРебенком.Изменение.Организации
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Чтение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Чтение.Организации
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Изменение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВФинансовомУчете.Изменение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Чтение.ГруппыПартнеров
	|Документ.ОтчетОператораСистемыПлатон.Чтение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Чтение.Подразделения
	|Документ.ОтчетОператораСистемыПлатон.Изменение.ГруппыПартнеров
	|Документ.ОтчетОператораСистемыПлатон.Изменение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Изменение.Подразделения
	|Документ.ОтчетПереработчика.Чтение.ГруппыПартнеров
	|Документ.ОтчетПереработчика.Чтение.Организации
	|Документ.ОтчетПереработчика.Чтение.Подразделения
	|Документ.ОтчетПереработчика.Чтение.Склады
	|Документ.ОтчетПереработчика.Изменение.ГруппыПартнеров
	|Документ.ОтчетПереработчика.Изменение.Организации
	|Документ.ОтчетПереработчика.Изменение.Подразделения
	|Документ.ОтчетПереработчика.Изменение.Склады
	|Документ.ПачкаДокументовАДВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_1.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_1.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_2.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_2.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_2.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_2.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_3.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_3.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_3.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_3.Изменение.Организации
	|Документ.ПачкаДокументовДСВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовДСВ_1.Чтение.Организации
	|Документ.ПачкаДокументовДСВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовДСВ_1.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_1.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_1.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_3.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_3.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_3.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_3.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_4.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_4.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_4.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_4.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_К.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_К.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_К.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_К.Изменение.Организации
	|Документ.ПачкаДокументовСПВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_1.Чтение.Организации
	|Документ.ПачкаДокументовСПВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_1.Изменение.Организации
	|Документ.ПачкаДокументовСПВ_2.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_2.Чтение.Организации
	|Документ.ПачкаДокументовСПВ_2.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_2.Изменение.Организации
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Чтение.Организации
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Изменение.Организации
	|Документ.ПереводКДругомуРаботодателю.Чтение.ГруппыФизическихЛиц
	|Документ.ПереводКДругомуРаботодателю.Чтение.Организации
	|Документ.ПереводКДругомуРаботодателю.Изменение.ГруппыФизическихЛиц
	|Документ.ПереводКДругомуРаботодателю.Изменение.Организации
	|Документ.ПереводНаОплатуПоСреднемуЗаработку.Чтение.ГруппыФизическихЛиц
	|Документ.ПереводНаОплатуПоСреднемуЗаработку.Чтение.Организации
	|Документ.ПереводНаОплатуПоСреднемуЗаработку.Изменение.ГруппыФизическихЛиц
	|Документ.ПереводНаОплатуПоСреднемуЗаработку.Изменение.Организации
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Организации
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Подразделения
	|Документ.ПередачаМатериаловВПроизводство.Чтение.Склады
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Организации
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Подразделения
	|Документ.ПередачаМатериаловВПроизводство.Изменение.Склады
	|Документ.ПередачаОСАрендатору.Чтение.Организации
	|Документ.ПередачаОСАрендатору.Изменение.Организации
	|Документ.ПередачаОСАрендатору2_4.Чтение.Организации
	|Документ.ПередачаОСАрендатору2_4.Изменение.Организации
	|Документ.ПередачаСырьяПереработчику.Чтение.ГруппыПартнеров
	|Документ.ПередачаСырьяПереработчику.Чтение.Организации
	|Документ.ПередачаСырьяПереработчику.Чтение.Подразделения
	|Документ.ПередачаСырьяПереработчику.Чтение.Склады
	|Документ.ПередачаСырьяПереработчику.Изменение.ГруппыПартнеров
	|Документ.ПередачаСырьяПереработчику.Изменение.Организации
	|Документ.ПередачаСырьяПереработчику.Изменение.Подразделения
	|Документ.ПередачаСырьяПереработчику.Изменение.Склады
	|Документ.ПередачаТоваровХранителю.Чтение.ГруппыПартнеров
	|Документ.ПередачаТоваровХранителю.Чтение.Организации
	|Документ.ПередачаТоваровХранителю.Чтение.Подразделения
	|Документ.ПередачаТоваровХранителю.Чтение.Склады
	|Документ.ПередачаТоваровХранителю.Изменение.ГруппыПартнеров
	|Документ.ПередачаТоваровХранителю.Изменение.Организации
	|Документ.ПередачаТоваровХранителю.Изменение.Подразделения
	|Документ.ПередачаТоваровХранителю.Изменение.Склады
	|Документ.ПеремещениеВДругоеПодразделение.Чтение.ГруппыФизическихЛиц
	|Документ.ПеремещениеВДругоеПодразделение.Чтение.Организации
	|Документ.ПеремещениеВДругоеПодразделение.Изменение.ГруппыФизическихЛиц
	|Документ.ПеремещениеВДругоеПодразделение.Изменение.Организации
	|Документ.ПеремещениеВЭксплуатации.Чтение.Организации
	|Документ.ПеремещениеВЭксплуатации.Чтение.Подразделения
	|Документ.ПеремещениеВЭксплуатации.Изменение.Организации
	|Документ.ПеремещениеВЭксплуатации.Изменение.Подразделения
	|Документ.ПеремещениеМеждуТерриториями.Чтение.ГруппыФизическихЛиц
	|Документ.ПеремещениеМеждуТерриториями.Чтение.Организации
	|Документ.ПеремещениеМеждуТерриториями.Изменение.ГруппыФизическихЛиц
	|Документ.ПеремещениеМеждуТерриториями.Изменение.Организации
	|Документ.ПеремещениеНМА2_4.Чтение.Организации
	|Документ.ПеремещениеНМА2_4.Изменение.Организации
	|Документ.ПеремещениеОС.Чтение.Организации
	|Документ.ПеремещениеОС.Изменение.Организации
	|Документ.ПеремещениеОС2_4.Чтение.Организации
	|Документ.ПеремещениеОС2_4.Изменение.Организации
	|Документ.ПереносЗатратНаПерсоналМеждуСтатьями.Чтение.ГруппыФизическихЛиц
	|Документ.ПереносЗатратНаПерсоналМеждуСтатьями.Чтение.Организации
	|Документ.ПереносЗатратНаПерсоналМеждуСтатьями.Изменение.ГруппыФизическихЛиц
	|Документ.ПереносЗатратНаПерсоналМеждуСтатьями.Изменение.Организации
	|Документ.ПереносОтпуска.Чтение.ГруппыФизическихЛиц
	|Документ.ПереносОтпуска.Чтение.Организации
	|Документ.ПереносОтпуска.Изменение.ГруппыФизическихЛиц
	|Документ.ПереносОтпуска.Изменение.Организации
	|Документ.ПереоценкаНМА.Чтение.Организации
	|Документ.ПереоценкаНМА.Изменение.Организации
	|Документ.ПереоценкаНМА2_4.Чтение.Организации
	|Документ.ПереоценкаНМА2_4.Изменение.Организации
	|Документ.ПереоценкаОС.Чтение.Организации
	|Документ.ПереоценкаОС.Изменение.Организации
	|Документ.ПереоценкаОС2_4.Чтение.Организации
	|Документ.ПереоценкаОС2_4.Изменение.Организации
	|Документ.ПерерасчетНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Чтение.Организации
	|Документ.ПерерасчетНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Изменение.Организации
	|Документ.ПерерасчетСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетСтраховыхВзносов.Чтение.Организации
	|Документ.ПерерасчетСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетСтраховыхВзносов.Изменение.Организации
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Чтение.ГруппыФизическихЛиц
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Чтение.Организации
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Изменение.ГруппыФизическихЛиц
	|Документ.ПериодыОплаченныеДоНачалаЭксплуатации.Изменение.Организации
	|Документ.ПланПроизводства.Чтение.Подразделения
	|Документ.ПланПроизводства.Изменение.Подразделения
	|Документ.ПогашениеЗадолженностиПоВзысканиям.Чтение.ГруппыФизическихЛиц
	|Документ.ПогашениеЗадолженностиПоВзысканиям.Чтение.Организации
	|Документ.ПогашениеЗадолженностиПоВзысканиям.Изменение.ГруппыФизическихЛиц
	|Документ.ПогашениеЗадолженностиПоВзысканиям.Изменение.Организации
	|Документ.ПодготовкаКПередачеНМА.Чтение.Организации
	|Документ.ПодготовкаКПередачеНМА.Изменение.Организации
	|Документ.ПодготовкаКПередачеНМА2_4.Чтение.Организации
	|Документ.ПодготовкаКПередачеНМА2_4.Изменение.Организации
	|Документ.ПодготовкаКПередачеОС.Чтение.Организации
	|Документ.ПодготовкаКПередачеОС.Изменение.Организации
	|Документ.ПодготовкаКПередачеОС2_4.Чтение.Организации
	|Документ.ПодготовкаКПередачеОС2_4.Изменение.Организации
	|Документ.ПодтверждениеЗачисленияЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеЗачисленияЗарплаты.Чтение.Организации
	|Документ.ПодтверждениеЗачисленияЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеЗачисленияЗарплаты.Изменение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Чтение.ГруппыФизическихЛиц
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Чтение.Организации
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Изменение.ГруппыФизическихЛиц
	|Документ.ПостоянноеУдержаниеВПользуТретьихЛиц.Изменение.Организации
	|Документ.ПоступлениеАрендованныхОС.Чтение.Организации
	|Документ.ПоступлениеАрендованныхОС.Изменение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеДенежныхДокументов.Чтение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Чтение.Подразделения
	|Документ.ПоступлениеДенежныхДокументов.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеДенежныхДокументов.Изменение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Изменение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеОтПереработчика.Чтение.Организации
	|Документ.ПоступлениеОтПереработчика.Чтение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Чтение.Склады
	|Документ.ПоступлениеОтПереработчика.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеОтПереработчика.Изменение.Организации
	|Документ.ПоступлениеОтПереработчика.Изменение.Подразделения
	|Документ.ПоступлениеОтПереработчика.Изменение.Склады
	|Документ.ПоступлениеПредметовЛизинга.Чтение.Организации
	|Документ.ПоступлениеПредметовЛизинга.Изменение.Организации
	|Документ.ПоступлениеТоваровОтХранителя.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровОтХранителя.Чтение.Организации
	|Документ.ПоступлениеТоваровОтХранителя.Чтение.Подразделения
	|Документ.ПоступлениеТоваровОтХранителя.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровОтХранителя.Изменение.Организации
	|Документ.ПоступлениеТоваровОтХранителя.Изменение.Подразделения
	|Документ.ПоясненияКДекларацииПоНДС.Чтение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Изменение.Организации
	|Документ.ПрекращениеПлановогоНачисления.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПлановогоНачисления.Чтение.Организации
	|Документ.ПрекращениеПлановогоНачисления.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПлановогоНачисления.Изменение.Организации
	|Документ.ПрекращениеПодработки.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПодработки.Чтение.Организации
	|Документ.ПрекращениеПодработки.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеПодработки.Изменение.Организации
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Чтение.Организации
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Изменение.Организации
	|Документ.Премия.Чтение.ГруппыФизическихЛиц
	|Документ.Премия.Чтение.Организации
	|Документ.Премия.Изменение.ГруппыФизическихЛиц
	|Документ.Премия.Изменение.Организации
	|Документ.ПриемкаТоваровНаХранение.Чтение.ГруппыПартнеров
	|Документ.ПриемкаТоваровНаХранение.Чтение.Организации
	|Документ.ПриемкаТоваровНаХранение.Чтение.Подразделения
	|Документ.ПриемкаТоваровНаХранение.Чтение.Склады
	|Документ.ПриемкаТоваровНаХранение.Изменение.ГруппыПартнеров
	|Документ.ПриемкаТоваровНаХранение.Изменение.Организации
	|Документ.ПриемкаТоваровНаХранение.Изменение.Подразделения
	|Документ.ПриемкаТоваровНаХранение.Изменение.Склады
	|Документ.ПриемНаРаботу.Чтение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПриемНаРаботу.Изменение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПриемНаРаботуСписком.Чтение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботуСписком.Чтение.Организации
	|Документ.ПриемНаРаботуСписком.Изменение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботуСписком.Изменение.Организации
	|Документ.ПризПодарок.Чтение.ГруппыФизическихЛиц
	|Документ.ПризПодарок.Чтение.Организации
	|Документ.ПризПодарок.Изменение.ГруппыФизическихЛиц
	|Документ.ПризПодарок.Изменение.Организации
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Чтение.Организации
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.ПриказНаДоплатуДоСреднегоЗаработка.Изменение.Организации
	|Документ.ПринятиеКУчетуНМА.Чтение.Организации
	|Документ.ПринятиеКУчетуНМА.Изменение.Организации
	|Документ.ПринятиеКУчетуНМА2_4.Чтение.Организации
	|Документ.ПринятиеКУчетуНМА2_4.Изменение.Организации
	|Документ.ПринятиеКУчетуОС.Чтение.Организации
	|Документ.ПринятиеКУчетуОС.Изменение.Организации
	|Документ.ПринятиеКУчетуОС2_4.Чтение.Организации
	|Документ.ПринятиеКУчетуОС2_4.Изменение.Организации
	|Документ.ПриобретениеУслугПоЛизингу.Чтение.Организации
	|Документ.ПриобретениеУслугПоЛизингу.Изменение.Организации
	|Документ.ПрогулНеявка.Чтение.ГруппыФизическихЛиц
	|Документ.ПрогулНеявка.Чтение.Организации
	|Документ.ПрогулНеявка.Изменение.ГруппыФизическихЛиц
	|Документ.ПрогулНеявка.Изменение.Организации
	|Документ.ПродлениеКонтрактаДоговора.Чтение.ГруппыФизическихЛиц
	|Документ.ПродлениеКонтрактаДоговора.Чтение.Организации
	|Документ.ПродлениеКонтрактаДоговора.Изменение.ГруппыФизическихЛиц
	|Документ.ПродлениеКонтрактаДоговора.Изменение.Организации
	|Документ.ПроизводствоБезЗаказа.Чтение.Организации
	|Документ.ПроизводствоБезЗаказа.Чтение.Подразделения
	|Документ.ПроизводствоБезЗаказа.Изменение.Организации
	|Документ.ПроизводствоБезЗаказа.Изменение.Подразделения
	|Документ.ПростойСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ПростойСотрудников.Чтение.Организации
	|Документ.ПростойСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ПростойСотрудников.Изменение.Организации
	|Документ.РаботаВВыходныеИПраздничныеДни.Чтение.ГруппыФизическихЛиц
	|Документ.РаботаВВыходныеИПраздничныеДни.Чтение.Организации
	|Документ.РаботаВВыходныеИПраздничныеДни.Изменение.ГруппыФизическихЛиц
	|Документ.РаботаВВыходныеИПраздничныеДни.Изменение.Организации
	|Документ.РаботаСверхурочно.Чтение.ГруппыФизическихЛиц
	|Документ.РаботаСверхурочно.Чтение.Организации
	|Документ.РаботаСверхурочно.Изменение.ГруппыФизическихЛиц
	|Документ.РаботаСверхурочно.Изменение.Организации
	|Документ.РазовоеНачисление.Чтение.ГруппыФизическихЛиц
	|Документ.РазовоеНачисление.Чтение.Организации
	|Документ.РазовоеНачисление.Изменение.ГруппыФизическихЛиц
	|Документ.РазовоеНачисление.Изменение.Организации
	|Документ.РазукомплектацияОС.Чтение.Организации
	|Документ.РазукомплектацияОС.Изменение.Организации
	|Документ.РаспределениеВозвратныхОтходов.Чтение.Организации
	|Документ.РаспределениеВозвратныхОтходов.Чтение.Подразделения
	|Документ.РаспределениеВозвратныхОтходов.Изменение.Организации
	|Документ.РаспределениеВозвратныхОтходов.Изменение.Подразделения
	|Документ.РаспределениеОсновногоЗаработка.Чтение.ГруппыФизическихЛиц
	|Документ.РаспределениеОсновногоЗаработка.Чтение.Организации
	|Документ.РаспределениеОсновногоЗаработка.Изменение.ГруппыФизическихЛиц
	|Документ.РаспределениеОсновногоЗаработка.Изменение.Организации
	|Документ.РегистрацияЗемельныхУчастков.Чтение.Организации
	|Документ.РегистрацияЗемельныхУчастков.Изменение.Организации
	|Документ.РегистрацияПереработок.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияПереработок.Чтение.Организации
	|Документ.РегистрацияПереработок.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияПереработок.Изменение.Организации
	|Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.Чтение.Организации
	|Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество.Изменение.Организации
	|Документ.РегистрацияПрочихДоходов.Чтение.ГруппыФизическихЛиц
	|Документ.РегистрацияПрочихДоходов.Чтение.Организации
	|Документ.РегистрацияПрочихДоходов.Изменение.ГруппыФизическихЛиц
	|Документ.РегистрацияПрочихДоходов.Изменение.Организации
	|Документ.РегистрацияПрочихКонтролируемыхСделок.Чтение.Организации
	|Документ.РегистрацияПрочихКонтролируемыхСделок.Изменение.Организации
	|Документ.РегистрацияТранспортныхСредств.Чтение.Организации
	|Документ.РегистрацияТранспортныхСредств.Изменение.Организации
	|Документ.РегистрУчета.Чтение.Организации
	|Документ.РегистрУчета.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентнаяОперация.Чтение.Организации
	|Документ.РегламентнаяОперация.Изменение.Организации
	|Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.Чтение.Организации
	|Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.Изменение.Организации
	|Документ.РеестрДСВ_3.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрДСВ_3.Чтение.Организации
	|Документ.РеестрДСВ_3.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрДСВ_3.Изменение.Организации
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Чтение.Организации
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Изменение.Организации
	|Документ.РеестрСЗВ_6_2.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСЗВ_6_2.Чтение.Организации
	|Документ.РеестрСЗВ_6_2.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСЗВ_6_2.Изменение.Организации
	|Документ.РеестрСчетовФактурПоставщика.Чтение.Организации
	|Документ.РеестрСчетовФактурПоставщика.Изменение.Организации
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Чтение.Организации
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Изменение.Организации
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Чтение.Организации
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Изменение.Организации
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Чтение.Организации
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Изменение.Организации
	|Документ.Совмещение.Чтение.ГруппыФизическихЛиц
	|Документ.Совмещение.Чтение.Организации
	|Документ.Совмещение.Изменение.ГруппыФизическихЛиц
	|Документ.Совмещение.Изменение.Организации
	|Документ.СписаниеИзЭксплуатации.Чтение.Организации
	|Документ.СписаниеИзЭксплуатации.Чтение.Подразделения
	|Документ.СписаниеИзЭксплуатации.Изменение.Организации
	|Документ.СписаниеИзЭксплуатации.Изменение.Подразделения
	|Документ.СписаниеНМА.Чтение.Организации
	|Документ.СписаниеНМА.Изменение.Организации
	|Документ.СписаниеНМА2_4.Чтение.Организации
	|Документ.СписаниеНМА2_4.Изменение.Организации
	|Документ.СписаниеОС.Чтение.Организации
	|Документ.СписаниеОС.Изменение.Организации
	|Документ.СписаниеОС2_4.Чтение.Организации
	|Документ.СписаниеОС2_4.Изменение.Организации
	|Документ.СписаниеПринятыхНаХранениеТоваров.Чтение.ГруппыПартнеров
	|Документ.СписаниеПринятыхНаХранениеТоваров.Чтение.Организации
	|Документ.СписаниеПринятыхНаХранениеТоваров.Чтение.Подразделения
	|Документ.СписаниеПринятыхНаХранениеТоваров.Изменение.ГруппыПартнеров
	|Документ.СписаниеПринятыхНаХранениеТоваров.Изменение.Организации
	|Документ.СписаниеПринятыхНаХранениеТоваров.Изменение.Подразделения
	|Документ.СписаниеТоваровУХранителя.Чтение.ГруппыПартнеров
	|Документ.СписаниеТоваровУХранителя.Чтение.Организации
	|Документ.СписаниеТоваровУХранителя.Чтение.Подразделения
	|Документ.СписаниеТоваровУХранителя.Изменение.ГруппыПартнеров
	|Документ.СписаниеТоваровУХранителя.Изменение.Организации
	|Документ.СписаниеТоваровУХранителя.Изменение.Подразделения
	|Документ.СправкаНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.СправкаНДФЛ.Чтение.Организации
	|Документ.СправкаНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.СправкаНДФЛ.Изменение.Организации
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Чтение.ГруппыФизическихЛиц
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Чтение.Организации
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Изменение.ГруппыФизическихЛиц
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Изменение.Организации
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Чтение.ГруппыФизическихЛиц
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Чтение.Организации
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Изменение.ГруппыФизическихЛиц
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Изменение.Организации
	|Документ.ТабельУчетаРабочегоВремени.Чтение.ГруппыФизическихЛиц
	|Документ.ТабельУчетаРабочегоВремени.Чтение.Организации
	|Документ.ТабельУчетаРабочегоВремени.Изменение.ГруппыФизическихЛиц
	|Документ.ТабельУчетаРабочегоВремени.Изменение.Организации
	|Документ.ТаможеннаяДекларацияЭкспорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияЭкспорт.Изменение.Организации
	|Документ.УведомлениеОКонтролируемыхСделках.Чтение.Организации
	|Документ.УведомлениеОКонтролируемыхСделках.Изменение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Чтение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Изменение.Организации
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Чтение.Организации
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Изменение.Организации
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Чтение.Организации
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПрекращенииОтпускаПоУходуЗаРебенком.Изменение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Чтение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Изменение.Организации
	|Документ.Увольнение.Чтение.ГруппыФизическихЛиц
	|Документ.Увольнение.Чтение.Организации
	|Документ.Увольнение.Изменение.ГруппыФизическихЛиц
	|Документ.Увольнение.Изменение.Организации
	|Документ.УвольнениеСписком.Чтение.ГруппыФизическихЛиц
	|Документ.УвольнениеСписком.Чтение.Организации
	|Документ.УвольнениеСписком.Изменение.ГруппыФизическихЛиц
	|Документ.УвольнениеСписком.Изменение.Организации
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Чтение.Организации
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеВСчетРасчетовПоПрочимОперациям.Изменение.Организации
	|Документ.УдержаниеДобровольныхВзносовВНПФ.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеДобровольныхВзносовВНПФ.Чтение.Организации
	|Документ.УдержаниеДобровольныхВзносовВНПФ.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеДобровольныхВзносовВНПФ.Изменение.Организации
	|Документ.УдержаниеДобровольныхСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеДобровольныхСтраховыхВзносов.Чтение.Организации
	|Документ.УдержаниеДобровольныхСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеДобровольныхСтраховыхВзносов.Изменение.Организации
	|Документ.УдержаниеПрофсоюзныхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.УдержаниеПрофсоюзныхВзносов.Чтение.Организации
	|Документ.УдержаниеПрофсоюзныхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.УдержаниеПрофсоюзныхВзносов.Изменение.Организации
	|Документ.УстановкаЗначенийНефинансовыхПоказателей.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Документ.УстановкаЗначенийНефинансовыхПоказателей.Чтение.Организации
	|Документ.УстановкаЗначенийНефинансовыхПоказателей.Чтение.Подразделения
	|Документ.УстановкаЗначенийНефинансовыхПоказателей.Чтение.Сценарии
	|Документ.УстановкаЗначенийНефинансовыхПоказателей.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Документ.УстановкаЗначенийНефинансовыхПоказателей.Изменение.Организации
	|Документ.УстановкаЗначенийНефинансовыхПоказателей.Изменение.Подразделения
	|Документ.УстановкаЗначенийНефинансовыхПоказателей.Изменение.Сценарии
	|Документ.УтверждениеШтатногоРасписания.Чтение.Организации
	|Документ.УтверждениеШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|Документ.УтверждениеШтатногоРасписания.Изменение.Организации
	|Документ.УтверждениеШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Чтение.Организации
	|Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Изменение.Организации
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Чтение.Организации
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Изменение.ГруппыФизическихЛиц
	|Документ.ХодатайствоОБронированииГражданПребывающихВЗапасе.Изменение.Организации
	|Документ.ЭкземплярБюджета.Чтение.ГруппыДоступаВидовБюджетов
	|Документ.ЭкземплярБюджета.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Документ.ЭкземплярБюджета.Чтение.Организации
	|Документ.ЭкземплярБюджета.Чтение.Подразделения
	|Документ.ЭкземплярБюджета.Чтение.Сценарии
	|Документ.ЭкземплярБюджета.Изменение.ГруппыДоступаВидовБюджетов
	|Документ.ЭкземплярБюджета.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|Документ.ЭкземплярБюджета.Изменение.Организации
	|Документ.ЭкземплярБюджета.Изменение.Подразделения
	|Документ.ЭкземплярБюджета.Изменение.Сценарии
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.АлиментыИДругиеПостоянныеУдержания.Чтение.Организации
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.Организации
	|ЖурналДокументов.БронированиеГражданПребывающихВЗапасе.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.БронированиеГражданПребывающихВЗапасе.Чтение.Организации
	|ЖурналДокументов.ВедомостиНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ВедомостиНаВыплатуЗарплаты.Чтение.Организации
	|ЖурналДокументов.ВедомостиПрочихДоходов.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ВедомостиПрочихДоходов.Чтение.Организации
	|ЖурналДокументов.ГрафикиПереносыОтпусков.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ГрафикиПереносыОтпусков.Чтение.Организации
	|ЖурналДокументов.ДанныеНаНачалоЭксплуатации.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДанныеНаНачалоЭксплуатации.Чтение.Организации
	|ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.Чтение.Организации
	|ЖурналДокументов.ДоговорыГражданскоПравовогоХарактера.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДоговорыГражданскоПравовогоХарактера.Чтение.Организации
	|ЖурналДокументов.ДокументыОбменаСБанкамиПоЗарплатнымПроектам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Организации
	|ЖурналДокументов.ДокументыПоУчетуНДСДляПередачиВЭлектронномВиде.Чтение.Организации
	|ЖурналДокументов.ДокументыУправленияШтатнымРасписанием.Чтение.Организации
	|ЖурналДокументов.ДокументыУправленияШтатнымРасписанием.Чтение.ПодразделенияОрганизаций
	|ЖурналДокументов.ЗаймыСотрудникам.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаймыСотрудникам.Чтение.Организации
	|ЖурналДокументов.ЗапросыПФРФСС.Чтение.Объект.Документ.ЗапросВФССОПроверкеРаботодателя
	|ЖурналДокументов.ЗапросыПФРФСС.Чтение.Объект.Документ.ЗаявлениеИЗапросВПФРОЗаработке
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.Организации
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Организации
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ИзменениеОплатыСотрудников.Чтение.Организации
	|ЖурналДокументов.КадровыеДокументы.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.КадровыеДокументы.Чтение.Организации
	|ЖурналДокументов.Командировки.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Командировки.Чтение.Организации
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Организации
	|ЖурналДокументов.Отгулы.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Отгулы.Чтение.Организации
	|ЖурналДокументов.Отпуска.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Отпуска.Чтение.Организации
	|ЖурналДокументов.ОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ОтпускаПоУходуЗаРебенком.Чтение.Организации
	|ЖурналДокументов.Отсутствия.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Отсутствия.Чтение.Организации
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Организации
	|ЖурналДокументов.Подработки.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.Подработки.Чтение.Организации
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ПриемыПереводыУвольнения.Чтение.Организации
	|ЖурналДокументов.ПрочиеДоходы.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.ПрочиеДоходы.Чтение.Организации
	|ЖурналДокументов.РаботаСверхурочно.Чтение.ГруппыФизическихЛиц
	|ЖурналДокументов.РаботаСверхурочно.Чтение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.ВзаимозависимыеЛица.Чтение.Организации
	|РегистрСведений.ВзаимозависимыеЛица.Изменение.Организации
	|РегистрСведений.ВидыЗанятостиСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВидыЗанятостиСотрудников.Чтение.Организации
	|РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВидыЗанятостиСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Изменение.Организации
	|РегистрСведений.ВоинскийУчет.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВоинскийУчет.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикРаботыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикРаботыСотрудников.Чтение.Организации
	|РегистрСведений.ГрафикРаботыСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикРаботыСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ДанныеДляПодбораСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеДляПодбораСотрудников.Чтение.Организации
	|РегистрСведений.ДанныеДляПодбораСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеДляПодбораСотрудников.Изменение.Организации
	|РегистрСведений.ДанныеОбОплатеТрудаДляПодбораСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДанныеОбОплатеТрудаДляПодбораСотрудников.Чтение.Организации
	|РегистрСведений.ДанныеСостоянийСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДокументыПоНМА.Чтение.Организации
	|РегистрСведений.ДокументыПоОС.Чтение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Чтение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Изменение.Организации
	|РегистрСведений.ДолиСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЖурналНовыхСобытий.Чтение.Организации
	|РегистрСведений.ЖурналНовыхСобытий.Изменение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Чтение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Изменение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Чтение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Изменение.Организации
	|РегистрСведений.ЗаданияКРасчетуАмортизацииНМА.Чтение.Организации
	|РегистрСведений.ЗаданияКРасчетуАмортизацииОС.Чтение.Организации
	|РегистрСведений.ЗаданияКРасчетуСтоимостиВНА.Чтение.Организации
	|РегистрСведений.ЗаданияКФормированиюДвиженийПоВНА.Чтение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.ЗнаниеЯзыковФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗнаниеЯзыковФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияНефинансовыхПоказателей.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|РегистрСведений.ЗначенияНефинансовыхПоказателей.Чтение.Организации
	|РегистрСведений.ЗначенияНефинансовыхПоказателей.Чтение.Подразделения
	|РегистрСведений.ЗначенияНефинансовыхПоказателей.Чтение.Сценарии
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудников.Изменение.Организации
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЗначенияПериодическихПоказателейРасчетаЗарплатыСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.Чтение.Организации
	|РегистрСведений.ЗначенияПоказателейДоплатыЗаРаботуВНочноеВечернееВремя.Изменение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрСведений.ЗначенияРазовыхПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ИсторияЕжегодныхОтпусковПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияЕжегодныхОтпусковПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияИспользованияШтатногоРасписания.Чтение.Организации
	|РегистрСведений.ИсторияИспользованияШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияНачисленийПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияНачисленийПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияПоказателейПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияПоказателейПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Изменение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВОрганеПФР.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВОрганеПФР.Изменение.Организации
	|РегистрСведений.ИсторияСпециальностейПоШтатномуРасписанию.Чтение.Организации
	|РегистрСведений.ИсторияСпециальностейПоШтатномуРасписанию.Чтение.ПодразделенияОрганизаций
	|РегистрСведений.ИсходныеДанныеПерерасчетов.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ИсходныеДанныеПерерасчетов.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.Организации
	|РегистрСведений.МестаВыплатыЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.МестаВыплатыЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.МестонахождениеОС.Чтение.Организации
	|РегистрСведений.МестоУчетаНМА.Чтение.Организации
	|РегистрСведений.НаградыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НаградыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.НакопленныеСтажиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.Чтение.Организации
	|РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.Изменение.Организации
	|РегистрСведений.НастройкаЗаполненияФормСтатистики.Чтение.Организации
	|РегистрСведений.НастройкаЗаполненияФормСтатистики.Изменение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Чтение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Изменение.Организации
	|РегистрСведений.НастройкиЗарплатаКадрыРасширенная.Чтение.Организации
	|РегистрСведений.НастройкиЗарплатаКадрыРасширенная.Изменение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Чтение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Изменение.Организации
	|РегистрСведений.НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда.Чтение.Организации
	|РегистрСведений.НастройкиОбменаМинобороны.Чтение.Организации
	|РегистрСведений.НастройкиОбменаМинобороны.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Изменение.Организации
	|РегистрСведений.НастройкиРасчетаРезервовОтпусков.Чтение.Организации
	|РегистрСведений.НастройкиУчетаПособийСоциальногоСтрахования.Чтение.Организации
	|РегистрСведений.НастройкиУчетаПособийСоциальногоСтрахования.Изменение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносов.Чтение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносов.Изменение.Организации
	|РегистрСведений.НумераторПачекПФР.Чтение.Организации
	|РегистрСведений.НумераторПачекПФР.Изменение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.Организации
	|РегистрСведений.ОплаченныеДоговоры.Чтение.Организации
	|РегистрСведений.ОснованияПолномочийОтветственныхЛиц.Чтение.Организации
	|РегистрСведений.ОснованияПолномочийОтветственныхЛиц.Изменение.Организации
	|РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОсновныеДанныеКонтрактаДоговораСотрудника.Чтение.Организации
	|РегистрСведений.ОсновныеСотрудникиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОсновныеСотрудникиФизическихЛиц.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Изменение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Чтение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Изменение.Организации
	|РегистрСведений.ОтражениеДокументовВРеглУчете.Чтение.Организации
	|РегистрСведений.ОтражениеДокументовВРеглУчете.Изменение.Организации
	|РегистрСведений.ПараметрыАмортизацииНМАБУ.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииНМАУУ.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСБУ.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСУУ.Чтение.Организации
	|РегистрСведений.ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПараметрыИсчисленияПроцентаСевернойНадбавкиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПараметрыТорговыхТочек.Чтение.Организации
	|РегистрСведений.ПараметрыТорговыхТочек.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМА.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОС.Чтение.Организации
	|РегистрСведений.ПерерасчетЗарплаты.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетЗарплаты.Чтение.Организации
	|РегистрСведений.ПерерасчетЗарплаты.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетЗарплаты.Изменение.Организации
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Чтение.Организации
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетСреднегоЗаработка.Изменение.Организации
	|РегистрСведений.ПерерасчетУдержаний.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетУдержаний.Чтение.Организации
	|РегистрСведений.ПерерасчетУдержаний.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПерерасчетУдержаний.Изменение.Организации
	|РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПериодыДействияДоговоровГражданскоПравовогоХарактера.Чтение.Организации
	|РегистрСведений.ПлановыеАвансы.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансы.Чтение.Организации
	|РегистрСведений.ПлановыеАвансыИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансыИнтервальный.Чтение.Организации
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Чтение.Организации
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеЕжегодныеОтпуска.Изменение.Организации
	|РегистрСведений.ПлановыеНачисления.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисления.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияПоДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияПоДоговорам.Чтение.Организации
	|РегистрСведений.ПлановыеУдержания.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеУдержания.Чтение.Организации
	|РегистрСведений.ПлановыйФОТ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыйФОТ.Чтение.Организации
	|РегистрСведений.ПлановыйФОТИтоги.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПодразделенияЗаПределамиРФ.Чтение.Организации
	|РегистрСведений.ПодразделенияЗаПределамиРФ.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияДоходов.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияДоходов.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияНоменклатуры.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияНоменклатуры.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияНоменклатурыПереданной.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияНоменклатурыПереданной.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияПодарочныхСертификатов.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияПодарочныхСертификатов.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияПроизводства.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияПроизводства.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияПрочихОпераций.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияПрочихОпераций.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияРасходов.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияРасходов.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияРасчетовСПартнерами.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияРасчетовСПартнерами.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияРезервов.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияРезервов.Изменение.Организации
	|РегистрСведений.ПорядокОтраженияТМЦВЭксплуатации.Чтение.Организации
	|РегистрСведений.ПорядокОтраженияТМЦВЭксплуатации.Изменение.Организации
	|РегистрСведений.ПорядокУплатыНалоговНаМестах.Чтение.Организации
	|РегистрСведений.ПорядокУплатыНалоговНаМестах.Изменение.Организации
	|РегистрСведений.ПорядокУчетаНМА.Чтение.Организации
	|РегистрСведений.ПорядокУчетаНМАБУ.Чтение.Организации
	|РегистрСведений.ПорядокУчетаНМАУУ.Чтение.Организации
	|РегистрСведений.ПорядокУчетаОСБУ.Чтение.Организации
	|РегистрСведений.ПорядокУчетаОСУУ.Чтение.Организации
	|РегистрСведений.ПредельныеСуммыУдержанийСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПредельныеСуммыУдержанийСотрудников.Чтение.Организации
	|РегистрСведений.ПредоставлениеСоциальныхВычетовУРаботодателя.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеДополнительныхПериодическихПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрофессииФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрофессииФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату.Чтение.Организации
	|РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату.Изменение.Организации
	|РегистрСведений.ПроцентыСевернойНадбавкиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПроцентыСевернойНадбавкиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетДолейБазыНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетЗемельногоНалога.Чтение.Организации
	|РегистрСведений.РасчетНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.РасчетНалогаУСН.Чтение.Организации
	|РегистрСведений.РасчетНормированияРасходов.Чтение.Организации
	|РегистрСведений.РасчетРазницВОценкеАктивовИОбязательств.Чтение.Организации
	|РегистрСведений.РасчетРасходовПоАренде.Чтение.Организации
	|РегистрСведений.РасчетРезерваОтпусков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетРезервовПоСомнительнымДолгам.Чтение.Организации
	|РегистрСведений.РасчетСтавкиНалогаНаПрибыльЗаМесяц.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательств.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетТранспортногоНалога.Чтение.Организации
	|РегистрСведений.РеестрКадровыхПриказов.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РеестрКадровыхПриказов.Чтение.Организации
	|РегистрСведений.РеестрКадровыхПриказовИспр.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РеестрКадровыхПриказовИспр.Чтение.Организации
	|РегистрСведений.РеестрОтпусков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиСотрудников.Чтение.Организации
	|РегистрСведений.РолиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РолиФизическихЛиц.Чтение.Организации
	|РегистрСведений.РолиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РолиФизическихЛиц.Изменение.Организации
	|РегистрСведений.СведенияКонтрактаДоговораСотрудника.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияКонтрактаДоговораСотрудника.Чтение.Организации
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОВзносахВПФР.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОВзносахВПФР.Чтение.Организации
	|РегистрСведений.СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОЛьготахФизическихЛицПострадавшихВАварииЧАЭС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.Организации
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Изменение.Организации
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЖурнал.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоЛицензии.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил11Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел1.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил12Раздел2.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил13Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил14Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Поставщики.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил15Производство.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил16Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил17Декларация.Изменение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация.Чтение.Организации
	|РегистрСведений.СведенияРеглОтчетАлкоПрил18Декларация.Изменение.Организации
	|РегистрСведений.СведенияТаможенныхДекларацийЭкспорт.Чтение.Организации
	|РегистрСведений.СвязиПоказателейБюджетов.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|РегистрСведений.СвязиПоказателейБюджетов.Изменение.ГруппыДоступаСтатейИПоказателейБюджетов
	|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации
	|РегистрСведений.СоставГруппСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СоставГруппСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СостояниеНастройкиЗаполненияФормСтатистики.Чтение.Организации
	|РегистрСведений.СостоянияВБракеФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияВБракеФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Изменение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Чтение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Изменение.Организации
	|РегистрСведений.СостоянияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СостоянияСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СпециальностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СпециальностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Чтение.Организации
	|РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Изменение.Организации
	|РегистрСведений.СтавкаКомпенсацииЗаЗадержкуЗарплаты.Чтение.Организации
	|РегистрСведений.СтавкаКомпенсацииЗаЗадержкуЗарплаты.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаИмущество.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Изменение.Организации
	|РегистрСведений.СтажиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтажиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыНаДетейНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыПоНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыФизическихЛицНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛВторичный.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыЗапросовРеестровСчетовФактур.Чтение.Организации
	|РегистрСведений.СтатусыЗапросовРеестровСчетовФактур.Изменение.Организации
	|РегистрСведений.СтатусыЗастрахованныхФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыЗастрахованныхФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыОтправки.Чтение.Организации
	|РегистрСведений.СтатусыОтправки.Изменение.Организации
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Чтение.ГруппыПартнеров
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Изменение.ГруппыПартнеров
	|РегистрСведений.СтроковыеСведенияФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СхемыОбеспеченияПроизводства.Чтение.Подразделения
	|РегистрСведений.СхемыОбеспеченияПроизводства.Изменение.Подразделения
	|РегистрСведений.СчетаРеглУчетаТребующиеНастройки.Чтение.Организации
	|РегистрСведений.СчетаРеглУчетаТребующиеНастройки.Изменение.Организации
	|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.Организации
	|РегистрСведений.ТерриториальныеУсловияПФР.Чтение.Организации
	|РегистрСведений.ТерриториальныеУсловияПФР.Изменение.Организации
	|РегистрСведений.ТерриторииСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТерриторииСотрудников.Чтение.Организации
	|РегистрСведений.ТерриторииСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТерриторииСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.ТрудоваяДеятельностьФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТрудоваяДеятельностьФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияДоговораГПХ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияДоговораГПХ.Чтение.Организации
	|РегистрСведений.УсловияОплатыОтпускаПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияОплатыОтпускаПоУходуЗаРебенком.Чтение.Организации
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.Организации
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Изменение.Организации
	|РегистрСведений.УченыеЗванияФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеЗванияФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеСтепениФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УченыеСтепениФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УчетнаяПолитикаПоНДФЛ.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|РегистрСведений.ФотографииФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФотографииФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Чтение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Изменение.Организации
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Чтение.Организации
	|РегистрНакопления.АмортизацияНМА.Чтение.Организации
	|РегистрНакопления.АмортизацияОС.Чтение.Организации
	|РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоКонтрагентамАкционерам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоКонтрагентамАкционерам.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.БухучетНачисленияУдержанияПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.ВзаиморасчетыПоЗаймамСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыПоЗаймамСотрудникам.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Чтение.Организации
	|РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДанныеСтрахователейДляРасчетаСреднегоЗаработкаФСС.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДенежныеДокументы.Чтение.Организации
	|РегистрНакопления.ДенежныеДокументы.Чтение.Подразделения
	|РегистрНакопления.ДниЧасыОтгулов.Чтение.Организации
	|РегистрНакопления.ДополнениеРасчетнойБазыУдержаний.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДополнениеРасчетнойБазыУдержаний.Чтение.Организации
	|РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц.Чтение.Организации
	|РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗадолженностьПоУдержаниямФизическихЛиц.Изменение.Организации
	|РегистрНакопления.ЗаказыМатериаловВПроизводство.Чтение.Подразделения
	|РегистрНакопления.ЗаказыМатериаловВПроизводство.Чтение.Склады
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Организации
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Подразделения
	|РегистрНакопления.ЗаказыМатериаловСУчетомКорректировок.Чтение.Склады
	|РегистрНакопления.ЗанятыеПозицииШтатногоРасписания.Чтение.Организации
	|РегистрНакопления.ЗанятыеПозицииШтатногоРасписания.Чтение.ПодразделенияОрганизаций
	|РегистрНакопления.ЗанятыеПозицииШтатногоРасписания.Изменение.Организации
	|РегистрНакопления.ЗанятыеПозицииШтатногоРасписания.Изменение.ПодразделенияОрганизаций
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.Организации
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.Организации
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыОрганизаций.Чтение.Организации
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыПодразделений.Чтение.Организации
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗначенияОперативныхПоказателейРасчетаЗарплатыСотрудников.Чтение.Организации
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Чтение.Организации
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел2.Чтение.Организации
	|РегистрНакопления.КонтролируемыеСделкиОрганизаций.Чтение.Организации
	|РегистрНакопления.КонтролируемыеСделкиОрганизаций.Изменение.Организации
	|РегистрНакопления.НачисленияПоДоговорамГПХ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияПоДоговорамГПХ.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоКонтрагентамАкционерам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.НДСЗаписиРаздела7Декларации.Чтение.Организации
	|РегистрНакопления.ОборотыБюджетов.Чтение.ГруппыДоступаСтатейИПоказателейБюджетов
	|РегистрНакопления.ОборотыБюджетов.Чтение.Организации
	|РегистрНакопления.ОборотыБюджетов.Чтение.Подразделения
	|РегистрНакопления.ОборотыБюджетов.Чтение.Сценарии
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамАвансом.Изменение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникамКорректировка.Изменение.Организации
	|РегистрНакопления.ОценочныеОбязательства.Чтение.Организации
	|РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОценочныеОбязательстваПоСотрудникам.Чтение.Организации
	|РегистрНакопления.ПартииНезавершенногоПроизводства.Чтение.Организации
	|РегистрНакопления.ПериодыУходаЗаБольнымиРодственниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Чтение.Организации
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Чтение.Организации
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Чтение.Организации
	|РегистрНакопления.РасходыПриУСН.Чтение.Организации
	|РегистрНакопления.РасходыПриУСНМатериалы.Чтение.Организации
	|РегистрНакопления.РасходыПриУСНОСиНМА.Чтение.Организации
	|РегистрНакопления.РасходыПриУСНТовары.Чтение.Организации
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Чтение.Организации
	|РегистрНакопления.РезервыПоСомнительнымДолгам.Чтение.Организации
	|РегистрНакопления.РезервыПредстоящихРасходов.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.СтоимостьНМА.Чтение.Организации
	|РегистрНакопления.СтоимостьОС.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Изменение.Организации
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.Организации
	|РегистрНакопления.УдержанияДоПределаПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.УдержанияДоПределаПоСотрудникам.Чтение.Организации
	|РегистрНакопления.УдержанияПоИсполнительнымДокументам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.УдержанияПоИсполнительнымДокументам.Чтение.Организации
	|РегистрНакопления.УплатаНДФЛНалоговымиАгентамиКРаспределению.Чтение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Чтение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Изменение.Организации
	|РегистрРасчета.Начисления.Чтение.ГруппыФизическихЛиц
	|РегистрРасчета.Начисления.Чтение.Организации
	|РегистрРасчета.Удержания.Чтение.ГруппыФизическихЛиц
	|РегистрРасчета.Удержания.Чтение.Организации
//-- НЕ УТ
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АвансовыйОтчетПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктВыполненныхРаботПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеОтгрузкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПеремещенияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Чтение.ТипыОснованийАктаОРасхождениях
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.АктОРасхожденияхПослеПриемкиПрисоединенныеФайлы.Изменение.ТипыОснованийАктаОРасхождениях
	|Справочник.БанковскиеСчетаКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаКонтрагентов.Изменение.ВнешниеПользователи
	|Справочник.БанковскиеСчетаОрганизаций.Чтение.Организации
	|Справочник.ВариантыКомплектацииНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВерсииФайлов.Чтение.Объект.БизнесПроцесс.Задание
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВерсииФайлов.Изменение.Объект.БизнесПроцесс.Задание
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВзаимозачетЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВидыЗапасов.Чтение.Организации
	|Справочник.ВидыНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ВидыНоменклатурыПрисоединенныеФайлы.Изменение.ГруппыНоменклатуры
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ВидыЦенПоставщиков.Чтение.ГруппыПартнеров
	|Справочник.ВидыЦенПоставщиков.Изменение.ГруппыПартнеров
	|Справочник.ВнешниеПользователи.Чтение.ВнешниеПользователи
	|Справочник.ВнешниеПользователи.Изменение.ВнешниеПользователи
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВнутреннееПотреблениеТоваровПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ВозвратТоваровПоставщикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ВстречаПрисоединенныеФайлы.Чтение.Объект.Документ.Встреча
	|Справочник.ВстречаПрисоединенныеФайлы.Изменение.Объект.Документ.Встреча
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупВозвратнойТарыКлиентомПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ВыкупВозвратнойТарыУПоставщикаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ГруппыВнешнихПользователей.Чтение.ВнешниеПользователи
	|Справочник.ГруппыДоступаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.ГруппыПользователей.Чтение.Пользователи
	|Справочник.ДоговорыКонтрагентов.Чтение.ВнешниеПользователи
	|Справочник.ДоговорыКонтрагентов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыКонтрагентовПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ДоговорыКредитовИДепозитов.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитов.Чтение.Организации
	|Справочник.ДоговорыКредитовИДепозитов.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитов.Изменение.Организации
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ДоговорыКредитовИДепозитовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ДоговорыМеждуОрганизациями.Чтение.Организации
	|Справочник.ДоговорыМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ЗаданиеНаПеревозкуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаданиеНаПеревозкуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаданиеТорговомуПредставителюПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗадачиПроектов.Чтение.ГруппыПартнеров
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗадачиПроектов.Изменение.ГруппыПартнеров
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.МаркетинговыеМероприятия
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.ПретензииКлиентов
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.Проекты
	|Справочник.ЗадачиПроектов.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказНаВнутреннееПотреблениеПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаказПоставщикуПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗапланированноеВзаимодействиеПрисоединенныеФайлы.Чтение.Объект.Документ.ЗапланированноеВзаимодействие
	|Справочник.ЗапланированноеВзаимодействиеПрисоединенныеФайлы.Изменение.Объект.Документ.ЗапланированноеВзаимодействие
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаВозвратТоваровОтКлиентаПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ЗаявкаНаРасходованиеДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ИнойДокументПодтвержденияНДСПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КассовыеКниги.Чтение.Организации
	|Справочник.КассовыеКниги.Изменение.Организации
	|Справочник.Кассы.Чтение.Кассы
	|Справочник.Кассы.Чтение.Организации
	|Справочник.КассыККМ.Чтение.КассыККМ
	|Справочник.КассыККМ.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КоммерческоеПредложениеКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Чтение.ГруппыПартнеров
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ВнешниеПользователи
	|Справочник.КонтактныеЛицаПартнеров.Изменение.ГруппыПартнеров
	|Справочник.Контрагенты.Чтение.ВнешниеПользователи
	|Справочник.Контрагенты.Чтение.ГруппыПартнеров
	|Справочник.Контрагенты.Изменение.ВнешниеПользователи
	|Справочник.Контрагенты.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.КорректировкаПриобретенияПрисоединенныеФайлы.Изменение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Чтение.Склады
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.КорректировкаРеализацииПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Чтение.ГруппыПартнеров
	|Справочник.ЛицензииПоставщиковАлкогольнойПродукции.Изменение.ГруппыПартнеров
	|Справочник.НаборыДополнительныхРеквизитовИСведений.Изменение.ГруппыНоменклатуры
	|Справочник.Номенклатура.Изменение.ГруппыНоменклатуры
	|Справочник.НоменклатураПоставщиков.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиков.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.НоменклатураПоставщиковПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.НоменклатураПрисоединенныеФайлы.Изменение.ГруппыНоменклатуры
	|Справочник.ОбластиХранения.Чтение.Склады
	|Справочник.ОбластиХранения.Изменение.Склады
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Чтение.Кассы
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Изменение.Кассы
	|Справочник.ОжидаемоеПоступлениеДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтветственныеЛицаОрганизаций.Чтение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомиссионераОСписанииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомиссионераПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомитентуОСписанииПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ОтчетКомитентуПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиЭлектронныхПисем.Чтение.Пользователи
	|Справочник.ПапкиЭлектронныхПисем.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.ПапкиЭлектронныхПисем.Изменение.Пользователи
	|Справочник.ПапкиЭлектронныхПисем.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.Партнеры.Чтение.ВнешниеПользователи
	|Справочник.Партнеры.Чтение.ГруппыПартнеров
	|Справочник.Партнеры.Изменение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПартнерыПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПередачаТоваровМеждуОрганизациямиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланЗакупокПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланПродажПоКатегориямПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПланПродажПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПланПродажПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Чтение.ВнешниеПользователи
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Чтение.ГруппыПартнеров
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Изменение.ВнешниеПользователи
	|Справочник.ПодпискиНаРассылкиИОповещенияКлиентам.Изменение.ГруппыПартнеров
	|Справочник.Пользователи.Чтение.Пользователи
	|Справочник.Пользователи.Изменение.Пользователи
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПоступлениеТоваровНаСкладПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПравилаОбработкиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.ПравилаОбработкиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.ПравилаОбработкиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.ПравилаОбработкиЭлектроннойПочты.Изменение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.ПретензииКлиентов.Чтение.ВнешниеПользователи
	|Справочник.ПретензииКлиентов.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентов.Изменение.ВнешниеПользователи
	|Справочник.ПретензииКлиентов.Изменение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ВнешниеПользователи
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПретензииКлиентовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Чтение.Склады
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ПриобретениеТоваровУслугПрисоединенныеФайлы.Изменение.Склады
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ПриобретениеУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РабочиеУчастки.Чтение.Склады
	|Справочник.РабочиеУчастки.Изменение.Склады
	|Справочник.РассылкаКлиентамПрисоединенныеФайлы.Чтение.Объект.Документ.РассылкаКлиентам
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Чтение.Склады
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РеализацияТоваровУслугПрисоединенныеФайлы.Изменение.Склады
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.РеализацияУслугПрочихАктивовПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.РегистрацияЦенНоменклатурыПоставщикаПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СверкаВзаиморасчетовПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СделкиСКлиентами.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентами.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Чтение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СделкиСКлиентамиПрисоединенныеФайлы.Изменение.Объект.Справочник.СделкиСКлиентами
	|Справочник.СкладскиеПомещения.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Чтение.Склады
	|Справочник.СкладскиеЯчейки.Изменение.Склады
	|Справочник.Склады.Чтение.Склады
	|Справочник.Склады.Изменение.Склады
	|Справочник.СоглашенияСКлиентами.Чтение.ВнешниеПользователи
	|Справочник.СоглашенияСКлиентами.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Чтение.Организации
	|Справочник.СоглашенияСКлиентами.Чтение.Склады
	|Справочник.СоглашенияСКлиентами.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентами.Изменение.Организации
	|Справочник.СоглашенияСКлиентами.Изменение.Склады
	|Справочник.СоглашенияСКлиентами.Изменение.СоглашенияСКлиентамиИзменение
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СоглашенияСКлиентамиПрисоединенныеФайлы.Изменение.СоглашенияСКлиентамиИзменение
	|Справочник.СоглашенияСПоставщиками.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Чтение.Организации
	|Справочник.СоглашенияСПоставщиками.Чтение.Склады
	|Справочник.СоглашенияСПоставщиками.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщиками.Изменение.Организации
	|Справочник.СоглашенияСПоставщиками.Изменение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Чтение.Склады
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СоглашенияСПоставщикамиПрисоединенныеФайлы.Изменение.Склады
	|Справочник.СообщениеSMSПрисоединенныеФайлы.Чтение.Объект.Документ.СообщениеSMS
	|Справочник.СообщениеSMSПрисоединенныеФайлы.Изменение.Объект.Документ.СообщениеSMS
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Чтение.ХозяйственныеОперации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СписаниеБезналичныхДенежныхСредствПрисоединенныеФайлы.Изменение.ХозяйственныеОперации
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СписаниеЗадолженностиПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СтруктураПредприятия.Чтение.Подразделения
	|Справочник.СтруктураПредприятия.Изменение.Подразделения
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетНаОплатуКлиентуПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураВыданныйАвансПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйАвансПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураВыданныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураКомиссионеруПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураКомитентаПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйАвансПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйАвансПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйНалоговыйАгентПрисоединенныеФайлы.Изменение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Чтение.Организации
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.СчетФактураПолученныйПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Чтение.Подразделения
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.ГруппыПартнеров
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Организации
	|Справочник.ТаможеннаяДекларацияИмпортПрисоединенныеФайлы.Изменение.Подразделения
	|Справочник.ТелефонныйЗвонокПрисоединенныеФайлы.Чтение.Объект.Документ.ТелефонныйЗвонок
	|Справочник.ТелефонныйЗвонокПрисоединенныеФайлы.Изменение.Объект.Документ.ТелефонныйЗвонок
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ТранспортнаяНакладнаяПрисоединенныеФайлы.Изменение.Организации
	|Справочник.УпаковкиЕдиницыИзмерения.Изменение.ГруппыНоменклатуры
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Чтение.ГруппыПартнеров
	|Справочник.УсловияОбслуживанияПартнеровТорговымиПредставителями.Изменение.ГруппыПартнеров
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.УстановкаЦенНоменклатурыПрисоединенныеФайлы.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.Файлы.Чтение.ВнешниеПользователи
	|Справочник.Файлы.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.БизнесПроцесс.Задание
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Изменение.ВнешниеПользователи
	|Справочник.Файлы.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.БизнесПроцесс.Задание
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛица.Изменение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛицаПрисоединенныеФайлы.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛицаПрисоединенныеФайлы.Изменение.ГруппыФизическихЛиц
	|Справочник.ХарактеристикиНоменклатуры.Изменение.ГруппыНоменклатуры
	|Справочник.ШаблоныСообщений.Чтение.Пользователи
	|Справочник.ШаблоныСообщений.Изменение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Изменение.Пользователи
	|Справочник.ЭквайринговыеТерминалы.Чтение.Организации
	|Справочник.ЭквайринговыеТерминалы.Чтение.ЭквайринговыеТерминалы
	|Справочник.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Чтение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Справочник.ЭлектронноеПисьмоВходящееПрисоединенныеФайлы.Изменение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Справочник.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы.Чтение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Справочник.ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы.Изменение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Документ.АвансовыйОтчет.Чтение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АвансовыйОтчет.Чтение.Подразделения
	|Документ.АвансовыйОтчет.Изменение.ГруппыПартнеров
	|Документ.АвансовыйОтчет.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйОтчет.Изменение.Подразделения
	|Документ.АктВыполненныхРабот.Чтение.ВнешниеПользователи
	|Документ.АктВыполненныхРабот.Чтение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Чтение.Организации
	|Документ.АктВыполненныхРабот.Чтение.Подразделения
	|Документ.АктВыполненныхРабот.Изменение.ГруппыПартнеров
	|Документ.АктВыполненныхРабот.Изменение.Организации
	|Документ.АктВыполненныхРабот.Изменение.Подразделения
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ВнешниеПользователи
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.Организации
	|Документ.АктОРасхожденияхПослеОтгрузки.Чтение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ВнешниеПользователи
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.Организации
	|Документ.АктОРасхожденияхПослеОтгрузки.Изменение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеПеремещения.Чтение.Организации
	|Документ.АктОРасхожденияхПослеПеремещения.Чтение.Склады
	|Документ.АктОРасхожденияхПослеПеремещения.Изменение.Организации
	|Документ.АктОРасхожденияхПослеПеремещения.Изменение.Склады
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.Организации
	|Документ.АктОРасхожденияхПослеПриемки.Чтение.ТипыОснованийАктаОРасхождениях
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.ГруппыПартнеров
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.Организации
	|Документ.АктОРасхожденияхПослеПриемки.Изменение.ТипыОснованийАктаОРасхождениях
	|Документ.БлокировкаВычетаНДС.Чтение.Организации
	|Документ.БлокировкаВычетаНДС.Изменение.Организации
	|Документ.ВводОстатков.Чтение.Организации
	|Документ.ВводОстатков.Чтение.Склады
	|Документ.ВводОстатков.Изменение.Организации
	|Документ.ВводОстатков.Изменение.Склады
	|Документ.ВзаимозачетЗадолженности.Чтение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Чтение.Организации
	|Документ.ВзаимозачетЗадолженности.Изменение.ВидыОперацийВзаимозачетаЗадолженности
	|Документ.ВзаимозачетЗадолженности.Изменение.ГруппыПартнеров
	|Документ.ВзаимозачетЗадолженности.Изменение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Организации
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Кассы
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.КассыККМ
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Чтение.Склады
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Организации
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Подразделения
	|Документ.ВнутреннееПотреблениеТоваров.Изменение.Склады
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Подразделения
	|Документ.ВозвратТоваровМеждуОрганизациями.Чтение.Склады
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Подразделения
	|Документ.ВозвратТоваровМеждуОрганизациями.Изменение.Склады
	|Документ.ВозвратТоваровОтКлиента.Чтение.ВнешниеПользователи
	|Документ.ВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ВозвратТоваровОтКлиента.Чтение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ВозвратТоваровОтКлиента.Изменение.Подразделения
	|Документ.ВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ВозвратТоваровПоставщику.Чтение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Чтение.Склады
	|Документ.ВозвратТоваровПоставщику.Изменение.ГруппыПартнеров
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Подразделения
	|Документ.ВозвратТоваровПоставщику.Изменение.Склады
	|Документ.Встреча.Чтение.Объект.Документ.Встреча
	|Документ.Встреча.Изменение.Объект.Документ.Встреча
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.Организации
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.КассыККМ
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.Организации
	|Документ.ВыкупВозвратнойТарыКлиентом.Чтение.Организации
	|Документ.ВыкупВозвратнойТарыКлиентом.Изменение.Организации
	|Документ.ВыкупВозвратнойТарыУПоставщика.Чтение.Организации
	|Документ.ВыкупВозвратнойТарыУПоставщика.Изменение.Организации
	|Документ.ДвижениеПрочихАктивовПассивов.Чтение.Организации
	|Документ.ДвижениеПрочихАктивовПассивов.Изменение.Организации
	|Документ.ДоверенностьВыданная.Чтение.ГруппыПартнеров
	|Документ.ДоверенностьВыданная.Чтение.ГруппыФизическихЛиц
	|Документ.ДоверенностьВыданная.Чтение.Организации
	|Документ.ДоверенностьВыданная.Изменение.ГруппыПартнеров
	|Документ.ДоверенностьВыданная.Изменение.ГруппыФизическихЛиц
	|Документ.ДоверенностьВыданная.Изменение.Организации
	|Документ.ЗаданиеНаПеревозку.Чтение.Склады
	|Документ.ЗаданиеНаПеревозку.Изменение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Чтение.Склады
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.ГруппыПартнеров
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Организации
	|Документ.ЗаданиеТорговомуПредставителю.Изменение.Склады
	|Документ.ЗаказКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Чтение.Организации
	|Документ.ЗаказКлиента.Чтение.Подразделения
	|Документ.ЗаказКлиента.Чтение.Склады
	|Документ.ЗаказКлиента.Изменение.ВнешниеПользователи
	|Документ.ЗаказКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаказКлиента.Изменение.Организации
	|Документ.ЗаказКлиента.Изменение.Подразделения
	|Документ.ЗаказКлиента.Изменение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Чтение.Склады
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Организации
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Подразделения
	|Документ.ЗаказНаВнутреннееПотребление.Изменение.Склады
	|Документ.ЗаказНаПеремещение.Чтение.Организации
	|Документ.ЗаказНаПеремещение.Чтение.Склады
	|Документ.ЗаказНаПеремещение.Изменение.Организации
	|Документ.ЗаказНаПеремещение.Изменение.Склады
	|Документ.ЗаказНаСборку.Чтение.Организации
	|Документ.ЗаказНаСборку.Чтение.Склады
	|Документ.ЗаказНаСборку.Изменение.Организации
	|Документ.ЗаказНаСборку.Изменение.Склады
	|Документ.ЗаказПоставщику.Чтение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Чтение.Организации
	|Документ.ЗаказПоставщику.Чтение.Подразделения
	|Документ.ЗаказПоставщику.Чтение.Склады
	|Документ.ЗаказПоставщику.Изменение.ГруппыПартнеров
	|Документ.ЗаказПоставщику.Изменение.Организации
	|Документ.ЗаказПоставщику.Изменение.Подразделения
	|Документ.ЗаказПоставщику.Изменение.Склады
	|Документ.ЗаписьКнигиПокупок.Чтение.Организации
	|Документ.ЗаписьКнигиПокупок.Изменение.Организации
	|Документ.ЗаписьКнигиПродаж.Чтение.Организации
	|Документ.ЗаписьКнигиПродаж.Изменение.Организации
	|Документ.ЗапланированноеВзаимодействие.Чтение.Объект.Документ.ЗапланированноеВзаимодействие
	|Документ.ЗапланированноеВзаимодействие.Изменение.Объект.Документ.ЗапланированноеВзаимодействие
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ВнешниеПользователи
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Чтение.Склады
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ВнешниеПользователи
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Организации
	|Документ.ЗаявкаНаВозвратТоваровОтКлиента.Изменение.Склады
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Пользователи
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Организации
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Подразделения
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Пользователи
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ЗаявлениеОВвозеТоваров.Чтение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Изменение.Организации
	|Документ.ИзменениеАссортимента.Чтение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИзменениеАссортимента.Изменение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИнвентаризационнаяОпись.Чтение.Организации
	|Документ.ИнвентаризационнаяОпись.Чтение.Склады
	|Документ.ИнвентаризационнаяОпись.Изменение.Организации
	|Документ.ИнвентаризационнаяОпись.Изменение.Склады
	|Документ.ИнвентаризацияНаличныхДенежныхСредств.Чтение.Организации
	|Документ.ИнвентаризацияНаличныхДенежныхСредств.Изменение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Чтение.Организации
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.ГруппыПартнеров
	|Документ.ИнойДокументПодтвержденияНДС.Изменение.Организации
	|Документ.КассоваяСмена.Чтение.Организации
	|Документ.КассоваяСмена.Изменение.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Чтение.Организации
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.ГруппыПартнеров
	|Документ.КоммерческоеПредложениеКлиенту.Изменение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Чтение.Организации
	|Документ.КорректировкаВидаДеятельностиНДС.Изменение.Организации
	|Документ.КорректировкаЗадолженностиПоФинансовымИнструментам.Чтение.ГруппыПартнеров
	|Документ.КорректировкаЗадолженностиПоФинансовымИнструментам.Чтение.Организации
	|Документ.КорректировкаЗадолженностиПоФинансовымИнструментам.Изменение.ГруппыПартнеров
	|Документ.КорректировкаЗадолженностиПоФинансовымИнструментам.Изменение.Организации
	|Документ.КорректировкаИзлишковНедостачПоТоварнымМестам.Чтение.Склады
	|Документ.КорректировкаИзлишковНедостачПоТоварнымМестам.Изменение.Склады
	|Документ.КорректировкаНазначенияТоваров.Чтение.Организации
	|Документ.КорректировкаНазначенияТоваров.Изменение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Чтение.Организации
	|Документ.КорректировкаНалогообложенияНДСПартийТоваров.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Чтение.Склады
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Организации
	|Документ.КорректировкаОбособленногоУчетаЗапасов.Изменение.Склады
	|Документ.КорректировкаПоОрдеруНаТовары.Чтение.Склады
	|Документ.КорректировкаПоОрдеруНаТовары.Изменение.Склады
	|Документ.КорректировкаПриобретения.Чтение.ГруппыПартнеров
	|Документ.КорректировкаПриобретения.Чтение.Организации
	|Документ.КорректировкаПриобретения.Чтение.Подразделения
	|Документ.КорректировкаПриобретения.Чтение.Склады
	|Документ.КорректировкаПриобретения.Изменение.ГруппыПартнеров
	|Документ.КорректировкаПриобретения.Изменение.Организации
	|Документ.КорректировкаПриобретения.Изменение.Подразделения
	|Документ.КорректировкаПриобретения.Изменение.Склады
	|Документ.КорректировкаРеализации.Чтение.ВнешниеПользователи
	|Документ.КорректировкаРеализации.Чтение.ГруппыПартнеров
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.КорректировкаРеализации.Чтение.Подразделения
	|Документ.КорректировкаРеализации.Чтение.Склады
	|Документ.КорректировкаРеализации.Изменение.ГруппыПартнеров
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.КорректировкаРеализации.Изменение.Подразделения
	|Документ.КорректировкаРеализации.Изменение.Склады
	|Документ.ЛимитыРасходаДенежныхСредств.Чтение.Организации
	|Документ.ЛимитыРасходаДенежныхСредств.Чтение.Подразделения
	|Документ.ЛимитыРасходаДенежныхСредств.Изменение.Организации
	|Документ.ЛимитыРасходаДенежныхСредств.Изменение.Подразделения
	|Документ.ЛистКассовойКниги.Чтение.Организации
	|Документ.ЛистКассовойКниги.Изменение.Организации
	|Документ.НачисленияКредитовИДепозитов.Чтение.Организации
	|Документ.НачисленияКредитовИДепозитов.Изменение.Организации
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Чтение.Кассы
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Чтение.Организации
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Изменение.Кассы
	|Документ.ОжидаемоеПоступлениеДенежныхСредств.Изменение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Чтение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Чтение.ЭквайринговыеТерминалы
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоПлатежнойКарте.Изменение.Организации
	|Документ.ОперацияПоПлатежнойКарте.Изменение.ЭквайринговыеТерминалы
	|Документ.ОперацияПоЯндексКассе.Чтение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Чтение.Организации
	|Документ.ОперацияПоЯндексКассе.Изменение.ГруппыПартнеров
	|Документ.ОперацияПоЯндексКассе.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Чтение.Склады
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Организации
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Подразделения
	|Документ.ОприходованиеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеНедостачТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеПересортицыТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеПересортицыТоваров.Изменение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Чтение.Склады
	|Документ.ОрдерНаОтражениеПорчиТоваров.Изменение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Чтение.Склады
	|Документ.ОрдерНаПеремещениеТоваров.Изменение.Склады
	|Документ.ОтборРазмещениеТоваров.Чтение.Склады
	|Документ.ОтборРазмещениеТоваров.Изменение.Склады
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств.Чтение.Организации
	|Документ.ОтражениеРасхожденийПриИнкассацииДенежныхСредств.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Чтение.Подразделения
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Организации
	|Документ.ОтчетБанкаПоОперациямЭквайринга.Изменение.Подразделения
	|Документ.ОтчетКомиссионера.Чтение.ВнешниеПользователи
	|Документ.ОтчетКомиссионера.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Чтение.Организации
	|Документ.ОтчетКомиссионера.Чтение.Подразделения
	|Документ.ОтчетКомиссионера.Изменение.ВнешниеПользователи
	|Документ.ОтчетКомиссионера.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионера.Изменение.Организации
	|Документ.ОтчетКомиссионера.Изменение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Чтение.Организации
	|Документ.ОтчетКомиссионераОСписании.Чтение.Подразделения
	|Документ.ОтчетКомиссионераОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомиссионераОСписании.Изменение.Организации
	|Документ.ОтчетКомиссионераОСписании.Изменение.Подразделения
	|Документ.ОтчетКомитенту.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Чтение.Организации
	|Документ.ОтчетКомитенту.Чтение.Подразделения
	|Документ.ОтчетКомитенту.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитенту.Изменение.Организации
	|Документ.ОтчетКомитенту.Изменение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Чтение.Организации
	|Документ.ОтчетКомитентуОСписании.Чтение.Подразделения
	|Документ.ОтчетКомитентуОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетКомитентуОСписании.Изменение.Организации
	|Документ.ОтчетКомитентуОСписании.Изменение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Чтение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Чтение.Склады
	|Документ.ОтчетОРозничныхПродажах.Изменение.КассыККМ
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Подразделения
	|Документ.ОтчетОРозничныхПродажах.Изменение.Склады
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.ГруппыПартнеров
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Чтение.Подразделения
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.ГруппыПартнеров
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациями.Изменение.Подразделения
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Чтение.ГруппыПартнеров
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Чтение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Чтение.Подразделения
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Изменение.ГруппыПартнеров
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Изменение.Организации
	|Документ.ОтчетПоКомиссииМеждуОрганизациямиОСписании.Изменение.Подразделения
	|Документ.ПервичныйДокумент.Чтение.Организации
	|Документ.ПервичныйДокумент.Изменение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.ГруппыПартнеров
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Подразделения
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Склады
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.ГруппыПартнеров
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Организации
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Подразделения
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Склады
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Склады
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Склады
	|Документ.ПересортицаТоваров.Чтение.Организации
	|Документ.ПересортицаТоваров.Чтение.Подразделения
	|Документ.ПересортицаТоваров.Чтение.Склады
	|Документ.ПересортицаТоваров.Изменение.Организации
	|Документ.ПересортицаТоваров.Изменение.Подразделения
	|Документ.ПересортицаТоваров.Изменение.Склады
	|Документ.ПересчетТоваров.Чтение.Склады
	|Документ.ПересчетТоваров.Изменение.Склады
	|Документ.ПланЗакупок.Чтение.ГруппыПартнеров
	|Документ.ПланЗакупок.Чтение.Подразделения
	|Документ.ПланЗакупок.Чтение.Склады
	|Документ.ПланЗакупок.Изменение.ГруппыПартнеров
	|Документ.ПланЗакупок.Изменение.Подразделения
	|Документ.ПланЗакупок.Изменение.Склады
	|Документ.ПланОстатков.Чтение.Склады
	|Документ.ПланОстатков.Изменение.Склады
	|Документ.ПланПродаж.Чтение.ВнешниеПользователи
	|Документ.ПланПродаж.Чтение.ГруппыПартнеров
	|Документ.ПланПродаж.Чтение.Подразделения
	|Документ.ПланПродаж.Чтение.Склады
	|Документ.ПланПродаж.Изменение.ВнешниеПользователи
	|Документ.ПланПродаж.Изменение.ГруппыПартнеров
	|Документ.ПланПродаж.Изменение.Подразделения
	|Документ.ПланПродаж.Изменение.Склады
	|Документ.ПланПродажПоКатегориям.Чтение.Подразделения
	|Документ.ПланПродажПоКатегориям.Чтение.Склады
	|Документ.ПланПродажПоКатегориям.Изменение.Подразделения
	|Документ.ПланПродажПоКатегориям.Изменение.Склады
	|Документ.ПоручениеЭкспедитору.Чтение.ГруппыПартнеров
	|Документ.ПоручениеЭкспедитору.Чтение.ГруппыФизическихЛиц
	|Документ.ПоручениеЭкспедитору.Чтение.Подразделения
	|Документ.ПоручениеЭкспедитору.Чтение.Склады
	|Документ.ПоручениеЭкспедитору.Изменение.ГруппыПартнеров
	|Документ.ПоручениеЭкспедитору.Изменение.ГруппыФизическихЛиц
	|Документ.ПоручениеЭкспедитору.Изменение.Подразделения
	|Документ.ПоручениеЭкспедитору.Изменение.Склады
	|Документ.ПорчаТоваров.Чтение.Организации
	|Документ.ПорчаТоваров.Чтение.Подразделения
	|Документ.ПорчаТоваров.Чтение.Склады
	|Документ.ПорчаТоваров.Изменение.Организации
	|Документ.ПорчаТоваров.Изменение.Подразделения
	|Документ.ПорчаТоваров.Изменение.Склады
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.ПоступлениеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.ПоступлениеТоваровНаСклад.Чтение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровНаСклад.Чтение.Организации
	|Документ.ПоступлениеТоваровНаСклад.Чтение.Подразделения
	|Документ.ПоступлениеТоваровНаСклад.Чтение.Склады
	|Документ.ПоступлениеТоваровНаСклад.Изменение.ГруппыПартнеров
	|Документ.ПоступлениеТоваровНаСклад.Изменение.Организации
	|Документ.ПоступлениеТоваровНаСклад.Изменение.Подразделения
	|Документ.ПоступлениеТоваровНаСклад.Изменение.Склады
	|Документ.ПриобретениеТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.ПриобретениеТоваровУслуг.Чтение.Организации
	|Документ.ПриобретениеТоваровУслуг.Чтение.Подразделения
	|Документ.ПриобретениеТоваровУслуг.Чтение.Склады
	|Документ.ПриобретениеТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.ПриобретениеТоваровУслуг.Изменение.Организации
	|Документ.ПриобретениеТоваровУслуг.Изменение.Подразделения
	|Документ.ПриобретениеТоваровУслуг.Изменение.Склады
	|Документ.ПриобретениеУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.ПриобретениеУслугПрочихАктивов.Чтение.Организации
	|Документ.ПриобретениеУслугПрочихАктивов.Чтение.Подразделения
	|Документ.ПриобретениеУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.ПриобретениеУслугПрочихАктивов.Изменение.Организации
	|Документ.ПриобретениеУслугПрочихАктивов.Изменение.Подразделения
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Чтение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.ПриходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.ПриходныйКассовыйОрдер.Изменение.Кассы
	|Документ.ПриходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.ПриходныйОрдерНаТовары.Чтение.Склады
	|Документ.ПриходныйОрдерНаТовары.Изменение.Склады
	|Документ.ПрочееОприходованиеТоваров.Чтение.Организации
	|Документ.ПрочееОприходованиеТоваров.Чтение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Чтение.Склады
	|Документ.ПрочееОприходованиеТоваров.Изменение.Организации
	|Документ.ПрочееОприходованиеТоваров.Изменение.Подразделения
	|Документ.ПрочееОприходованиеТоваров.Изменение.Склады
	|Документ.ПрочиеДоходыРасходы.Чтение.Организации
	|Документ.ПрочиеДоходыРасходы.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Кассы
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.Организации
	|Документ.РаспоряжениеНаПеремещениеДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Чтение.Организации
	|Документ.РаспределениеДоходовИРасходовПоНаправлениямДеятельности.Изменение.Организации
	|Документ.РаспределениеНДС.Чтение.Организации
	|Документ.РаспределениеНДС.Изменение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Чтение.Организации
	|Документ.РаспределениеРасходовБудущихПериодов.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Чтение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Чтение.Кассы
	|Документ.РасходныйКассовыйОрдер.Чтение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.ХозяйственныеОперации
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыПартнеров
	|Документ.РасходныйКассовыйОрдер.Изменение.ГруппыФизическихЛиц
	|Документ.РасходныйКассовыйОрдер.Изменение.Кассы
	|Документ.РасходныйКассовыйОрдер.Изменение.КассыККМ
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.ХозяйственныеОперации
	|Документ.РасходныйОрдерНаТовары.Чтение.Склады
	|Документ.РасходныйОрдерНаТовары.Изменение.Склады
	|Документ.РасчетКурсовыхРазниц.Чтение.Организации
	|Документ.РасчетКурсовыхРазниц.Изменение.Организации
	|Документ.РасчетСебестоимостиТоваров.Чтение.Организации
	|Документ.РасчетСебестоимостиТоваров.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.ВнешниеПользователи
	|Документ.РеализацияТоваровУслуг.Чтение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Подразделения
	|Документ.РеализацияТоваровУслуг.Чтение.Склады
	|Документ.РеализацияТоваровУслуг.Изменение.ГруппыПартнеров
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Подразделения
	|Документ.РеализацияТоваровУслуг.Изменение.Склады
	|Документ.РеализацияУслугПрочихАктивов.Чтение.ГруппыПартнеров
	|Документ.РеализацияУслугПрочихАктивов.Чтение.Организации
	|Документ.РеализацияУслугПрочихАктивов.Чтение.Подразделения
	|Документ.РеализацияУслугПрочихАктивов.Изменение.ГруппыПартнеров
	|Документ.РеализацияУслугПрочихАктивов.Изменение.Организации
	|Документ.РеализацияУслугПрочихАктивов.Изменение.Подразделения
	|Документ.РегистраторГрафикаДвиженияТоваров.Чтение.ГруппыПартнеров
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Чтение.ГруппыПартнеров
	|Документ.РегистрацияЦенНоменклатурыПоставщика.Изменение.ГруппыПартнеров
	|Документ.СборкаТоваров.Чтение.Организации
	|Документ.СборкаТоваров.Чтение.Склады
	|Документ.СборкаТоваров.Изменение.Организации
	|Документ.СборкаТоваров.Изменение.Склады
	|Документ.СверкаВзаиморасчетов.Чтение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Чтение.Организации
	|Документ.СверкаВзаиморасчетов.Изменение.ГруппыПартнеров
	|Документ.СверкаВзаиморасчетов.Изменение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.СообщениеSMS.Чтение.Объект.Документ.СообщениеSMS
	|Документ.СообщениеSMS.Изменение.Объект.Документ.СообщениеSMS
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Чтение.ХозяйственныеОперации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыПартнеров
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ГруппыФизическихЛиц
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.Организации
	|Документ.СписаниеБезналичныхДенежныхСредств.Изменение.ХозяйственныеОперации
	|Документ.СписаниеЗадолженности.Чтение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Чтение.Организации
	|Документ.СписаниеЗадолженности.Изменение.ГруппыПартнеров
	|Документ.СписаниеЗадолженности.Изменение.Организации
	|Документ.СписаниеНДСНаРасходы.Чтение.Организации
	|Документ.СписаниеНДСНаРасходы.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Организации
	|Документ.СписаниеНедостачТоваров.Чтение.Подразделения
	|Документ.СписаниеНедостачТоваров.Чтение.Склады
	|Документ.СписаниеНедостачТоваров.Изменение.Организации
	|Документ.СписаниеНедостачТоваров.Изменение.Подразделения
	|Документ.СписаниеНедостачТоваров.Изменение.Склады
	|Документ.СправкаОПодтверждающихДокументах.Чтение.Организации
	|Документ.СправкаОПодтверждающихДокументах.Изменение.Организации
	|Документ.СчетНаОплатуКлиенту.Чтение.ВнешниеПользователи
	|Документ.СчетНаОплатуКлиенту.Чтение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Чтение.Организации
	|Документ.СчетНаОплатуКлиенту.Изменение.ГруппыПартнеров
	|Документ.СчетНаОплатуКлиенту.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураВыданныйАванс.Чтение.Организации
	|Документ.СчетФактураВыданныйАванс.Изменение.Организации
	|Документ.СчетФактураКомиссионеру.Чтение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Чтение.Организации
	|Документ.СчетФактураКомиссионеру.Изменение.ГруппыПартнеров
	|Документ.СчетФактураКомиссионеру.Изменение.Организации
	|Документ.СчетФактураКомитента.Чтение.Организации
	|Документ.СчетФактураКомитента.Изменение.Организации
	|Документ.СчетФактураНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураНалоговыйАгент.Изменение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Чтение.Организации
	|Документ.СчетФактураНаНеподтвержденнуюРеализацию0.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.СчетФактураПолученныйАванс.Чтение.Организации
	|Документ.СчетФактураПолученныйАванс.Изменение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Чтение.Организации
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.ГруппыПартнеров
	|Документ.СчетФактураПолученныйНалоговыйАгент.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Чтение.Подразделения
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.ГруппыПартнеров
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Организации
	|Документ.ТаможеннаяДекларацияИмпорт.Изменение.Подразделения
	|Документ.ТелефонныйЗвонок.Чтение.Объект.Документ.ТелефонныйЗвонок
	|Документ.ТелефонныйЗвонок.Изменение.Объект.Документ.ТелефонныйЗвонок
	|Документ.ТранспортнаяНакладная.Чтение.Организации
	|Документ.ТранспортнаяНакладная.Изменение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Чтение.Организации
	|Документ.УведомлениеОЗачисленииВалюты.Изменение.Организации
	|Документ.УдалитьКассовыйЧекКоррекции.Чтение.Кассы
	|Документ.УдалитьКассовыйЧекКоррекции.Чтение.КассыККМ
	|Документ.УдалитьКассовыйЧекКоррекции.Чтение.Организации
	|Документ.УстановкаБлокировокЯчеек.Чтение.Склады
	|Документ.УстановкаБлокировокЯчеек.Изменение.Склады
	|Документ.УстановкаЦенНоменклатуры.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.УстановкаЦенНоменклатуры.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.ЧекККМ.Чтение.КассыККМ
	|Документ.ЧекККМ.Чтение.Организации
	|Документ.ЧекККМ.Чтение.Склады
	|Документ.ЧекККМ.Изменение.КассыККМ
	|Документ.ЧекККМ.Изменение.Организации
	|Документ.ЧекККМ.Изменение.Склады
	|Документ.ЧекККМВозврат.Чтение.КассыККМ
	|Документ.ЧекККМВозврат.Чтение.Организации
	|Документ.ЧекККМВозврат.Чтение.Склады
	|Документ.ЧекККМВозврат.Изменение.КассыККМ
	|Документ.ЧекККМВозврат.Изменение.Организации
	|Документ.ЧекККМВозврат.Изменение.Склады
	|Документ.ЧекККМКоррекции.Чтение.КассыККМ
	|Документ.ЧекККМКоррекции.Чтение.Организации
	|Документ.ЧекККМКоррекции.Чтение.Склады
	|Документ.ЧекККМКоррекции.Изменение.КассыККМ
	|Документ.ЧекККМКоррекции.Изменение.Организации
	|Документ.ЧекККМКоррекции.Изменение.Склады
	|Документ.ЭлектронноеПисьмоВходящее.Чтение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Документ.ЭлектронноеПисьмоВходящее.Изменение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|Документ.ЭлектронноеПисьмоИсходящее.Чтение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|Документ.ЭлектронноеПисьмоИсходящее.Изменение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.Встреча
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.ЗапланированноеВзаимодействие
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.СообщениеSMS
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.ТелефонныйЗвонок
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|ЖурналДокументов.Взаимодействия.Чтение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|ЖурналДокументов.КорректировкиНДС.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомиссионеров.Чтение.Подразделения
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.ГруппыПартнеров
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Организации
	|ЖурналДокументов.ОтчетыКомитентам.Чтение.Подразделения
	|ЖурналДокументов.РегламентныеДокументы.Чтение.Организации
	|ЖурналДокументов.СкладскиеОрдера.Чтение.Склады
	|ЖурналДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи.Чтение.Склады
	|ЖурналДокументов.ЧекиККМ.Чтение.КассыККМ
	|ЖурналДокументов.ЧекиККМ.Чтение.Организации
	|ЖурналДокументов.ЧекиККМ.Чтение.Склады
	|ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Чтение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияКлиентов.Изменение.ГруппыПартнеров
	|РегистрСведений.ABCXYZКлассификацияНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрСведений.ВариантыОбеспеченияТоварами.Чтение.Склады
	|РегистрСведений.ВариантыОбеспеченияТоварами.Изменение.Склады
	|РегистрСведений.ГрафикПлатежей.Чтение.Организации
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.Задание
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|РегистрСведений.ДанныеОснованийСчетовФактур.Чтение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Чтение.Организации
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыПартнеров
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыПартнеров
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.ДоступностьТоваровДляВнешнихПользователей.Чтение.Склады
	|РегистрСведений.ДоступныеОстаткиПланируемыхПоступлений.Чтение.Склады
	|РегистрСведений.ЖурналУчетаСчетовФактур.Чтение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Изменение.Организации
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСКлиентами.Чтение.Организации
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрСведений.ЗаданияКРаспределениюРасчетовСПоставщиками.Чтение.Организации
	|РегистрСведений.ИсточникиПервичногоИнтереса.Чтение.ГруппыПартнеров
	|РегистрСведений.КорзинаПокупателя.Чтение.ВнешниеПользователи
	|РегистрСведений.НастройкаКонтроляОбеспечения.Чтение.Склады
	|РегистрСведений.НастройкаКонтроляОбеспечения.Изменение.Склады
	|РегистрСведений.НастройкаПередачиТоваровМеждуОрганизациями.Чтение.Организации
	|РегистрСведений.НастройкиАдресныхСкладов.Чтение.Склады
	|РегистрСведений.НастройкиАдресныхСкладов.Изменение.Склады
	|РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.Чтение.Пользователи
	|РегистрСведений.НастройкиУчетныхЗаписейЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|РегистрСведений.НДССостояниеРеализации0.Чтение.Организации
	|РегистрСведений.НДССостояниеРеализации0.Изменение.Организации
	|РегистрСведений.ОстаткиНаБанковскихСчетахПоДаннымВыписок.Чтение.Организации
	|РегистрСведений.ОчередьФормированияКорректировокИзлишковИНедостачПоТоварнымМестам.Чтение.Склады
	|РегистрСведений.ОшибкиРасчетаПартийИСебестоимости.Чтение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Чтение.Организации
	|РегистрСведений.ПартнерыСегмента.Чтение.ВнешниеПользователи
	|РегистрСведений.ПартнерыСегмента.Чтение.ГруппыПартнеров
	|РегистрСведений.ПартнерыСегмента.Изменение.ГруппыПартнеров
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Чтение.Организации
	|РегистрСведений.ПодтверждениеОплатыНДСВБюджет.Изменение.Организации
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Чтение.Склады
	|РегистрСведений.ПравилаРазмещенияТоваровВЯчейках.Изменение.Склады
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.Встреча
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.ЗапланированноеВзаимодействие
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.СообщениеSMS
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.ТелефонныйЗвонок
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.ЭлектронноеПисьмоВходящее
	|РегистрСведений.ПредметыПапкиВзаимодействий.Изменение.Объект.Документ.ЭлектронноеПисьмоИсходящее
	|РегистрСведений.ПримененияЕНВД.Чтение.Организации
	|РегистрСведений.ПримененияЕНВД.Чтение.Склады
	|РегистрСведений.ПримененияЕНВД.Изменение.Организации
	|РегистрСведений.ПримененияЕНВД.Изменение.Склады
	|РегистрСведений.ПрогнозыРасходаУпаковок.Чтение.Склады
	|РегистрСведений.ПрогнозыРасходаУпаковок.Изменение.Склады
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Чтение.Склады
	|РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.Изменение.Склады
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Организации
	|РегистрСведений.РегистрацииВНалоговомОргане.Чтение.Подразделения
	|РегистрСведений.РеестрДокументов.Чтение.ГруппыПартнеров
	|РегистрСведений.РеестрДокументов.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РеестрДокументов.Чтение.Кассы
	|РегистрСведений.РеестрДокументов.Чтение.Организации
	|РегистрСведений.РеестрДокументов.Чтение.Подразделения
	|РегистрСведений.РеестрДокументов.Чтение.Склады
	|РегистрСведений.РеестрДокументов.Чтение.ХозяйственныеОперации
	|РегистрСведений.СвязиМеждуПартнерами.Чтение.ГруппыПартнеров
	|РегистрСведений.СвязиМеждуПартнерами.Изменение.ГруппыПартнеров
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|РегистрСведений.СоставыГруппПользователей.Чтение.ВнешниеПользователи
	|РегистрСведений.СоставыГруппПользователей.Чтение.Пользователи
	|РегистрСведений.СостоянияБлокировкиВычетаНДСПоСчетамФактурам.Чтение.Организации
	|РегистрСведений.СостоянияИРеквизитыДоставки.Чтение.Склады
	|РегистрСведений.СтоимостьТоваров.Чтение.Организации
	|РегистрСведений.СубъектыДляСкрытияПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СхемыОбеспечения.Чтение.Склады
	|РегистрСведений.СхемыОбеспечения.Изменение.Склады
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.ГруппыПартнеров
	|РегистрСведений.СчетаФактурыКомиссионерамКОформлению.Чтение.Организации
	|РегистрСведений.СчетаФактурыКомитентовКРегистрации.Чтение.Организации
	|РегистрСведений.ТоварныеОграничения.Чтение.Склады
	|РегистрСведений.ТоварныеОграничения.Изменение.Склады
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Чтение.Организации
	|РегистрСведений.УчетнаяПолитикаОрганизаций.Изменение.Организации
	|РегистрСведений.ФИОФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФИОФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ЦеныНоменклатурыПоставщиков.Чтение.ГруппыПартнеров
	|РегистрСведений.ШтрихкодыНоменклатуры.Изменение.ГруппыНоменклатуры
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.ГруппыПартнеров
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Организации
	|РегистрНакопления.ВыручкаИСебестоимостьПродаж.Чтение.Подразделения
	|РегистрНакопления.ГрафикОтгрузкиТоваров.Чтение.Склады
	|РегистрНакопления.ГрафикПоступленияТоваров.Чтение.Склады
	|РегистрНакопления.ДвижениеТоваров.Чтение.Склады
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Кассы
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.КассыККМ
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.ГруппыПартнеров
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Кассы
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.КассыККМ
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Кассы
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.КассыККМ
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ДвиженияДенежныхСредств.Чтение.Подразделения
	|РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Чтение.Организации
	|РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияКонтрагентДоходыРасходы.Чтение.ГруппыПартнеров
	|РегистрНакопления.ДвиженияКонтрагентДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияКонтрагентДоходыРасходы.Чтение.Подразделения
	|РегистрНакопления.ДвиженияКонтрагентКонтрагент.Чтение.ГруппыПартнеров
	|РегистрНакопления.ДвиженияКонтрагентКонтрагент.Чтение.Организации
	|РегистрНакопления.ДвиженияКонтрагентКонтрагент.Чтение.Подразделения
	|РегистрНакопления.ДвиженияНоменклатураДоходыРасходы.Чтение.Организации
	|РегистрНакопления.ДвиженияНоменклатураНоменклатура.Чтение.Организации
	|РегистрНакопления.ДвиженияСерийТоваров.Чтение.Склады
	|РегистрНакопления.ДенежныеСредстваБезналичные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.КассыККМ
	|РегистрНакопления.ДенежныеСредстваВКассахККМ.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваВПути.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваВПути.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваКВыплате.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Кассы
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Организации
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН.Чтение.Организации
	|РегистрНакопления.ДетализацияПартийТоваровДляНДСиУСН2_4.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ВнешниеПользователи
	|РегистрНакопления.ЗаказыКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаказыКлиентов.Чтение.Склады
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Организации
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Подразделения
	|РегистрНакопления.ЗаказыНаВнутреннееПотребление.Чтение.Склады
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Организации
	|РегистрНакопления.ЗаказыНаПеремещение.Чтение.Склады
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Организации
	|РегистрНакопления.ЗаказыНаСборку.Чтение.Склады
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Организации
	|РегистрНакопления.ЗаказыПоставщикам.Чтение.Склады
	|РегистрНакопления.Закупки.Чтение.ГруппыПартнеров
	|РегистрНакопления.Закупки.Чтение.Организации
	|РегистрНакопления.Закупки.Чтение.Подразделения
	|РегистрНакопления.Закупки.Чтение.Склады
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.ГруппыПартнеров
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Организации
	|РегистрНакопления.ЗаявкиНаВозвратТоваровОтКлиентов.Чтение.Склады
	|РегистрНакопления.ЛимитыРасходаДенежныхСредств.Чтение.Организации
	|РегистрНакопления.ЛимитыРасходаДенежныхСредств.Чтение.Подразделения
	|РегистрНакопления.МатериалыИРаботыВПроизводстве.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Изменение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Изменение.Организации
	|РегистрНакопления.НДСПредъявленный.Чтение.Организации
	|РегистрНакопления.ОбеспечениеЗаказов.Чтение.Склады
	|РегистрНакопления.ПартииЗатратНаВыпуск.Чтение.Организации
	|РегистрНакопления.ПартииПроизводственныхЗатрат.Чтение.Организации
	|РегистрНакопления.ПартииПрочихРасходов.Чтение.Организации
	|РегистрНакопления.ПартииРасходовНаСебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ПартииТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.ПартииТоваровПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.ГруппыПартнеров
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.Организации
	|РегистрНакопления.ПереданнаяВозвратнаяТара.Чтение.Склады
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.ГруппыПартнеров
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.Организации
	|РегистрНакопления.ПринятаяВозвратнаяТара.Чтение.Склады
	|РегистрНакопления.ПрочиеАктивыПассивы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Организации
	|РегистрНакопления.ПрочиеДоходы.Чтение.Подразделения
	|РегистрНакопления.ПрочиеРасходы.Чтение.Организации
	|РегистрНакопления.ПрочиеРасходы.Чтение.Подразделения
	|РегистрНакопления.РасчетыПоФинансовымИнструментам.Чтение.Организации
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.Организации
	|РегистрНакопления.РасчетыПоЭквайрингу.Чтение.ЭквайринговыеТерминалы
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ВнешниеПользователи
	|РегистрНакопления.РасчетыСКлиентами.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентами.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПланОплат.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПланОплат.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПланОтгрузок.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РасчетыСКлиентамиПоСрокам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСКлиентамиПоСрокам.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПланОплат.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПланОплат.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПланПоставок.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Чтение.Организации
	|РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Чтение.ГруппыПартнеров
	|РегистрНакопления.РасчетыСПоставщикамиПоСрокам.Чтение.Организации
	|РегистрНакопления.РезервыТоваровОрганизаций.Чтение.Организации
	|РегистрНакопления.СвободныеОстатки.Чтение.Склады
	|РегистрНакопления.СебестоимостьТоваров.Чтение.Организации
	|РегистрНакопления.ТМЦВЭксплуатации.Чтение.Организации
	|РегистрНакопления.ТМЦВЭксплуатации.Чтение.Подразделения
	|РегистрНакопления.ТоварныеМестаКОтражениюИзлишковНедостач.Чтение.Склады
	|РегистрНакопления.ТоварыВЯчейках.Чтение.Склады
	|РегистрНакопления.ТоварыКОтгрузке.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Чтение.Склады
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыКОформлениюОтчетовКомитенту.Чтение.Организации
	|РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций.Чтение.ГруппыПартнеров
	|РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций.Чтение.Организации
	|РегистрНакопления.ТоварыКПоступлению.Чтение.Склады
	|РегистрНакопления.ТоварыНаСкладах.Чтение.Склады
	|РегистрНакопления.ТоварыОрганизаций.Чтение.Организации
	|РегистрНакопления.ТоварыОрганизацийКПередаче.Чтение.Организации
	|РегистрНакопления.ТоварыПереданныеНаКомиссию.Чтение.Организации
	|РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Чтение.ГруппыПартнеров
	|РегистрНакопления.УслугиКОформлениюОтчетовПринципалу.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Организации
	|РегистрНакопления.ФинансовыеРезультаты.Чтение.Подразделения
	|БизнесПроцесс.Задание.Чтение.Пользователи
	|БизнесПроцесс.Задание.Изменение.Пользователи
	|БизнесПроцесс.СогласованиеЦенНоменклатуры.Изменение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Чтение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Чтение.Пользователи
	|БизнесПроцесс.ТиповаяПродажа.Изменение.ГруппыПартнеров
	|БизнесПроцесс.ТиповаяПродажа.Изменение.Пользователи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.Задание
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗакупки
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЗаявкиНаВозвратТоваровОтКлиента
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеПродажи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.СогласованиеЦенНоменклатуры
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.ТиповаяПродажа
	|Задача.ЗадачаИсполнителя.Чтение.Пользователи
	|Задача.ЗадачаИсполнителя.Изменение.Пользователи
//-- НЕ ГОСИС
	|";

	//<{УСО 2.4}:{Управление строительным предприятием}
	УСОERP_МодификацияКонфигурации.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	//<{/УСО 2.4}:{Управление строительным предприятием} 
	 
	// Сметная подсистема
	СМ_СметаСтандартныеПодсистемы.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	// Сметная подсистема

КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект, для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка и т. п.
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	//++ НЕ ГОСИС
	УправлениеДоступомУТ.ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты);
	//-- НЕ ГОСИС
	
КонецПроцедуры

#КонецОбласти










































