
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Подразделение") Тогда
		Подразделение = Параметры.Подразделение;
		ПрочитатьПараметрыПодразделения();
	КонецЕсли;
	
	АктивныеСостояния = АктивныеСостояния();
	Состояние.ЗагрузитьЗначения(АктивныеСостояния);
	
	УстановитьТипРабочегоЦентра(ЭтаФорма);
	УстановитьТипИсполнителя();
	
	УстановитьСвойстваДинамическогоСпискаВыполнениеОпераций();
	УстановитьСвойстваДинамическогоСпискаОперации();
	
	УстановитьОтборПоПодразделениюУчастку();
	УстановитьОтборПоРабочемуЦентру();
	УстановитьОтборПоСостоянию();
	
	Если Параметры.Свойство("ОтборПоЭтапам") Тогда
		УстановитьОтборПоЭтапам(Параметры.ОтборПоЭтапам);
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПроизводственныеУчастки КАК ПроизводственныеУчастки
		|		ПО СтруктураПредприятия.Ссылка = ПроизводственныеУчастки.Владелец
		|ГДЕ
		|	СтруктураПредприятия.ИспользоватьПооперационноеУправление
		|	И НЕ СтруктураПредприятия.ИспользоватьПооперационноеПланирование
		|	И СтруктураПредприятия.ИспользоватьПроизводственныеУчастки");
	ИспользоватьУчастки = НЕ Запрос.Выполнить().Пустой();
	
	Элементы.ОтборПодразделениеЗаголовок.Видимость = НЕ ИспользоватьУчастки;
	Элементы.ТипОтбораПодразделение.Видимость = ИспользоватьУчастки;
	
	НастроитьЗависимыеЭлементыФормы();
	
	РегистрыСведений.ЗаданияКРасчетуОчередиПроизводственныхОпераций.ЗапуститьЗадание();
	
	#Область СтандартныеМеханизмы
	
	// ПодключаемоеОборудование
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	СписокТипов = Операции.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = СписокТипов;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.КомандыОперации;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма, Элементы.КомандыОперацииГлобальныеКоманды);
	// Конец ИнтеграцияС1СДокументооборотом
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	#КонецОбласти
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если ИмяСобытия = "Запись_ПроизводственнаяОперация"
		И ТипЗнч(Параметр) = Тип("Структура")
		И Параметр.Свойство("Подразделение")
		И Параметр.Подразделение = Подразделение
		И Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыполнениеОпераций Тогда
		
		Элементы.ВыполнениеОпераций.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		
		// Отборы установлены через параметры, сохраненные настройки не используются
		
		Настройки.Удалить("Подразделение");
		Настройки.Удалить("Участок");
		Настройки.Удалить("РабочийЦентр");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки["Подразделение"] <> Неопределено Тогда
		
		ТипОтбораПодразделение = ?(НЕ Участок.Пустая() И ИспользоватьУчастки, 1, 0);
		
		Если ТипЗнч(РабочийЦентр) = Тип("СправочникСсылка.ВидыРабочихЦентров")
				ИЛИ НЕ ЗначениеЗаполнено(РабочийЦентр) Тогда
			ТипОтбораРабочийЦентр = 0;
		Иначе
			ТипОтбораРабочийЦентр = 1;
		КонецЕсли;
		
		ПодразделениеПриИзмененииНаСервере(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область ВыполнениеОпераций

&НаКлиенте
Процедура ВыполнениеОпераций_Обновить(Команда)
	
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.ВыполнениеОпераций2_2.РабочееМесто.Команда.ОбновитьСписок");
	
	Элементы.ВыполнениеОпераций.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОпераций_Назначить(Команда)
	
	КлючиОпераций = ПроверитьПолучитьВыделенныеВСпискеОперации(Элементы.ВыполнениеОпераций.ВыделенныеСтроки);
	
	Если КлючиОпераций = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если КлючиОпераций.Количество() = 1
		И Элементы.ВыполнениеОпераций.ТекущиеДанные <> Неопределено Тогда
		
		Если ТипЗнч(Элементы.ВыполнениеОпераций.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
			Или Элементы.ВыполнениеОпераций.ТекущиеДанные.ОжиданиеСоздания = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru='Команда не может быть выполнена для выбранной строки.';uk='Команда не може бути виконана для вибраного рядка.'"));
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ОткрытьФормуНазначениеОпераций(КлючиОпераций, "Назначить");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОпераций_ПринятьВРаботу(Команда)
	
	КлючиОпераций = ПроверитьПолучитьВыделенныеВСпискеОперации(Элементы.ВыполнениеОпераций.ВыделенныеСтроки);
	
	Если КлючиОпераций = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуСписка = Ложь;
	
	Если КлючиОпераций.Количество() = 1
		И Элементы.ВыполнениеОпераций.ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные = Элементы.ВыполнениеОпераций.ТекущиеДанные;
		
		Если ТипЗнч(Элементы.ВыполнениеОпераций.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
			Или ТекущиеДанные.МожноВыполнять = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru='Команда не может быть выполнена для выбранной строки.';uk='Команда не може бути виконана для вибраного рядка.'"));
			Возврат;
		КонецЕсли;
		
		ОткрытьФормуСписка = (ТекущиеДанные.Создано - ТекущиеДанные.Выполняется - ТекущиеДанные.Выполнено - ТекущиеДанные.Пропущено) > 0;
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='Команда не может быть выполнена для нескольких строк.';uk='Команда не може бути виконана для кількох рядків.'"));
		Возврат;
		
	КонецЕсли;
	
	Если ОткрытьФормуСписка Тогда
		
		ОткрытьФормуСпискаОпераций(КлючиОпераций, "ПринятьВРаботу");
		
	Иначе
		
		ОткрытьФормуНазначениеОпераций(КлючиОпераций, "ПринятьВРаботу");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОпераций_ОтметитьВыполнение(Команда)
	
	КлючиОпераций = ПроверитьПолучитьВыделенныеВСпискеОперации(Элементы.ВыполнениеОпераций.ВыделенныеСтроки);
	
	Если КлючиОпераций = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуСписка = Ложь;
	
	Если КлючиОпераций.Количество() = 1
		И Элементы.ВыполнениеОпераций.ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные = Элементы.ВыполнениеОпераций.ТекущиеДанные;
		
		Если ТипЗнч(Элементы.ВыполнениеОпераций.ТекущаяСтрока) = Тип("СтрокаГруппировкиДинамическогоСписка")
			Или (ТекущиеДанные.МожноВыполнять + ТекущиеДанные.Выполняется) = 0 Тогда
			ПоказатьПредупреждение(, НСтр("ru='Команда не может быть выполнена для выбранной строки.';uk='Команда не може бути виконана для вибраного рядка.'"));
			Возврат;
		КонецЕсли;
		
		ОткрытьФормуСписка = (ТекущиеДанные.Создано - ТекущиеДанные.Выполнено - ТекущиеДанные.Пропущено) > 0;
		
	Иначе
		
		ПоказатьПредупреждение(, НСтр("ru='Команда не может быть выполнена для нескольких строк.';uk='Команда не може бути виконана для кількох рядків.'"));
		Возврат;
		
	КонецЕсли;
	
	Если ОткрытьФормуСписка Тогда
		
		ОткрытьФормуСпискаОпераций(КлючиОпераций, "ОтметитьВыполнение");
		
	Иначе
		
		ОткрытьФормуНазначениеОпераций(КлючиОпераций, "ОтметитьВыполнение");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОпераций_Пропустить(Команда)
	
	КлючиОпераций = ПроверитьПолучитьВыделенныеВСпискеОперации(Элементы.ВыполнениеОпераций.ВыделенныеСтроки);
	
	Если КлючиОпераций = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МожноПропустить = Истина;
	
	Для каждого КлючОперации Из КлючиОпераций Цикл
		ДанныеСтроки = Элементы.ВыполнениеОпераций.ДанныеСтроки(КлючОперации); 
		Если НЕ ДанныеСтроки.МожноПропустить
				ИЛИ ДанныеСтроки.МожноВыполнять = 0 Тогда
			МожноПропустить = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если МожноПропустить Тогда
		
		ОперативныйУчетПроизводстваКлиент.СформироватьПроизводственныеОперации(
			Подразделение,
			КлючиОпераций,
			Новый Структура,
			ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Пропущена"));
		
	Иначе
		
		ПоказатьПредупреждение(, ?(КлючиОпераций.Количество() > 1,
			НСтр("ru='Команда не может быть выполнена для выбранных строк.';uk='Команда не може бути виконана для вибраних рядків.'"),
			НСтр("ru='Команда не может быть выполнена для выбранной строки.';uk='Команда не може бути виконана для вибраного рядка.'")));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Операции

&НаКлиенте
Процедура Операции_НазначитьРабочийЦентр(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ВидРабочегоЦентра = Неопределено;
	
	Для каждого Ссылка Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = Элементы.Операции.ДанныеСтроки(Ссылка);
			
		Если НЕ ДанныеСтроки.ВидРабочегоЦентра.Пустая() Тогда
			
			Если ВидРабочегоЦентра = Неопределено Тогда
					
				ВидРабочегоЦентра = ДанныеСтроки.ВидРабочегоЦентра;
				
			ИначеЕсли ВидРабочегоЦентра <> ДанныеСтроки.ВидРабочегоЦентра Тогда
				
				ПоказатьПредупреждение(, НСтр("ru='Выбраны операции с различными видами рабочих центров.';uk='Вибрані операції з різними видами робочих центрів.'"));
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Подразделение", Подразделение);
	Если ВидРабочегоЦентра <> Неопределено Тогда
		Отбор.Вставить("ВидРабочегоЦентра", ВидРабочегоЦентра);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Операции", ВыделенныеСтроки);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОперацииНазначитьРабочийЦентрЗавершение",
		ЭтотОбъект, ДопПараметры);
	
	ОткрытьФорму("Справочник.РабочиеЦентры.ФормаВыбора",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацииНазначитьРабочийЦентрЗавершение(РезультатЗакрытия, ДопПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено Тогда
		
		ОперацииНазначитьРабочийЦентрНаСервере(ДопПараметры.Операции, РезультатЗакрытия);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_ОтменитьНазначениеРабочегоЦентра(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОперацииНазначитьРабочийЦентрНаСервере(
		ВыделенныеСтроки,
		ПредопределенноеЗначение("Справочник.РабочиеЦентры.ПустаяСсылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_УстановитьСтатусВыполняется(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОперативныйУчетПроизводстваКлиент.УстановитьСтатусПроизводственнойОперации(
		ВыделенныеСтроки,
		"Выполняется",
		Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_УстановитьСтатусВыполнена(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ОперативныйУчетПроизводстваКлиент.УстановитьСтатусПроизводственнойОперации(
		ВыделенныеСтроки,
		"Выполнена",
		Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_УстановитьСтатусНеВыполнена(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ОперативныйУчетПроизводстваКлиент.УстановитьСтатусПроизводственнойОперации(
		ВыделенныеСтроки,
		"НеВыполнена",
		Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура Операции_УстановитьСтатусПропущена(Команда)
	
	ВыделенныеСтроки = ОбщегоНазначенияУТКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Операции);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	ОперативныйУчетПроизводстваКлиент.УстановитьСтатусПроизводственнойОперации(
		ВыделенныеСтроки,
		"Пропущена",
		Подразделение);
	
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Операции);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Операции, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Операции);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Элементы.Операции);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница = Элементы.СтраницаЖурналОпераций Тогда
		Элементы.Операции.Обновить();
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаВыполнениеОпераций Тогда
		Элементы.ВыполнениеОпераций.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	ПодразделениеПриИзмененииНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборУчастокПриИзменении(Элемент)
	
	УчастокПриИзмененииНаСервере(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтбораПодразделениеПриИзменении(Элемент)
	
	Если ТипОтбораПодразделение = 1 Тогда
		
		Подразделение = Неопределено;
		ПодразделениеПриИзмененииНаСервере(Истина);
		
	Иначе
		
		Участок = Неопределено;
		УчастокПриИзмененииНаСервере(Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОтбораРабочийЦентрПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(РабочийЦентр) Тогда
		ЗначениеОтбораДоИзменения = РабочийЦентр;
	Иначе
		ЗначениеОтбораДоИзменения = Неопределено;
	КонецЕсли;
	
	УстановитьТипРабочегоЦентра(ЭтаФорма);
	
	Если ЗначениеОтбораДоИзменения <> Неопределено
		И ЗначениеОтбораДоИзменения <> РабочийЦентр Тогда
		УстановитьОтборПоРабочемуЦентру();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборРабочийЦентрПриИзменении(Элемент)
	
	УстановитьОтборПоРабочемуЦентру();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтборСостояниеНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Перечисление", Тип("ПеречислениеСсылка.СостоянияВыполненияОпераций"));
	ПараметрыФормы.Вставить("ВыбранныеЗначения", Состояние.ВыгрузитьЗначения());
	
	ОткрытьФорму("Обработка.ВыполнениеОпераций2_2.Форма.ВыборЗначенийПеречисления",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено 
		И РезультатЗакрытия <> КодВозвратаДиалога.Отмена Тогда
		
		Состояние.ЗагрузитьЗначения(РезультатЗакрытия);
		УстановитьОтборПоСостоянию();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеПриИзменении(Элемент)
	
	УстановитьОтборПоСостоянию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСостояниеОчистка(Элемент, СтандартнаяОбработка)
	
	Если Состояние.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Состояние.Очистить();
	
	УстановитьОтборПоСостоянию();
	
КонецПроцедуры

#Область ВыполнениеОпераций

&НаКлиенте
Процедура ВыполнениеОперацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если Поле.Имя = "ВыполнениеОперацийОперация" Тогда
			ПоказатьЗначение(, ТекущиеДанные.Операция);
		ИначеЕсли Найти("ВыполнениеОперацийЭтап,ВыполнениеОперацийПредставлениеЭтапа" ,Поле.Имя) Тогда
			ПоказатьЗначение(, ТекущиеДанные.Этап);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнениеОперацийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационноеСообщениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОтключитьОтборПоЭтапу" Тогда
		
		СтандартнаяОбработка = Ложь;
		УстановитьОтборПоЭтапам();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Операции

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	УстановитьОтборПоИсполнителю();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ИсполнительНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПроизводствоКлиент.ОткрытьФормуВыбораИсполнителя(
		Неопределено,
		Подразделение,
		Исполнитель,
		ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусПриИзменении(Элемент)
	
	УстановитьОтборПоСтатусу();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОтборСтатусНачалоВыбораЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Перечисление", Тип("ПеречислениеСсылка.СтатусыПроизводственныхОпераций"));
	ПараметрыФормы.Вставить("ВыбранныеЗначения", Статус.ВыгрузитьЗначения());
	
	ОткрытьФорму("Обработка.ВыполнениеОпераций2_2.Форма.ВыборЗначенийПеречисления",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтатусНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено 
		И РезультатЗакрытия <> КодВозвратаДиалога.Отмена Тогда
		
		Статус.ЗагрузитьЗначения(РезультатЗакрытия);
		УстановитьОтборПоСтатусу();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСменаПриИзменении(Элемент)
	
	УстановитьОтборПоСменномуЗаданию(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОперации

&НаКлиенте
Процедура ОперацииПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоСостоянию()
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
		ВыполнениеОпераций.Отбор,, "ГруппаОтбораПоСостоянию");
		
	НаборСостояний = Состояние.ВыгрузитьЗначения();
	
	Если НаборСостояний.ВГраница() <> -1 Тогда
		
		ОтборГруппа = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
			ВыполнениеОпераций.Отбор.Элементы, "ГруппаОтбораПоСостоянию", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		Для каждого СостояниеЗначение Из НаборСостояний Цикл
			
			Если СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.ОжиданиеПредшествующих Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "ОжиданиеПредшествующих", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.НачатаПредшествующая Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "НачатыПредшествующие", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.МожноВыполнять Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "МожноВыполнять", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.Выполняется Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппа, "Выполняется", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);
			ИначеЕсли СостояниеЗначение = Перечисления.СостоянияВыполненияОпераций.Завершена Тогда
				ОтборГруппаВыполнено = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
					ОтборГруппа.Элементы, "ГруппаОтбораПоСостояниюВыполнено", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "Выполнено", 0, ВидСравненияКомпоновкиДанных.Больше,, Истина);	
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "ОжиданиеПредшествующих", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "НачатыПредшествующие", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "МожноВыполнять", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
				ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ОтборГруппаВыполнено, "Выполняется", 0, ВидСравненияКомпоновкиДанных.Равно,, Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	НастроитьЗависимыеЭлементыФормы("Состояние");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоИсполнителю()
	
	ОтборПоНоменклатуре = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Операции.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы,
		НСтр("ru='Отбор по исполнителю';uk='Відбір за виконавцем'"),
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ОтборПоНоменклатуре,
		"Ссылка.Исполнитель",
		ВидСравненияКомпоновкиДанных.Равно,
		Исполнитель,
		,
		ЗначениеЗаполнено(Исполнитель));
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ОтборПоНоменклатуре,
		"Ссылка.Трудозатраты.Исполнитель",
		ВидСравненияКомпоновкиДанных.Равно,
		Исполнитель,
		,
		ЗначениеЗаполнено(Исполнитель));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоСтатусу()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции, 
		"Статус", 
		Статус, 
		ВидСравненияКомпоновкиДанных.ВСписке,
		, 
		ЗначениеЗаполнено(Статус));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборПоСменномуЗаданию(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Форма.Операции, 
		"СменноеЗадание", 
		Форма.Смена, 
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ЗначениеЗаполнено(Форма.Смена));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоЭтапам(СписокЭтапов = Неопределено)
	
	УстановленОтбор = ЗначениеЗаполнено(СписокЭтапов);
	
	Если УстановленОтбор Тогда
		
		ЗначениеОтбора  = ?(СписокЭтапов.Количество() = 1, СписокЭтапов[0], СписокЭтапов);
		ВидСравненияСКД = ?(СписокЭтапов.Количество() = 1,
			ВидСравненияКомпоновкиДанных.Равно,
			ВидСравненияКомпоновкиДанных.ВСписке);
			
	Иначе
		
		ЗначениеОтбора = Неопределено;
		ВидСравненияСКД = ВидСравненияКомпоновкиДанных.Равно;
		
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ВыполнениеОпераций,
			"Этап",
			ЗначениеОтбора,
			ВидСравненияСКД,
			,
			УстановленОтбор);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Операции,
			"Этап",
			ЗначениеОтбора,
			ВидСравненияСКД,
			,
			УстановленОтбор);
	
	Если УстановленОтбор Тогда
		СформироватьНадписьУстановленОтборПоЭтапам(СписокЭтапов);
	Иначе
		ОчиститьИнформационноеСообщение();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоРабочемуЦентру()
	
	УстановленОтбор = ЗначениеЗаполнено(РабочийЦентр);
	
	Если УстановленОтбор И ТипОтбораРабочийЦентр = 1 Тогда
		ЗначениеОтбора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РабочийЦентр, "ВидРабочегоЦентра");
	Иначе
		ЗначениеОтбора = РабочийЦентр;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ВыполнениеОпераций, 
			"ВидРабочегоЦентра", 
			ЗначениеОтбора, 
			ВидСравненияКомпоновкиДанных.Равно,
			, 
			УстановленОтбор);
		
	Если ТипОтбораРабочийЦентр = 1 Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Операции, 
				"РабочийЦентр", 
				РабочийЦентр, 
				ВидСравненияКомпоновкиДанных.Равно,
				, 
				УстановленОтбор);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Операции, 
				"ВидРабочегоЦентра", 
				,
				,
				,
				Ложь);
				
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Операции, 
				"РабочийЦентр", 
				,
				,
				,
				Ложь);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Операции, 
				"ВидРабочегоЦентра", 
				РабочийЦентр, 
				ВидСравненияКомпоновкиДанных.Равно,
				, 
				УстановленОтбор);
				
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоПодразделениюУчастку()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ВыполнениеОпераций,
		"Подразделение",
		Подразделение,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
	УстановитьСвойстваДинамическогоСпискаВыполнениеОпераций(); // Отбор дс ВыполнениеОпераций по участку
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции, 
		"Подразделение", 
		Подразделение, 
		ВидСравненияКомпоновкиДанных.Равно,
		,
		Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Операции,
		"Участок",
		Участок,
		ВидСравненияКомпоновкиДанных.Равно,
		, 
		ТипОтбораПодразделение = 1);
	
	ПараметрыФО = Новый Структура(
		"Подразделение",
		?(ЗначениеЗаполнено(Подразделение), Подразделение, Неопределено));
	УстановитьПараметрыФункциональныхОпцийФормы(ПараметрыФО);
	
КонецПроцедуры

&НаСервере
Процедура УчастокПриИзмененииНаСервере(ИзмененТипОтбора)
	
	Подразделение = ?(Участок.Пустая(),
		Неопределено,
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Участок, "Владелец"));
		
	ПодразделениеПриИзмененииНаСервере(ИзмененТипОтбора);
	
КонецПроцедуры

&НаСервере
Процедура ПодразделениеПриИзмененииНаСервере(ИзмененТипОтбора)
	
	ПрочитатьПараметрыПодразделения();
	
	УстановитьТипРабочегоЦентра(ЭтаФорма);
	УстановитьТипИсполнителя();
	
	УстановитьОтборПоПодразделениюУчастку();
	УстановитьОтборПоРабочемуЦентру();
	УстановитьОтборПоИсполнителю();
	УстановитьОтборПоСменномуЗаданию(ЭтаФорма);
	
	НастроитьЗависимыеЭлементыФормы("Подразделение" + ?(ИзмененТипОтбора, ",ТипОтбораПодразделение", ""));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипИсполнителя()
	
	УправлениеПроизводствомКлиентСервер.УстановитьТипИсполнителя(Исполнитель, ИспользоватьБригадныеНаряды);
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьИнформационноеСообщение()
	
	ИнформационноеСообщение = Неопределено;
	НастроитьЗависимыеЭлементыФормы("ИнформационноеСообщение");
	
КонецПроцедуры

&НаСервере
Процедура СформироватьНадписьУстановленОтборПоЭтапам(СписокЭтапов)
	
	МассивСтрок = Новый Массив;
	
	Если СписокЭтапов.Количество() > 1 Тогда
		
		МассивСтрок.Добавить(НСтр("ru='Установлен отбор по списку этапов';uk='Встановлено відбір за списком етапів'"));
		
	Иначе
		
		РеквизитыЭтапа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СписокЭтапов[0], "Номер, НаименованиеЭтапа"); 
		ПредставлениеЭтапа = Документы.ЭтапПроизводства2_2.ПредставлениеЭтапа(РеквизитыЭтапа);
		
		МассивСтрок.Добавить(НСтр("ru='Установлен отбор по этапу';uk='Встановлено відбір за етапом'"));
		МассивСтрок.Добавить(" ");
		
		МассивСтрок.Добавить(Новый ФорматированнаяСтрока(
			ПредставлениеЭтапа,
			,
			,
			,
			ПолучитьНавигационнуюСсылку(СписокЭтапов[0])));
		
	КонецЕсли;
	
	МассивСтрок.Добавить(" (");
	
	МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='отключить';uk='відключити'"),,,, "ОтключитьОтборПоЭтапу"));
	
	МассивСтрок.Добавить(") ");
	
	ИнформационноеСообщение = Новый ФорматированнаяСтрока(МассивСтрок);
	
	НастроитьЗависимыеЭлементыФормы("ИнформационноеСообщение");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// Оформление цветом ожидающих предшествующие операции
	#Область ВыполнениеОпераций_ОжиданиеПредшествующих
	
	Элемент = ВыполнениеОпераций.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы.Добавить();
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("НачатыПредшествующие");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОжиданиеПредшествующих");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СерыйЦветТекста1);
		
	
	#КонецОбласти 
	
	// Оформление поля Дата в списке операций
	#Область Операции_Дата
	СтандартныеПодсистемыСервер.УстановитьУсловноеОформлениеПоляДата(ЭтаФорма, "Операции.Дата", Элементы.ОперацииДата.Имя);
	#КонецОбласти
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаОперации()
	
	ТекстЗапроса = Операции.ТекстЗапроса;
	
	Документы.ЭтапПроизводства2_2.ВыполнитьПодстановкуПоляПредставлениеЭтапа(ТекстЗапроса, "&ПредставлениеЭтапа", "ОперацииПереопределяемый.Этап");

	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	
	СвойстваСписка.ТекстЗапроса                 = ТекстЗапроса;
	СвойстваСписка.ОсновнаяТаблица              = Операции.ОсновнаяТаблица;
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Операции, СвойстваСписка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаВыполнениеОпераций()
	
	Если СтрНайти(ВыполнениеОпераций.ТекстЗапроса, "&ПредставлениеЭтапа") <> 0
		ИЛИ СтрНайти(ВыполнениеОпераций.ТекстЗапроса, "&Участок") <> 0
			И ТипОтбораПодразделение = 0
		ИЛИ СтрНайти(ВыполнениеОпераций.ТекстЗапроса, "&Участок") = 0
			И ТипОтбораПодразделение = 1 Тогда
			
		ТекстЗапроса = ТекстЗапросаСпискаВыполнениеОпераций();
		
		Документы.ЭтапПроизводства2_2.ВыполнитьПодстановкуПоляПредставлениеЭтапа(
			ТекстЗапроса,
			"&ПредставлениеЭтапа",
			"Очередь.Этап");
		
		СвойстваСписка              = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
		СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
		ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ВыполнениеОпераций, СвойстваСписка);
		
		ВыполнениеОпераций.Параметры.УстановитьЗначениеПараметра(
			"ИспользуетсяГрафикПроизводства",
			УправлениеПроизводством.ИспользуетсяГрафикПроизводства());
			
		ВыполнениеОпераций.Параметры.УстановитьЗначениеПараметра(
			"СтатусРабочийГрафик",
			РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик());
			
	КонецЕсли;
	
	Если ТипОтбораПодразделение = 1 Тогда
		
		ВыполнениеОпераций.Параметры.УстановитьЗначениеПараметра("Участок", Участок);
		
	КонецЕсли;
	
	ВыполнениеОпераций.Порядок.Элементы.Очистить();
	
	Если УправлениеПроизводством.ИспользуетсяГрафикПроизводства() Тогда
	
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("Порядок");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
		ПорядокСписка.Использование = Истина;
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("НачалоЭтапа");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПорядокСписка.Использование = Истина;
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("НачалоСледующегоЭтапа");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПорядокСписка.Использование = Истина;
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("НомерОперации");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПорядокСписка.Использование = Истина;
		
	Иначе
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("Порядок");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Убыв;
		ПорядокСписка.Использование = Истина;
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("Распоряжение.Приоритет");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПорядокСписка.Использование = Истина;
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("Распоряжение.Подразделение.РеквизитДопУпорядочивания");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПорядокСписка.Использование = Истина;
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("Распоряжение.Очередь");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПорядокСписка.Использование = Истина;
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("ДлительностьДоВыпуска");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПорядокСписка.Использование = Истина;
		
		ПорядокСписка = ВыполнениеОпераций.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
		ПорядокСписка.Поле = Новый ПолеКомпоновкиДанных("НомерОперации");
		ПорядокСписка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
		ПорядокСписка.Использование = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаСпискаВыполнениеОпераций()
	
	Результат =
		"ВЫБРАТЬ
		|	Очередь.Распоряжение КАК Распоряжение,
		|	Очередь.Этап КАК Этап,
		|	Очередь.Операция КАК Операция,
		|	Очередь.ИдентификаторОперации КАК ИдентификаторОперации,
		|	Очередь.МаршрутнаяКарта КАК МаршрутнаяКарта,
		|	&ПредставлениеЭтапа КАК ПредставлениеЭтапа,
		|	Очередь.Запланировано КАК Запланировано,
		|	Очередь.Создано КАК Создано,
		|	ВЫБОР
		|		КОГДА Очередь.Запланировано + Очередь.ТребуетПовторения > Очередь.Создано
		|			ТОГДА Очередь.Запланировано + Очередь.ТребуетПовторения - Очередь.Создано
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОжиданиеСоздания,
		|		ВЫБОР
		|			КОГДА Очередь.Запланировано + Очередь.ТребуетПовторения > Очередь.Создано
		|				ТОГДА
		|					ВЫБОР 
		|						КОГДА
		|							ВЫБОР
		|							КОГДА Очередь.Операция.РабочийЦентр ССЫЛКА Справочник.ВидыРабочихЦентров
		|								ТОГДА ЕСТЬNULL(Очередь.Операция.РабочийЦентр.ПараллельнаяЗагрузка, ЛОЖЬ)
		|							ИНАЧЕ ЕСТЬNULL(Очередь.Операция.РабочийЦентр.ВидРабочегоЦентра.ПараллельнаяЗагрузка, ЛОЖЬ)
		|						КОНЕЦ
		|					ТОГДА Очередь.ВремяШтучное
		|				ИНАЧЕ Очередь.ВремяШтучное * (Очередь.Запланировано + Очередь.ТребуетПовторения - Очередь.Создано) / Очередь.Операция.Количество
		|			КОНЕЦ + Очередь.ВремяПЗ
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВремяВыполненияОжиданиеСоздания,
		|	Очередь.ОжиданиеПредшествующих КАК ОжиданиеПредшествующих,
		|	Очередь.НачатыПредшествующие КАК НачатыПредшествующие,
		|	Очередь.МожноВыполнять КАК МожноВыполнять,
		|	Очередь.Выполняется КАК Выполняется,
		|	Операции.МожноПропустить КАК МожноПропустить,
		|	Очередь.Выполнено КАК Выполнено,
		|	Очередь.Пропущено КАК Пропущено,
		|	Очередь.ТребуетПовторения КАК ТребуетПовторения,
		|	Операции.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Очередь.Этап.ПартияПроизводства.ОсновноеИзделиеНоменклатура КАК Номенклатура,
		|	Очередь.Этап.ПартияПроизводства.ОсновноеИзделиеХарактеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА Операции.РабочийЦентр ССЫЛКА Справочник.ВидыРабочихЦентров
		|			ТОГДА Операции.РабочийЦентр
		|		ИНАЧЕ Операции.РабочийЦентр.ВидРабочегоЦентра
		|	КОНЕЦ КАК ВидРабочегоЦентра,
		|	Операции.ВариантНаладки КАК ВариантНаладки,
		|	Очередь.ВремяОбщее КАК ВремяВыполнения,
		|	Очередь.ВремяЕдИзм КАК ВремяЕдИзм,
		|	Очередь.Порядок КАК Порядок,
		|	ВЫБОР
		|		КОГДА &ИспользуетсяГрафикПроизводства
		|				И НЕ График.ЭтапПроизводства ЕСТЬ NULL
		|			ТОГДА График.НачалоЭтапа
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(Очередь.Распоряжение.НачатьНеРанее, СЕКУНДА, ЕСТЬNULL(НормативныйГрафик.ДлительностьДоЗапуска, 0))
		|	КОНЕЦ КАК ДатаНачала,
		|	Очередь.НомерОперации КАК НомерОперации,
		|	Очередь.НомерСледующейОперации КАК НомерСледующейОперации,
		|	График.НачалоЭтапа КАК НачалоЭтапа,
		|	График.НачалоСледующегоЭтапа КАК НачалоСледующегоЭтапа,
		|	НормативныйГрафик.ДлительностьДоВыпуска КАК ДлительностьДоВыпуска
		|ИЗ
		|	РегистрСведений.ОчередьПроизводственныхОпераций КАК Очередь
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК Операции
		|		ПО Очередь.Операция = Операции.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК График
		|		ПО Очередь.Распоряжение = График.Распоряжение
		|			И Очередь.Этап = График.ЭтапПроизводства
		|			И (График.СтатусГрафика = &СтатусРабочийГрафик)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативныйГрафикЭтаповПроизводства КАК НормативныйГрафик
		|		ПО Очередь.Этап = НормативныйГрафик.ЭтапПроизводства
		|ГДЕ
		|	НЕ Очередь.ВАрхиве
		|	И &ТекстОтборПоУчастку";
	
	Результат = СтрЗаменить(Результат, "И &ТекстОтборПоУчастку",
		?(ТипОтбораПодразделение = 0, "",
			"	И (Операции.РабочийЦентр = НЕОПРЕДЕЛЕНО
			|		ИЛИ Операции.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.РабочиеЦентры.ПустаяСсылка)
			|		ИЛИ Операции.РабочийЦентр = ЗНАЧЕНИЕ(Справочник.ВидыРабочихЦентров.ПустаяСсылка)
			|		ИЛИ Операции.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
			|			И Операции.РабочийЦентр.Участок = &Участок
			|		ИЛИ Операции.РабочийЦентр ССЫЛКА Справочник.ВидыРабочихЦентров
			|			И ИСТИНА В
			|				(ВЫБРАТЬ ПЕРВЫЕ 1
			|					ИСТИНА
			|				ИЗ
			|					Справочник.РабочиеЦентры КАК Т
			|				ГДЕ
			|					Т.ВидРабочегоЦентра = Операции.РабочийЦентр
			|					И Т.Участок = &Участок))"));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура НастроитьЗависимыеЭлементыФормы(СписокРеквизитов = "")
	
	Инициализация = ПустаяСтрока(СписокРеквизитов);
	СтруктураРеквизитов = Новый Структура(СписокРеквизитов);
	
	Если Инициализация ИЛИ СтруктураРеквизитов.Свойство("Подразделение") Тогда
		
		Элементы.ОтборИсполнительЗаголовок.Видимость = ИспользоватьСменныеЗадания;
		Элементы.Исполнитель1.Видимость              = ИспользоватьСменныеЗадания;
		Элементы.ОтборСтатусЗаголовок.Видимость      = ИспользоватьСменныеЗадания;
		Элементы.ОтборСтатус1.Видимость              = ИспользоватьСменныеЗадания;
		Элементы.ОтборСменаЗаголовок.Видимость       = ИспользоватьСменныеЗадания;
		Элементы.ОтборСмена.Видимость                = ИспользоватьСменныеЗадания;
		Элементы.ОперацииСменноеЗадание.Видимость    = ИспользоватьСменныеЗадания;
		
		Элементы.Исполнитель.Видимость                = Не ИспользоватьСменныеЗадания;
		Элементы.ОтборСтатус.Видимость                = Не ИспользоватьСменныеЗадания;
		Элементы.СтраницаВыполнениеОпераций.Видимость = Не ИспользоватьСменныеЗадания;
		
		Если ИспользоватьСменныеЗадания Тогда
			
			Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаЖурналОпераций;
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
			
		Иначе
			
			Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Инициализация ИЛИ СтруктураРеквизитов.Свойство("ТипОтбораПодразделение") Тогда
		
		Элементы.ОтборПодразделение.Видимость = (ТипОтбораПодразделение = 0);
		Элементы.ОтборУчасток.Видимость       = (ТипОтбораПодразделение = 1);
		
		Связи = Новый Массив;
		Связи.Добавить(Новый СвязьПараметраВыбора("Отбор.Подразделение", "Подразделение"));
		Если ТипОтбораПодразделение = 1 Тогда
			Связи.Добавить(Новый СвязьПараметраВыбора("Отбор.Участок", "Участок"));
		КонецЕсли;
		
		Элементы.ОтборРабочийЦентр.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
		Элементы.ОтборСмена.СвязиПараметровВыбора = Новый ФиксированныйМассив(Связи);
		
	КонецЕсли;
	
	Если Инициализация ИЛИ СтруктураРеквизитов.Свойство("Состояние") Тогда
		
		Если ТолькоАктивныеСостояния(Состояние) Тогда
			СостояниеСтрока = НСтр("ru='Незавершенные';uk='Незавершені'");
		Иначе
			СостояниеСтрока = СтрСоединить(Состояние.ВыгрузитьЗначения(), ";");
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураРеквизитов.Свойство("ИнформационноеСообщение") Тогда
		
		ЗаполненоИнформационноеСообщение = ЗначениеЗаполнено(ИнформационноеСообщение);
		
		Элементы.ИнформационноеСообщение1.Видимость = ЗаполненоИнформационноеСообщение;
		Элементы.ИнформационноеСообщение2.Видимость = ЗаполненоИнформационноеСообщение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуНазначениеОпераций(КлючиОпераций, РежимРаботы)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Подразделение", Подразделение);
	ПараметрыФормы.Вставить("РежимРаботы", РежимРаботы);
	ПараметрыФормы.Вставить("КлючиОпераций", КлючиОпераций);
	
	Если ТипОтбораРабочийЦентр = 1 И ЗначениеЗаполнено(РабочийЦентр) Тогда
		ПараметрыФормы.Вставить("РабочийЦентр", РабочийЦентр);
	КонецЕсли;
	
	Если ТипОтбораПодразделение = 1 И ЗначениеЗаполнено(Участок) Тогда
		ПараметрыФормы.Вставить("Участок", Участок);
	КонецЕсли;
	
	СтатусОперации = Неопределено;
	Если РежимРаботы = "Назначить" Тогда
		СтатусОперации = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Создана");
	ИначеЕсли РежимРаботы = "ПринятьВРаботу" Тогда
		СтатусОперации = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполняется");
	ИначеЕсли РежимРаботы = "ОтметитьВыполнение" Тогда
		СтатусОперации = ПредопределенноеЗначение("Перечисление.СтатусыПроизводственныхОпераций.Выполнена");
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("КлючиОпераций", КлючиОпераций);
	ДопПараметры.Вставить("СтатусОперации", СтатусОперации);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОткрытьФормуНазначениеОперацийЗавершение",
		ЭтотОбъект,
		ДопПараметры);
	
	ОткрытьФорму("Обработка.ВыполнениеОпераций2_2.Форма.НазначениеОпераций",
		ПараметрыФормы,
		ЭтаФорма,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНазначениеОперацийЗавершение(ПараметрыНазначения, ДополнительныеПараметры) Экспорт
	
	Если ПараметрыНазначения <> Неопределено Тогда
		
		ОперативныйУчетПроизводстваКлиент.СформироватьПроизводственныеОперации(
			Подразделение, ДополнительныеПараметры.КлючиОпераций, ПараметрыНазначения, ДополнительныеПараметры.СтатусОперации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОткрытьФормуСпискаОпераций(КлючиОпераций, РежимРаботы)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Подразделение", Подразделение);
	ПараметрыФормы.Вставить("РежимРаботы", РежимРаботы);
	ПараметрыФормы.Вставить("КлючОперации", КлючиОпераций[0]);
	
	ОткрытьФорму("Обработка.ВыполнениеОпераций2_2.Форма.СписокОпераций",
		ПараметрыФормы,
		ЭтаФорма,
		,
		,
		,
		,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции

&НаКлиенте
Процедура ИсполнительНачалоВыбораЗавершение(Результат, Параметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		
		Исполнитель = Результат;
		УстановитьОтборПоИсполнителю();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИсполнительПолучениеДанныхВыбора(ДанныеВыбора, Текст, Подразделение)
	
	ДанныеВыбора = Новый СписокЗначений;
	ПараметрыОтбора = Новый Структура("Организация, Подразделение");
	ПараметрыОтбора.Подразделение = Подразделение;
	ПроизводствоСервер.ЗаполнитьДанныеВыбораПриВводеИсполнителя(ДанныеВыбора, Текст, ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьТипРабочегоЦентра(Форма)
	
	Если Форма.ТипОтбораРабочийЦентр = 0 Тогда
		ДопустимыйТип = Новый ОписаниеТипов("СправочникСсылка.ВидыРабочихЦентров");
	Иначе
		ДопустимыйТип = Новый ОписаниеТипов("СправочникСсылка.РабочиеЦентры");
	КонецЕсли;
	
	Форма.РабочийЦентр = ДопустимыйТип.ПривестиЗначение(Форма.РабочийЦентр);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если МассивСсылок.Количество() > 0 Тогда
		Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаВыполнениеОпераций Тогда
			ПоказатьЗначение(Неопределено, МассивСсылок[0]);
		Иначе
			Элементы.Операции.ТекущаяСтрока = МассивСсылок[0];
			Если Элементы.Операции.ТекущаяСтрока = Неопределено Тогда
				ПоказатьЗначение(Неопределено, МассивСсылок[0]);
			КонецЕсли;
		КонецЕсли;
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ПроизводственнаяОперация2_2.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

&НаСервере
Процедура ОперацииНазначитьРабочийЦентрНаСервере(Операции, РабочийЦентр)
	
	Документы.ПроизводственнаяОперация2_2.НазначитьРабочийЦентрОперациям(Операции, РабочийЦентр);
	
	Элементы.Операции.Обновить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция АктивныеСостояния()
	
	Состояния = Новый Массив;
	
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияВыполненияОпераций.ОжиданиеПредшествующих"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияВыполненияОпераций.НачатаПредшествующая"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияВыполненияОпераций.МожноВыполнять"));
	Состояния.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияВыполненияОпераций.Выполняется"));
	
	Возврат Состояния;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТолькоАктивныеСостояния(СписокСостояний)
	
	АктивныеСостояния = АктивныеСостояния();
	
	Если АктивныеСостояния.Количество() <> СписокСостояний.Количество() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого ЭлементКоллекции Из СписокСостояний Цикл
		Если АктивныеСостояния.Найти(ЭлементКоллекции.Значение) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ПрочитатьПараметрыПодразделения()
	
	Если Подразделение.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(
		ЭтаФорма,
		ПроизводствоСервер.ПараметрыПроизводственногоПодразделения(Подразделение),
		"ИспользоватьСменныеЗадания,ИспользоватьБригадныеНаряды");
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьПолучитьВыделенныеВСпискеОперации(ВыделенныеСтроки)
	
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		
		Результат = Неопределено;
		
		ПоказатьПредупреждение(, НСтр("ru='Не выбраны операции для выполнения действия';uk='Не вибрані операції для виконання дії'"));
		
	Иначе
		
		Результат = Новый Массив;
		
		Для каждого Строка Из ВыделенныеСтроки Цикл
			
			Если ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				
				ПоказатьПредупреждение(, НСтр("ru='Действие не может быть выполнено для строки группировки списка';uk='Дію не може бути виконано для рядка групування списку'"));
				
				Результат = Неопределено;
				Прервать;
				
			Иначе
				
				Результат.Добавить(Строка);
				
			КонецЕсли;
		
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
