
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.ИмяРеквизита = "НаправлениеДеятельности" Тогда
		Заголовок = НСтр("ru='История изменения направления деятельности';uk='Історія зміни напряму діяльності'");
	КонецЕсли; 
	
	ИсторияИзменений.Загрузить(Справочники.НематериальныеАктивы.ИсторияИзмененияРеквизита(Параметры.НематериальныйАктив, Параметры.ИмяРеквизита));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИсторияИзменений

&НаКлиенте
Процедура ИсторияИзмененийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПоказатьЗначение(, Элементы.ИсторияИзменений.ТекущиеДанные.Документ);
	
КонецПроцедуры

#КонецОбласти
