#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(
		Истина, "Обработка.ЖурналДокументовОС.Команда.ДокументыПоОС");
	
	КлючНазначенияФормыПоУмолчанию = КлючНазначенияФормыПоУмолчанию();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючНазначенияФормы", КлючНазначенияФормыПоУмолчанию);
	
	ОткрытьФорму("Обработка.ЖурналДокументовОС.Форма.ДокументыПоОС", 
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		Ложь, 
		ПараметрыВыполненияКоманды.Окно, 
		ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КлючНазначенияФормыПоУмолчанию()
	Возврат Обработки.ЖурналДокументовОС.КлючНазначенияФормыПоУмолчанию();
КонецФункции

#КонецОбласти


