#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализНДФЛПоМесяцам");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	НастройкиВарианта.Описание =
		НСтр("ru = '(Упрощенный) Налогооблагаемая сумма, примененные вычеты, сопоставление исчисленного, 
		|удержанного и перечисленного налогов по месяцам налогового периода';
		|en = '(Simplified) Amount subject to taxation, applied deductions, mapping of calculated,
		| deducted and transferred taxes by fiscal period months'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализУплатыНДФЛ");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	НастройкиВарианта.Описание =
		НСтр("ru = 'Удержанный и уплаченный НДФЛ. Не актуален с 2016 г.
		|При уплате НДФЛ одновременно с выплатой зарплаты 
		|задолженность не образуется';
		|en = 'Deducted and paid PIT. Invalid since 2016.
		|There is no debt if PIT payment and salary payment
		| are simultaneous'");
	НастройкиВарианта.Размещение.Очистить();
	НастройкиВарианта.Размещение.Вставить(, "СмТакже");
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СводнаяСправка");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	НастройкиВарианта.Описание =
		НСтр("ru = '(Упрощенный) Краткая информация, отображаемая в справках 2-НДФЛ';
			|en = '(Simplified) Short profile displayed in 2-NDFL statements'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли