#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы);
	
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиОтчета, ДанныеРасшифровки);

	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	КомпоновкаДанныхСервер.СкрытьВспомогательныеПараметрыОтчета(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ВспомогательныеПараметрыОтчета());
	
	// Сообщим форме отчета, что настройки модифицированы
	Если ПользовательскиеНастройкиМодифицированы Тогда
		КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ПользовательскиеНастройкиМодифицированы", Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОбязательныеНастройки(ПользовательскиеНастройкиМодифицированы)
	
	// Строковые литералы
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаКасса",				НСтр("ru = 'Касса';
																											|en = 'Cash account'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаБанк",				НСтр("ru = 'Банк';
																											|en = 'Bank'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаБанкКасса",			НСтр("ru = 'Банк или касса';
																											|en = 'Bank or cash account'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаПлатежнаяКарта",	НСтр("ru = 'Платежная карта';
																										|en = 'Payment card'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаПодотчетник",		НСтр("ru = 'Подотчетник';
																											|en = 'Advance holder'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "СтрокаСклад",				НСтр("ru = 'Склад';
																											|en = 'Warehouse'"));
	
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииКонвертацияНаличная",      НСтр("ru = 'Конвертация наличной валюты';
																														|en = 'Conversion of currency in cash'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииКонвертацияБезналичная",   НСтр("ru = 'Поступление сконвертированной безналичной валюты на счет';
																														|en = 'Receipt of converted electronic currency to account'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииЭквайрингПоступление",     НСтр("ru = 'Поступление от банка по эквайрингу';
																														|en = 'Receipt from bank by acquiring'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииЭквайрингОплата",          НСтр("ru = 'Оплата от клиента платежной картой';
																														|en = 'Payment from customer by payment card'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииЭквайрингВозврат",         НСтр("ru = 'Возврат оплаты по платежной карте';
																														|en = 'Return payment by payment card'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииВыдачаПодотчет",           НСтр("ru = 'Выдача аванса';
																														|en = 'Advance payment issue'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииЗачислениеНаДругойСчет",   НСтр("ru = 'Зачисление при перечислении на другой счет';
																														|en = 'Bank receipt in case of transfer to other account'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеМеждуКассами",  НСтр("ru = 'Перемещение ДС между кассами организации';
																														|en = 'Cash transfer between company cash accounts'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеИзКассыВБанк",  НСтр("ru = 'Передача наличных из кассы в банк';
																														|en = 'Cash transfer from cash account to the bank'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеИзБанкаВКассу", НСтр("ru = 'Получение наличных из банка в кассу';
																														|en = 'Cash receipt from bank to cash account'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеИзКассыККМ",    НСтр("ru = 'Выемка ДС из кассы ККМ';
																														|en = 'Cash withdrawal out of cash register'"));
	КомпоновкаДанныхКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ТекстОперацииПеремещениеВКассуККМ",     НСтр("ru = 'Внесение ДС в кассу ККМ';
																														|en = 'Deposit cash into cash register'"));
	
КонецПроцедуры

Функция ВспомогательныеПараметрыОтчета()
	
	ВспомогательныеПараметры = Новый Массив;
	
	ВспомогательныеПараметры.Добавить("ДетальноеОтображениеОтправителейПолучателей");
	ВспомогательныеПараметры.Добавить("ДатаИВремяОперации");
	
	КомпоновкаДанныхСервер.ДобавитьВспомогательныеПараметрыОтчетаПоФункциональнымОпциям(ВспомогательныеПараметры);
	
	Возврат ВспомогательныеПараметры;

КонецФункции

#КонецОбласти

#КонецЕсли