#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет список команд создания на основании.
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСозданияНаОсновании, Параметры) Экспорт
	
	
	
КонецПроцедуры

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

// Проверяет, есть ли контролируемые сделки созданные по этому уведомлению.
//	Параметры:
//		Уведомление - ДокументСсылка.УведомлениеОКонтролируемыхСделках - ссылка на документ уведомления,
// 			для которого проверяется наличие созданных контролируемых сделок.
//	Возвращаемое значение:
//		Булево - истина, если ранее уже были созданы контролируемые сделки.
//
Функция ДанныеАвтоматическогоЗаполненияПодготовлены(Уведомление) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтролируемыеСделкиОрганизаций.Регистратор
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|ГДЕ
	|	КонтролируемыеСделкиОрганизаций.Регистратор = &Уведомление";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// Проверяет, есть ли контролируемые сделки созданные по этому уведомлению.
// В отличие от "ДанныеАвтоматическогоЗаполненияПодготовлены" проверяются только не помеченные на удаление.
//	Параметры:
//		Уведомление - ДокументСсылка.УведомлениеОКонтролируемыхСделках - ссылка на документ уведомления,
// 			для которого проверяется наличие созданных контролируемых сделок.
//	Возвращаемое значение:
//		Булево - истина, если ранее уже были созданы контролируемые сделки.
//
Функция УведомлениеЗаполнено(Уведомление) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке
	|ИЗ
	|	Документ.КонтролируемаяСделка КАК КонтролируемаяСделка
	|ГДЕ
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке = &Уведомление
	|	И НЕ КонтролируемаяСделка.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

// На основании данных документов оперативного контура подготавливает таблицу для записи в регистр накопления "КонтролируемыеСделкиОрганизаций".
//	Параметры:
//		Уведомление - ДокументСсылка.УведомлениеОКонтролируемыхСделках - ссылка на документ уведомления,
// 			для которого подготавливаются данные.
//
Процедура ПодготовитьДанныеАвтоматическогоЗаполнения(Уведомление) Экспорт
	
	МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление);	
	
	ТаблицаСделок = ТаблицаСделок();
	
	ТаблицаСделок.Очистить();
	
	СтруктураПараметров = СтруктураПараметровЗапросаКДокументамИсточникам(Уведомление);
	
	// Документы продажи:
	ДобавитьСделкиРеализацииТоваровУслуг(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиРеализацииУслугПрочихАктивов(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиАктаВыполненныхРабот(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиВозвратаТоваровОтПокупателя(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиРеализаций") Тогда
		ДобавитьСделкиКорректировкиРеализации(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	
	// Документы покупки:
	ДобавитьСделкиПриобретенияТоваровУслуг(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиПоступленияУслугПрочихАктивов(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	ДобавитьСделкиВозвратаТоваровПоставщику(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиПриобретений") Тогда
		ДобавитьСделкиКорректировкиПоступления(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	
	// Комиссия:
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриЗакупках") Тогда
		ДобавитьСделкиОтчетаКомитентуОПродажах(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
		ДобавитьСделкиОтчетаКомитентуОСписании(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКомиссиюПриПродажах") Тогда
		ДобавитьСделкиОтчетаКомиссионераОПродажах(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
		ДобавитьСделкиОтчетаКомиссионераОПродажахЗависимымЛицам(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
		ДобавитьСделкиОтчетаКомиссионераОСписании(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	
	// Интеркомпани:
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПередачиТоваровМеждуОрганизациями") Тогда
		ДобавитьСделкиПередачиТоваровМеждуОрганизациями_ОрганизацияОтправитель(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
		ДобавитьСделкиПередачиТоваровМеждуОрганизациями_ОрганизацияПолучатель(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
		ДобавитьСделкиОтчетПоКомиссииМеждуОрганизациями(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
		ДобавитьСделкиВозвратаТоваровМеждуОрганизациями(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	//++ НЕ УТКА
	// Переработчик:
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоНаСтороне") Тогда
		ДобавитьСделкиОтчетаПереработчика(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	
	// Давалец:
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоИзДавальческогоСырья") Тогда
		ДобавитьСделкиОтчетаДавальцу(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	//-- НЕ УТКА
	
	// Лизинг:
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЛизинг") Тогда
		ДобавитьСделкиПоступленияУслугПоЛизингу(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	
	// Возвратная тара:
	Если ПолучитьФункциональнуюОпцию("ИспользоватьМногооборотнуюТару") Тогда
		ДобавитьСделкиВыкупаВозвратнойТарыКлиентом(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
		ДобавитьСделкиВыкупаВозвратнойТарыУПоставщика(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
	
	// Другое:
	Если ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыКредитовИДепозитов") Тогда
		ДобавитьСделкиНачисленияКредитовИДепозитов(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок);
	КонецЕсли;
		
	ТаблицаСделок.Колонки.Добавить("Уведомление", Новый ОписаниеТипов("ДокументСсылка.УведомлениеОКонтролируемыхСделках"));
	ТаблицаСделок.ЗаполнитьЗначения(Уведомление, "Уведомление");
	
	КонтролируемыеСделкиНаборЗаписей = РегистрыНакопления.КонтролируемыеСделкиОрганизаций.СоздатьНаборЗаписей();
	КонтролируемыеСделкиНаборЗаписей.Отбор.Регистратор.Значение = Уведомление;

	КонтролируемыеСделкиНаборЗаписей.Загрузить(ТаблицаСделок);
	
	НачатьТранзакцию();
	Попытка
		КонтролируемыеСделкиНаборЗаписей.Записать();
		ОбъектУведомление = Уведомление.ПолучитьОбъект();
		ОбъектУведомление.ДатаФормированияСпискаСделок = ТекущаяДатаСеанса();
		ОбъектУведомление.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьВЖурналРегистрации = НСтр("ru = 'Выполнение операции записи уведомления по контролируемым сделкам';
										|en = 'Writing controlled transaction notification'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()); // строка записывается в ИБ
		ЗаписьЖурналаРегистрации(ЗаписьВЖурналРегистрации, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

// На основании ранее подготовленных данных в регистре накопления "КонтролируемыеСделкиОрганизаций" создает документы "КонтролируемыеСделки".
//
//		Уведомление - ДокументСсылка.УведомлениеОКонтролируемыхСделках - ссылка на документ уведомления,
// 			для которого создаются данные по контролируемым сделкам.
//
Процедура СформироватьКонтролируемыеСделкиУведомления(Уведомление) Экспорт
	
	ПараметрыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "Организация, ОтчетныйГод");
	
	ТаблицаЛистов1А = ПометитьНаУдалениеКонтролируемыеСделкиУведомления(Уведомление);
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияУведомления(Уведомление);
	Запрос.Параметры.Вставить("ВалютаРегламентированногоУчета",
		ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтролируемыеСделки.Организация КАК Организация,
	|	КонтролируемыеСделки.Уведомление КАК УведомлениеОКонтролируемойСделке,
	|	КонтролируемыеСделки.ПериодСделки КАК ДатаСовершенияСделки,
	|	КонтролируемыеСделки.ТипВзаимозависимости КАК ТипВзаимозависимости,
	|	КонтролируемыеСделки.Контрагент КАК Контрагент,
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	КонтролируемыеСделки.Договор КАК Договор,
	|	КонтролируемыеСделки.Валюта <> &ВалютаРегламентированногоУчета КАК РасчетыВУсловныхЕдиницах,
	|	КонтролируемыеСделки.Комиссионер <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК СделкаСовершенаЧерезКомиссионера,
	|	КонтролируемыеСделки.Комиссионер КАК Комиссионер,
	|	КонтролируемыеСделки.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделки.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу КАК Строка121СтороныВзаимозависимыПоКодексу,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли КАК Строка122СделкаВОбластиВнешнейТорговли,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.СделкаСНезависимымПосредником КАК Строка124СделкаСНезависимымПосредником,
	|	ВЫБОР
	|		КОГДА НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ КАК Строка132СделкаСПлательщикомНДПИ,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	КонтролируемыеСделки.СуммаБезНДСВРублях КАК Стоимость,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.Валюта = &ВалютаРегламентированногоУчета
	|			ТОГДА (КонтролируемыеСделки.СуммаБезНДСВРублях)
	|		ИНАЧЕ (КонтролируемыеСделки.СуммаБезНДСВВалютеРасчетов)
	|	КОНЕЦ КАК СтоимостьВВалюте,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ КАК КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль КАК Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ КАК Строка135СделкаСРезидентомОЭЗ,
	|	КонтролируемыеСделки.СделкаМорскогоМесторождения КАК Строка136СделкаМорскогоМесторождения,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам КАК Строка137СделкаИнвестиционныйПроект,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС КАК Строка138СделкаОсвобождениеОтНДС,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету КАК Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемыеСделки.Соглашение.КодНаименованияСделки, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|						ТОГДА ""019""
	|					ИНАЧЕ ""015""
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(КонтролируемыеСделки.Соглашение.КодНаименованияСделки, """")
	|	КОНЕЦ КАК КодНаименованияСделки,
	|	ЕСТЬNULL(КонтролируемыеСделки.Соглашение.СпособОпределенияЦеныСделки, ЗНАЧЕНИЕ(Справочник.СпособыОпределенияЦенКонтролируемыхСделок.ПустаяСсылка)) КАК СпособОпределенияЦеныСделки,
	|	ЕСТЬNULL(КонтролируемыеСделки.Соглашение.КодУсловийПоставки, """") КАК КодУсловийПоставки,
	|	КонтролируемыеСделки.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемыеСделки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КонтролируемыеСделки.ТипКонтролируемойСделки КАК ТипСделки,
	|	КонтролируемыеСделки.Грузоотправитель КАК Грузоотправитель,
	|	КонтролируемыеСделки.Грузополучатель КАК Грузополучатель,
	|	КонтролируемыеСделки.Валюта КАК Валюта,
	|	КонтролируемыеСделки.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА СУММА(КонтролируемыеСделки.Количество)
	|		ИНАЧЕ СРЕДНЕЕ(КонтролируемыеСделки.Количество)
	|	КОНЕЦ КАК Количество,
	|	СРЕДНЕЕ(КонтролируемыеСделки.ПроцентнаяСтавка) КАК ПроцентнаяСтавка,
	|	МАКСИМУМ(КонтролируемыеСделки.ДатаПроцентнойСтавки) КАК ДатаПроцентнойСтавки,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодТНВЭД, ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ КАК КодТНВЭД,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодОКП, ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторПродукции.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторПродукции.ПустаяСсылка)
	|	КОНЕЦ КАК КодОКП,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки <> ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодОКВЭД, ЗНАЧЕНИЕ(Справочник.КлассификаторВидовЭкономическойДеятельности.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторВидовЭкономическойДеятельности.ПустаяСсылка)
	|	КОНЕЦ КАК КодОКВЭД,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодОКПД2, ЗНАЧЕНИЕ(Справочник.КлассификаторОКПД2.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторОКПД2.ПустаяСсылка)
	|	КОНЕЦ КАК КодОКПД2,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки <> ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодОКВЭД2, ЗНАЧЕНИЕ(Справочник.КлассификаторОКВЭД2.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторОКВЭД2.ПустаяСсылка)
	|	КОНЕЦ КАК КодОКВЭД2,
	|	КонтролируемыеСделки.СтранаПроисхожденияПредметаСделки КАК СтранаПроисхожденияПредметаСделки,
	|	ЕСТЬNULL(КонтролируемыеСделки.Договор.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДоговора,
	|	ЕСТЬNULL(КонтролируемыеСделки.Договор.Номер, """") КАК НомерДоговора
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОбщейСумме КАК КонтрагентыКонтролируемыеПоОбщейСумме
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоНДПИ КАК КонтрагентыКонтролируемыеПоНДПИ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоСпецРежиму КАК КонтрагентыКонтролируемыеПоСпецРежиму
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоПрибыли КАК КонтрагентыКонтролируемыеПоПрибыли
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОЭЗ КАК КонтрагентыКонтролируемыеПоОЭЗ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоМорскомуМесторождению КАК КонтрагентыКонтролируемыеПоМорскомуМесторождению
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоМорскомуМесторождению.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаМорскогоМесторождения)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам КАК КонтрагентыКонтролируемыеПоИнвестиционнымПроектам
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоИнвестиционнымПроектам.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоОсвобождениюНДС КАК КонтрагентыКонтролируемыеПоОсвобождениюНДС
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоОсвобождениюНДС.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоИнвестиционномуВычету КАК КонтрагентыКонтролируемыеПоИнвестиционномуВычету
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоИнвестиционномуВычету.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету)
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ КАК КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|		ПО КонтролируемыеСделки.ГоловнойКонтрагент = КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент
	|			И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|				ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|ГДЕ
	|	КонтролируемыеСделки.ГоловнойКонтрагент В
	|			(ВЫБРАТЬ
	|				КонтрагентыПоМинимальнойСумме.ГоловнойКонтрагент
	|			ИЗ
	|				КонтрагентыПоМинимальнойСумме КАК КонтрагентыПоМинимальнойСумме)
	|	И (КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ИЛИ КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу
	|				И НЕ КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоНДПИ.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоСпецРежиму.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоПрибыли.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоОЭЗ.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоМорскомуМесторождению.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоОсвобождениюНДС.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоИнвестиционномуВычету.ГоловнойКонтрагент ЕСТЬ NULL
	|			ИЛИ НЕ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ.ГоловнойКонтрагент ЕСТЬ NULL)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.Организация,
	|	КонтролируемыеСделки.Уведомление,
	|	КонтролируемыеСделки.ПериодСделки,
	|	КонтролируемыеСделки.ТипВзаимозависимости,
	|	КонтролируемыеСделки.Контрагент,
	|	КонтролируемыеСделки.Комиссионер,
	|	КонтролируемыеСделки.ГоловнойКонтрагент,
	|	КонтролируемыеСделки.Договор,
	|	КонтролируемыеСделки.ПредметСделки,
	|	КонтролируемыеСделки.НаименованиеПредметаСделки,
	|	КонтролируемыеСделки.СтороныВзаимозависимыПоКодексу,
	|	КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	КонтролируемыеСделки.СделкаСНезависимымПосредником,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ,
	|	КонтролируемыеСделки.СуммаБезНДСВРублях,
	|	КонтролируемыеСделки.СуммаБезНДСВВалютеРасчетов,
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	КонтролируемыеСделки.СделкаМорскогоМесторождения,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС,
	|	КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету,
	|	КонтролируемыеСделки.ТипПредметаСделки,
	|	КонтролируемыеСделки.ЕдиницаИзмерения,
	|	КонтролируемыеСделки.СтранаПроисхожденияПредметаСделки,
	|	КонтролируемыеСделки.ТипКонтролируемойСделки,
	|	КонтролируемыеСделки.Грузоотправитель,
	|	КонтролируемыеСделки.Грузополучатель,
	|	КонтролируемыеСделки.Валюта,
	|	КонтролируемыеСделки.РасчетныйДокумент,
	|	КонтролируемыеСделки.СтранаПроисхожденияПредметаСделки,
	|	ВЫБОР
	|		КОГДА НЕ КонтрагентыКонтролируемыеПоОбщейСумме.ГоловнойКонтрагент ЕСТЬ NULL 
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|				ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемыеСделки.Соглашение.КодНаименованияСделки, """") = """"
	|			ТОГДА ВЫБОР
	|					КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|						ТОГДА ""019""
	|					ИНАЧЕ ""015""
	|				КОНЕЦ
	|		ИНАЧЕ ЕСТЬNULL(КонтролируемыеСделки.Соглашение.КодНаименованияСделки, """")
	|	КОНЕЦ,
	|	ЕСТЬNULL(КонтролируемыеСделки.Соглашение.СпособОпределенияЦеныСделки, ЗНАЧЕНИЕ(Справочник.СпособыОпределенияЦенКонтролируемыхСделок.ПустаяСсылка)),
	|	ЕСТЬNULL(КонтролируемыеСделки.Соглашение.КодУсловийПоставки, """"),
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодТНВЭД, ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторТНВЭД.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодОКП, ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторПродукции.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторПродукции.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодОКПД2, ЗНАЧЕНИЕ(Справочник.КлассификаторОКПД2.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторОКПД2.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки <> ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодОКВЭД2, ЗНАЧЕНИЕ(Справочник.КлассификаторОКВЭД2.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторОКВЭД2.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КонтролируемыеСделки.ТипПредметаСделки <> ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ЕСТЬNULL(КонтролируемыеСделки.ПредметСделки.КодОКВЭД, ЗНАЧЕНИЕ(Справочник.КлассификаторВидовЭкономическойДеятельности.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КлассификаторВидовЭкономическойДеятельности.ПустаяСсылка)
	|	КОНЕЦ,
	|	ЕСТЬNULL(КонтролируемыеСделки.Договор.Дата, ДАТАВРЕМЯ(1, 1, 1)),
	|	ЕСТЬNULL(КонтролируемыеСделки.Договор.Номер, """")
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ГоловнойКонтрагент,
	|	Контрагент,
	|	Договор,
	|	ПредметСделки,
	|	Строка121СтороныВзаимозависимыПоКодексу,
	|	Строка122СделкаВОбластиВнешнейТорговли,
	|	Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	Строка124СделкаСНезависимымПосредником,
	|	Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	Строка132СделкаСПлательщикомНДПИ,
	|	Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	Строка135СделкаСРезидентомОЭЗ,
	|	Строка136СделкаМорскогоМесторождения,
	|	Строка137СделкаИнвестиционныйПроект,
	|	Строка138СделкаОсвобождениеОтНДС,
	|	Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль,
	|	КодНаименованияСделки,
	|	ТипВзаимозависимости,
	|	ТипПредметаСделки,
	|	НаименованиеПредметаСделки,
	|	ТипСделки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	КлючСделки = Новый Структура("Контрагент, Договор, СделкаСовершенаЧерезКомиссионера, Комиссионер,
		|ПредметСделки, Строка121СтороныВзаимозависимыПоКодексу, Строка122СделкаВОбластиВнешнейТорговли,
		|Строка123СделкаСКонтрагентомСЛьготнымНалогообложением, Строка124СделкаСНезависимымПосредником,
		|Строка131СуммаДоходовПоСделкамПревышаетПредел, Строка132СделкаСПлательщикомНДПИ,
		|Строка133СделкаСКонтрагентомНаСпецрежимах, Строка134СделкаСПлательщикомНалогаНаПрибыль,
		|Строка135СделкаСРезидентомОЭЗ, Строка136СделкаМорскогоМесторождения, Строка137СделкаИнвестиционныйПроект,
		|Строка138СделкаОсвобождениеОтНДС, ТипВзаимозависимости, ТипПредметаСделки, НаименованиеПредметаСделки,
		|КодНаименованияСделки, ТипСделки, Валюта");
	
	ВерсияУведомления = Документы.УведомлениеОКонтролируемыхСделках.ВерсияУведомления(Уведомление);
	
	СтруктураКлючевыхПолей = Новый Структура();
	СтруктураКлючевыхПолей.Вставить("РасчетныйДокумент");
	СтрокаСверткиТаблицыСделок = "";
	Для Каждого РеквизитСделки Из Метаданные.Документы.КонтролируемаяСделка.ТабличныеЧасти.Сделки.Реквизиты Цикл
		Если РеквизитСделки.Имя <> "Количество" И РеквизитСделки.Имя <> "Стоимость" Тогда
			СтруктураКлючевыхПолей.Вставить(РеквизитСделки.Имя);
			СтрокаСверткиТаблицыСделок = СтрокаСверткиТаблицыСделок 
				+ ?(СтрокаСверткиТаблицыСделок = "","",", ") + РеквизитСделки.Имя;
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "ГруппироватьСделкиСОдинаковойЦеной") Тогда
		СтруктураКлючевыхПолей.Удалить("ДатаСовершенияСделки");
		СтруктураКлючевыхПолей.Удалить("РасчетныйДокумент");
		Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
			СтруктураКлючевыхПолей.Удалить("ПроцентнаяСтавка");
		КонецЕсли;
	КонецЕсли;
	
	МетаданныеРегистра = Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций;
	
	ТаблицаСделокЛиста1А = Документы.КонтролируемаяСделка.ПустаяСсылка().Сделки.Выгрузить();
	ТаблицаСделокЛиста1А.Колонки.Добавить("СтоимостьДляРасчетаЦены", МетаданныеРегистра.Ресурсы.СуммаНДСВВалютеРасчетов.Тип);
	ТаблицаСделокЛиста1А.Колонки.Добавить("РасчетныйДокумент", МетаданныеРегистра.Измерения.РасчетныйДокумент.Тип);
	ТекущийНомерЛиста1А = 1;
	
	ИсключенияДляЗаполненияЛиста1А = ИсключенияЗаполненияЛиста1А(ВерсияУведомления);
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		ПолеОпределенияСтоимостиДляРасчетаЦены = "Стоимость";
	Иначе
		ПолеОпределенияСтоимостиДляРасчетаЦены = "СтоимостьВВалюте";
	КонецЕсли;
	
	ДокументСделки = Неопределено;
	Пока Выборка.Следующий() Цикл
		Если ДокументСделки = Неопределено ИЛИ
			НЕ КлючСделкиСовпадает(Выборка, КлючСделки) Тогда
			
			ЗаполнитьЗначенияСвойств(КлючСделки, Выборка);
			
			Если ДокументСделки <> Неопределено Тогда
				ЗаполнитьТаблицуСделокЛиста1А(ДокументСделки, ТаблицаСделокЛиста1А, СтрокаСверткиТаблицыСделок, СтруктураКлючевыхПолей);
				ДокументСделки.Записать();
				ТаблицаСделокЛиста1А.Очистить();
				ДокументСделки = Неопределено;
				ТекущийНомерЛиста1А = ТекущийНомерЛиста1А + 1;
			КонецЕсли;
			
			Отбор = Новый Структура("Контрагент, Договор, ПредметСделки, Используется");
			ЗаполнитьЗначенияСвойств(Отбор, КлючСделки);
			Отбор.Используется = Ложь;
			
			ДокументыСделок = ТаблицаЛистов1А.НайтиСтроки(Отбор);
			Если ДокументыСделок.Количество()>0 Тогда
				Для Каждого СтрокаДокументовСделок Из ДокументыСделок Цикл
					Если КлючСделкиСовпадает(СтрокаДокументовСделок, КлючСделки) Тогда
						ДокументСделки = СтрокаДокументовСделок.Сделка.ПолучитьОбъект();
						ДокументСделки.ПометкаУдаления = Ложь;
						СтрокаДокументовСделок.Используется = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если ДокументСделки = Неопределено Тогда
				ДокументСделки = Документы.КонтролируемаяСделка.СоздатьДокумент();
				ДокументСделки.Дата = ТекущаяДатаСеанса();
			КонецЕсли;
			
			ДокументСделки.Номер = ТекущийНомерЛиста1А;
			ЗаполнитьЗначенияСвойств(ДокументСделки, Выборка, , ИсключенияДляЗаполненияЛиста1А);
			
			СписокКодовСтороныСделки = КонтролируемыеСделкиПовтИсп.СоответствиеКодовСтороныСделки().Получить(Выборка.КодНаименованияСделки);
			Если СписокКодовСтороныСделки.Количество() = 1 Тогда
				ДокументСделки.КодСтороныСделки = СписокКодовСтороныСделки[0].Значение;
			ИначеЕсли СписокКодовСтороныСделки.Количество() > 1 Тогда
				ДокументСделки.КодСтороныСделки = ?(Выборка.ТипСделки = Перечисления.ТипыКонтролируемыхСделок.ПолученДоход, СписокКодовСтороныСделки[0].Значение, СписокКодовСтороныСделки[1].Значение);
			КонецЕсли;
			ДокументСделки.КомментарийКПункту7 = "";
			ДокументСделки.РедактироватьСуммыСделок = Ложь;
			ДокументСделки.СуммаДоходов = 0;
			ДокументСделки.СуммаДоходовРегулируемых = 0;
			ДокументСделки.СуммаРасходов = 0;
			ДокументСделки.СуммаРасходовРегулируемых = 0;
			
			ДокументСделки.Сделки.Очистить();
			
		КонецЕсли;
		
		НоваяСделка = ТаблицаСделокЛиста1А.Добавить();
		ИсключенияЗаполненияЛиста1Б = ИсключенияЗаполненияЛиста1Б(ВерсияУведомления, Выборка.ТипПредметаСделки);
		ЗаполнитьЗначенияСвойств(НоваяСделка, Выборка, , ИсключенияЗаполненияЛиста1Б);
		ЗаполнитьДатуСделкиДолговыхОбязательств(НоваяСделка, ВерсияУведомления, Выборка.ТипПредметаСделки, Выборка.ДатаПроцентнойСтавки);
		НоваяСделка.СтоимостьДляРасчетаЦены = Выборка[ПолеОпределенияСтоимостиДляРасчетаЦены];
		ЗаполнитьАдресаСделки(НоваяСделка, Выборка.Грузоотправитель, Выборка.Грузополучатель, ВерсияУведомления);
	КонецЦикла;
	
	Если ДокументСделки <> Неопределено Тогда
		ЗаполнитьТаблицуСделокЛиста1А(ДокументСделки, ТаблицаСделокЛиста1А, СтрокаСверткиТаблицыСделок, СтруктураКлючевыхПолей);
		ДокументСделки.Записать();
		ДокументСделки = Неопределено;
	КонецЕсли;
	
	ОбъектУведомление = Уведомление.ПолучитьОбъект();
	ОбъектУведомление.ДатаЗаполненияУведомления = ТекущаяДатаСеанса();
	ОбъектУведомление.Записать();
	
	Запрос.МенеджерВременныхТаблиц.Закрыть();
 
КонецПроцедуры

// На основании служебных данных по контролируемым сделкам, определяет какие сделки относятся в разряд контролируемых и
// какие нет, возвращает эти данные в виде временных таблиц.
//	Параметры:
//		Уведомление - ДокументСсылка.УведомлениеОКонтролируемыхСделках - ссылка на документ уведомления,
// 		для которого подготавливаются врменные таблицы.
//	Возвращаемое значение:
//		Менеджер временных таблиц - содержит в себе следующие таблицы:
//			УчастникиКонтролируемыхСделок - организации или контрагенты, сделки с которыми подлежат контролю;
//			КонтролируемыеСделки - данные из регистра накопления "КонтролируемыеСделкиОрганизаций", со сведениями о признаках по которым каждая конкретная сделка контролиурется;
//			КонтрагентыПоМинимальнойСумме - Сделки с контрагентами, которые контролируются так как сумма оборотов по ним превышает мимнимально контролируемую;
//			КонтрагентыКонтролируемыеПоОбщейСумме - Сделки с невзаимозависимыми контрагентами, которые контролируются так как сумма оборотов по ним превышает общую сумму;
//			КонтрагентыКонтролируемыеПоНДПИ - Сделки с контрагентами, контролируемые по НДПИ;
//			КонтрагентыКонтролируемыеПоСпецРежиму - Сделки с контрагентами, контролируемые по спецрежиму (сделка облагается ЕНВД или сделка с плательщиком ЕСХН);
//			КонтрагентыКонтролируемыеПоПрибыли - Сделки с контрагентами, контролируемые по налогу на прибыль;
//			КонтрагентыКонтролируемыеПоОЭЗ - Сделки с контрагентами, контролируемые в виду того, что контрагент зарегистрирован в особой экономической зоне;
//			КонтрагентыКонтролируемыеПоРегистрацииНеВРФ - Сделки с контрагентами, контролируемые в виду того, что контрагент зарегистрирован в стране с льготным налогообложением
//				или сделка совершается по товарам мировой биржевой торговли.
//
Функция ПолучитьВременныеТаблицыДляЗаполненияУведомления(Уведомление) Экспорт
	
	ПараметрыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "Организация, ОтчетныйГод");
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ОтчетныйГод", ПараметрыУведомления.ОтчетныйГод);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛица)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаОбщейСуммыСделок,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНДПИ)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокНДПИ,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаНаСпецрежимах)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокСпецРежим,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаПлательщикиНалогаНаПрибыль)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокПрибыль,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсобаяЭкономическаяЗона)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокОЭЗ,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаДеятельностьМорскогоМесторождения)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаНовоеМорскоеМесторождение,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаУчастникиРегиональногоИнвестиционногоПроекта)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаРегиональныйИнвестиционныйПроект,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаОсвобождениеНДС)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаОсвобождениеНДС,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.ВзаимозависимыеЛицаИнвестиционныйВычет)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаИнвестиционныйВычет,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.НезависимыеИностранныеЛица)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ГраницаСуммыСделокИностранныхНезависимыхЛиц,
	|	СУММА(ВЫБОР
	|			КОГДА ГраницыКонтролируемостиСделокСрезПоследних.ОсобенностьОтнесенияСделкиККонтролируемой = ЗНАЧЕНИЕ(Перечисление.ОсобенностиОтнесенияСделокККонтролируемым.МинимальнаяСуммаДляВключенияВУведомление)
	|				ТОГДА ГраницыКонтролируемостиСделокСрезПоследних.ПредельнаяСумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МинимальнаяГраницаДляВключенияСделокВУведомление
	|ИЗ
	|	РегистрСведений.ГраницыКонтролируемостиСделок.СрезПоследних(КОНЕЦПЕРИОДА(&ОтчетныйГод, ГОД), ) КАК ГраницыКонтролируемостиСделокСрезПоследних";
	
	ГраницыКонтролируемостиСделок = Новый Структура;
	ГраницыКонтролируемостиСделок.Вставить("ГраницаОбщейСуммыСделок", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокНДПИ", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокСпецРежим", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокПрибыль", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокОЭЗ", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаНовоеМорскоеМесторождение", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаРегиональныйИнвестиционныйПроект", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаОсвобождениеНДС", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаИнвестиционныйВычет", 0);
	ГраницыКонтролируемостиСделок.Вставить("ГраницаСуммыСделокИностранныхНезависимыхЛиц", 0);
	ГраницыКонтролируемостиСделок.Вставить("МинимальнаяГраницаДляВключенияСделокВУведомление", 0);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ГраницыКонтролируемостиСделок, Выборка);
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление);
	Запрос.Параметры.Вставить("Уведомление", Уведомление);
	Запрос.Параметры.Вставить("Организация", ПараметрыУведомления.Организация);
	Запрос.Параметры.Вставить("ОтчетныйГод", ПараметрыУведомления.ОтчетныйГод);
	Запрос.Параметры.Вставить("ГраницаОбщейСуммыСделок", ГраницыКонтролируемостиСделок.ГраницаОбщейСуммыСделок);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокНДПИ",  ГраницыКонтролируемостиСделок.ГраницаСуммыСделокНДПИ);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокСпецРежим", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокСпецРежим);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокПрибыль", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокПрибыль);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокОЭЗ", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокОЭЗ);
	Запрос.Параметры.Вставить("ГраницаНовоеМорскоеМесторождение", ГраницыКонтролируемостиСделок.ГраницаНовоеМорскоеМесторождение);
	Запрос.Параметры.Вставить("ГраницаРегиональныйИнвестиционныйПроект", ГраницыКонтролируемостиСделок.ГраницаРегиональныйИнвестиционныйПроект);
	Запрос.Параметры.Вставить("ГраницаОсвобождениеНДС", ГраницыКонтролируемостиСделок.ГраницаОсвобождениеНДС);
	Запрос.Параметры.Вставить("ГраницаИнвестиционныйВычет", ГраницыКонтролируемостиСделок.ГраницаИнвестиционныйВычет);
	Запрос.Параметры.Вставить("ГраницаСуммыСделокИностранныхНезависимыхЛиц", ГраницыКонтролируемостиСделок.ГраницаСуммыСделокИностранныхНезависимыхЛиц);
	Запрос.Параметры.Вставить("МинимальнаяГраницаДляВключенияСделокВУведомление", ГраницыКонтролируемостиСделок.МинимальнаяГраницаДляВключенияСделокВУведомление);
	Запрос.Параметры.Вставить("УчитыватьСпецрежимДляПосредников", ?(ПараметрыУведомления.ОтчетныйГод < Дата(2014,1,1), Ложь, Истина));
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	КонтролируемыеКонтрагенты.Контрагент КАК Контрагент,
	|	КонтролируемыеКонтрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.СтранаРегистрации КАК СтранаРегистрации,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КонтрагентЗарегистрированВРФ,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.СделкаВОбластиВнешнейТорговли, ЛОЖЬ) КАК СделкаВОбластиВнешнейТорговли,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ УчастникиКонтролируемыхСделок
	|ИЗ
	|	КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО КонтролируемыеКонтрагенты.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = КонтролируемыеКонтрагенты.Контрагент)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтролируемыеКонтрагенты.Контрагент,
	|	КонтролируемыеКонтрагенты.ГоловнойКонтрагент,
	|	Организации.СтранаРегистрации,
	|	НЕ Организации.ИностраннаяОрганизация,
	|	ЕСТЬNULL(ИностранныеОрганизации.СделкаВОбластиВнешнейТорговли, ЛОЖЬ) КАК СделкаВОбластиВнешнейТорговли,
	|	ЕСТЬNULL(ИностранныеОрганизации.ЗарегистрированаВСтранеСЛьготнымНалогообложением, ЛОЖЬ)
	|ИЗ
	|	КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО КонтролируемыеКонтрагенты.Контрагент = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеОрганизации КАК ИностранныеОрганизации
	|		ПО (ИностранныеОрганизации.Организация = КонтролируемыеКонтрагенты.Контрагент)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УведомлениеОКонтролируемыхСделках.Организация КАК Организация,
	|	УведомлениеОКонтролируемыхСделках.Ссылка КАК Уведомление,
	|	КонтролируемыеСделкиОрганизаций.Период КАК ПериодСделки,
	|	УведомлениеОКонтролируемыхСделках.ОтчетныйГод КАК ОтчетныйГод,
	|	КонтролируемыеСделкиОрганизаций.Контрагент КАК Контрагент,
	|	УчастникиКонтролируемыхСделок.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	КонтролируемыеСделкиОрганизаций.Договор КАК Договор,
	|	КонтролируемыеСделкиОрганизаций.Комиссионер КАК Комиссионер,
	|	КонтролируемыеСделкиОрганизаций.Соглашение КАК Соглашение,
	|	КонтролируемыеСделкиОрганизаций.РасчетныйДокумент КАК РасчетныйДокумент,
	|	КонтролируемыеСделкиОрганизаций.ПредметСделки КАК ПредметСделки,
	|	КонтролируемыеСделкиОрганизаций.СуммаБезНДСВРублях КАК СуммаБезНДСВРублях,
	|	КонтролируемыеСделкиОрганизаций.СуммаБезНДСВВалютеРасчетов КАК СуммаБезНДСВВалютеРасчетов,
	|	УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ КАК КонтрагентЗарегистрированВРФ,
	|	ВЫБОР
	|		КОГДА (КонтролируемыеСделкиОрганизаций.Контрагент ССЫЛКА Справочник.Контрагенты
	|					И УчетнаяПолитикаОрганизации.ЯвляетсяПлательщикомНалогаНаПрибыль <> ЕСТЬNULL(ДанныеПоКонтрагентамПоПериодам.ЯвляетсяПлательщикомНалогаНаПрибыль, ЛОЖЬ)
	|				ИЛИ КонтролируемыеСделкиОрганизаций.Контрагент ССЫЛКА Справочник.Организации
	|					И УчетнаяПолитикаОрганизации.ЯвляетсяПлательщикомНалогаНаПрибыль <> ЕСТЬNULL(ДанныеПоОрганизациямПоПериодам.ЯвляетсяПлательщикомНалогаНаПрибыль, ЛОЖЬ))
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоНалогуНаПрибыль,
	|	ВЫБОР
	|		КОГДА НЕ ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL
	|				И УчастникиКонтролируемыхСделок.СделкаВОбластиВнешнейТорговли = ИСТИНА
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли,
	|	УчастникиКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(УчетнаяПолитикаОрганизации.ЯвляетсяПлательщикомНДПИ, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				ИЛИ (КонтролируемыеСделкиОрганизаций.Контрагент ССЫЛКА Справочник.Контрагенты
	|						И ЕСТЬNULL(ДанныеПоКонтрагентамПоПериодам.ЯвляетсяПлательщикомНДПИ, ЛОЖЬ)
	|					ИЛИ КонтролируемыеСделкиОрганизаций.Контрагент ССЫЛКА Справочник.Организации
	|						И ЕСТЬNULL(ДанныеПоОрганизациямПоПериодам.ЯвляетсяПлательщикомНДПИ, ЛОЖЬ))
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход))
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				И ЕСТЬNULL(КонтролируемыеСделкиОрганизаций.ПредметСделки.ОблагаетсяНДПИПоПроцентнойСтавке, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоНДПИ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УчетнаяПолитикаОрганизации.ЗарегистрированВОЭЗ, ЛОЖЬ) <> ВЫБОР
	|					КОГДА КонтролируемыеСделкиОрганизаций.Контрагент ССЫЛКА Справочник.Контрагенты
	|						ТОГДА ЕСТЬNULL(ДанныеПоКонтрагентамПоПериодам.ЗарегистрированВОЭЗ, ЛОЖЬ)
	|					ИНАЧЕ ДанныеПоОрганизациямПоПериодам.ЗарегистрированВОЭЗ
	|				КОНЕЦ
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоРегистрацииВОЭЗ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемыеСделкиОрганизаций.ОперацияОблагаетсяЕНВД, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ДанныеПоКонтрагентамПоПериодам.ЯвляетсяПлательщикомЕНВД, ЛОЖЬ)
	|					И КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки = ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход)
	|					И ЕСТЬNULL(КонтролируемыеСделкиОрганизаций.ОперацияОблагаетсяЕНВД, ЛОЖЬ)
	|					И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВзаимозависимыеЛицаПоПериодам.НевзаимозависимыйПосредник
	|							И НЕ &УчитыватьСпецрежимДляПосредников
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ДанныеПоКонтрагентамПоПериодам.ЯвляетсяПлательщикомЕСХН, ЛОЖЬ)
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ВЫБОР
	|					КОГДА ВзаимозависимыеЛицаПоПериодам.НевзаимозависимыйПосредник
	|							И НЕ &УчитыватьСпецрежимДляПосредников
	|						ТОГДА ЛОЖЬ
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаСПлательщикомЕСХН,
	|	ЛОЖЬ КАК СделкаМорскогоМесторождения,
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(УчетнаяПолитикаОрганизации.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ДанныеПоКонтрагентамПоПериодам.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта, ЛОЖЬ))
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоИнвестиционнымПроектам,
	|	ВЫБОР
	|		КОГДА (ЕСТЬNULL(УчетнаяПолитикаОрганизации.ОсвобожденОтУплатыНДС, ЛОЖЬ)
	|				ИЛИ ЕСТЬNULL(ДанныеПоКонтрагентамПоПериодам.ОсвобожденОтУплатыНДС, ЛОЖЬ))
	|				И УчастникиКонтролируемыхСделок.КонтрагентЗарегистрированВРФ
	|				И ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ВзаимозависимыеЛица, ЛОЖЬ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаКонтролируетсяПоОсвобождениюНДС,
	|	ЕСТЬNULL(ДанныеПоКонтрагентамПоПериодам.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль, ЛОЖЬ) КАК СделкаКонтролируетсяПоИнвестиционномуВычету,
	|	ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) КАК ТипВзаимозависимости,
	|	КонтролируемыеСделкиОрганизаций.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КонтролируемыеСделкиОрганизаций.СтранаПроисхожденияПредметаСделки КАК СтранаПроисхожденияПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.ТипКонтролируемойСделки КАК ТипКонтролируемойСделки,
	|	КонтролируемыеСделкиОрганизаций.Грузоотправитель КАК Грузоотправитель,
	|	КонтролируемыеСделкиОрганизаций.Грузополучатель КАК Грузополучатель,
	|	КонтролируемыеСделкиОрганизаций.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	КонтролируемыеСделкиОрганизаций.Валюта КАК Валюта,
	|	КонтролируемыеСделкиОрганизаций.Количество КАК Количество,
	|	КонтролируемыеСделкиОрганизаций.ПроцентнаяСтавка КАК ПроцентнаяСтавка,
	|	КонтролируемыеСделкиОрганизаций.ДатаПроцентнойСтавки КАК ДатаПроцентнойСтавки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|				ИЛИ ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВзаимозависимыеЛицаПоПериодам.ТипВзаимозависимости, ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)) = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СделкаСНезависимымПосредником
	|ПОМЕСТИТЬ КонтролируемыеСделки
	|ИЗ
	|	РегистрНакопления.КонтролируемыеСделкиОрганизаций КАК КонтролируемыеСделкиОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОКонтролируемыхСделках КАК УведомлениеОКонтролируемыхСделках
	|		ПО КонтролируемыеСделкиОрганизаций.Уведомление = УведомлениеОКонтролируемыхСделках.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УчастникиКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО КонтролируемыеСделкиОрганизаций.Контрагент = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = ВзаимозависимыеЛицаПоПериодам.Организация
	|			И КонтролируемыеСделкиОрганизаций.Контрагент = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|			И КонтролируемыеСделкиОрганизаций.Период >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам КАК УчетнаяПолитикаОрганизации
	|		ПО КонтролируемыеСделкиОрганизаций.Организация = УчетнаяПолитикаОрганизации.Организация
	|			И КонтролируемыеСделкиОрганизаций.Период >= УчетнаяПолитикаОрганизации.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= УчетнаяПолитикаОрганизации.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО КонтролируемыеСделкиОрганизаций.ПредметСделки = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоКонтрагентамПоПериодам КАК ДанныеПоКонтрагентамПоПериодам
	|		ПО КонтролируемыеСделкиОрганизаций.Контрагент = ДанныеПоКонтрагентамПоПериодам.Контрагент
	|			И КонтролируемыеСделкиОрганизаций.Период >= ДанныеПоКонтрагентамПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= ДанныеПоКонтрагентамПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам КАК ДанныеПоОрганизациямПоПериодам
	|		ПО (КонтролируемыеСделкиОрганизаций.Контрагент ССЫЛКА Справочник.Организации)
	|			И КонтролируемыеСделкиОрганизаций.Период >= ДанныеПоОрганизациямПоПериодам.НачалоПериода
	|			И КонтролируемыеСделкиОрганизаций.Период <= ДанныеПоОрганизациямПоПериодам.ОкончаниеПериода
	|			И КонтролируемыеСделкиОрганизаций.Контрагент = ДанныеПоОрганизациямПоПериодам.Организация
	|ГДЕ
	|	УведомлениеОКонтролируемыхСделках.Ссылка = &Уведомление
	|	И КонтролируемыеСделкиОрганизаций.Уведомление = &Уведомление
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	Договор,
	|	ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыПоМинимальнойСумме
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) > &МинимальнаяГраницаДляВключенияСделокВУведомление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоОбщейСумме
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаОбщейСуммыСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоНДПИ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоНДПИ
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокНДПИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоСпецРежиму
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И (КонтролируемыеСделки.СделкаОблагаетсяЕНВД
	|			ИЛИ КонтролируемыеСделки.СделкаСПлательщикомЕСХН)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокСпецРежим
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоПрибыли
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоНалогуНаПрибыль
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокПрибыль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоОЭЗ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоРегистрацииВОЭЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокОЭЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоМорскомуМесторождению
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаМорскогоМесторождения
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаНовоеМорскоеМесторождение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоИнвестиционнымПроектам
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционнымПроектам
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаРегиональныйИнвестиционныйПроект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоОсвобождениюНДС
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоОсвобождениюНДС
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаОсвобождениеНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоИнвестиционномуВычету
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.КонтрагентЗарегистрированВРФ
	|	И КонтролируемыеСделки.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И КонтролируемыеСделки.СделкаКонтролируетсяПоИнвестиционномуВычету
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаИнвестиционныйВычет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтролируемыеСделки.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) КАК СуммаБезНДСВРублях
	|ПОМЕСТИТЬ КонтрагентыКонтролируемыеПоРегистрацииНеВРФ
	|ИЗ
	|	КонтролируемыеСделки КАК КонтролируемыеСделки
	|ГДЕ
	|	КонтролируемыеСделки.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|	И (КонтролируемыеСделки.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|			ИЛИ КонтролируемыеСделки.СделкаВнешнейТорговлиТоваромМировойБиржевойТорговли)
	|
	|СГРУППИРОВАТЬ ПО
	|	КонтролируемыеСделки.ГоловнойКонтрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(КонтролируемыеСделки.СуммаБезНДСВРублях) >= &ГраницаСуммыСделокИностранныхНезависимыхЛиц";
	
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

// Возвращает текст запроса с данными по записанным контролируемым сделкам.
//	Возвращаемое значение:
//		Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаПоКонтролируемымСделкам_2012() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.СтранаРегистрации КАК СтранаРегистрации,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.НаименованиеМеждународное КАК НаименованиеМеждународное,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	Контрагенты.РегистрационныйНомер КАК РегистрационныйНомер,
	|	Контрагенты.НалоговыйНомер КАК НалоговыйНомер
	|ПОМЕСТИТЬ КонтрагентыИОрганизации
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Организации.ГоловнаяОрганизация КАК ГоловнойКонтрагент,
	|	Организации.СтранаРегистрации КАК СтранаРегистрации,
	|	Организации.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	Организации.НаименованиеИнострОрганизации КАК НаименованиеМеждународное,
	|	Организации.НаименованиеПолное КАК НаименованиеПолное,
	|	Организации.ОГРН КАК РегистрационныйНомер,
	|	"""" КАК НалоговыйНомер
	|ИЗ
	|	Справочник.Организации КАК Организации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтролируемаяСделка.Номер КАК НомерЛиста1А,
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке КАК УведомлениеОКонтролируемойСделке,
	|	КонтролируемаяСделка.Ссылка КАК Сделка,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимыПоКодексу)
	|			ТОГДА ""1""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.СамостоятельноеПризнаниеВзаимозависимости)
	|			ТОГДА ""2""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимостьПоРешениюСуда)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка100Взаимозависимость,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка121СтороныВзаимозависимыПоКодексу
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка121СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка122СделкаВОбластиВнешнейТорговли
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка122СделкаВОбластиВнешнейТорговли,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка123СделкаСКонтрагентомСЛьготнымНалогообложением
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка124СделкаСНезависимымПосредником
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка124СделкаСНезависимымПосредником,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка131СуммаДоходовПоСделкамПревышаетПредел
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка132СделкаСПлательщикомНДПИ
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка132СделкаСПлательщикомНДПИ,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка133СделкаСКонтрагентомНаСпецрежимах
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка134СделкаСПлательщикомНалогаНаПрибыль
	|				ИЛИ КонтролируемаяСделка.Строка136СделкаМорскогоМесторождения
	|				ИЛИ КонтролируемаяСделка.Строка137СделкаИнвестиционныйПроект
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка135СделкаСРезидентомОЭЗ
	|				ИЛИ КонтролируемаяСделка.Строка138СделкаОсвобождениеОтНДС
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка135СделкаСРезидентомОЭЗ,
	|	КонтролируемаяСделка.КодНаименованияСделки КАК Строка210КодНаименованияСделки,
	|	КонтролируемаяСделка.КодСтороныСделки КАК Строка211КодСтороныСделки,
	|	КонтролируемаяСделка.СпособОпределенияЦеныСделки КАК СпособОпределенияЦеныСделки,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.СпособОпределенияЦеныСделки.ЦенаЯвляетсяРегулируемой
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка220ПризнакОпределенияЦеныСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКПризнакуОпределенияЦеныСделки, """") КАК Строка220_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки, """") = """"
	|			ТОГДА ""0""
	|		ИНАЧЕ КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки
	|	КОНЕЦ КАК Строка230КодОпределенияЦены,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийККодуОпределенияЦеныСделки, """") КАК Строка230_1Комментарий,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодМетодаЦенообразования, """") КАК Строка240КодМетодовЦенообразования,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКМетодуЦенообразования, """") КАК Строка240_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации251, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка251,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации252, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка252,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации253, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка253,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации254, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка254,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации255, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка255,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации256, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка256,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации257, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка257,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации258, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка258,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации259, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка259,
	|	2 КАК Строка260КоличествоУчастниковСделки,
	|	КонтролируемаяСделка.КомментарийКПункту7 КАК Строка260_1Комментарий,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходов КАК ЧИСЛО(15, 0)) КАК Строка300СуммаДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка301СуммаРегулируемыхДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходов КАК ЧИСЛО(15, 0)) КАК Строка310СуммаРасходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка311СуммаРегулируемыхРасходов,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОбособленноеПодразделение
	|				И Контрагенты.ГоловнойКонтрагент.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Контрагенты.Ссылка
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент
	|	КОНЕЦ КАК Контрагент,
	|	Контрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) КАК ВнешнеторговаяСделка,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ТипКонтрагента,
	|	КонтролируемаяСделка.Договор КАК Договор,
	|	КонтролируемаяСделка.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемаяСделка.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.КодТНВЭД.Код, """") КАК КодТНВЭД,
	|	ЕСТЬNULL(КонтролируемаяСделка.КодОКП.Код, """") КАК КодОКП,
	|	ЕСТЬNULL(КонтролируемаяСделка.КодОКВЭД.Код, """") КАК КодОКВЭД,
	|	ЕСТЬNULL(КонтролируемаяСделка.КодОКПД2.Код, """") КАК КодОКПД2,
	|	ЕСТЬNULL(КонтролируемаяСделка.КодОКВЭД2.Код, """") КАК КодОКВЭД2,
	|	КонтролируемаяСделка.НомерДоговора КАК НомерДоговора,
	|	КонтролируемаяСделка.ДатаДоговора КАК ДатаДоговора,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|				И КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|		ИНАЧЕ КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки
	|	КОНЕЦ КАК СтранаПроисхожденияПредметаСделки,
	|	ЛОЖЬ КАК СделкаСовершенаЧерезКомиссионера,
	|	""0"" КАК СделкаСовАгент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ПустаяСсылка) КАК ТипКомиссионера
	|ПОМЕСТИТЬ Листы1А
	|ИЗ
	|	Документ.КонтролируемаяСделка КАК КонтролируемаяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыИОрганизации КАК Контрагенты
	|		ПО КонтролируемаяСделка.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке = &УведомлениеОКонтролируемойСделке
	|	И НЕ КонтролируемаяСделка.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтролируемаяСделкаСделки.Ссылка КАК Сделка,
	|	Листы1А.НомерЛиста1А КАК НомерЛиста1А,
	|	КонтролируемаяСделкаСделки.НомерСтроки КАК НомерСтроки,
	|	Листы1А.ТипПредметаСделки КАК ТипПредметаСделки,
	|	ВЫБОР
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА 1
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|			ТОГДА 2
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|				ИЛИ Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|			ТОГДА 3
	|	КОНЕЦ КАК Строка020ТипПредмета,
	|	Листы1А.НаименованиеПредметаСделки КАК Строка030НаименованиеПредмета,
	|	Листы1А.КодТНВЭД КАК Строка040КодПоТНВЭД,
	|	Листы1А.КодОКП КАК Строка043КодПоОКП,
	|	Листы1А.КодОКВЭД КАК Строка045КодОКВЭД,
	|	Листы1А.КодОКПД2 КАК Строка043КодПоОКПД2,
	|	Листы1А.КодОКВЭД2 КАК Строка045КодОКВЭД2,
	|	Листы1А.Контрагент КАК Контрагент,
	|	Листы1А.Договор,
	|	Листы1А.НомерДоговора КАК Строка060НомерДоговора,
	|	Листы1А.ДатаДоговора КАК Строка065ДатаДоговора,
	|	ЕСТЬNULL(Листы1А.СтранаПроисхожденияПредметаСделки.Код, """") КАК Строка070КодСтраныПроисхождения,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаОтправкиТовара.Код, """") КАК Строка080КодСтраныОтправки,
	|	КонтролируемаяСделкаСделки.КодРегионаОтправкиТовара КАК Строка080КодРегионаОтправки,
	|	КонтролируемаяСделкаСделки.ГородОтправкиТовара КАК Строка080ГородОтправки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктОтправкиТовара КАК Строка080НаселенныйПунктОтправки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаСовершенияСделки.Код, """") КАК Строка090КодСтраныСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодРегионаСовершенияСделки КАК Строка090КодРегионаСовершенияСделки,
	|	КонтролируемаяСделкаСделки.ГородСовершенияСделки КАК Строка090ГородСовершенияСделки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктСовершенияСделки КАК Строка090НаселенныйПунктСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодУсловийПоставки КАК Строка100КодУсловийПоставки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.ЕдиницаИзмерения.Код, """") КАК Строка110КодЕдиницыИзмерения,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделкаСделки.Количество > 0
	|				И КонтролируемаяСделкаСделки.Количество < 1
	|			ТОГДА 1
	|		ИНАЧЕ ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Количество КАК ЧИСЛО(15, 0))
	|	КОНЕЦ КАК Строка120Количество,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Цена КАК ЧИСЛО(15, 0)) КАК Строка130Цена,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Стоимость КАК ЧИСЛО(15, 0)) КАК Строка140Стоимость,
	|	КонтролируемаяСделкаСделки.ДатаСовершенияСделки КАК Строка150ДатаСовершения,
	|	Листы1А.ТипКонтрагента КАК ТипКонтрагента,
	|	Листы1А.ВнешнеторговаяСделка КАК ВнешнеторговаяСделка,
	|	Листы1А.СделкаСовершенаЧерезКомиссионера КАК СделкаСовершенаЧерезКомиссионера,
	|	Листы1А.Комиссионер КАК Комиссионер,
	|	Листы1А.ТипКомиссионера КАК ТипКомиссионера
	|ПОМЕСТИТЬ Листы1Б
	|ИЗ
	|	Документ.КонтролируемаяСделка.Сделки КАК КонтролируемаяСделкаСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Листы1А КАК Листы1А
	|		ПО КонтролируемаяСделкаСделки.Ссылка = Листы1А.Сделка
	|ГДЕ
	|	КонтролируемаяСделкаСделки.Ссылка В
	|			(ВЫБРАТЬ
	|				Листы1А.Сделка
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	ГоловныеКонтрагенты.Ссылка КАК ГоловнойКонтрагент,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеМеждународное КАК НаименованиеВЛатинскойТранскрипции,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	ГоловныеКонтрагенты.КПП КАК ГоловнойКонтрагентКПП,
	|	ВЫРАЗИТЬ(ГоловныеКонтрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	ГоловныеКонтрагенты.РегистрационныйНомер КАК РегистрационныйНомер,
	|	ГоловныеКонтрагенты.НалоговыйНомер КАК НалоговыйНомер,
	|	ВЫБОР КОГДА ГоловныеКонтрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) ИНАЧЕ ГоловныеКонтрагенты.СтранаРегистрации КОНЕЦ КАК СтранаРегистрации,
	|	МАКСИМУМ(ЕСТЬNULL(ДанныеКонтактнойИнформации.ДействуетС, ДатаВремя(1,1,1))) КАК ДатаАктуальностиКонтактнойИнформации,
	|	МАКСИМУМ(ЕСТЬNULL(ДанныеКПП.Период, ДатаВремя(1,1,1))) КАК ДатаАктуальностиКПП,
	|	МАКСИМУМ(ЕСТЬNULL(ДанныеКППГоловнойКонтрагент.Период, ДатаВремя(1,1,1))) КАК ДатаАктуальностиКППГоловнойКонтрагент,
	|	МАКСИМУМ(ЕСТЬNULL(ДанныеНаименований.Период, ДатаВремя(1,1,1))) КАК ДатаАктуальностиНаименований
	|ПОМЕСТИТЬ КонтагентыКонтролируемыхСделок
	|ИЗ
	|	Листы1А КАК Листы1А
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыИОрганизации КАК Контрагенты
	|		ПО Листы1А.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыИОрганизации КАК ГоловныеКонтрагенты
	|		ПО (ГоловныеКонтрагенты.Ссылка = Контрагенты.ГоловнойКонтрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ДанныеКонтактнойИнформации
	|			ПО ГоловныеКонтрагенты.Ссылка = ДанныеКонтактнойИнформации.Ссылка
	|				И ДанныеКонтактнойИнформации.ДействуетС <= &ДатаАктуальностиСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ДанныеКПП
	|			ПО Листы1А.Контрагент = ДанныеКПП.Ссылка
	|				И ДанныеКПП.Период <= &ДатаАктуальностиСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ДанныеКППГоловнойКонтрагент
	|			ПО ГоловныеКонтрагенты.Ссылка = ДанныеКПП.Ссылка
	|				И ДанныеКПП.Период <= &ДатаАктуальностиСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияНаименований КАК ДанныеНаименований
	|			ПО ГоловныеКонтрагенты.Ссылка = ДанныеНаименований.Ссылка
	|				И ДанныеНаименований.Период <= &ДатаАктуальностиСведений
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.Ссылка,
	|	ГоловныеКонтрагенты.Ссылка,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеМеждународное,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.РегистрационныйНомер,
	|	Контрагенты.НалоговыйНомер,
	|	Контрагенты.СтранаРегистрации,
	|	ГоловныеКонтрагенты.КПП,
	|	ГоловныеКонтрагенты.НаименованиеПолное,
	|	ГоловныеКонтрагенты.РегистрационныйНомер,
	|	ГоловныеКонтрагенты.НалоговыйНомер,
	|	ГоловныеКонтрагенты.СтранаРегистрации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ЮридическоеФизическоеЛицо;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ВЫБОР
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Строка020ТипОрганизации,
	|	ВЫБОР
	|		КОГДА Контрагенты.СтранаРегистрации.Код ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ Контрагенты.СтранаРегистрации.Код
	|	КОНЕЦ КАК Строка030КакКодСтраныРегистрации,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ИсторияНаименованийКонтрагента.НаименованиеПолное КАК СТРОКА(1000)), Контрагенты.НаименованиеПолное) КАК Строка040Наименование,
	|	Контрагенты.НаименованиеВЛатинскойТранскрипции КАК Строка040НаименованиеЛат,
	|	Контрагенты.ИНН КАК Строка050ИНН,
	|	ВЫБОР
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЕСТЬNULL(ИсторияКППГоловногоКонтрагента.КПП, Контрагенты.ГоловнойКонтрагентКПП)
	|		ИНАЧЕ ЕСТЬNULL(ИсторияКППКонтрагента.КПП, Контрагенты.КПП)
	|	КОНЕЦ КАК Строка060КПП,
	|	ВЫБОР
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ Контрагенты.РегистрационныйНомер
	|	КОНЕЦ КАК Строка070РегНомерВСтрокеРегистрации,
	|	ВЫБОР
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ Контрагенты.НалоговыйНомер
	|	КОНЕЦ КАК Строка080КодНалогВСтранеРегистрации,
	|	ЕСТЬNULL(КонтактнаяИнформацияКонтрагента.Представление, """") КАК Строка090АдресИностраннойОрганизации
	|ПОМЕСТИТЬ Раздел2
	|ИЗ
	|	КонтагентыКонтролируемыхСделок КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформацияКонтрагента
	|		ПО Контрагенты.ГоловнойКонтрагент = КонтактнаяИнформацияКонтрагента.Ссылка
	|			И Контрагенты.ДатаАктуальностиКонтактнойИнформации = КонтактнаяИнформацияКонтрагента.ДействуетС
	|			И (КонтактнаяИнформацияКонтрагента.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагента
	|		ПО Контрагенты.Ссылка = ИсторияКППКонтрагента.Ссылка
	|			И Контрагенты.ДатаАктуальностиКПП = ИсторияКППКонтрагента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППГоловногоКонтрагента
	|		ПО Контрагенты.ГоловнойКонтрагент = ИсторияКППГоловногоКонтрагента.Ссылка
	|			И Контрагенты.ДатаАктуальностиКППГоловнойКонтрагент = ИсторияКППГоловногоКонтрагента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияНаименований КАК ИсторияНаименованийКонтрагента
	|		ПО Контрагенты.ГоловнойКонтрагент = ИсторияНаименованийКонтрагента.Ссылка
	|			И Контрагенты.ДатаАктуальностиНаименований = ИсторияНаименованийКонтрагента.Период
	|ГДЕ
	|	Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
	|	ДокументыФизическихЛицСрезПоследних.Период КАК Период,
	|	МАКСИМУМ(ДокументыФизическихЛицСрезПоследних.ВидДокумента) КАК ВидДокумента
	|ПОМЕСТИТЬ ВидыДокументовФизическихЛиц
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			&ДатаАктуальностиСведений,
	|			Физлицо В
	|				(ВЫБРАТЬ
	|					УчастникиСделок.ФизическоеЛицо
	|				ИЗ
	|					РегистрСведений.ДанныеПоКонтрагентамКонтролируемыхСделок КАК УчастникиСделок)) КАК ДокументыФизическихЛицСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыФизическихЛицСрезПоследних.Физлицо,
	|	ДокументыФизическихЛицСрезПоследних.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период,
	|	ВидДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГражданствоФизическихЛицСрезПоследних.Страна КАК Страна
	|ПОМЕСТИТЬ ГражданствоФизическихЛиц
	|ИЗ
	|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(
	|			&ДатаАктуальностиСведений,
	|			ФизическоеЛицо В
	|				(ВЫБРАТЬ
	|					УчастникиСделок.ФизическоеЛицо
	|				ИЗ
	|					РегистрСведений.ДанныеПоКонтрагентамКонтролируемыхСделок КАК УчастникиСделок)) КАК ГражданствоФизическихЛицСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо,
	|	ГражданствоФизическихЛицСрезПоследних.Страна
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.КодВидаДеятельностиФизическогоЛица, """") КАК Строка020КодВидаДеятельности,
	|	Контрагенты.ИНН КАК Строка030ИНН,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаРождения,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо.МестоРождения, """") КАК МестоРождения,
	|	ГражданствоФизическихЛиц.Страна КАК ГражданствоФизЛицСтрана,
	|	КонтактнаяИнформацияФизлица.Вид КАК ВидКонтактнойИнформации,
	|	КонтактнаяИнформацияФизлица.ЗначенияПолей КАК КонтактнаяИнформацияЗначенияПолей,
	|	КонтактнаяИнформацияФизлица.Значение КАК КонтактнаяИнформацияЗначениеJSON,
	|	КонтактнаяИнформацияФизлица.Страна КАК КонтактнаяИнформацияСтрана,
	|	КонтактнаяИнформацияФизлица.Представление КАК КонтактнаяИнформацияПредставление,
	|	КонтактнаяИнформацияЗаРФ.Страна КАК КонтактнаяИнформацияЗаРФСтрана,
	|	КонтактнаяИнформацияЗаРФ.Представление КАК КонтактнаяИнформацияЗаРФПредставление,
	|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента,
	|	ДокументыФизическихЛиц.Серия КАК ДокументСерия,
	|	ДокументыФизическихЛиц.Номер КАК ДокументНомер,
	|	ДокументыФизическихЛиц.КемВыдан КАК ДокументКемВыдан,
	|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДокументДатаВыдачи,
	|	ФИОФизЛиц.Фамилия КАК Фамилия,
	|	ФИОФизЛиц.Имя КАК Имя,
	|	ФИОФизЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ Раздел3
	|ИЗ
	|	КонтагентыКонтролируемыхСделок КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоКонтрагентамКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО Контрагенты.Ссылка = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГражданствоФизическихЛиц КАК ГражданствоФизическихЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ГражданствоФизическихЛиц.ФизическоеЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияФизлица
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформацияФизлица.Ссылка)
	|			И (КонтактнаяИнформацияФизлица.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияФизлица.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияЗаРФ
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформацияЗаРФ.Ссылка)
	|			И (КонтактнаяИнформацияЗаРФ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияЗаРФ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЗаПределамиРФФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ВидыДокументовФизическихЛиц.Физлицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|		ПО (ДокументыФизическихЛиц.Физлицо = ВидыДокументовФизическихЛиц.Физлицо)
	|			И (ДокументыФизическихЛиц.Период = ВидыДокументовФизическихЛиц.Период)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ВидыДокументовФизическихЛиц.ВидДокумента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаАктуальностиСведений, ) КАК ФИОФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ФИОФизЛиц.ФизическоеЛицо)
	|ГДЕ
	|	Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)";
	
	Возврат(ТекстЗапроса);
	
КонецФункции

// Возвращает текст запроса с данными по записанным контролируемым сделкам.
//	Возвращаемое значение:
//		Строка - текст запроса.
//
Функция ПолучитьТекстЗапросаПоКонтролируемымСделкам_2018() Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ВЫБОР КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) ИНАЧЕ Контрагенты.СтранаРегистрации КОНЕЦ КАК СтранаРегистрации,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	Контрагенты.НаименованиеМеждународное КАК НаименованиеМеждународное,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	Контрагенты.РегистрационныйНомер КАК РегистрационныйНомер,
	|	Контрагенты.НалоговыйНомер КАК НалоговыйНомер
	|ПОМЕСТИТЬ КонтрагентыИОрганизации
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ОбособленноеПодразделение КАК ОбособленноеПодразделение,
	|	Организации.ГоловнаяОрганизация КАК ГоловнойКонтрагент,
	|	ВЫБОР КОГДА Организации.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|		ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) ИНАЧЕ Организации.СтранаРегистрации КОНЕЦ КАК СтранаРегистрации,
	|	Организации.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Организации.ИНН КАК ИНН,
	|	ЕСТЬNULL(ИсторияКППОрганизации.РегистрацияВНалоговомОргане.КПП, Организации.КПП) КАК КПП,
	|	Организации.НаименованиеИнострОрганизации КАК НаименованиеМеждународное,
	|	ВЫРАЗИТЬ(Организации.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	Организации.ОГРН КАК РегистрационныйНомер,
	|	"""" КАК НалоговыйНомер
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&ДатаАктуальностиСведений) КАК ИсторияКППОрганизации
	|		ПО Организации.Ссылка = ИсторияКППОрганизации.СтруктурнаяЕдиница
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтролируемаяСделка.Номер КАК НомерЛиста1А,
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке КАК УведомлениеОКонтролируемойСделке,
	|	КонтролируемаяСделка.Ссылка КАК Сделка,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимыПоКодексу)
	|			ТОГДА ""1""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.СамостоятельноеПризнаниеВзаимозависимости)
	|			ТОГДА ""2""
	|		КОГДА КонтролируемаяСделка.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.ВзаимозависимостьПоРешениюСуда)
	|			ТОГДА ""3""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка100Взаимозависимость,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка121СтороныВзаимозависимыПоКодексу
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка121СтороныВзаимозависимыПоКодексу,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка122СделкаВОбластиВнешнейТорговли
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка122СделкаВОбластиВнешнейТорговли,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка123СделкаСКонтрагентомСЛьготнымНалогообложением
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка123СделкаСКонтрагентомСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка124СделкаСНезависимымПосредником
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка124СделкаСНезависимымПосредником,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка131СуммаДоходовПоСделкамПревышаетПредел
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка131СуммаДоходовПоСделкамПревышаетПредел,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка132СделкаСПлательщикомНДПИ
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка132СделкаСПлательщикомНДПИ,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка133СделкаСКонтрагентомНаСпецрежимах
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка133СделкаСКонтрагентомНаСпецрежимах,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка134СделкаСПлательщикомНалогаНаПрибыль
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка134СделкаСПлательщикомНалогаНаПрибыль,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка135СделкаСРезидентомОЭЗ
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка135СделкаСРезидентомОЭЗ,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка136СделкаМорскогоМесторождения
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка136СделкаМорскогоМесторождения,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка137СделкаИнвестиционныйПроект
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка137СделкаИнвестиционныйПроект,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка138СделкаОсвобождениеОтНДС
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка138СделкаОсвобождениеОтНДС,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.Строка140СделкаНалогНаДополнительныйДоходУглеводородов
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка140СделкаНалогНаДополнительныйДоходУглеводородов,
	|	КонтролируемаяСделка.КодНаименованияСделки КАК Строка210КодНаименованияСделки,
	|	КонтролируемаяСделка.КодСтороныСделки КАК Строка211КодСтороныСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.Валюта.Код, """") КАК КодВалюты,
	|	КонтролируемаяСделка.СпособОпределенияЦеныСделки КАК СпособОпределенияЦеныСделки,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.СпособОпределенияЦеныСделки.ЦенаЯвляетсяРегулируемой
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка220ПризнакОпределенияЦеныСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКПризнакуОпределенияЦеныСделки, """") КАК Строка220_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки, """") = """"
	|			ТОГДА ""0""
	|		ИНАЧЕ КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодОпределенияЦеныСделки
	|	КОНЕЦ КАК Строка230КодОпределенияЦены,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийККодуОпределенияЦеныСделки, """") КАК Строка230_1Комментарий,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КодМетодаЦенообразования, """") КАК Строка240КодМетодовЦенообразования,
	|	ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.КомментарийКМетодуЦенообразования, """") КАК Строка240_1Комментарий,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации251, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка251,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации252, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка252,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации253, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка253,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации254, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка254,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации255, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка255,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации256, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка256,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации257, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка257,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации258, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка258,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(КонтролируемаяСделка.СпособОпределенияЦеныСделки.ИсточникИнформации259, ЛОЖЬ)
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК Строка259,
	|	2 КАК Строка260КоличествоУчастниковСделки,
	|	КонтролируемаяСделка.КомментарийКПункту7 КАК Строка260_1Комментарий,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходов КАК ЧИСЛО(15, 0)) КАК Строка300СуммаДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаДоходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка301СуммаРегулируемыхДоходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходов КАК ЧИСЛО(15, 0)) КАК Строка310СуммаРасходов,
	|	ВЫРАЗИТЬ(КонтролируемаяСделка.СуммаРасходовРегулируемых КАК ЧИСЛО(15, 0)) КАК Строка311СуммаРегулируемыхРасходов,
	|	ВЫБОР
	|		КОГДА Контрагенты.ОбособленноеПодразделение
	|				И Контрагенты.ГоловнойКонтрагент.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Контрагенты.Ссылка
	|		ИНАЧЕ Контрагенты.ГоловнойКонтрагент
	|	КОНЕЦ КАК Контрагент,
	|	Контрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия) КАК ВнешнеторговаяСделка,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ТипКонтрагента,
	|	КонтролируемаяСделка.Договор КАК Договор,
	|	КонтролируемаяСделка.ТипПредметаСделки КАК ТипПредметаСделки,
	|	КонтролируемаяСделка.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	ЕСТЬNULL(КонтролируемаяСделка.КодТНВЭД.Код, """") КАК КодТНВЭД,
	|	ЕСТЬNULL(КонтролируемаяСделка.КодОКПД2.Код, """") КАК КодОКПД2,
	|	ЕСТЬNULL(КонтролируемаяСделка.КодОКВЭД2.Код, """") КАК КодОКВЭД2,
	|	КонтролируемаяСделка.НомерДоговора КАК НомерДоговора,
	|	КонтролируемаяСделка.ДатаДоговора КАК ДатаДоговора,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|				И КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки = ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|		ИНАЧЕ КонтролируемаяСделка.СтранаПроисхожденияПредметаСделки
	|	КОНЕЦ КАК СтранаПроисхожденияПредметаСделки,
	|	КонтролируемаяСделка.СделкаСовершенаЧерезКомиссионера КАК СделкаСовершенаЧерезКомиссионера,
	|	ВЫБОР
	|		КОГДА КонтролируемаяСделка.СделкаСовершенаЧерезКомиссионера
	|			ТОГДА ""1""
	|		ИНАЧЕ ""0""
	|	КОНЕЦ КАК СделкаСовАгент,
	|	ВЫБОР
	|		КОГДА Комиссионеры.ОбособленноеПодразделение
	|				И Комиссионеры.ГоловнойКонтрагент.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Комиссионеры.Ссылка
	|		ИНАЧЕ Комиссионеры.ГоловнойКонтрагент
	|	КОНЕЦ КАК Комиссионер,
	|	Комиссионеры.ЮридическоеФизическоеЛицо КАК ТипКомиссионера
	|ПОМЕСТИТЬ Листы1А
	|ИЗ
	|	Документ.КонтролируемаяСделка КАК КонтролируемаяСделка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыИОрганизации КАК Контрагенты
	|		ПО КонтролируемаяСделка.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтрагентыИОрганизации КАК Комиссионеры
	|		ПО КонтролируемаяСделка.Комиссионер = Комиссионеры.Ссылка
	|ГДЕ
	|	КонтролируемаяСделка.УведомлениеОКонтролируемойСделке = &УведомлениеОКонтролируемойСделке
	|	И НЕ КонтролируемаяСделка.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтролируемаяСделкаСделки.Ссылка КАК Сделка,
	|	Листы1А.НомерЛиста1А КАК НомерЛиста1А,
	|	КонтролируемаяСделкаСделки.НомерСтроки КАК НомерСтроки,
	|	Листы1А.ТипПредметаСделки КАК ТипПредметаСделки,
	|	ВЫБОР
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА 1
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|			ТОГДА 2
	|		КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|				ИЛИ Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|			ТОГДА 3
	|	КОНЕЦ КАК Строка020ТипПредмета,
	|	Листы1А.НаименованиеПредметаСделки КАК Строка030НаименованиеПредмета,
	|	Листы1А.КодТНВЭД КАК Строка040КодПоТНВЭД,
	|	Листы1А.КодОКПД2 КАК Строка043КодПоОКПД2,
	|	Листы1А.КодОКВЭД2 КАК Строка045КодОКВЭД2,
	|	Листы1А.Контрагент КАК Контрагент,
	|	Листы1А.Договор,
	|	Листы1А.НомерДоговора КАК Строка060НомерДоговора,
	|	Листы1А.ДатаДоговора КАК Строка065ДатаДоговора,
	|	ЕСТЬNULL(Листы1А.СтранаПроисхожденияПредметаСделки.Код, """") КАК Строка070КодСтраныПроисхождения,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаОтправкиТовара.Код, """") КАК Строка080КодСтраныОтправки,
	|	КонтролируемаяСделкаСделки.КодРегионаОтправкиТовара КАК Строка080КодРегионаОтправки,
	|	КонтролируемаяСделкаСделки.ГородОтправкиТовара КАК Строка080ГородОтправки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктОтправкиТовара КАК Строка080НаселенныйПунктОтправки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.СтранаСовершенияСделки.Код, """") КАК Строка090КодСтраныСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодРегионаСовершенияСделки КАК Строка090КодРегионаСовершенияСделки,
	|	КонтролируемаяСделкаСделки.ГородСовершенияСделки КАК Строка090ГородСовершенияСделки,
	|	КонтролируемаяСделкаСделки.НаселенныйПунктСовершенияСделки КАК Строка090НаселенныйПунктСовершенияСделки,
	|	КонтролируемаяСделкаСделки.КодУсловийПоставки КАК Строка100КодУсловийПоставки,
	|	ЕСТЬNULL(КонтролируемаяСделкаСделки.ЕдиницаИзмерения.Код, """") КАК Строка110КодЕдиницыИзмерения,
	|	ВЫРАЗИТЬ(КонтролируемаяСделкаСделки.Количество КАК ЧИСЛО(15, 5)) КАК Строка120Количество,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|				ТОГДА 0
	|			ИНАЧЕ КонтролируемаяСделкаСделки.Цена
	|		КОНЕЦ КАК ЧИСЛО(18, 4)) КАК Строка130Цена,
	|	Листы1А.КодВалюты КАК Строка140КодВалюты,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|				ТОГДА КонтролируемаяСделкаСделки.ПроцентнаяСтавка
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ЧИСЛО(7, 4)) КАК Строка150ПроцентнаяСтавка,
	|	ВЫРАЗИТЬ(ВЫБОР
	|			КОГДА Листы1А.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство)
	|				ТОГДА 0
	|			ИНАЧЕ КонтролируемаяСделкаСделки.Стоимость
	|		КОНЕЦ КАК ЧИСЛО(15, 0)) КАК Строка160Стоимость,
	|	КонтролируемаяСделкаСделки.ДатаСовершенияСделки КАК Строка150ДатаСовершения,
	|	Листы1А.ТипКонтрагента КАК ТипКонтрагента,
	|	Листы1А.ВнешнеторговаяСделка КАК ВнешнеторговаяСделка,
	|	Листы1А.СделкаСовершенаЧерезКомиссионера КАК СделкаСовершенаЧерезКомиссионера,
	|	Листы1А.Комиссионер КАК Комиссионер,
	|	Листы1А.ТипКомиссионера КАК ТипКомиссионера
	|ПОМЕСТИТЬ Листы1Б
	|ИЗ
	|	Документ.КонтролируемаяСделка.Сделки КАК КонтролируемаяСделкаСделки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Листы1А КАК Листы1А
	|		ПО КонтролируемаяСделкаСделки.Ссылка = Листы1А.Сделка
	|ГДЕ
	|	КонтролируемаяСделкаСделки.Ссылка В
	|			(ВЫБРАТЬ
	|				Листы1А.Сделка
	|			ИЗ
	|				Листы1А КАК Листы1А)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сделка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Листы1А.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ КонтрагентыЛистов1А
	|ИЗ
	|	Листы1А КАК Листы1А
	|ГДЕ
	|	Листы1А.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Листы1А.Комиссионер
	|ИЗ
	|	Листы1А КАК Листы1А
	|ГДЕ
	|	Листы1А.Комиссионер <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.ГоловнойКонтрагент
	|ИЗ
	|	Листы1А КАК Листы1А
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыИОрганизации КАК Контрагенты
	|		ПО Листы1А.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	Листы1А.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контрагенты.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контрагенты.ГоловнойКонтрагент <> Листы1А.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.ГоловнойКонтрагент
	|ИЗ
	|	Листы1А КАК Листы1А
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыИОрганизации КАК Контрагенты
	|		ПО Листы1А.Комиссионер = Контрагенты.Ссылка
	|ГДЕ
	|	Листы1А.Комиссионер <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контрагенты.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И Контрагенты.ГоловнойКонтрагент <> Листы1А.Комиссионер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	Контрагенты.ЮридическоеФизическоеЛицо КАК ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеМеждународное КАК НаименованиеВЛатинскойТранскрипции,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	ВЫРАЗИТЬ(Контрагенты.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
	|	Контрагенты.РегистрационныйНомер КАК РегистрационныйНомер,
	|	Контрагенты.НалоговыйНомер КАК НалоговыйНомер,
	|	Контрагенты.СтранаРегистрации КАК СтранаРегистрации,
	|	МАКСИМУМ(ЕСТЬNULL(ДанныеКонтактнойИнформацииКонтрагента.ДействуетС, ЕСТЬNULL(ДанныеКонтактнойИнформацииОрганизации.ДействуетС, ДатаВремя(1,1,1)))) КАК ДатаАктуальностиКонтактнойИнформации,
	|	МАКСИМУМ(ЕСТЬNULL(ДанныеКПП.Период, ДатаВремя(1,1,1))) КАК ДатаАктуальностиКПП,
	|	МАКСИМУМ(ЕСТЬNULL(ДанныеНаименований.Период, ДатаВремя(1,1,1))) КАК ДатаАктуальностиНаименований
	|ПОМЕСТИТЬ КонтагентыКонтролируемыхСделок
	|ИЗ
	|	КонтрагентыЛистов1А КАК Листы1А
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыИОрганизации КАК Контрагенты
	|		ПО Листы1А.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК ДанныеКонтактнойИнформацииКонтрагента
	|			ПО Листы1А.Контрагент = ДанныеКонтактнойИнформацииКонтрагента.Ссылка
	|				И ДанныеКонтактнойИнформацииКонтрагента.ДействуетС <= &ДатаАктуальностиСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК ДанныеКонтактнойИнформацииОрганизации
	|			ПО Листы1А.Контрагент = ДанныеКонтактнойИнформацииОрганизации.Ссылка
	|				И ДанныеКонтактнойИнформацииОрганизации.ДействуетС <= &ДатаАктуальностиСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ДанныеКПП
	|			ПО Листы1А.Контрагент = ДанныеКПП.Ссылка
	|				И ДанныеКПП.Период <= &ДатаАктуальностиСведений
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияНаименований КАК ДанныеНаименований
	|			ПО Листы1А.Контрагент = ДанныеНаименований.Ссылка
	|				И ДанныеНаименований.Период <= &ДатаАктуальностиСведений
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.Ссылка,
	|	Контрагенты.ГоловнойКонтрагент,
	|	Контрагенты.ЮридическоеФизическоеЛицо,
	|	Контрагенты.НаименованиеМеждународное,
	|	Контрагенты.ИНН,
	|	Контрагенты.КПП,
	|	Контрагенты.НаименованиеПолное,
	|	Контрагенты.РегистрационныйНомер,
	|	Контрагенты.НалоговыйНомер,
	|	Контрагенты.СтранаРегистрации
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка,
	|	ЮридическоеФизическоеЛицо;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ГоловныеКонтрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Строка020ТипОрганизации,
	|	ВЫБОР
	|		КОГДА ГоловныеКонтрагенты.СтранаРегистрации.Код ЕСТЬ NULL
	|			ТОГДА """"
	|		ИНАЧЕ ГоловныеКонтрагенты.СтранаРегистрации.Код
	|	КОНЕЦ КАК Строка030КакКодСтраныРегистрации,
	|	ЕСТЬNULL(ВЫРАЗИТЬ(ИсторияНаименованийКонтрагента.НаименованиеПолное КАК СТРОКА(1000)), ГоловныеКонтрагенты.НаименованиеПолное) КАК Строка040Наименование,
	|	ЕСТЬNULL(ГоловныеКонтрагенты.НаименованиеВЛатинскойТранскрипции, """") КАК Строка040НаименованиеЛат,
	|	ВЫБОР
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Контрагенты.ИНН
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Строка050ИНН,
	|	ВЫБОР
	|		КОГДА ГоловныеКонтрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЕСТЬNULL(ИсторияКППГоловногоКонтрагента.КПП, ГоловныеКонтрагенты.КПП)
	|		КОГДА Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ЕСТЬNULL(ИсторияКППКонтрагента.КПП, Контрагенты.КПП)
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК Строка060КПП,
	|	ВЫБОР
	|		КОГДА ГоловныеКонтрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ ГоловныеКонтрагенты.РегистрационныйНомер
	|	КОНЕЦ КАК Строка070РегНомерВСтрокеРегистрации,
	|	ВЫБОР
	|		КОГДА ГоловныеКонтрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ ГоловныеКонтрагенты.НалоговыйНомер
	|	КОНЕЦ КАК Строка080КодНалогВСтранеРегистрации,
	|	ВЫБОР
	|		КОГДА ГоловныеКонтрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(КонтактнаяИнформацияКонтрагента.Представление, ЕСТЬNULL(КонтактнаяИнформацияОрганизации.Представление, """"))
	|	КОНЕЦ КАК Строка090АдресИностраннойОрганизации
	|ПОМЕСТИТЬ Раздел2
	|ИЗ
	|	КонтагентыКонтролируемыхСделок КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтагентыКонтролируемыхСделок КАК ГоловныеКонтрагенты
	|		ПО (ГоловныеКонтрагенты.Ссылка = Контрагенты.ГоловнойКонтрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформацияКонтрагента
	|		ПО ГоловныеКонтрагенты.Ссылка = КонтактнаяИнформацияКонтрагента.Ссылка
	|			И ГоловныеКонтрагенты.ДатаАктуальностиКонтактнойИнформации = КонтактнаяИнформацияКонтрагента.ДействуетС
	|			И (КонтактнаяИнформацияКонтрагента.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияКонтрагента.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.КонтактнаяИнформация КАК КонтактнаяИнформацияОрганизации
	|		ПО ГоловныеКонтрагенты.Ссылка = КонтактнаяИнформацияОрганизации.Ссылка
	|			И ГоловныеКонтрагенты.ДатаАктуальностиКонтактнойИнформации = КонтактнаяИнформацияОрганизации.ДействуетС
	|			И (КонтактнаяИнформацияОрганизации.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияОрганизации.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ЮрАдресКонтрагента))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППКонтрагента
	|		ПО Контрагенты.Ссылка = ИсторияКППКонтрагента.Ссылка
	|			И Контрагенты.ДатаАктуальностиКПП = ИсторияКППКонтрагента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияКПП КАК ИсторияКППГоловногоКонтрагента
	|		ПО ГоловныеКонтрагенты.Ссылка = ИсторияКППГоловногоКонтрагента.Ссылка
	|			И ГоловныеКонтрагенты.ДатаАктуальностиКПП = ИсторияКППГоловногоКонтрагента.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ИсторияНаименований КАК ИсторияНаименованийКонтрагента
	|		ПО ГоловныеКонтрагенты.Ссылка = ИсторияНаименованийКонтрагента.Ссылка
	|			И ГоловныеКонтрагенты.ДатаАктуальностиНаименований = ИсторияНаименованийКонтрагента.Период
	|ГДЕ
	|	Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыФизическихЛицСрезПоследних.Физлицо КАК Физлицо,
	|	ДокументыФизическихЛицСрезПоследних.Период КАК Период,
	|	МАКСИМУМ(ДокументыФизическихЛицСрезПоследних.ВидДокумента) КАК ВидДокумента
	|ПОМЕСТИТЬ ВидыДокументовФизическихЛиц
	|ИЗ
	|	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(
	|			&ДатаАктуальностиСведений,
	|			Физлицо В
	|				(ВЫБРАТЬ
	|					УчастникиСделок.ФизическоеЛицо
	|				ИЗ
	|					РегистрСведений.ДанныеПоКонтрагентамКонтролируемыхСделок КАК УчастникиСделок)) КАК ДокументыФизическихЛицСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ДокументыФизическихЛицСрезПоследних.Физлицо,
	|	ДокументыФизическихЛицСрезПоследних.Период
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Физлицо,
	|	Период,
	|	ВидДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ГражданствоФизическихЛицСрезПоследних.Страна КАК Страна
	|ПОМЕСТИТЬ ГражданствоФизическихЛиц
	|ИЗ
	|	РегистрСведений.ГражданствоФизическихЛиц.СрезПоследних(
	|			&ДатаАктуальностиСведений,
	|			ФизическоеЛицо В
	|				(ВЫБРАТЬ
	|					УчастникиСделок.ФизическоеЛицо
	|				ИЗ
	|					РегистрСведений.ДанныеПоКонтрагентамКонтролируемыхСделок КАК УчастникиСделок)) КАК ГражданствоФизическихЛицСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ГражданствоФизическихЛицСрезПоследних.ФизическоеЛицо,
	|	ГражданствоФизическихЛицСрезПоследних.Страна
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтрагентыЛистов1А.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.КодВидаДеятельностиФизическогоЛица, """") КАК Строка020КодВидаДеятельности,
	|	КонтрагентыЛистов1А.ИНН КАК Строка030ИНН,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК ФизическоеЛицо,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо.ДатаРождения, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаРождения,
	|	ЕСТЬNULL(УчастникиКонтролируемыхСделок.ФизическоеЛицо.МестоРождения, """") КАК МестоРождения,
	|	ГражданствоФизическихЛиц.Страна КАК ГражданствоФизЛицСтрана,
	|	КонтактнаяИнформацияФизлица.Вид КАК ВидКонтактнойИнформации,
	|	КонтактнаяИнформацияФизлица.ЗначенияПолей КАК КонтактнаяИнформацияЗначенияПолей,
	|	КонтактнаяИнформацияФизлица.Значение КАК КонтактнаяИнформацияЗначениеJSON,
	|	КонтактнаяИнформацияФизлица.Страна КАК КонтактнаяИнформацияСтрана,
	|	КонтактнаяИнформацияФизлица.Представление КАК КонтактнаяИнформацияПредставление,
	|	КонтактнаяИнформацияЗаРФ.Страна КАК КонтактнаяИнформацияЗаРФСтрана,
	|	КонтактнаяИнформацияЗаРФ.Представление КАК КонтактнаяИнформацияЗаРФПредставление,
	|	ДокументыФизическихЛиц.ВидДокумента КАК ВидДокумента,
	|	ДокументыФизическихЛиц.Серия КАК ДокументСерия,
	|	ДокументыФизическихЛиц.Номер КАК ДокументНомер,
	|	ДокументыФизическихЛиц.КемВыдан КАК ДокументКемВыдан,
	|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДокументДатаВыдачи,
	|	ФИОФизЛиц.Фамилия КАК Фамилия,
	|	ФИОФизЛиц.Имя КАК Имя,
	|	ФИОФизЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ Раздел3
	|ИЗ
	|	КонтагентыКонтролируемыхСделок КАК КонтрагентыЛистов1А
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПоКонтрагентамКонтролируемыхСделок КАК УчастникиКонтролируемыхСделок
	|		ПО КонтрагентыЛистов1А.Ссылка = УчастникиКонтролируемыхСделок.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГражданствоФизическихЛиц КАК ГражданствоФизическихЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ГражданствоФизическихЛиц.ФизическоеЛицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияФизлица
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформацияФизлица.Ссылка)
	|			И (КонтактнаяИнформацияФизлица.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияФизлица.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформацияЗаРФ
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = КонтактнаяИнформацияЗаРФ.Ссылка)
	|			И (КонтактнаяИнформацияЗаРФ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес))
	|			И (КонтактнаяИнформацияЗаРФ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресЗаПределамиРФФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыДокументовФизическихЛиц КАК ВидыДокументовФизическихЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ВидыДокументовФизическихЛиц.Физлицо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
	|		ПО (ДокументыФизическихЛиц.Физлицо = ВидыДокументовФизическихЛиц.Физлицо)
	|			И (ДокументыФизическихЛиц.Период = ВидыДокументовФизическихЛиц.Период)
	|			И (ДокументыФизическихЛиц.ВидДокумента = ВидыДокументовФизическихЛиц.ВидДокумента)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц.СрезПоследних(&ДатаАктуальностиСведений, ) КАК ФИОФизЛиц
	|		ПО (УчастникиКонтролируемыхСделок.ФизическоеЛицо = ФИОФизЛиц.ФизическоеЛицо)
	|ГДЕ
	|	КонтрагентыЛистов1А.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)";
	
	Возврат(ТекстЗапроса);
	
КонецФункции

// Возвращает текст настроек, с данными о методе выставления листа 1Б (для каждой сделки или для нескольких) и коде
// места представления.
//	Возвращаемое значение:
//		Строка - текст.
//
Функция ПолучитьТекстНастроекФормированияУведомления(Уведомление) Экспорт
	
	Если ЗначениеЗаполнено(Уведомление) Тогда
		НастройкиФормирования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "ГруппироватьСделкиСОдинаковойЦеной, КодМестаПредставления");
	Иначе
		НастройкиФормирования = Новый Структура("ГруппироватьСделкиСОдинаковойЦеной, КодМестаПредставления", Ложь, "");
	КонецЕсли;
	
	
	Если НастройкиФормирования.ГруппироватьСделкиСОдинаковойЦеной Тогда
		ТекстНастроек = НСтр("ru = 'Один лист 1Б для нескольких сделок; Код места представления %1';
							|en = 'One sheet 1B for several transactions; %1 submission location code '");
	Иначе
		ТекстНастроек = НСтр("ru = 'Один лист 1Б для каждой сделки; Код места представления %1';
							|en = 'One sheet 1B for each transaction; %1 submission location code '");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НастройкиФормирования.КодМестаПредставления) Тогда
		ТекстНастроек = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНастроек, НастройкиФормирования.КодМестаПредставления);
	Иначе
		ТекстНастроек = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстНастроек, НСтр("ru = 'не заполнен';
																									|en = 'not filled in'"));
	КонецЕсли;
	
	Возврат ТекстНастроек;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ПечатьИВыгрузка_2018

Функция СведенияОГражданстве2018(СтранаГражданства) Экспорт
	
	СведенияОГражданстве = Новый Структура();
	СведенияОГражданстве.Вставить("Гражд", "3"); // Без гражданства
	СведенияОГражданстве.Вставить("ОКСМ", "");
	
	Если ЗначениеЗаполнено(СтранаГражданства) Тогда
		СведенияОГражданстве.Гражд = ?(СтранаГражданства = Справочники.СтраныМира.Россия, "1", "2");
		СведенияОГражданстве.ОКСМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтранаГражданства, "Код");
	КонецЕсли;
	
	Возврат СведенияОГражданстве;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Уведомление о контролируемых сделках за %1 г.';
			|en = 'Notification of controlled transactions for %1'"),
		Формат(Данные.ОтчетныйГод, "ДФ=yyyy"));
		
	Если Данные.НомерКорректировки > 0 Тогда
		
		Представление = Представление + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = ', корректировка %1';
				|en = ', adjustment %1'"),
			Формат(Данные.НомерКорректировки, "ЧГ="));
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ОтчетныйГод");
	Поля.Добавить("НомерКорректировки");
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

// Добавляет команду создания документа "Уведомление о контролируемых сделках".
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - Таблица с командами создания на основании. Для изменения.
//       См. описание 1 параметра процедуры СозданиеНаОснованииПереопределяемый.ПередДобавлениемКомандСозданияНаОсновании().
//
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	Если ПравоДоступа("Добавление", Метаданные.Документы.УведомлениеОКонтролируемыхСделках) Тогда
		КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
		КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.УведомлениеОКонтролируемыхСделках.ПолноеИмя();
		КомандаСоздатьНаОсновании.Представление = ОбщегоНазначенияУТ.ПредставлениеОбъекта(Метаданные.Документы.УведомлениеОКонтролируемыхСделках);
		КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		КомандаСоздатьНаОсновании.ФункциональныеОпции = "ИспользоватьУведомленияОКонтролируемыхСделках";
	

		Возврат КомандаСоздатьНаОсновании;
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

#Область АвтоматическоеЗаполнение

Функция ИсключенияЗаполненияЛиста1А(ВерсияУведомления)
	
	ИсключенияДляЗаполненияЛиста1А = Новый Массив;
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		// Все показатели Листа 1А и 1Б уведомления о контролируемых сделках выводятся в рублях.
		// Поэтому из сделки валюта не переносится - она устанавливается при записи документа - всегда в валюту регламентированного учета.
		ИсключенияДляЗаполненияЛиста1А.Добавить("Валюта");
	КонецЕсли;
	
	Если ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012() Тогда
		ИсключенияДляЗаполненияЛиста1А.Добавить("КодОКПД2");
		ИсключенияДляЗаполненияЛиста1А.Добавить("КодОКВЭД2");
	Иначе
		ИсключенияДляЗаполненияЛиста1А.Добавить("КодОКП");
		ИсключенияДляЗаполненияЛиста1А.Добавить("КодОКВЭД");
	КонецЕсли;
	
	Возврат СтрСоединить(ИсключенияДляЗаполненияЛиста1А, ",");
	
КонецФункции

Функция ИсключенияЗаполненияЛиста1Б(ВерсияУведомления, ТипПредметаСделки)
	
	ИсключенияДляЗаполненияЛиста1Б = Новый Массив;
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018()
		Или ТипПредметаСделки <> Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство Тогда
		ИсключенияДляЗаполненияЛиста1Б.Добавить("ПроцентнаяСтавка");
	КонецЕсли;
	
	Возврат СтрСоединить(ИсключенияДляЗаполненияЛиста1Б, ",");
	
КонецФункции

Процедура ЗаполнитьДатуСделкиДолговыхОбязательств(Сделка, ВерсияУведомления, ТипПредметаСделки, ДатаПроцентнойСтавки)
	
	Если ВерсияУведомления >= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018()
		И ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство Тогда
		Сделка.ДатаСовершенияСделки = ДатаПроцентнойСтавки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуСделокЛиста1А(Лист1А, ТаблицаСделок, СписокПолейСделки, СтруктураКлючевыхПолей)
	
	ТаблицаСделок.Свернуть(СписокПолейСделки + ", РасчетныйДокумент", "Количество, Стоимость, СтоимостьДляРасчетаЦены");
	Если Лист1А.ТипПредметаСделки <> Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство Тогда
		Для Каждого Сделка Из ТаблицаСделок Цикл
			Сделка.Цена = ?(Сделка.Количество = 0, Сделка.СтоимостьДляРасчетаЦены, Окр(Сделка.СтоимостьДляРасчетаЦены/Сделка.Количество, 2));
		КонецЦикла;
	КонецЕсли;
	
	ТаблицаСделок.Сортировать("ДатаСовершенияСделки");
	
	Листы1Б = ТаблицаСделок.СкопироватьКолонки();
	
	СделкаДокумента = Неопределено;
	Для Каждого Сделка Из ТаблицаСделок Цикл
		Если (Сделка.Количество <> 0) ИЛИ (Сделка.Стоимость <> 0) ИЛИ (Сделка.ПроцентнаяСтавка <> 0) Тогда
			
			Если СделкаДокумента = Неопределено 
				ИЛИ Лист1А.ТипПредметаСделки <> Перечисления.ТипыПредметовКонтролируемыхСделок.Товар
				ИЛИ НЕ СделкиСовпадают(СделкаДокумента, Сделка, СтруктураКлючевыхПолей) Тогда
				СделкаДокумента = Листы1Б.Добавить();
				ЗаполнитьЗначенияСвойств(СделкаДокумента, Сделка, , "Количество, Стоимость");
			КонецЕсли;
			СделкаДокумента.Количество = СделкаДокумента.Количество + Сделка.Количество;
			СделкаДокумента.Стоимость = СделкаДокумента.Стоимость + Сделка.Стоимость;
			СделкаДокумента.ДатаСовершенияСделки = Сделка.ДатаСовершенияСделки;
		КонецЕсли;
	КонецЦикла;
	
	Лист1А.Сделки.Загрузить(Листы1Б);
	
КонецПроцедуры

Функция СделкиСовпадают(Сделка1, Сделка2, СтруктураКлючевыхПолей)
	
	Для Каждого Поле Из СтруктураКлючевыхПолей Цикл
		Если Сделка1[Поле.Ключ] <> Сделка2[Поле.Ключ] Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
	
КонецФункции

Функция ПолучитьВременныеТаблицыДляЗаполненияСделок(Уведомление)
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ПараметрыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "Организация, ОтчетныйГод");
	Организации = Новый Массив(1);
	Организации[0] = ПараметрыУведомления.Организация;
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("СписокОрганизаций", Организации);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("СписокКодовСтранОфшоров", КонтролируемыеСделкиПовтИсп.ПереченьКодовСтранОфшоров(ПараметрыУведомления.ОтчетныйГод));
	Запрос.УстановитьПараметр("СписокКодовТНВЭДМировойБиржевойТорговли", КонтролируемыеСделкиПовтИсп.ПереченьКодовТНВЭДМировойБиржевойТорговли());
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Страны.Ссылка КАК Страна
	|ПОМЕСТИТЬ СтраныСЛьготнымНалогообложением
	|ИЗ
	|	Справочник.СтраныМира КАК Страны
	|ГДЕ
	|	Страны.Код В(&СписокКодовСтранОфшоров)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Страна
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК ПредметСделки
	|ПОМЕСТИТЬ ТоварыМировойБиржевойТорговли
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
	|		ПО Номенклатура.КодТНВЭД = КлассификаторТНВЭД.Ссылка
	|ГДЕ
	|	КлассификаторТНВЭД.Код В(&СписокКодовТНВЭДМировойБиржевойТорговли)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	&НачалоПериода,
	|	ВзаимозависимыеЛицаСрезПоследних.Организация,
	|	ВзаимозависимыеЛицаСрезПоследних.Контрагент КАК Контрагент,
	|	ВзаимозависимыеЛицаСрезПоследних.ТипВзаимозависимости
	|ПОМЕСТИТЬ ВзаимозависимыеЛицаГоловныеКонтрагенты
	|ИЗ
	|	РегистрСведений.ВзаимозависимыеЛица.СрезПоследних(&НачалоПериода, Организация В (&СписокОрганизаций)) КАК ВзаимозависимыеЛицаСрезПоследних
	|ГДЕ
	|	ВзаимозависимыеЛицаСрезПоследних.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзаимозависимыеЛица.Период,
	|	ВзаимозависимыеЛица.Организация,
	|	ВзаимозависимыеЛица.Контрагент,
	|	ВзаимозависимыеЛица.ТипВзаимозависимости
	|ИЗ
	|	РегистрСведений.ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	|ГДЕ
	|	ВзаимозависимыеЛица.Период > &НачалоПериода
	|	И ВзаимозависимыеЛица.Период <= &ОкончаниеПериода
	|	И ВзаимозависимыеЛица.Организация В(&СписокОрганизаций)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.НачалоПериода КАК НачалоПериода,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Организация КАК Организация,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент КАК ГоловнойКонтрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ТипВзаимозависимости,
	|	Контрагенты.Ссылка КАК Контрагент
	|ПОМЕСТИТЬ ВзаимозависимыеЛица
	|ИЗ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты КАК ВзаимозависимыеЛицаГоловныеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент = Контрагенты.ГоловнойКонтрагент
	|			И (Контрагенты.ОбособленноеПодразделение)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.НачалоПериода,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Организация,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ТипВзаимозависимости,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент
	|ИЗ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты КАК ВзаимозависимыеЛицаГоловныеКонтрагенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.НачалоПериода,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Организация,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент,
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты.ТипВзаимозависимости,
	|	Организации.Ссылка
	|ИЗ
	|	ВзаимозависимыеЛицаГоловныеКонтрагенты КАК ВзаимозависимыеЛицаГоловныеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ВзаимозависимыеЛицаГоловныеКонтрагенты.Контрагент = Организации.ГоловнаяОрганизация
	|			И (Организации.ОбособленноеПодразделение)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаимозависимыеЛица.Организация КАК Организация,
	|	ВзаимозависимыеЛица.ГоловнойКонтрагент,
	|	ВзаимозависимыеЛица.НачалоПериода,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(БудущиеВзаимозависимыеЛица.НачалоПериода, &ОкончаниеПериода)), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|	ВзаимозависимыеЛица.ТипВзаимозависимости,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛица.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НевзаимозависимыйПосредник,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛица.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВзаимозависимыеЛица.Контрагент
	|ПОМЕСТИТЬ ВзаимозависимыеЛицаПоПериодам
	|ИЗ
	|	ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛица КАК БудущиеВзаимозависимыеЛица
	|		ПО ВзаимозависимыеЛица.Организация = БудущиеВзаимозависимыеЛица.Организация
	|			И ВзаимозависимыеЛица.НачалоПериода < БудущиеВзаимозависимыеЛица.НачалоПериода
	|			И ВзаимозависимыеЛица.Контрагент = БудущиеВзаимозависимыеЛица.Контрагент
	|ГДЕ
	|	ВзаимозависимыеЛица.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаимозависимыеЛица.Организация,
	|	ВзаимозависимыеЛица.ГоловнойКонтрагент,
	|	ВзаимозависимыеЛица.НачалоПериода,
	|	ВзаимозависимыеЛица.ТипВзаимозависимости,
	|	ВзаимозависимыеЛица.Контрагент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛица.ТипВзаимозависимости = ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимыйПосредник)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛица.ТипВзаимозависимости <> ЗНАЧЕНИЕ(Перечисление.ТипыВзаимозависимости.НеВзаимозависимы)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&НачалоПериода,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.Контрагент КАК Контрагент,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ЯвляетсяПлательщикомНДПИ,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ЯвляетсяПлательщикомЕСХН,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ЯвляетсяПлательщикомЕНВД,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ЗарегистрированВОЭЗ,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ОсвобожденОтУплатыНДС,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.КодВидаДеятельностиФизическогоЛица,
	|	ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних.ФизическоеЛицо
	|ПОМЕСТИТЬ ДанныеПоГоловнымКонтрагентам
	|ИЗ
	|	РегистрСведений.ДанныеПоКонтрагентамКонтролируемыхСделок.СрезПоследних(, ) КАК ДанныеПоКонтрагентамКонтролируемыхСделокСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.Период,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.Контрагент,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ЯвляетсяПлательщикомЕСХН,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ЯвляетсяПлательщикомЕНВД,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ЗарегистрированВОЭЗ,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ОсвобожденОтУплатыНДС,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.КодВидаДеятельностиФизическогоЛица,
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ДанныеПоКонтрагентамКонтролируемыхСделок КАК ДанныеПоКонтрагентамКонтролируемыхСделок
	|ГДЕ
	|	ДанныеПоКонтрагентамКонтролируемыхСделок.Период > &НачалоПериода
	|	И ДанныеПоКонтрагентамКонтролируемыхСделок.Период <= &ОкончаниеПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоГоловнымКонтрагентам.НачалоПериода КАК НачалоПериода,
	|	ДанныеПоГоловнымКонтрагентам.Контрагент КАК ГоловнойКонтрагент,
	|	ЕСТЬNULL(Контрагенты.Ссылка, ДанныеПоГоловнымКонтрагентам.Контрагент) КАК Контрагент,
	|	ДанныеПоГоловнымКонтрагентам.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ДанныеПоГоловнымКонтрагентам.ЯвляетсяПлательщикомНДПИ,
	|	ДанныеПоГоловнымКонтрагентам.ЯвляетсяПлательщикомЕСХН,
	|	ДанныеПоГоловнымКонтрагентам.ЯвляетсяПлательщикомЕНВД,
	|	ДанныеПоГоловнымКонтрагентам.ЗарегистрированВОЭЗ,
	|	ДанныеПоГоловнымКонтрагентам.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ДанныеПоГоловнымКонтрагентам.ОсвобожденОтУплатыНДС,
	|	ДанныеПоГоловнымКонтрагентам.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль,
	|	ДанныеПоГоловнымКонтрагентам.КодВидаДеятельностиФизическогоЛица,
	|	ДанныеПоГоловнымКонтрагентам.ФизическоеЛицо
	|ПОМЕСТИТЬ ДанныеПоКонтрагентам
	|ИЗ
	|	ДанныеПоГоловнымКонтрагентам КАК ДанныеПоГоловнымКонтрагентам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДанныеПоГоловнымКонтрагентам.Контрагент = Контрагенты.ГоловнойКонтрагент
	|			И (Контрагенты.ОбособленноеПодразделение)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеПоКонтрагентам.Контрагент КАК Контрагент,
	|	ДанныеПоКонтрагентам.ГоловнойКонтрагент,
	|	ДанныеПоКонтрагентам.НачалоПериода,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(БудущиеДанныеПоКонтрагентам.НачалоПериода, &ОкончаниеПериода)), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|	ДанныеПоКонтрагентам.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ДанныеПоКонтрагентам.ЯвляетсяПлательщикомНДПИ,
	|	ДанныеПоКонтрагентам.ЯвляетсяПлательщикомЕСХН,
	|	ДанныеПоКонтрагентам.ЯвляетсяПлательщикомЕНВД,
	|	ДанныеПоКонтрагентам.ЗарегистрированВОЭЗ,
	|	ДанныеПоКонтрагентам.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ДанныеПоКонтрагентам.ОсвобожденОтУплатыНДС,
	|	ДанныеПоКонтрагентам.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль,
	|	ДанныеПоКонтрагентам.КодВидаДеятельностиФизическогоЛица,
	|	ДанныеПоКонтрагентам.ФизическоеЛицо
	|ПОМЕСТИТЬ ДанныеПоКонтрагентамПоПериодам
	|ИЗ
	|	ДанныеПоКонтрагентам КАК ДанныеПоКонтрагентам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПоКонтрагентам КАК БудущиеДанныеПоКонтрагентам
	|		ПО ДанныеПоКонтрагентам.Контрагент = БудущиеДанныеПоКонтрагентам.Контрагент
	|			И ДанныеПоКонтрагентам.НачалоПериода < БудущиеДанныеПоКонтрагентам.НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеПоКонтрагентам.Контрагент,
	|	ДанныеПоКонтрагентам.ГоловнойКонтрагент,
	|	ДанныеПоКонтрагентам.НачалоПериода,
	|	ДанныеПоКонтрагентам.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ДанныеПоКонтрагентам.ЯвляетсяПлательщикомНДПИ,
	|	ДанныеПоКонтрагентам.ЯвляетсяПлательщикомЕСХН,
	|	ДанныеПоКонтрагентам.ЯвляетсяПлательщикомЕНВД,
	|	ДанныеПоКонтрагентам.ЗарегистрированВОЭЗ,
	|	ДанныеПоКонтрагентам.ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	ДанныеПоКонтрагентам.ОсвобожденОтУплатыНДС,
	|	ДанныеПоКонтрагентам.ПрименяетИнвестиционныйВычетПоНалогуНаПрибыль,
	|	ДанныеПоКонтрагентам.КодВидаДеятельностиФизическогоЛица,
	|	ДанныеПоКонтрагентам.ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&НачалоПериода КАК НачалоПериода,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация КАК Организация,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ЯвляетсяПлательщикомНДПИ КАК ЯвляетсяПлательщикомНДПИ,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Организация.ЗарегистрированВОЭЗ КАК ЗарегистрированВОЭЗ,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ПрименяетсяЕНВД КАК ЯвляетсяПлательщикомЕНВД,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.ПлательщикНалогаНаПрибыль КАК ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ЛОЖЬ КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	УчетнаяПолитикаОрганизацийСрезПоследних.УчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС КАК ОсвобожденОтУплатыНДС
	|ПОМЕСТИТЬ СведенияОбОрганизацииДляКонтролируемыхСделок
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&НачалоПериода) КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	|	ПО ВзаимозависимыеЛица.Организация = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|	ИЛИ ВзаимозависимыеЛица.Контрагент = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УчетнаяПолитикаОрганизаций.Период,
	|	УчетнаяПолитикаОрганизаций.Организация,
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика.ЯвляетсяПлательщикомНДПИ,
	|	УчетнаяПолитикаОрганизаций.Организация.ЗарегистрированВОЭЗ,
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика.ПрименяетсяЕНВД,
	|	УчетнаяПолитикаОрганизаций.ПлательщикНалогаНаПрибыль,
	|	ЛОЖЬ КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика.ПрименяетсяОсвобождениеОтУплатыНДС
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВзаимозависимыеЛица КАК ВзаимозависимыеЛица
	|	ПО ВзаимозависимыеЛица.Организация = УчетнаяПолитикаОрганизаций.Организация
	|	ИЛИ ВзаимозависимыеЛица.Контрагент = УчетнаяПолитикаОрганизаций.Организация
	|ГДЕ
	|	УчетнаяПолитикаОрганизаций.Период > &НачалоПериода
	|	И УчетнаяПолитикаОрганизаций.Период <= &ОкончаниеПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НачалоПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Организация КАК Организация,
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(МИНИМУМ(ЕСТЬNULL(БудущиеСведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода, &ОкончаниеПериода)), СЕКУНДА, -1), ДЕНЬ) КАК ОкончаниеПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЗарегистрированВОЭЗ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомЕНВД,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	ЛОЖЬ КАК ПрименяетЛьготыУчастникаРегиональногоИнвестиционногоПроекта,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ОсвобожденОтУплатыНДС КАК ОсвобожденОтУплатыНДС
	|ПОМЕСТИТЬ СведенияОбОрганизацииДляКонтролируемыхСделокПоПериодам
	|ИЗ
	|	СведенияОбОрганизацииДляКонтролируемыхСделок КАК СведенияОбОрганизацииДляКонтролируемыхСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ СведенияОбОрганизацииДляКонтролируемыхСделок КАК БудущиеСведенияОбОрганизацииДляКонтролируемыхСделок
	|		ПО СведенияОбОрганизацииДляКонтролируемыхСделок.Организация = БудущиеСведенияОбОрганизацииДляКонтролируемыхСделок.Организация
	|			И СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода < БудущиеСведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.НачалоПериода,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.Организация,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНДПИ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЗарегистрированВОЭЗ,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомЕНВД,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ЯвляетсяПлательщикомНалогаНаПрибыль,
	|	СведенияОбОрганизацииДляКонтролируемыхСделок.ОсвобожденОтУплатыНДС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	ЕСТЬNULL(ГоловныеКонтрагенты.Ссылка, Контрагенты.Ссылка) КАК ГоловнойКонтрагент,
	|	ВЫБОР
	|		КОГДА СтраныСЛьготнымНалогообложением.Страна ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ИСТИНА КАК СделкаВОбластиВнешнейТорговли
	|ПОМЕСТИТЬ ИностранныеКонтрагенты
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|		ПО Контрагенты.ГоловнойКонтрагент = ГоловныеКонтрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныСЛьготнымНалогообложением КАК СтраныСЛьготнымНалогообложением
	|		ПО (СтраныСЛьготнымНалогообложением.Страна = Контрагенты.СтранаРегистрации)
	|ГДЕ
	|	Контрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|	И Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Контрагенты.Ссылка,
	|	ГоловныеКонтрагенты.Ссылка,
	|	ВЫБОР
	|		КОГДА СтраныСЛьготнымНалогообложением.Страна ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ГоловныеКонтрагенты
	|		ПО (ГоловныеКонтрагенты.Ссылка = Контрагенты.ГоловнойКонтрагент)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныСЛьготнымНалогообложением КАК СтраныСЛьготнымНалогообложением
	|		ПО (СтраныСЛьготнымНалогообложением.Страна = ГоловныеКонтрагенты.СтранаРегистрации)
	|ГДЕ
	|	Контрагенты.ГоловнойКонтрагент <> Контрагенты.Ссылка
	|	И ГоловныеКонтрагенты.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|	И Контрагенты.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ЕСТЬNULL(ГоловныеОрганизации.Ссылка, Организации.Ссылка) КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА СтраныСЛьготнымНалогообложением.Страна ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЗарегистрированаВСтранеСЛьготнымНалогообложением,
	|	ИСТИНА КАК СделкаВОбластиВнешнейТорговли
	|ПОМЕСТИТЬ ИностранныеОрганизации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныСЛьготнымНалогообложением КАК СтраныСЛьготнымНалогообложением
	|		ПО Организации.СтранаРегистрации = СтраныСЛьготнымНалогообложением.Страна
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК ГоловныеОрганизации
	|		ПО Организации.ГоловнаяОрганизация = ГоловныеОрганизации.Ссылка
	|ГДЕ
	|	Организации.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|	И Организации.ИностраннаяОрганизация
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Организации.Ссылка,
	|	ГоловныеОрганизации.Ссылка,
	|	ВЫБОР
	|		КОГДА СтраныСЛьготнымНалогообложением.Страна ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК ГоловныеОрганизации
	|		ПО (ГоловныеОрганизации.Ссылка = Организации.ГоловнаяОрганизация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ СтраныСЛьготнымНалогообложением КАК СтраныСЛьготнымНалогообложением
	|		ПО (СтраныСЛьготнымНалогообложением.Страна = ГоловныеОрганизации.СтранаРегистрации)
	|ГДЕ
	|	Организации.ГоловнаяОрганизация <> Организации.Ссылка
	|	И ГоловныеОрганизации.СтранаРегистрации <> ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|	И Организации.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВзаимозависимыеЛица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВзаимозависимыеЛицаПоПериодам.Контрагент КАК Контрагент,
	|	ВзаимозависимыеЛицаПоПериодам.ГоловнойКонтрагент КАК ГоловнойКонтрагент
	|ПОМЕСТИТЬ КонтролируемыеКонтрагенты
	|ИЗ
	|	ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИностранныеКонтрагенты.Контрагент,
	|	ИностранныеКонтрагенты.ГоловнойКонтрагент
	|ИЗ
	|	ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИностранныеОрганизации.Организация,
	|	ИностранныеОрганизации.ГоловнаяОрганизация
	|ИЗ
	|	ИностранныеОрганизации КАК ИностранныеОрганизации";
	Запрос.Выполнить();
	
	Возврат Запрос.МенеджерВременныхТаблиц;
	
КонецФункции

Функция ПометитьНаУдалениеКонтролируемыеСделкиУведомления(Уведомление)
	
	ТаблицаСделок = Новый ТаблицаЗначений();
	ТаблицаСделок.Колонки.Добавить("Сделка", Новый ОписаниеТипов("ДокументСсылка.КонтролируемаяСделка"));
	ТаблицаСделок.Колонки.Добавить("Используется", Новый ОписаниеТипов("Булево"));
	
	РеквизитыСделки = Метаданные.Документы.КонтролируемаяСделка.Реквизиты;
	Для Каждого Реквизит Из РеквизитыСделки Цикл
		ТаблицаСделок.Колонки.Добавить(Реквизит.Имя, Новый ОписаниеТипов(Реквизит.Тип));
	КонецЦикла;
	
	ДокументыСделок = Документы.КонтролируемаяСделка.Выбрать( , , Новый Структура("УведомлениеОКонтролируемойСделке", Уведомление));
	Пока ДокументыСделок.Следующий() Цикл
		ДокументСделка = ДокументыСделок.ПолучитьОбъект();
		СтрокаСделок = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделок, ДокументСделка);
		СтрокаСделок.Сделка = ДокументСделка.Ссылка;
		ДокументСделка.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
	ТаблицаСделок.Индексы.Добавить("Контрагент, Договор, ПредметСделки, Используется");
	
	Возврат ТаблицаСделок;
	
КонецФункции

Функция КлючСделкиСовпадает(Сделка, КлючСделки) 
	
	Для Каждого Ключ Из КлючСделки Цикл
		Если Сделка[Ключ.Ключ] <> Ключ.Значение Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция ТаблицаСделок()
	
	ОписаниеТиповРасчетныхДокументов = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.РасчетныйДокумент.Тип;
	ОписаниеТиповПредметовСделки = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.ПредметСделки.Тип;
	ОписаниеТиповДоговора = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.Договор.Тип;
	ОписаниеТиповСоглашения = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.Соглашение.Тип;
	ОписаниеГрузоотправителя = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Реквизиты.Грузоотправитель.Тип;
	ОписаниеГрузополучателя  = 
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Реквизиты.Грузополучатель.Тип;
	ОписаниеКонтрагента =
		Метаданные.РегистрыНакопления.КонтролируемыеСделкиОрганизаций.Измерения.Контрагент.Тип;
	
	ТаблицаСделок = Новый ТаблицаЗначений();
	ТаблицаСделок.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата", , , Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	ТаблицаСделок.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаСделок.Колонки.Добавить("Контрагент", ОписаниеКонтрагента);
	ТаблицаСделок.Колонки.Добавить("Договор", ОписаниеТиповДоговора);
	ТаблицаСделок.Колонки.Добавить("Соглашение", ОписаниеТиповСоглашения);
	ТаблицаСделок.Колонки.Добавить("Комиссионер", ОписаниеКонтрагента);
	ТаблицаСделок.Колонки.Добавить("РасчетныйДокумент", ОписаниеТиповРасчетныхДокументов);
	ТаблицаСделок.Колонки.Добавить("ПредметСделки", ОписаниеТиповПредметовСделки);
	ТаблицаСделок.Колонки.Добавить("ТипПредметаСделки", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыПредметовКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("НаименованиеПредметаСделки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(512)));
	ТаблицаСделок.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТаблицаСделок.Колонки.Добавить("СтранаПроисхожденияПредметаСделки", Новый ОписаниеТипов("СправочникСсылка.СтраныМира"));
	ТаблицаСделок.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперацииКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаСделок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	ТаблицаСделок.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	ТаблицаСделок.Колонки.Добавить("ЦенаВРублях", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	ТаблицаСделок.Колонки.Добавить("СуммаБезНДСВРублях", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	ТаблицаСделок.Колонки.Добавить("СуммаНДСВРублях", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	ТаблицаСделок.Колонки.Добавить("СуммаБезНДСВВалютеРасчетов", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	ТаблицаСделок.Колонки.Добавить("СуммаНДСВВалютеРасчетов", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	ТаблицаСделок.Колонки.Добавить("ВсегоВВалютеРасчетов", ОбщегоНазначенияУТ.ОписаниеТипаДенежногоПоля());
	ТаблицаСделок.Колонки.Добавить("ТипКонтролируемойСделки", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыКонтролируемыхСделок"));
	ТаблицаСделок.Колонки.Добавить("ТоварМировойБиржевойТорговли", Новый ОписаниеТипов("Булево"));
	ТаблицаСделок.Колонки.Добавить("ОперацияОблагаетсяЕНВД", Новый ОписаниеТипов("Булево"));
	
	ТаблицаСделок.Колонки.Добавить("Грузоотправитель", ОписаниеГрузоотправителя);
	ТаблицаСделок.Колонки.Добавить("Грузополучатель", ОписаниеГрузополучателя);
	
	Возврат ТаблицаСделок;
	
КонецФункции

Процедура ЗаполнитьАдресаСделки(СтруктураАдресов, Грузоотправитель, Грузополучатель, ВерсияУведомления)
	
	ПараметрыАдресаГрузоотправителя = ПолучитьПараметрыАдресаСделки(Грузоотправитель);
	Если ПараметрыАдресаГрузоотправителя <> Неопределено Тогда
		СтруктураАдресов.СтранаОтправкиТовара = ПараметрыАдресаГрузоотправителя.Страна;
		СтруктураАдресов.КодРегионаОтправкиТовара = ПараметрыАдресаГрузоотправителя.КодРегиона;
		Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
			СтруктураАдресов.ГородОтправкиТовара = ПараметрыАдресаГрузоотправителя.Город;
			СтруктураАдресов.НаселенныйПунктОтправкиТовара = ПараметрыАдресаГрузоотправителя.НаселенныйПункт;
		Иначе
			ЧастиНаселенногоПункта = Новый Массив;
			Если ЗначениеЗаполнено(ПараметрыАдресаГрузоотправителя.Город) Тогда
				ЧастиНаселенногоПункта.Добавить(ПараметрыАдресаГрузоотправителя.Город);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПараметрыАдресаГрузоотправителя.НаселенныйПункт) Тогда
				ЧастиНаселенногоПункта.Добавить(ПараметрыАдресаГрузоотправителя.НаселенныйПункт);
			КонецЕсли;
			СтруктураАдресов.НаселенныйПунктОтправкиТовара = СтрСоединить(ЧастиНаселенногоПункта, ", ");
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыАдресаГрузополучателя = ПолучитьПараметрыАдресаСделки(Грузополучатель);
	Если ПараметрыАдресаГрузополучателя <> Неопределено Тогда
		СтруктураАдресов.СтранаСовершенияСделки = ПараметрыАдресаГрузополучателя.Страна;
		СтруктураАдресов.КодРегионаСовершенияСделки = ПараметрыАдресаГрузополучателя.КодРегиона;
		Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
			СтруктураАдресов.ГородСовершенияСделки = ПараметрыАдресаГрузополучателя.Город;
			СтруктураАдресов.НаселенныйПунктСовершенияСделки = ПараметрыАдресаГрузополучателя.НаселенныйПункт;
		Иначе
			ЧастиНаселенногоПункта = Новый Массив;
			Если ЗначениеЗаполнено(ПараметрыАдресаГрузополучателя.Город) Тогда
				ЧастиНаселенногоПункта.Добавить(ПараметрыАдресаГрузополучателя.Город);
			КонецЕсли;
			Если ЗначениеЗаполнено(ПараметрыАдресаГрузополучателя.НаселенныйПункт) Тогда
				ЧастиНаселенногоПункта.Добавить(ПараметрыАдресаГрузополучателя.НаселенныйПункт);
			КонецЕсли;
			СтруктураАдресов.НаселенныйПунктСовершенияСделки = СтрСоединить(ЧастиНаселенногоПункта, ", ");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьПараметрыАдресаСделки(Объект)
	
	Если НЕ ЗначениеЗаполнено(Объект) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("СправочникСсылка.Организации") Тогда
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ЮридическоеФизическоеЛицо") = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
			СсылкаНаОбъект = Объект;
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации;
			ИмяСправочника = "Организации";
		Иначе
			СсылкаНаОбъект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "ИндивидуальныйПредприниматель");
			ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица;
			ИмяСправочника = "ФизическиеЛица";
		КонецЕсли;
	ИначеЕсли ТипЗнч(Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
		СсылкаНаОбъект = Объект;
		ВидКонтактнойИнформации = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
		ИмяСправочника = "Контрагенты";
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.ЗначенияПолей
		|ИЗ
		|	Справочник." + ИмяСправочника + ".КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Ссылка = &Ссылка
		|	И КонтактнаяИнформация.Вид = &Вид";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Вид",    ВидКонтактнойИнформации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		АдресСтруктурой = РаботаСАдресами.СведенияОбАдресе(Выборка.ЗначенияПолей);
		
		Если НЕ АдресСтруктурой.Свойство("Страна") Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		СтранаМира = Справочники.СтраныМира.НайтиПоНаименованию(АдресСтруктурой.Страна);
		
		ДанныеАдреса = Новый Структура;
		ДанныеАдреса.Вставить("Страна", СтранаМира);
		ДанныеАдреса.Вставить("КодРегиона", "");
		ДанныеАдреса.Вставить("Город", "");
		ДанныеАдреса.Вставить("НаселенныйПункт", "");
		
		Если СтранаМира = Справочники.СтраныМира.Россия Тогда
			Если АдресСтруктурой.Свойство("КодРегиона") И ЗначениеЗаполнено(АдресСтруктурой.КодРегиона) Тогда
				ДанныеАдреса.КодРегиона = АдресСтруктурой.КодРегиона;
			ИначеЕсли АдресСтруктурой.Свойство("Регион") И ЗначениеЗаполнено(АдресСтруктурой.Регион) Тогда
				ДанныеАдреса.КодРегиона = РегламентированнаяОтчетностьВызовСервера.КодРегионаПоНазванию(АдресСтруктурой.Регион);
			КонецЕсли;
			АдресСтруктурой.Свойство("Город", ДанныеАдреса.Город);
			АдресСтруктурой.Свойство("НаселенныйПункт", ДанныеАдреса.НаселенныйПункт);
		КонецЕсли;
		
		Возврат ДанныеАдреса;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область ДобавлениеСделок

// Подготавливает основные параметры запроса к документам - источникам, на основании которых будет формироваться таблица
// контролируемых сделок.
Функция СтруктураПараметровЗапросаКДокументамИсточникам(Уведомление)
	
	ПараметрыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "Организация, ОтчетныйГод");
	СтруктураОрганизации = БухгалтерскийУчетПереопределяемый.СтруктураОрганизации(ПараметрыУведомления.Организация);
	
	СтруктураВозврата = Новый Структура;
	
	СтруктураВозврата.Вставить("СписокПодчиненныхОрганизаций", СтруктураОрганизации.Организация);
	СтруктураВозврата.Вставить("Организация", ПараметрыУведомления.Организация);
	СтруктураВозврата.Вставить("НачалоПериода", НачалоГода(ПараметрыУведомления.ОтчетныйГод));
	СтруктураВозврата.Вставить("ОкончаниеПериода", КонецГода(ПараметрыУведомления.ОтчетныйГод));
	СтруктураВозврата.Вставить("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Создает запрос и заполняет его переданными параметрами для последующего запроса к документам - источникам, на
// основании которых будет формироваться таблица контролируемых сделок.
Функция ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктураОрганизации", СтруктураПараметров.СписокПодчиненныхОрганизаций);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("НачалоПериода", СтруктураПараметров.НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", СтруктураПараметров.ОкончаниеПериода);
	Запрос.УстановитьПараметр("ВалютаРегламентированногоУчета", СтруктураПараметров.ВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ЕдиницаИзмеренияШтука", Справочники.УпаковкиЕдиницыИзмерения.НайтиПоКоду("796"));
	
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаСделок.РасчетныйДокумент,
	|	ТаблицаСделок.Период,
	|	ТаблицаСделок.Организация,
	|	ТаблицаСделок.Контрагент,
	|	ТаблицаСделок.Комиссионер,
	|	ТаблицаСделок.ПредметСделки,
	|	ТаблицаСделок.ТипПредметаСделки,
	|	ТаблицаСделок.НаименованиеПредметаСделки,
	|	ТаблицаСделок.СтранаПроисхожденияПредметаСделки,
	|	ТаблицаСделок.ХозяйственнаяОперация,
	|	ТаблицаСделок.Валюта,
	|	ТаблицаСделок.ЕдиницаИзмерения,
	|	СУММА(ТаблицаСделок.МножительСуммовыхДанных * ТаблицаСделок.Количество) КАК Количество,
	|	ТаблицаСделок.СтавкаНДС,
	|	СУММА(ТаблицаСделок.МножительСуммовыхДанных * ЕСТЬNULL(СуммыДокументовВВалютеРегл.СуммаБезНДСРегл, ТаблицаСделок.СуммаБезНДС)) КАК СуммаБезНДСВРублях,
	|	СУММА(ТаблицаСделок.МножительСуммовыхДанных * ЕСТЬNULL(СуммыДокументовВВалютеРегл.СуммаНДСРегл, ТаблицаСделок.СуммаНДС)) КАК СуммаНДСВРублях,
	|	ТаблицаСделок.ТипКонтролируемойСделки,
	|	ТаблицаСделок.ТоварМировойБиржевойТорговли,
	|	ТаблицаСделок.ОперацияОблагаетсяЕНВД,
	|	ТаблицаСделок.Грузоотправитель,
	|	ТаблицаСделок.Грузополучатель,
	|	СУММА(ТаблицаСделок.МножительСуммовыхДанных * ТаблицаСделок.СуммаБезНДС) КАК СуммаБезНДСВВалютеРасчетов,
	|	СУММА(ТаблицаСделок.МножительСуммовыхДанных * ТаблицаСделок.СуммаНДС) КАК СуммаНДСВВалютеРасчетов,
	|	СРЕДНЕЕ(ВЫБОР
	|			КОГДА ТаблицаСделок.Количество = 0
	|				ТОГДА ЕСТЬNULL(СуммыДокументовВВалютеРегл.СуммаБезНДСРегл, ТаблицаСделок.СуммаБезНДС)
	|			ИНАЧЕ ЕСТЬNULL(СуммыДокументовВВалютеРегл.СуммаБезНДСРегл, ТаблицаСделок.СуммаБезНДС) / ТаблицаСделок.Количество
	|		КОНЕЦ) КАК ЦенаВРублях,
	|	ТаблицаСделок.Договор,
	|	ТаблицаСделок.Соглашение
	|ИЗ
	|	ТаблицаСделок КАК ТаблицаСделок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СуммыДокументовВВалютеРегл КАК СуммыДокументовВВалютеРегл
	|		ПО ТаблицаСделок.ИдентификаторСтроки = СуммыДокументовВВалютеРегл.ИдентификаторСтроки
	|			И ТаблицаСделок.РегистраторРегистраСумм = СуммыДокументовВВалютеРегл.Регистратор
	|ГДЕ
	|	(ЕСТЬNULL(СуммыДокументовВВалютеРегл.СуммаБезНДСРегл, ТаблицаСделок.СуммаБезНДС) <> 0
	|			ИЛИ ЕСТЬNULL(СуммыДокументовВВалютеРегл.СуммаНДСРегл, ТаблицаСделок.СуммаНДС) <> 0
	|			ИЛИ ТаблицаСделок.Количество <> 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаСделок.Контрагент,
	|	ТаблицаСделок.Комиссионер,
	|	ТаблицаСделок.РасчетныйДокумент,
	|	ТаблицаСделок.Период,
	|	ТаблицаСделок.ТипПредметаСделки,
	|	ТаблицаСделок.НаименованиеПредметаСделки,
	|	ТаблицаСделок.ОперацияОблагаетсяЕНВД,
	|	ТаблицаСделок.СтавкаНДС,
	|	ТаблицаСделок.Валюта,
	|	ТаблицаСделок.ХозяйственнаяОперация,
	|	ТаблицаСделок.ПредметСделки,
	|	ТаблицаСделок.ТипКонтролируемойСделки,
	|	ТаблицаСделок.ТоварМировойБиржевойТорговли,
	|	ТаблицаСделок.ЕдиницаИзмерения,
	|	ТаблицаСделок.Грузополучатель,
	|	ТаблицаСделок.СтранаПроисхожденияПредметаСделки,
	|	ТаблицаСделок.Организация,
	|	ТаблицаСделок.Грузоотправитель,
	|	ТаблицаСделок.Договор,
	|	ТаблицаСделок.Соглашение";
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#Область ДобавлениеСделокПродажи

Процедура ДобавитьСделкиРеализацииТоваровУслуг(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Организация КАК Организация,
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияТоваровУслуг.Договор КАК ДоговорКонтрагента,
	|	РеализацияТоваровУслуг.Валюта,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.Договор.ТипДоговора КАК ТипДоговора,
	|	РеализацияТоваровУслуг.Договор.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|			И РеализацияТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|ГДЕ
	|	РеализацияТоваровУслуг.Организация В(&СтруктураОрганизации)
	|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияТоваровУслуг.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|	И ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РеализацияТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|		КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Ссылка,
	|	РеализацияТоваровУслуг.ДатаПереходаПраваСобственности,
	|	РеализацияТоваровУслуг.Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ,
	|	РеализацияТоваровУслуг.Договор,
	|	РеализацияТоваровУслуг.Валюта,
	|	РеализацияТоваровУслуг.ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ),
	|	РеализацияТоваровУслуг.Договор.ТипДоговора,
	|	РеализацияТоваровУслуг.Договор.ВалютаВзаиморасчетов
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|			И РеализацияТоваровУслуг.ДатаПереходаПраваСобственности >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияТоваровУслуг.ДатаПереходаПраваСобственности <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияТоваровУслуг.Контрагент)
	|ГДЕ
	|	РеализацияТоваровУслуг.Организация В(&СтруктураОрганизации)
	|	И РеализацияТоваровУслуг.ДатаПереходаПраваСобственности >= &НачалоПериода
	|	И РеализацияТоваровУслуг.ДатаПереходаПраваСобственности <= &ОкончаниеПериода
	|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
	|	И РеализацияТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL)
	|	И РеализацияТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|	И ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РеализацияТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|		КОНЕЦ
	|	И РеализацияТоваровУслуг.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыРеализацийТоваровУслуг.Отгружено)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УслугиРеализации.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	УслугиРеализации.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	СУММА(УслугиРеализации.Количество) КАК Количество,
	|	СУММА(УслугиРеализации.Количество) КАК КоличествоВУчете,
	|	УслугиРеализации.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	СУММА(УслугиРеализации.СуммаСНДС - УслугиРеализации.СуммаНДС) КАК СуммаБезНДС,
	|	УслугиРеализации.СтавкаНДС,
	|	СУММА(УслугиРеализации.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА УслугиРеализации.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = УслугиРеализации.Ссылка.Организация
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхУслуг)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = УслугиРеализации.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = УслугиРеализации.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьНДСПриРаспределении,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.Пустаяссылка) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	УслугиРеализации.ИдентификаторСтроки
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК УслугиРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО УслугиРеализации.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	НЕ УслугиРеализации.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиРеализации.Ссылка,
	|	УслугиРеализации.Номенклатура,
	|	УслугиРеализации.Номенклатура.ЕдиницаИзмерения,
	|	УслугиРеализации.СтавкаНДС,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА УслугиРеализации.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = УслугиРеализации.Ссылка.Организация
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхУслуг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = УслугиРеализации.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	УслугиРеализации.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(УслугиРеализации.Характеристика.Принципал, УслугиРеализации.Номенклатура.Принципал) = УслугиРеализации.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыРеализации.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	Аналитика.Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	СУММА(ТоварыРеализации.Количество),
	|	СУММА(ТоварыРеализации.Количество),
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(ТоварыРеализации.СуммаСНДС - ТоварыРеализации.СуммаНДС),
	|	ТоварыРеализации.СтавкаНДС,
	|	СУММА(ТоварыРеализации.СуммаНДС),
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТоварыРеализации.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ТоварыРеализации.ИдентификаторСтроки
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.ВидыЗапасов КАК ТоварыРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ТоварыРеализации.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТоварыРеализации.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТоварыРеализации.Ссылка.ВернутьМногооборотнуюТару
	|				ТОГДА Аналитика.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыРеализации.Ссылка,
	|	Аналитика.Номенклатура,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	ТоварыРеализации.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТоварыРеализации.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ТоварыРеализации.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА ТоварыРеализации.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.Пустаяссылка)
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиРеализацииУслугПрочихАктивов(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияУслугПрочихАктивов.Организация КАК Организация,
	|	РеализацияУслугПрочихАктивов.Ссылка КАК РасчетныйДокумент,
	|	РеализацияУслугПрочихАктивов.Дата КАК Период,
	|	РеализацияУслугПрочихАктивов.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА РеализацияУслугПрочихАктивов.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияУслугПрочихАктивов.Контрагент
	|		ИНАЧЕ РеализацияУслугПрочихАктивов.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияУслугПрочихАктивов.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияУслугПрочихАктивов.Организация
	|		ИНАЧЕ РеализацияУслугПрочихАктивов.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	РеализацияУслугПрочихАктивов.Договор КАК ДоговорКонтрагента,
	|	РеализацияУслугПрочихАктивов.Валюта,
	|	РеализацияУслугПрочихАктивов.ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияУслугПрочихАктивов.Договор.ТипДоговора КАК ТипДоговора,
	|	РеализацияУслугПрочихАктивов.Договор.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов КАК РеализацияУслугПрочихАктивов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = РеализацияУслугПрочихАктивов.Контрагент)
	|			И РеализацияУслугПрочихАктивов.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И РеализацияУслугПрочихАктивов.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = РеализацияУслугПрочихАктивов.Контрагент)
	|ГДЕ
	|	РеализацияУслугПрочихАктивов.Организация В(&СтруктураОрганизации)
	|	И РеализацияУслугПрочихАктивов.Дата >= &НачалоПериода
	|	И РеализацияУслугПрочихАктивов.Дата <= &ОкончаниеПериода
	|	И РеализацияУслугПрочихАктивов.Проведен = ИСТИНА
	|	И РеализацияУслугПрочихАктивов.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И РеализацияУслугПрочихАктивов.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|	И ВЫБОР
	|			КОГДА РеализацияУслугПрочихАктивов.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РеализацияУслугПрочихАктивов.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УслугиПрочиеАктивы.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	УслугиПрочиеАктивы.Содержание КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	СУММА(УслугиПрочиеАктивы.Количество) КАК Количество,
	|	УслугиПрочиеАктивы.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	УслугиПрочиеАктивы.СтавкаНДС,
	|	СУММА(УслугиПрочиеАктивы.СуммаСНДС - УслугиПрочиеАктивы.СуммаНДС) КАК СуммаБезНДС,
	|	СУММА(УслугиПрочиеАктивы.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА УслугиПрочиеАктивы.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.Пустаяссылка) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	УслугиПрочиеАктивы.ИдентификаторСтроки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПрочаяОперация) КАК ХозяйственнаяОперация,
	|	ИСТИНА КАК ВключатьСоставСделок
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.РеализацияУслугПрочихАктивов.Доходы КАК УслугиПрочиеАктивы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО УслугиПрочиеАктивы.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	УслугиПрочиеАктивы.Ссылка,
	|	УслугиПрочиеАктивы.СтавкаНДС,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	УслугиПрочиеАктивы.ИдентификаторСтроки,
	|	УслугиПрочиеАктивы.Содержание,
	|	УслугиПрочиеАктивы.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА УслугиПрочиеАктивы.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиАктаВыполненныхРабот(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктВыполненныхРабот.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА АктВыполненныхРабот.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = АктВыполненныхРабот.Контрагент)
	|			И АктВыполненныхРабот.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И АктВыполненныхРабот.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = АктВыполненныхРабот.Контрагент)
	|ГДЕ
	|	АктВыполненныхРабот.Организация В(&СтруктураОрганизации)
	|	И АктВыполненныхРабот.Дата >= &НачалоПериода
	|	И АктВыполненныхРабот.Дата <= &ОкончаниеПериода
	|	И АктВыполненныхРабот.Проведен
	|	И АктВыполненныхРабот.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ВЫБОР
	|			КОГДА АктВыполненныхРабот.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ АктВыполненныхРабот.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	АктВыполненныхРаботУслуги.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	АктВыполненныхРаботУслуги.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	АктВыполненныхРаботУслуги.Содержание КАК НаименованиеПредметаСделки,
	|	СУММА(АктВыполненныхРаботУслуги.Количество) КАК Количество,
	|	АктВыполненныхРаботУслуги.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	АктВыполненныхРаботУслуги.СтавкаНДС,
	|	СУММА(АктВыполненныхРаботУслуги.СуммаСНДС - АктВыполненныхРаботУслуги.СуммаНДС) КАК СуммаБезНДС,
	|	СУММА(АктВыполненныхРаботУслуги.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА АктВыполненныхРаботУслуги.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктВыполненныхРаботУслуги.Характеристика.Принципал, АктВыполненныхРаботУслуги.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(АктВыполненныхРаботУслуги.Характеристика.Принципал, АктВыполненныхРаботУслуги.Номенклатура.Принципал) = АктВыполненныхРаботУслуги.Ссылка.Организация
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхУслуг)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктВыполненныхРаботУслуги.Характеристика.Принципал, АктВыполненныхРаботУслуги.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(АктВыполненныхРаботУслуги.Характеристика.Принципал, АктВыполненныхРаботУслуги.Номенклатура.Принципал) = АктВыполненныхРаботУслуги.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.Пустаяссылка) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	АктВыполненныхРаботУслуги.ИдентификаторСтроки
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК АктВыполненныхРаботУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО АктВыполненныхРаботУслуги.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	АктВыполненныхРаботУслуги.Ссылка,
	|	АктВыполненныхРаботУслуги.СтавкаНДС,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	АктВыполненныхРаботУслуги.ИдентификаторСтроки,
	|	АктВыполненныхРаботУслуги.Содержание,
	|	АктВыполненныхРаботУслуги.Номенклатура,
	|	АктВыполненныхРаботУслуги.Номенклатура.ЕдиницаИзмерения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА АктВыполненныхРаботУслуги.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктВыполненныхРаботУслуги.Характеристика.Принципал, АктВыполненныхРаботУслуги.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(АктВыполненныхРаботУслуги.Характеристика.Принципал, АктВыполненныхРаботУслуги.Номенклатура.Принципал) = АктВыполненныхРаботУслуги.Ссылка.Организация
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхУслуг)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(АктВыполненныхРаботУслуги.Характеристика.Принципал, АктВыполненныхРаботУслуги.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(АктВыполненныхРаботУслуги.Характеристика.Принципал, АктВыполненныхРаботУслуги.Номенклатура.Принципал) = АктВыполненныхРаботУслуги.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.НаименованиеПредметаСделки КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузоотправитель,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиВозвратаТоваровОтПокупателя(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТоваровОтКлиента.Ссылка КАК ДокументВозврата,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтКлиента.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента КАК ВозвратТоваровОтКлиента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Контрагент = ВозвратТоваровОтКлиента.Контрагент)
	|			И ВозвратТоваровОтКлиента.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ВозвратТоваровОтКлиента.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ВозвратТоваровОтКлиента.Контрагент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВозвратТоваровОтКлиента.ДокументРеализации = РеализацияТоваровУслуг.Ссылка
	|ГДЕ
	|	ВозвратТоваровОтКлиента.Организация В(&СтруктураОрганизации)
	|	И ВозвратТоваровОтКлиента.Дата >= &НачалоПериода
	|	И ВозвратТоваровОтКлиента.Проведен
	|	И ВозвратТоваровОтКлиента.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ВЫБОР
	|			КОГДА РеализацияТоваровУслуг.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ РеализацияТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|		КОНЕЦ
	|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
	|	И РеализацияТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И РеализацияТоваровУслуг.Проведен
	|	И РеализацияТоваровУслуг.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВозврата.Ссылка КАК Сделка,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	Аналитика.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	СУММА(ТоварыВозврата.Количество) КАК Количество,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ТоварыВозврата.СтавкаНДС,
	|	СУММА(ТоварыВозврата.СуммаСНДС - ТоварыВозврата.СуммаНДС) КАК СуммаБезНДС,
	|	СУММА(ТоварыВозврата.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыВозврата.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ВозвратТоваров) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТоварыВозврата.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ЕСТЬNULL(ТоварыВозврата.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ТоварыВозврата.ИдентификаторСтроки
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ВозвратТоваровОтКлиента.ВидыЗапасов КАК ТоварыВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТоварыВозврата.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ТоварыВозврата.Ссылка = ДокументыКонтролируемыхСделок.ДокументВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыВозврата.СтавкаНДС,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент,
	|	ТоварыВозврата.Ссылка,
	|	Аналитика.Номенклатура,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	ТоварыВозврата.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ТоварыВозврата.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыВозврата.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(ТоварыВозврата.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.Сделка КАК РегистраторРегистраСумм,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	-1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиКорректировкиРеализации(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаРеализации.Ссылка КАК Корректировка,
	|	КорректировкаРеализации.ДокументОснование КАК Реализация
	|ПОМЕСТИТЬ ДокументыКорректировкиИРеализации
	|ИЗ
	|	Документ.КорректировкаРеализации КАК КорректировкаРеализации
	|ГДЕ
	|	КорректировкаРеализации.Организация В(&СтруктураОрганизации)
	|	И КорректировкаРеализации.Дата >= &НачалоПериода
	|	И КорректировкаРеализации.Проведен
	|	И КорректировкаРеализации.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВЫБОР
	|			КОГДА КорректировкаРеализации.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КорректировкаРеализации.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Корректировка,
	|	Реализация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеализацияТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	РеализацияТоваровУслуг.Дата КАК Период,
	|	РеализацияТоваровУслуг.Организация,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Валюта,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Контрагент
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА РеализацияТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияТоваровУслуг.Организация
	|		ИНАЧЕ РеализацияТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА РеализацияТоваровУслуг.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА РеализацияТоваровУслуг.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ДокументыКорректировкиИРеализации.Корректировка КАК Корректировка,
	|	РеализацияТоваровУслуг.ВернутьМногооборотнуюТару
	|ПОМЕСТИТЬ ДанныеДокументовКорректировкиИРеализации
	|ИЗ
	|	ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ДокументыКорректировкиИРеализации.Реализация = РеализацияТоваровУслуг.Ссылка
	|			И (РеализацияТоваровУслуг.Дата >= &НачалоПериода)
	|			И (РеализацияТоваровУслуг.Дата <= &ОкончаниеПериода)
	|			И (РеализацияТоваровУслуг.Проведен)
	|			И (РеализацияТоваровУслуг.Контрагент В
	|				(ВЫБРАТЬ
	|					КонтролируемыеКонтрагенты.Контрагент
	|				ИЗ
	|					КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты))
	|			И (ВЫБОР
	|				КОГДА РеализацияТоваровУслуг.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ РеализацияТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктВыполненныхРабот.Ссылка,
	|	АктВыполненныхРабот.Дата,
	|	АктВыполненныхРабот.Организация,
	|	АктВыполненныхРабот.Контрагент,
	|	АктВыполненныхРабот.Валюта,
	|	ВЫБОР
	|		КОГДА АктВыполненныхРабот.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА АктВыполненныхРабот.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА АктВыполненныхРабот.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ДокументыКорректировкиИРеализации.Корректировка,
	|	ЛОЖЬ
	|ИЗ
	|	ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|		ПО (АктВыполненныхРабот.Дата >= &НачалоПериода)
	|			И (АктВыполненныхРабот.Дата <= &ОкончаниеПериода)
	|			И (АктВыполненныхРабот.Контрагент В
	|				(ВЫБРАТЬ
	|					КонтролируемыеКонтрагенты.Контрагент
	|				ИЗ
	|					КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты))
	|			И (ВЫБОР
	|				КОГДА АктВыполненныхРабот.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ АктВыполненныхРабот.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|			КОНЕЦ)
	|			И ДокументыКорректировкиИРеализации.Реализация = АктВыполненныхРабот.Ссылка
	|			И (АктВыполненныхРабот.Проведен)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеализацияУслугПрочихАктивов.Ссылка,
	|	РеализацияУслугПрочихАктивов.Дата,
	|	РеализацияУслугПрочихАктивов.Организация,
	|	РеализацияУслугПрочихАктивов.Контрагент,
	|	РеализацияУслугПрочихАктивов.Валюта,
	|	ВЫБОР
	|		КОГДА РеализацияУслугПрочихАктивов.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияУслугПрочихАктивов.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияУслугПрочихАктивов.Контрагент
	|		ИНАЧЕ РеализацияУслугПрочихАктивов.Грузополучатель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА РеализацияУслугПрочихАктивов.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА РеализацияУслугПрочихАктивов.Организация
	|		ИНАЧЕ РеализацияУслугПрочихАктивов.Грузоотправитель
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА РеализацияУслугПрочихАктивов.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА РеализацияУслугПрочихАктивов.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ДокументыКорректировкиИРеализации.Корректировка,
	|	ЛОЖЬ
	|ИЗ
	|	ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияУслугПрочихАктивов КАК РеализацияУслугПрочихАктивов
	|		ПО (РеализацияУслугПрочихАктивов.Дата <= &ОкончаниеПериода)
	|			И (РеализацияУслугПрочихАктивов.Контрагент В
	|				(ВЫБРАТЬ
	|					КонтролируемыеКонтрагенты.Контрагент
	|				ИЗ
	|					КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты))
	|			И (ВЫБОР
	|				КОГДА РеализацияУслугПрочихАктивов.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ РеализацияУслугПрочихАктивов.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|			КОНЕЦ)
	|			И ДокументыКорректировкиИРеализации.Реализация = РеализацияУслугПрочихАктивов.Ссылка
	|			И (РеализацияУслугПрочихАктивов.Дата >= &НачалоПериода)
	|			И (РеализацияУслугПрочихАктивов.Проведен)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокументовКорректировкиИРеализации.РасчетныйДокумент,
	|	ДанныеДокументовКорректировкиИРеализации.Период,
	|	ДанныеДокументовКорректировкиИРеализации.Организация,
	|	ДанныеДокументовКорректировкиИРеализации.Контрагент,
	|	ДанныеДокументовКорректировкиИРеализации.Валюта,
	|	ДанныеДокументовКорректировкиИРеализации.ОперацияОблагаетсяЕНВД,
	|	ДанныеДокументовКорректировкиИРеализации.Грузополучатель,
	|	ДанныеДокументовКорректировкиИРеализации.Грузоотправитель,
	|	ДанныеДокументовКорректировкиИРеализации.Договор,
	|	ДанныеДокументовКорректировкиИРеализации.Соглашение,
	|	ДанныеДокументовКорректировкиИРеализации.Корректировка КАК Корректировка,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДанныеДокументовКорректировкиИРеализации.ВернутьМногооборотнуюТару
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	ДанныеДокументовКорректировкиИРеализации КАК ДанныеДокументовКорректировкиИРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ДанныеДокументовКорректировкиИРеализации.Контрагент = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|			И ДанныеДокументовКорректировкиИРеализации.Период >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ДанныеДокументовКорректировкиИРеализации.Период <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО ДанныеДокументовКорректировкиИРеализации.Контрагент = ИностранныеКонтрагенты.Контрагент
	|ГДЕ
	|	(НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Корректировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	КорректировкаРеализацииРасхождения.Ссылка КАК РегистраторРегистраСумм,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ЕСТЬNULL(КорректировкаРеализацииРасхождения.Номенклатура, КорректировкаРеализацииРасхождения.Содержание) КАК ПредметСделки,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииРасхождения.Номенклатура ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|	КОНЕЦ КАК ТипПредметаСделки,
	|	ЕСТЬNULL(КорректировкаРеализацииРасхождения.Номенклатура.НаименованиеПолное, КорректировкаРеализацииРасхождения.Содержание) КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.Пустаяссылка) КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииРасхождения.Номенклатура ЕСТЬ NULL 
	|				ИЛИ ЕСТЬNULL(КорректировкаРеализацииРасхождения.Характеристика.Принципал, КорректировкаРеализацииРасхождения.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(КорректировкаРеализацииРасхождения.Характеристика.Принципал, КорректировкаРеализацииРасхождения.Номенклатура.Принципал) = КорректировкаРеализацииРасхождения.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ДокументыКонтролируемыхСделок.Валюта,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииРасхождения.Номенклатура ЕСТЬ NULL 
	|			ТОГДА &ЕдиницаИзмеренияШтука
	|		ИНАЧЕ КорректировкаРеализацииРасхождения.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	СУММА(КорректировкаРеализацииРасхождения.Количество) КАК Количество,
	|	КорректировкаРеализацииРасхождения.СтавкаНДС,
	|	СУММА(КорректировкаРеализацииРасхождения.СуммаСНДС - КорректировкаРеализацииРасхождения.СуммаНДС) КАК СуммаБезНДС,
	|	СУММА(КорректировкаРеализацииРасхождения.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииРасхождения.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	КорректировкаРеализацииРасхождения.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Договор,
	|	ДокументыКонтролируемыхСделок.Соглашение,
	|	1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.Расхождения КАК КорректировкаРеализацииРасхождения
	|		ПО ДокументыКонтролируемыхСделок.Корректировка = КорректировкаРеализацииРасхождения.Ссылка
	|ГДЕ
	|	НЕ КорректировкаРеализацииРасхождения.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииРасхождения.Ссылка,
	|	КорректировкаРеализацииРасхождения.СтавкаНДС,
	|	КорректировкаРеализацииРасхождения.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.Валюта,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Договор,
	|	ДокументыКонтролируемыхСделок.Соглашение,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииРасхождения.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(КорректировкаРеализацииРасхождения.Номенклатура, КорректировкаРеализацииРасхождения.Содержание),
	|	ЕСТЬNULL(КорректировкаРеализацииРасхождения.Номенклатура.НаименованиеПолное, КорректировкаРеализацииРасхождения.Содержание),
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииРасхождения.Номенклатура ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииРасхождения.Номенклатура ЕСТЬ NULL 
	|				ИЛИ ЕСТЬNULL(КорректировкаРеализацииРасхождения.Характеристика.Принципал, КорректировкаРеализацииРасхождения.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(КорректировкаРеализацииРасхождения.Характеристика.Принципал, КорректировкаРеализацииРасхождения.Номенклатура.Принципал) = КорректировкаРеализацииРасхождения.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииРасхождения.Номенклатура ЕСТЬ NULL 
	|			ТОГДА &ЕдиницаИзмеренияШтука
	|		ИНАЧЕ КорректировкаРеализацииРасхождения.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент,
	|	КорректировкаРеализацииВидыЗапасовОприходование.Ссылка,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	АналитикаУчета.Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	АналитикаУчета.Номенклатура.НаименованиеПолное,
	|	ЕСТЬNULL(КорректировкаРеализацииВидыЗапасовОприходование.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовОприходование.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовОприходование.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ДокументыКонтролируемыхСделок.Валюта,
	|	АналитикаУчета.Номенклатура.ЕдиницаИзмерения,
	|	-СУММА(КорректировкаРеализацииВидыЗапасовОприходование.Количество),
	|	КорректировкаРеализацииВидыЗапасовОприходование.СтавкаНДС,
	|	-СУММА(КорректировкаРеализацииВидыЗапасовОприходование.СуммаСНДС - КорректировкаРеализацииВидыЗапасовОприходование.СуммаНДС),
	|	-СУММА(КорректировкаРеализацииВидыЗапасовОприходование.СуммаНДС),
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовОприходование.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	КорректировкаРеализацииВидыЗапасовОприходование.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Договор,
	|	ДокументыКонтролируемыхСделок.Соглашение,
	|	1
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовОприходование КАК КорректировкаРеализацииВидыЗапасовОприходование
	|		ПО ДокументыКонтролируемыхСделок.Корректировка = КорректировкаРеализацииВидыЗапасовОприходование.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаУчета
	|		ПО КорректировкаРеализацииВидыЗапасовОприходование.АналитикаУчетаНоменклатуры = АналитикаУчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО АналитикаУчета.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.ВернутьМногооборотнуюТару
	|				ТОГДА АналитикаУчета.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииВидыЗапасовОприходование.Ссылка,
	|	КорректировкаРеализацииВидыЗапасовОприходование.СтавкаНДС,
	|	КорректировкаРеализацииВидыЗапасовОприходование.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.Валюта,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Договор,
	|	ДокументыКонтролируемыхСделок.Соглашение,
	|	АналитикаУчета.Номенклатура.НаименованиеПолное,
	|	АналитикаУчета.Номенклатура,
	|	АналитикаУчета.Номенклатура.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(КорректировкаРеализацииВидыЗапасовОприходование.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовОприходование.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовОприходование.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовОприходование.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент,
	|	КорректировкаРеализацииВидыЗапасовСписание.Ссылка,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	АналитикаУчета.Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	АналитикаУчета.Номенклатура.НаименованиеПолное,
	|	ЕСТЬNULL(КорректировкаРеализацииВидыЗапасовСписание.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовСписание.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовСписание.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ДокументыКонтролируемыхСделок.Валюта,
	|	АналитикаУчета.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.Количество),
	|	КорректировкаРеализацииВидыЗапасовСписание.СтавкаНДС,
	|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.СуммаСНДС - КорректировкаРеализацииВидыЗапасовСписание.СуммаНДС),
	|	СУММА(КорректировкаРеализацииВидыЗапасовСписание.СуммаНДС),
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовСписание.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	КорректировкаРеализацииВидыЗапасовСписание.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Договор,
	|	ДокументыКонтролируемыхСделок.Соглашение,
	|	1
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаРеализации.ВидыЗапасовСписание КАК КорректировкаРеализацииВидыЗапасовСписание
	|		ПО ДокументыКонтролируемыхСделок.Корректировка = КорректировкаРеализацииВидыЗапасовСписание.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК АналитикаУчета
	|		ПО КорректировкаРеализацииВидыЗапасовСписание.АналитикаУчетаНоменклатуры = АналитикаУчета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО АналитикаУчета.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.ВернутьМногооборотнуюТару
	|				ТОГДА АналитикаУчета.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаРеализацииВидыЗапасовСписание.Ссылка,
	|	КорректировкаРеализацииВидыЗапасовСписание.СтавкаНДС,
	|	КорректировкаРеализацииВидыЗапасовСписание.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.Валюта,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Договор,
	|	ДокументыКонтролируемыхСделок.Соглашение,
	|	АналитикаУчета.Номенклатура.НаименованиеПолное,
	|	АналитикаУчета.Номенклатура,
	|	АналитикаУчета.Номенклатура.ЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(КорректировкаРеализацииВидыЗапасовСписание.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовСписание.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовСписание.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаРеализацииВидыЗапасовСписание.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РегистраторРегистраСумм КАК РегистраторРегистраСумм,
	|	ТоварыКонтролируемыхСделок.Период,
	|	ТоварыКонтролируемыхСделок.Организация,
	|	ТоварыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ТоварыКонтролируемыхСделок.Грузополучатель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ТоварыКонтролируемыхСделок.Грузоотправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузоотправитель,
	|	ТоварыКонтролируемыхСделок.Договор,
	|	ТоварыКонтролируемыхСделок.Соглашение,
	|	ТоварыКонтролируемыхСделок.МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|	И (ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКорректировкиИРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДокументовКорректировкиИРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеСделокЗакупок

Процедура ДобавитьСделкиПриобретенияТоваровУслуг(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриобретениеТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	ПриобретениеТоваровУслуг.Дата КАК Период,
	|	ПриобретениеТоваровУслуг.Контрагент,
	|	ПриобретениеТоваровУслуг.Организация,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПриобретениеТоваровУслуг.Контрагент)
	|			И ПриобретениеТоваровУслуг.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПриобретениеТоваровУслуг.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО ПриобретениеТоваровУслуг.Контрагент = ИностранныеКонтрагенты.Контрагент
	|ГДЕ
	|	(НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПриобретениеТоваровУслуг.Организация В(&СтруктураОрганизации)
	|	И ПриобретениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПриобретениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПриобретениеТоваровУслуг.Проведен
	|	И ПриобретениеТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВЫБОР
	|			КОГДА ПриобретениеТоваровУслуг.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПриобретениеТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	|					ИЛИ ПриобретениеТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.Импорт)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыПоступления.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ТоварыПоступления.Номенклатура КАК ПредметСделки,
	|	ВЫБОР
	|		КОГДА ТоварыПоступления.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|				ИЛИ ТоварыПоступления.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|	КОНЕЦ КАК ТипПредметаСделки,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ИСТИНА КАК УчитыватьНДСПриРаспределении,
	|	ТоварыПоступления.Количество,
	|	ТоварыПоступления.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ТоварыПоступления.СтавкаНДС,
	|	ТоварыПоступления.СуммаСНДС - ТоварыПоступления.СуммаНДС КАК СуммаБезНДС,
	|	ТоварыПоступления.СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыПоступления.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ТоварыПоступления.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров)
	|		КОГДА ТоварыПоступления.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				И ТоварыПоступления.Номенклатура.ОсобенностьУчета В (ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.ОрганизациейПоАгентскойСхеме), ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.Партнером))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеАгентскихУслуг)
	|		КОГДА ТоварыПоступления.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ТоварыПоступления.ИдентификаторСтроки,
	|	ЕСТЬNULL(ТоварыПоступления.НомерГТД.СтранаПроисхождения, ЕСТЬNULL(ТоварыКОформлениюТаможенныхДеклараций.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ТоварыПоступления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ТоварыПоступления.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО ТоварыПоступления.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОформлениюТаможенныхДеклараций КАК ТоварыКОформлениюТаможенныхДеклараций
	|		ПО ТоварыПоступления.Ссылка = ТоварыКОформлениюТаможенныхДеклараций.ДокументПоступления
	|			И ТоварыПоступления.ВидЗапасов = ТоварыКОформлениюТаможенныхДеклараций.ВидЗапасов
	|			И ТоварыПоступления.АналитикаУчетаНоменклатуры = ТоварыКОформлениюТаможенныхДеклараций.АналитикаУчетаНоменклатуры
	|			И (ТоварыКОформлениюТаможенныхДеклараций.Регистратор ССЫЛКА Документ.ТаможеннаяДекларацияИмпорт)
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ТоварыПоступления.Ссылка.ВернутьМногооборотнуюТару
	|				ТОГДА ТоварыПоступления.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузоотправитель,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПоступленияУслугПрочихАктивов(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
		
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриобретениеУслугПрочихАктивов.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПриобретениеУслугПрочихАктивов.Контрагент)
	|			И ПриобретениеУслугПрочихАктивов.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПриобретениеУслугПрочихАктивов.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО ПриобретениеУслугПрочихАктивов.Контрагент = ИностранныеКонтрагенты.Контрагент
	|ГДЕ
	|	(НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ПриобретениеУслугПрочихАктивов.Организация В(&СтруктураОрганизации)
	|	И ПриобретениеУслугПрочихАктивов.Дата >= &НачалоПериода
	|	И ПриобретениеУслугПрочихАктивов.Дата <= &ОкончаниеПериода
	|	И ПриобретениеУслугПрочихАктивов.Проведен
	|	И ПриобретениеУслугПрочихАктивов.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВЫБОР
	|			КОГДА ПриобретениеУслугПрочихАктивов.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПриобретениеУслугПрочихАктивов.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УслугиПрочиеАктивы.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	УслугиПрочиеАктивы.Содержание КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	УслугиПрочиеАктивы.Количество,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмеренияПоКлассификатору,
	|	УслугиПрочиеАктивы.СтавкаНДС,
	|	УслугиПрочиеАктивы.СуммаСНДС - УслугиПрочиеАктивы.СуммаНДС КАК СуммаБезНДС,
	|	УслугиПрочиеАктивы.СуммаНДС,
	|	ВЫБОР
	|		КОГДА УслугиПрочиеАктивы.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.Пустаяссылка) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	УслугиПрочиеАктивы.ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА УслугиПрочиеАктивы.СтатьяРасходов.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.ОбъектыНезавершенногоСтроительства)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеОбъектовСтроительства)
	|		КОГДА УслугиПрочиеАктивы.СтатьяРасходов.ВидЦенностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыЦенностей.НМА)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеНематериальныхАктивов)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПрочаяОперация)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ИСТИНА КАК ВключатьСоставСделок
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК УслугиПрочиеАктивы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО УслугиПрочиеАктивы.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузоотправитель,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиВозвратаТоваровПоставщику(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
		
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВозвратТоваровПоставщику.Ссылка КАК ДокументВозврата,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровПоставщику.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ПриобретениеТоваровУслуг.Ссылка КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Контрагент = ВозвратТоваровПоставщику.Контрагент)
	|			И ВозвратТоваровПоставщику.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ВозвратТоваровПоставщику.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ВозвратТоваровПоставщику.Контрагент)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ПО ВозвратТоваровПоставщику.ДокументПоступления = ПриобретениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ВозвратТоваровПоставщику.Организация В(&СтруктураОрганизации)
	|	И ВозвратТоваровПоставщику.Дата >= &НачалоПериода
	|	И ВозвратТоваровПоставщику.Проведен
	|	И ВозвратТоваровПоставщику.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ВЫБОР
	|			КОГДА ПриобретениеТоваровУслуг.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ПриобретениеТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	|					ИЛИ ПриобретениеТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.Импорт)
	|		КОНЕЦ
	|	И ПриобретениеТоваровУслуг.Дата >= &НачалоПериода
	|	И ПриобретениеТоваровУслуг.Дата <= &ОкончаниеПериода
	|	И ПриобретениеТоваровУслуг.Проведен
	|	И ВозвратТоваровПоставщику.ДокументПоступления <> ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|	И ПриобретениеТоваровУслуг.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВозврата.Ссылка КАК Сделка,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	Аналитика.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ТоварыВозврата.Количество КАК Количество,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ТоварыВозврата.СтавкаНДС,
	|	ТоварыВозврата.СуммаСНДС - ТоварыВозврата.СуммаНДС КАК СуммаБезНДС,
	|	ТоварыВозврата.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыВозврата.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ВозвратТоваров) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТоварыВозврата.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ЕСТЬNULL(ТоварыВозврата.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ТоварыВозврата.ИдентификаторСтроки
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику.ВидыЗапасов КАК ТоварыВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТоварыВозврата.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ТоварыВозврата.Ссылка = ДокументыКонтролируемыхСделок.ДокументВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.Сделка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТоварыКонтролируемыхСделок.Сделка.Контрагент
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.Сделка.Грузополучатель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.Сделка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ТоварыКонтролируемыхСделок.Сделка.Организация
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.Сделка.Грузоотправитель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.Сделка КАК РегистраторРегистраСумм,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	-1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиКорректировкиПоступления(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
		
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КорректировкаПриобретения.Ссылка КАК Корректировка,
	|	КорректировкаПриобретения.ДокументОснование КАК Поступление
	|ПОМЕСТИТЬ ДокументыКорректировкиИРеализации
	|ИЗ
	|	Документ.КорректировкаПриобретения КАК КорректировкаПриобретения
	|ГДЕ
	|	КорректировкаПриобретения.Организация В(&СтруктураОрганизации)
	|	И КорректировкаПриобретения.Дата >= &НачалоПериода
	|	И КорректировкаПриобретения.Проведен
	|	И КорректировкаПриобретения.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВЫБОР
	|			КОГДА КорректировкаПриобретения.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ КорректировкаПриобретения.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Корректировка,
	|	Поступление
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриобретениеТоваровУслуг.Ссылка КАК РасчетныйДокумент,
	|	ПриобретениеТоваровУслуг.Дата КАК Период,
	|	ПриобретениеТоваровУслуг.Организация,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслуг.Валюта,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслуг.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслуг.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ПриобретениеТоваровУслуг.Контрагент
	|		ИНАЧЕ ПриобретениеТоваровУслуг.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ПриобретениеТоваровУслуг.Организация КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ПриобретениеТоваровУслуг.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ПриобретениеТоваровУслуг.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ДокументыКорректировкиИРеализации.Корректировка КАК Корректировка,
	|	ПриобретениеТоваровУслуг.ВернутьМногооборотнуюТару
	|ПОМЕСТИТЬ ДанныеДокументовКорректировкиИРеализации
	|ИЗ
	|	ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ПО (ПриобретениеТоваровУслуг.Дата >= &НачалоПериода)
	|			И (ПриобретениеТоваровУслуг.Дата <= &ОкончаниеПериода)
	|			И (ПриобретениеТоваровУслуг.Проведен)
	|			И (ПриобретениеТоваровУслуг.Контрагент В
	|				(ВЫБРАТЬ
	|					КонтролируемыеКонтрагенты.Контрагент
	|				ИЗ
	|					КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты))
	|			И ДокументыКорректировкиИРеализации.Поступление = ПриобретениеТоваровУслуг.Ссылка
	|			И (ВЫБОР
	|				КОГДА ПриобретениеТоваровУслуг.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПриобретениеТоваровУслуг.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеУслугПрочихАктивов.Ссылка,
	|	ПриобретениеУслугПрочихАктивов.Дата,
	|	ПриобретениеУслугПрочихАктивов.Организация,
	|	ПриобретениеУслугПрочихАктивов.Контрагент,
	|	ПриобретениеУслугПрочихАктивов.Валюта,
	|	ВЫБОР
	|		КОГДА ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ПриобретениеУслугПрочихАктивов.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ПриобретениеУслугПрочихАктивов.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ДокументыКорректировкиИРеализации.Корректировка,
	|	ЛОЖЬ
	|ИЗ
	|	ДокументыКорректировкиИРеализации КАК ДокументыКорректировкиИРеализации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
	|		ПО (ПриобретениеУслугПрочихАктивов.Дата <= &ОкончаниеПериода)
	|			И (ПриобретениеУслугПрочихАктивов.Контрагент В
	|				(ВЫБРАТЬ
	|					КонтролируемыеКонтрагенты.Контрагент
	|				ИЗ
	|					КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты))
	|			И (ПриобретениеУслугПрочихАктивов.Дата >= &НачалоПериода)
	|			И (ПриобретениеУслугПрочихАктивов.Проведен)
	|			И ДокументыКорректировкиИРеализации.Поступление = ПриобретениеУслугПрочихАктивов.Ссылка
	|			И (ВЫБОР
	|				КОГДА ПриобретениеУслугПрочихАктивов.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|					ТОГДА ИСТИНА
	|				ИНАЧЕ ПриобретениеУслугПрочихАктивов.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	|			КОНЕЦ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДанныеДокументовКорректировкиИРеализации.РасчетныйДокумент,
	|	ДанныеДокументовКорректировкиИРеализации.Период,
	|	ДанныеДокументовКорректировкиИРеализации.Организация,
	|	ДанныеДокументовКорректировкиИРеализации.Контрагент,
	|	ДанныеДокументовКорректировкиИРеализации.Валюта,
	|	ДанныеДокументовКорректировкиИРеализации.ОперацияОблагаетсяЕНВД,
	|	ДанныеДокументовКорректировкиИРеализации.Грузоотправитель,
	|	ДанныеДокументовКорректировкиИРеализации.Договор,
	|	ДанныеДокументовКорректировкиИРеализации.Соглашение,
	|	ДанныеДокументовКорректировкиИРеализации.Корректировка КАК Корректировка,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДанныеДокументовКорректировкиИРеализации.ВернутьМногооборотнуюТару,
	|	ДанныеДокументовКорректировкиИРеализации.Грузополучатель
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	ДанныеДокументовКорректировкиИРеализации КАК ДанныеДокументовКорректировкиИРеализации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ДанныеДокументовКорректировкиИРеализации.Контрагент = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|			И ДанныеДокументовКорректировкиИРеализации.Период >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ДанныеДокументовКорректировкиИРеализации.Период <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО ДанныеДокументовКорректировкиИРеализации.Контрагент = ИностранныеКонтрагенты.Контрагент
	|ГДЕ
	|	(НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Корректировка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	КорректировкаПриобретенияРасхождения.Ссылка КАК РегистраторРегистраСумм,
	|	ДокументыКонтролируемыхСделок.Период КАК Период,
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ЕСТЬNULL(КорректировкаПриобретенияРасхождения.Номенклатура, КорректировкаПриобретенияРасхождения.Содержание) КАК ПредметСделки,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|						ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			КОНЕЦ
	|	КОНЕЦ КАК ТипПредметаСделки,
	|	ЕСТЬNULL(КорректировкаПриобретенияРасхождения.Номенклатура.НаименованиеПолное, КорректировкаПриобретенияРасхождения.Содержание) КАК НаименованиеПредметаСделки,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|				ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|				ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(КорректировкаПриобретенияРасхождения.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	|	КОНЕЦ КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.Корректировка) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|				ИЛИ ЕСТЬNULL(КорректировкаПриобретенияРасхождения.Характеристика.Принципал, КорректировкаПриобретенияРасхождения.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(КорректировкаПриобретенияРасхождения.Характеристика.Принципал, КорректировкаПриобретенияРасхождения.Номенклатура.Принципал) = КорректировкаПриобретенияРасхождения.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ДокументыКонтролируемыхСделок.Валюта,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|			ТОГДА &ЕдиницаИзмеренияШтука
	|		ИНАЧЕ КорректировкаПриобретенияРасхождения.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ КАК ЕдиницаИзмерения,
	|	СУММА(КорректировкаПриобретенияРасхождения.Количество) КАК Количество,
	|	КорректировкаПриобретенияРасхождения.СтавкаНДС,
	|	СУММА(КорректировкаПриобретенияРасхождения.СуммаСНДС - КорректировкаПриобретенияРасхождения.СуммаНДС) КАК СуммаБезНДС,
	|	СУММА(КорректировкаПриобретенияРасхождения.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|				ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|				ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	КорректировкаПриобретенияРасхождения.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Договор,
	|	ДокументыКонтролируемыхСделок.Соглашение,
	|	1 КАК МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПриобретения.Расхождения КАК КорректировкаПриобретенияРасхождения
	|			ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|			ПО КорректировкаПриобретенияРасхождения.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|		ПО ДокументыКонтролируемыхСделок.Корректировка = КорректировкаПриобретенияРасхождения.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДокументыКонтролируемыхСделок.ВернутьМногооборотнуюТару
	|				ТОГДА КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПриобретенияРасхождения.Ссылка,
	|	КорректировкаПриобретенияРасхождения.СтавкаНДС,
	|	КорректировкаПриобретенияРасхождения.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент,
	|	ДокументыКонтролируемыхСделок.Период,
	|	ДокументыКонтролируемыхСделок.Организация,
	|	ДокументыКонтролируемыхСделок.Контрагент,
	|	ДокументыКонтролируемыхСделок.Валюта,
	|	ДокументыКонтролируемыхСделок.Грузоотправитель,
	|	ДокументыКонтролируемыхСделок.Договор,
	|	ДокументыКонтролируемыхСделок.Соглашение,
	|	ЕСТЬNULL(КорректировкаПриобретенияРасхождения.Номенклатура, КорректировкаПриобретенияРасхождения.Содержание),
	|	ЕСТЬNULL(КорректировкаПриобретенияРасхождения.Номенклатура.НаименованиеПолное, КорректировкаПриобретенияРасхождения.Содержание),
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|						ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|					ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга)
	|				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|				ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|				ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)
	|		ИНАЧЕ ЕСТЬNULL(КорректировкаПриобретенияРасхождения.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|				ИЛИ ЕСТЬNULL(КорректировкаПриобретенияРасхождения.Характеристика.Принципал, КорректировкаПриобретенияРасхождения.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(КорректировкаПриобретенияРасхождения.Характеристика.Принципал, КорректировкаПриобретенияРасхождения.Номенклатура.Принципал) = КорректировкаПриобретенияРасхождения.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|			ТОГДА &ЕдиницаИзмеренияШтука
	|		ИНАЧЕ КорректировкаПриобретенияРасхождения.Номенклатура.ЕдиницаИзмерения
	|	КОНЕЦ,
	|	ДокументыКонтролируемыхСделок.Грузополучатель,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Номенклатура ЕСТЬ NULL 
	|				ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Работа)
	|				ИЛИ КорректировкаПриобретенияРасхождения.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
	|				ИЛИ ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КорректировкаПриобретенияРасхождения.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РегистраторРегистраСумм КАК РегистраторРегистраСумм,
	|	ТоварыКонтролируемыхСделок.Период,
	|	ТоварыКонтролируемыхСделок.Организация,
	|	ТоварыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.Грузополучатель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ТоварыКонтролируемыхСделок.Грузоотправитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузоотправитель,
	|	ТоварыКонтролируемыхСделок.Договор,
	|	ТоварыКонтролируемыхСделок.Соглашение,
	|	ТоварыКонтролируемыхСделок.МножительСуммовыхДанных
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|	И (ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКорректировкиИРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДокументовКорректировкиИРеализации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеСделокКомиссии

Процедура ДобавитьСделкиОтчетаКомитентуОПродажах(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомитенту.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомитенту.Дата КАК Период,
	|	ОтчетКомитенту.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ОтчетКомитенту.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ОтчетКомитенту.Услуга КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ОтчетКомитенту.Услуга.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	ОтчетКомитенту.Валюта,
	|	ОтчетКомитенту.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Количество,
	|	ОтчетКомитенту.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ОтчетКомитенту.СуммаВознаграждения - ОтчетКомитенту.СуммаНДСВознаграждения КАК СуммаБезНДС,
	|	ОтчетКомитенту.СуммаНДСВознаграждения КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ОтчетКомитенту.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ОтчетКомитенту.Контрагент КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ОтчетКомитенту.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ОтчетКомитенту.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ОтчетКомитенту.Ссылка КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	"""" КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Документ.ОтчетКомитенту КАК ОтчетКомитенту
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомитенту.Контрагент)
	|			И ОтчетКомитенту.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомитенту.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетКомитенту.Контрагент)
	|ГДЕ
	|	ОтчетКомитенту.Организация В(&СтруктураОрганизации)
	|	И ОтчетКомитенту.Дата >= &НачалоПериода
	|	И ОтчетКомитенту.Дата <= &ОкончаниеПериода
	|	И ОтчетКомитенту.Проведен = ИСТИНА
	|	И ОтчетКомитенту.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА ОтчетКомитенту.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОтчетКомитенту.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомитентом)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомитентуОСписании(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомитентуОСписании.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомитентуОСписании КАК ОтчетКомитентуОСписании
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомитентуОСписании.Контрагент)
	|			И ОтчетКомитентуОСписании.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомитентуОСписании.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетКомитентуОСписании.Контрагент)
	|ГДЕ
	|	ОтчетКомитентуОСписании.Организация В(&СтруктураОрганизации)
	|	И ОтчетКомитентуОСписании.Дата >= &НачалоПериода
	|	И ОтчетКомитентуОСписании.Дата <= &ОкончаниеПериода
	|	И ОтчетКомитентуОСписании.Проведен = ИСТИНА
	|	И ОтчетКомитентуОСписании.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ВЫБОР
	|			КОГДА ОтчетКомитентуОСписании.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОтчетКомитентуОСписании.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомитентом)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКомитента.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	Аналитика.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	СУММА(ТоварыКомитента.Количество) КАК Количество,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	СУММА(ТоварыКомитента.СуммаСНДС - ТоварыКомитента.СуммаНДС) КАК СуммаБезНДС,
	|	ТоварыКомитента.СтавкаНДС,
	|	СУММА(ТоварыКомитента.СуммаНДС) КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыКомитента.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров) КАК ХозяйственнаяОперация,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЕСТЬNULL(ТоварыКомитента.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ТоварыКомитента.ИдентификаторСтроки
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомитентуОСписании.ВидыЗапасов КАК ТоварыКомитента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ТоварыКомитента.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТоварыКомитента.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКомитента.Ссылка,
	|	Аналитика.Номенклатура,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	ТоварыКомитента.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ТоварыКомитента.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ЕСТЬNULL(ТоварыКомитента.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ВЫБОР
	|		КОГДА ТоварыКомитента.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	-1 КАК МножительСуммовыхДанных,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Грузоотправитель,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Грузополучатель
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомиссионераОПродажах(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомиссионера.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомиссионера.Дата КАК Период,
	|	ОтчетКомиссионера.Организация КАК Организация,
	|	ОтчетКомиссионера.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ОтчетКомиссионера.Услуга КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ОтчетКомиссионера.Услуга.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	ОтчетКомиссионера.Валюта,
	|	ОтчетКомиссионера.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Количество,
	|	ОтчетКомиссионера.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ОтчетКомиссионера.СуммаВознаграждения - ОтчетКомиссионера.СуммаНДСВознаграждения КАК СуммаБезНДС,
	|	ОтчетКомиссионера.СуммаНДСВознаграждения КАК СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ОтчетКомиссионера.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ОтчетКомиссионера.Организация КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ОтчетКомиссионера.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ОтчетКомиссионера.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ОтчетКомиссионера.Ссылка КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	"""" КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомиссионера.Контрагент)
	|			И ОтчетКомиссионера.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомиссионера.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетКомиссионера.Контрагент)
	|ГДЕ
	|	ОтчетКомиссионера.Организация В(&СтруктураОрганизации)
	|	И ОтчетКомиссионера.Дата >= &НачалоПериода
	|	И ОтчетКомиссионера.Дата <= &ОкончаниеПериода
	|	И ОтчетКомиссионера.Проведен = ИСТИНА
	|	И ОтчетКомиссионера.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА ОтчетКомиссионера.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОтчетКомиссионера.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();

КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомиссионераОПродажахЗависимымЛицам(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомиссионера.Ссылка КАК РасчетныйДокумент,
	|	ОтчетКомиссионера.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокБезПроверкиПоПокупателям
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ГДЕ
	|	ОтчетКомиссионера.Организация В(&СтруктураОрганизации)
	|	И ОтчетКомиссионера.Дата >= &НачалоПериода
	|	И ОтчетКомиссионера.Дата <= &ОкончаниеПериода
	|	И ОтчетКомиссионера.Проведен = ИСТИНА
	|	И ОтчетКомиссионера.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ВЫБОР
	|			КОГДА ОтчетКомиссионера.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОтчетКомиссионера.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомиссионераТовары.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ОтчетКомиссионераТовары.Покупатель КАК Покупатель,
	|	ДокументыКонтролируемыхСделокБезПроверкиПоПокупателям.Контрагент КАК Комиссионер
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделокБезПроверкиПоПокупателям КАК ДокументыКонтролируемыхСделокБезПроверкиПоПокупателям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетКомиссионера.Товары КАК ОтчетКомиссионераТовары
	|		ПО ДокументыКонтролируемыхСделокБезПроверкиПоПокупателям.РасчетныйДокумент = ОтчетКомиссионераТовары.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ОтчетКомиссионераТовары.Покупатель = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|			И ОтчетКомиссионераТовары.Ссылка.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомиссионераТовары.Ссылка.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|ГДЕ
	|	НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент,
	|	Покупатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УслугиКомиссионера.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	УслугиКомиссионера.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	УслугиКомиссионера.Количество КАК Количество,
	|	УслугиКомиссионера.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	УслугиКомиссионера.СуммаСНДС - УслугиКомиссионера.СуммаНДС КАК СуммаБезНДС,
	|	УслугиКомиссионера.СтавкаНДС,
	|	УслугиКомиссионера.СуммаНДС КАК СуммаНДС,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	УслугиКомиссионера.ИдентификаторСтроки,
	|	УслугиКомиссионера.Покупатель КАК Контрагент,
	|	ДокументыКонтролируемыхСделок.Комиссионер КАК Комиссионер
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомиссионера.Товары КАК УслугиКомиссионера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО УслугиКомиссионера.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			И УслугиКомиссионера.Покупатель = ДокументыКонтролируемыхСделок.Покупатель
	|ГДЕ
	|	НЕ УслугиКомиссионера.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТоварыКомиссионера.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	Аналитика.Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	ТоварыКомиссионера.Количество,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	ТоварыКомиссионера.СуммаСНДС - ТоварыКомиссионера.СуммаНДС,
	|	ТоварыКомиссионера.СтавкаНДС,
	|	ТоварыКомиссионера.СуммаНДС,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров),
	|	ИСТИНА,
	|	ЕСТЬNULL(ТоварыКомиссионера.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ТоварыКомиссионера.ИдентификаторСтроки,
	|	ТоварыКомиссионера.Покупатель,
	|	ДокументыКонтролируемыхСделок.Комиссионер КАК Комиссионер
	|ИЗ
	|	Документ.ОтчетКомиссионера.ВидыЗапасов КАК ТоварыКомиссионера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ТоварыКомиссионера.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			И ТоварыКомиссионера.Покупатель = ДокументыКонтролируемыхСделок.Покупатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТоварыКомиссионера.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.Контрагент КАК Контрагент,
	|	ТоварыКонтролируемыхСделок.Комиссионер КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Грузоотправитель,
	|	ТоварыКонтролируемыхСделок.Контрагент КАК Грузополучатель
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокБезПроверкиПоПокупателям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетаКомиссионераОСписании(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетКомиссионераОСписании.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомиссионераОСписании КАК ОтчетКомиссионераОСписании
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетКомиссионераОСписании.Контрагент)
	|			И ОтчетКомиссионераОСписании.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетКомиссионераОСписании.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетКомиссионераОСписании.Контрагент)
	|ГДЕ
	|	ОтчетКомиссионераОСписании.Организация В(&СтруктураОрганизации)
	|	И ОтчетКомиссионераОСписании.Дата >= &НачалоПериода
	|	И ОтчетКомиссионераОСписании.Дата <= &ОкончаниеПериода
	|	И ОтчетКомиссионераОСписании.Проведен = ИСТИНА
	|	И ОтчетКомиссионераОСписании.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL )
	|	И ВЫБОР
	|			КОГДА ОтчетКомиссионераОСписании.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОтчетКомиссионераОСписании.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СКомиссионером)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыКомиссионера.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	Аналитика.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ТоварыКомиссионера.Количество КАК Количество,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ТоварыКомиссионера.СуммаСНДС - ТоварыКомиссионера.СуммаНДС КАК СуммаБезНДС,
	|	ТоварыКомиссионера.СтавкаНДС,
	|	ТоварыКомиссионера.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыКомиссионера.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ТоварыКомиссионера.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТоварыКомиссионера.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ЕСТЬNULL(ТоварыКомиссионера.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ИностранныйКонтрагент,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ТоварыКомиссионера.ИдентификаторСтроки
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетКомиссионераОСписании.ВидыЗапасов КАК ТоварыКомиссионера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ТоварыКомиссионера.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТоварыКомиссионера.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	-1 КАК МножительСуммовыхДанных,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Грузоотправитель,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Контрагент КАК Грузополучатель
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностранныйКонтрагент
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеСделокИнтеркомпани

Процедура ДобавитьСделкиПередачиТоваровМеждуОрганизациями_ОрганизацияОтправитель(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередачаТоваровМеждуОрганизациями.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеОрганизации.Организация ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностраннаяОрганизация,
	|	ЕСТЬNULL(ИностранныеОрганизации.ЗарегистрированаВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированаВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ПередачаТоваровМеждуОрганизациями.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПередачаТоваровМеждуОрганизациями.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеОрганизации КАК ИностранныеОрганизации
	|		ПО ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель = ИностранныеОрганизации.Организация
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациями.Организация В(&СтруктураОрганизации)
	|	И ПередачаТоваровМеждуОрганизациями.Дата >= &НачалоПериода
	|	И ПередачаТоваровМеждуОрганизациями.Дата <= &ОкончаниеПериода
	|	И ПередачаТоваровМеждуОрганизациями.Проведен = ИСТИНА
	|	И ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ПередачаТоваровМеждуОрганизациями.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеОрганизации.Организация ЕСТЬ NULL )
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередачаУслугМеждуОрганизациями.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ПередачаУслугМеждуОрганизациями.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ПередачаУслугМеждуОрганизациями.Количество КАК Количество,
	|	ПередачаУслугМеждуОрганизациями.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ПередачаУслугМеждуОрганизациями.СуммаСНДС - ПередачаУслугМеждуОрганизациями.СуммаНДС КАК СуммаБезНДС,
	|	ПередачаУслугМеждуОрганизациями.СтавкаНДС,
	|	ПередачаУслугМеждуОрганизациями.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ПередачаУслугМеждуОрганизациями.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПередачаУслугМеждуОрганизациями.Характеристика.Принципал, ПередачаУслугМеждуОрганизациями.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(ПередачаУслугМеждуОрганизациями.Характеристика.Принципал, ПередачаУслугМеждуОрганизациями.Номенклатура.Принципал) = ПередачаУслугМеждуОрганизациями.Ссылка.Организация
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхУслуг)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ПередачаУслугМеждуОрганизациями.Характеристика.Принципал, ПередачаУслугМеждуОрганизациями.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(ПередачаУслугМеждуОрганизациями.Характеристика.Принципал, ПередачаУслугМеждуОрганизациями.Номенклатура.Принципал) = ПередачаУслугМеждуОрганизациями.Ссылка.Организация
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.Пустаяссылка) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ПередачаУслугМеждуОрганизациями.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностраннаяОрганизация,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаУслугМеждуОрганизациями
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПередачаУслугМеждуОрганизациями.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	НЕ ПередачаУслугМеждуОрганизациями.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациями.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	Аналитика.Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	СУММА(ПередачаТоваровМеждуОрганизациями.Количество),
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(ПередачаТоваровМеждуОрганизациями.СуммаСНДС - ПередачаТоваровМеждуОрганизациями.СуммаНДС),
	|	ПередачаТоваровМеждуОрганизациями.СтавкаНДС,
	|	СУММА(ПередачаТоваровМеждуОрганизациями.СуммаНДС),
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациями.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациями.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациями.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(ПередачаТоваровМеждуОрганизациями.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ПередачаТоваровМеждуОрганизациями.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностраннаяОрганизация,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК ПередачаТоваровМеждуОрганизациями
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПередачаТоваровМеждуОрганизациями.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ПередачаТоваровМеждуОрганизациями.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПередачаТоваровМеждуОрганизациями.Ссылка,
	|	Аналитика.Номенклатура,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	ПередачаТоваровМеждуОрганизациями.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ПередачаТоваровМеждуОрганизациями.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностраннаяОрганизация,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациями.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациями.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.Типызапасов.Товар))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияКомиссионныхТоваров)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациями.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(ПередачаТоваровМеждуОрганизациями.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.ОрганизацияПолучатель КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.ОрганизацияПолучатель
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузополучатель,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|	И (ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностраннаяОрганизация
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиПередачиТоваровМеждуОрганизациями_ОрганизацияПолучатель(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПередачаТоваровМеждуОрганизациями.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеОрганизации.Организация ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностраннаяОрганизация,
	|	ЕСТЬNULL(ИностранныеОрганизации.ЗарегистрированаВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированаВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ПередачаТоваровМеждуОрганизациями.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПередачаТоваровМеждуОрганизациями.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПередачаТоваровМеждуОрганизациями.Организация)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеОрганизации КАК ИностранныеОрганизации
	|		ПО ПередачаТоваровМеждуОрганизациями.Организация = ИностранныеОрганизации.Организация
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациями.ОрганизацияПолучатель В(&СтруктураОрганизации)
	|	И ПередачаТоваровМеждуОрганизациями.Дата >= &НачалоПериода
	|	И ПередачаТоваровМеждуОрганизациями.Дата <= &ОкончаниеПериода
	|	И ПередачаТоваровМеждуОрганизациями.Проведен = ИСТИНА
	|	И ПередачаТоваровМеждуОрганизациями.Организация В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ПередачаТоваровМеждуОрганизациями.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеОрганизации.Организация ЕСТЬ NULL )
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УслугиПередачиМеждуОрганизациями.Ссылка КАК РасчетныйДокумент,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	УслугиПередачиМеждуОрганизациями.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	УслугиПередачиМеждуОрганизациями.Количество КАК Количество,
	|	УслугиПередачиМеждуОрганизациями.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	УслугиПередачиМеждуОрганизациями.СуммаСНДС - УслугиПередачиМеждуОрганизациями.СуммаНДС КАК СуммаБезНДС,
	|	УслугиПередачиМеждуОрганизациями.СтавкаНДС,
	|	УслугиПередачиМеждуОрганизациями.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА УслугиПередачиМеждуОрганизациями.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(УслугиПередачиМеждуОрганизациями.Характеристика.Принципал, УслугиПередачиМеждуОрганизациями.Номенклатура.Принципал) = НЕОПРЕДЕЛЕНО
	|				ИЛИ ЕСТЬNULL(УслугиПередачиМеждуОрганизациями.Характеристика.Принципал, УслугиПередачиМеждуОрганизациями.Номенклатура.Принципал) = УслугиПередачиМеждуОрганизациями.Ссылка.Организация
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеАгентскихУслуг)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.Пустаяссылка) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	УслугиПередачиМеждуОрганизациями.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностраннаяОрганизация,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК УслугиПередачиМеждуОрганизациями
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО УслугиПередачиМеждуОрганизациями.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|ГДЕ
	|	НЕ УслугиПередачиМеждуОрганизациями.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаТоваровМеждуОрганизациямиВидыЗапасов.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход),
	|	Аналитика.Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	СУММА(ПередачаТоваровМеждуОрганизациямиВидыЗапасов.Количество),
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	СУММА(ПередачаТоваровМеждуОрганизациямиВидыЗапасов.СуммаСНДС - ПередачаТоваровМеждуОрганизациямиВидыЗапасов.СуммаНДС),
	|	ПередачаТоваровМеждуОрганизациямиВидыЗапасов.СтавкаНДС,
	|	СУММА(ПередачаТоваровМеждуОрганизациямиВидыЗапасов.СуммаНДС),
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациямиВидыЗапасов.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров),
	|	ИСТИНА,
	|	ЕСТЬNULL(ПередачаТоваровМеждуОрганизациямиВидыЗапасов.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ПередачаТоваровМеждуОрганизациямиВидыЗапасов.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ИностраннаяОрганизация,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.ВидыЗапасов КАК ПередачаТоваровМеждуОрганизациямиВидыЗапасов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ПередачаТоваровМеждуОрганизациямиВидыЗапасов.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ПередачаТоваровМеждуОрганизациямиВидыЗапасов.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|
	|СГРУППИРОВАТЬ ПО
	|	ПередачаТоваровМеждуОрганизациямиВидыЗапасов.Ссылка,
	|	Аналитика.Номенклатура,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	ПередачаТоваровМеждуОрганизациямиВидыЗапасов.СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ПередачаТоваровМеждуОрганизациямиВидыЗапасов.ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностраннаяОрганизация,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением,
	|	ВЫБОР
	|		КОГДА ПередачаТоваровМеждуОрганизациямиВидыЗапасов.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЕСТЬNULL(ПередачаТоваровМеждуОрганизациямиВидыЗапасов.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.ОрганизацияПолучатель КАК Организация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.ОрганизацияПолучатель
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель
	|				КОНЕЦ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузополучатель,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|	И (ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностраннаяОрганизация
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиОтчетПоКомиссииМеждуОрганизациями(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетПоКомиссииМеждуОрганизациями.Ссылка КАК РасчетныйДокумент,
	|	ИСТИНА КАК ОрганизацияЯвляетсяКомитентом,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеОрганизации.Организация ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностраннаяОрганизация,
	|	ЕСТЬNULL(ИностранныеОрганизации.ЗарегистрированаВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированаВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетПоКомиссииМеждуОрганизациями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ОтчетПоКомиссииМеждуОрганизациями.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетПоКомиссииМеждуОрганизациями.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И ОтчетПоКомиссииМеждуОрганизациями.Комиссионер = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеОрганизации КАК ИностранныеОрганизации
	|		ПО ОтчетПоКомиссииМеждуОрганизациями.Комиссионер = ИностранныеОрганизации.Организация
	|ГДЕ
	|	ОтчетПоКомиссииМеждуОрганизациями.Организация В(&СтруктураОрганизации)
	|	И ОтчетПоКомиссииМеждуОрганизациями.Дата >= &НачалоПериода
	|	И ОтчетПоКомиссииМеждуОрганизациями.Дата <= &ОкончаниеПериода
	|	И ОтчетПоКомиссииМеждуОрганизациями.Проведен
	|	И ОтчетПоКомиссииМеждуОрганизациями.Комиссионер В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеОрганизации.Организация ЕСТЬ NULL )
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОтчетПоКомиссииМеждуОрганизациями.Ссылка,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИностранныеОрганизации.Организация ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(ИностранныеОрганизации.ЗарегистрированаВСтранеСЛьготнымНалогообложением, ЛОЖЬ)
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетПоКомиссииМеждуОрганизациями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ОтчетПоКомиссииМеждуОрганизациями.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетПоКомиссииМеждуОрганизациями.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И ОтчетПоКомиссииМеждуОрганизациями.Организация = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеОрганизации КАК ИностранныеОрганизации
	|		ПО ОтчетПоКомиссииМеждуОрганизациями.Организация = ИностранныеОрганизации.Организация
	|ГДЕ
	|	ОтчетПоКомиссииМеждуОрганизациями.Комиссионер В(&СтруктураОрганизации)
	|	И ОтчетПоКомиссииМеждуОрганизациями.Дата >= &НачалоПериода
	|	И ОтчетПоКомиссииМеждуОрганизациями.Дата <= &ОкончаниеПериода
	|	И ОтчетПоКомиссииМеждуОрганизациями.Проведен
	|	И ОтчетПоКомиссииМеждуОрганизациями.Организация В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеОрганизации.Организация ЕСТЬ NULL )
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ОтчетПоКомиссииМеждуОрганизациямиТовары.Покупатель КАК Покупатель
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделокПокупатели
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями.Товары КАК ОтчетПоКомиссииМеждуОрганизациямиТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ОтчетПоКомиссииМеждуОрганизациямиТовары.Ссылка.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетПоКомиссииМеждуОрганизациямиТовары.Ссылка.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И ОтчетПоКомиссииМеждуОрганизациямиТовары.Покупатель = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ОтчетПоКомиссииМеждуОрганизациямиТовары.Ссылка = ДокументыКонтролируемыхСделок.РасчетныйДокумент
	|			И (ДокументыКонтролируемыхСделок.ОрганизацияЯвляетсяКомитентом)
	|ГДЕ
	|	НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент,
	|	Покупатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетПоКомиссииМеждуОрганизациями.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ОрганизацияЯвляетсяКомитентом
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|	КОНЕЦ КАК ТипКонтролируемойСделки,
	|	ОтчетПоКомиссииМеждуОрганизациями.Услуга КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	1 КАК Количество,
	|	ОтчетПоКомиссииМеждуОрганизациями.Услуга.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ОтчетПоКомиссииМеждуОрганизациями.СтавкаНДСВознаграждения КАК СтавкаНДС,
	|	ОтчетПоКомиссииМеждуОрганизациями.СуммаВознаграждения - ОтчетПоКомиссииМеждуОрганизациями.СуммаНДСВознаграждения КАК СуммаБезНДС,
	|	ОтчетПоКомиссииМеждуОрганизациями.СуммаНДСВознаграждения КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ОтчетПоКомиссииМеждуОрганизациями.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ОрганизацияЯвляетсяКомитентом
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ИСТИНА КАК ВключатьСоставСделок,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностраннаяОрганизация,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением,
	|	"""" КАК ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ОрганизацияЯвляетсяКомитентом,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ОрганизацияЯвляетсяКомитентом
	|			ТОГДА ОтчетПоКомиссииМеждуОрганизациями.Комиссионер
	|		ИНАЧЕ ОтчетПоКомиссииМеждуОрганизациями.Организация
	|	КОНЕЦ КАК Контрагент
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетПоКомиссииМеждуОрганизациями КАК ОтчетПоКомиссииМеждуОрганизациями
	|		ПО ДокументыКонтролируемыхСделок.РасчетныйДокумент = ОтчетПоКомиссииМеждуОрганизациями.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаУслугКомитентаЗависимымЛицам.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	ПередачаУслугКомитентаЗависимымЛицам.Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга),
	|	ПередачаУслугКомитентаЗависимымЛицам.Количество,
	|	ПередачаУслугКомитентаЗависимымЛицам.Номенклатура.ЕдиницаИзмерения,
	|	ПередачаУслугКомитентаЗависимымЛицам.СтавкаНДС,
	|	ПередачаУслугКомитентаЗависимымЛицам.СуммаСНДС - ПередачаУслугКомитентаЗависимымЛицам.СуммаНДС,
	|	ПередачаУслугКомитентаЗависимымЛицам.СуммаНДС,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг),
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка),
	|	ДокументыКонтролируемыхСделокПокупатели.ВзаимозависимыеЛица,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	"""",
	|	ИСТИНА,
	|	ПередачаУслугКомитентаЗависимымЛицам.Покупатель
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями.Товары КАК ПередачаУслугКомитентаЗависимымЛицам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделокПокупатели КАК ДокументыКонтролируемыхСделокПокупатели
	|		ПО ПередачаУслугКомитентаЗависимымЛицам.Ссылка = ДокументыКонтролируемыхСделокПокупатели.РасчетныйДокумент
	|			И ПередачаУслугКомитентаЗависимымЛицам.Покупатель = ДокументыКонтролируемыхСделокПокупатели.Покупатель
	|ГДЕ
	|	НЕ ПередачаУслугКомитентаЗависимымЛицам.Номенклатура.ТипНоменклатуры В (ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар), ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.МногооборотнаяТара))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПередачаТоваровКомитентаЗависимымЛицам.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход),
	|	Аналитика.Номенклатура,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар),
	|	ПередачаТоваровКомитентаЗависимымЛицам.Количество,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения,
	|	ПередачаТоваровКомитентаЗависимымЛицам.СтавкаНДС,
	|	ПередачаТоваровКомитентаЗависимымЛицам.СуммаСНДС - ПередачаТоваровКомитентаЗависимымЛицам.СуммаНДС,
	|	ПередачаТоваровКомитентаЗависимымЛицам.СуммаНДС,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров),
	|	ИСТИНА,
	|	ЕСТЬNULL(ПередачаТоваровКомитентаЗависимымЛицам.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)),
	|	ДокументыКонтролируемыхСделокПокупатели.ВзаимозависимыеЛица,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ПередачаТоваровКомитентаЗависимымЛицам.ИдентификаторСтроки,
	|	ИСТИНА,
	|	ПередачаТоваровКомитентаЗависимымЛицам.Покупатель
	|ИЗ
	|	Документ.ОтчетПоКомиссииМеждуОрганизациями.ВидыЗапасов КАК ПередачаТоваровКомитентаЗависимымЛицам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделокПокупатели КАК ДокументыКонтролируемыхСделокПокупатели
	|		ПО ПередачаТоваровКомитентаЗависимымЛицам.Ссылка = ДокументыКонтролируемыхСделокПокупатели.РасчетныйДокумент
	|			И ПередачаТоваровКомитентаЗависимымЛицам.Покупатель = ДокументыКонтролируемыхСделокПокупатели.Покупатель
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ПередачаТоваровКомитентаЗависимымЛицам.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ОрганизацияЯвляетсяКомитентом
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Комиссионер
	|	КОНЕЦ КАК Организация,
	|	ТоварыКонтролируемыхСделок.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Комиссионер
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ТипПредметаСделки = ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар)
	|			ТОГДА ТоварыКонтролируемыхСделок.Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Грузополучатель,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	НЕОПРЕДЕЛЕНО КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|	И (ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностраннаяОрганизация
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением)";
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыКонтролируемыхСделокПокупатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиВозвратаТоваровМеждуОрганизациями(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратТоваровМеждуОрганизациями.Ссылка КАК ДокументВозврата,
	|	ЛОЖЬ КАК ОрганизацияПринимаетВозврат,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеОрганизации.Организация ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностраннаяОрганизация,
	|	ЕСТЬNULL(ИностранныеОрганизации.ЗарегистрированаВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированаВСтранеСЛьготнымНалогообложением,
	|	ПередачаТоваровМеждуОрганизациями.Ссылка КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратТоваровМеждуОрганизациями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ВозвратТоваровМеждуОрганизациями.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ВозвратТоваровМеждуОрганизациями.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И ВозвратТоваровМеждуОрганизациями.ОрганизацияПолучатель = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеОрганизации КАК ИностранныеОрганизации
	|		ПО ВозвратТоваровМеждуОрганизациями.ОрганизацияПолучатель = ИностранныеОрганизации.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|		ПО ВозвратТоваровМеждуОрганизациями.ДокументПередачи = ПередачаТоваровМеждуОрганизациями.Ссылка
	|ГДЕ
	|	ВозвратТоваровМеждуОрганизациями.Организация В(&СтруктураОрганизации)
	|	И ВозвратТоваровМеждуОрганизациями.Дата >= &НачалоПериода
	|	И ВозвратТоваровМеждуОрганизациями.Проведен
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеОрганизации.Организация ЕСТЬ NULL )
	|	И ВозвратТоваровМеждуОрганизациями.ОрганизацияПолучатель В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И ПередачаТоваровМеждуОрганизациями.Дата >= &НачалоПериода
	|	И ПередачаТоваровМеждуОрганизациями.Дата <= &ОкончаниеПериода
	|	И ПередачаТоваровМеждуОрганизациями.Проведен
	|	И ПередачаТоваровМеждуОрганизациями.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровМеждуОрганизациями.Ссылка,
	|	ИСТИНА,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ИностранныеОрганизации.Организация ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ,
	|	ЕСТЬNULL(ИностранныеОрганизации.ЗарегистрированаВСтранеСЛьготнымНалогообложением, ЛОЖЬ),
	|	ПередачаТоваровМеждуОрганизациями.Ссылка
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями КАК ВозвратТоваровМеждуОрганизациями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И ВозвратТоваровМеждуОрганизациями.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ВозвратТоваровМеждуОрганизациями.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И ВозвратТоваровМеждуОрганизациями.Организация = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеОрганизации КАК ИностранныеОрганизации
	|		ПО ВозвратТоваровМеждуОрганизациями.Организация = ИностранныеОрганизации.Организация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями
	|		ПО ВозвратТоваровМеждуОрганизациями.ДокументПередачи = ПередачаТоваровМеждуОрганизациями.Ссылка
	|ГДЕ
	|	ВозвратТоваровМеждуОрганизациями.Дата >= &НачалоПериода
	|	И ВозвратТоваровМеждуОрганизациями.Проведен
	|	И ВозвратТоваровМеждуОрганизациями.Организация В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ НЕ ИностранныеОрганизации.Организация ЕСТЬ NULL )
	|	И ВозвратТоваровМеждуОрганизациями.ОрганизацияПолучатель В(&СтруктураОрганизации)
	|	И ПередачаТоваровМеждуОрганизациями.Дата >= &НачалоПериода
	|	И ПередачаТоваровМеждуОрганизациями.Дата <= &ОкончаниеПериода
	|	И ПередачаТоваровМеждуОрганизациями.Проведен
	|	И ПередачаТоваровМеждуОрганизациями.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияБезПереходаПраваСобственности)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументВозврата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыВозврата.Ссылка КАК Сделка,
	|	ВЫБОР
	|		КОГДА ДокументыКонтролируемыхСделок.ОрганизацияПринимаетВозврат
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход)
	|	КОНЕЦ КАК ТипКонтролируемойСделки,
	|	Аналитика.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ТоварыВозврата.Количество КАК Количество,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияПоКлассификатору,
	|	ТоварыВозврата.СтавкаНДС КАК СтавкаНДС,
	|	ТоварыВозврата.СуммаСНДС - ТоварыВозврата.СуммаНДС КАК СуммаБезНДС,
	|	ТоварыВозврата.СуммаНДС КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА ТоварыВозврата.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыМировойБиржевойТорговли.ПредметСделки ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ТоварМировойБиржевойТорговли,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ВозвратТоваров) КАК ХозяйственнаяОперация,
	|	ВЫБОР
	|		КОГДА ТоварыВозврата.ВидЗапасов.ТипЗапасов В (ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ПустаяСсылка), ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.Товар))
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключатьСоставСделок,
	|	ЕСТЬNULL(ТоварыВозврата.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) КАК СтранаПроисхождения,
	|	ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица,
	|	ДокументыКонтролируемыхСделок.ИностраннаяОрганизация,
	|	ДокументыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением,
	|	ТоварыВозврата.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДокументыКонтролируемыхСделок.ОрганизацияПринимаетВозврат,
	|	ДокументыКонтролируемыхСделок.РасчетныйДокумент КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ТоварыКонтролируемыхСделок
	|ИЗ
	|	Документ.ВозвратТоваровМеждуОрганизациями.ВидыЗапасов КАК ТоварыВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТоварыВозврата.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ПО ТоварыВозврата.Ссылка = ДокументыКонтролируемыхСделок.ДокументВозврата
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыМировойБиржевойТорговли КАК ТоварыМировойБиржевойТорговли
	|		ПО Аналитика.Номенклатура = ТоварыМировойБиржевойТорговли.ПредметСделки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ОрганизацияПринимаетВозврат
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.ОрганизацияПолучатель
	|	КОНЕЦ КАК Организация,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.ОрганизацияПринимаетВозврат
	|			ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.ОрганизацияПолучатель
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|	КОНЕЦ КАК Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ТоварыКонтролируемыхСделок.ПредметСделки,
	|	ТоварыКонтролируемыхСделок.ТипПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ПредметСделки.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ТоварыКонтролируемыхСделок.СтранаПроисхождения КАК СтранаПроисхожденияПредметаСделки,
	|	ТоварыКонтролируемыхСделок.ХозяйственнаяОперация,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Валюта КАК Валюта,
	|	ТоварыКонтролируемыхСделок.ЕдиницаИзмеренияПоКлассификатору КАК ЕдиницаИзмерения,
	|	ТоварыКонтролируемыхСделок.Количество,
	|	ТоварыКонтролируемыхСделок.СтавкаНДС,
	|	ТоварыКонтролируемыхСделок.СуммаБезНДС,
	|	ТоварыКонтролируемыхСделок.СуммаНДС,
	|	ТоварыКонтролируемыхСделок.ТипКонтролируемойСделки,
	|	ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли,
	|	ТоварыКонтролируемыхСделок.ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.ОрганизацияПринимаетВозврат
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.ОрганизацияПолучатель
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ТоварыКонтролируемыхСделок.ОрганизацияПринимаетВозврат
	|						ТОГДА ТоварыКонтролируемыхСделок.РасчетныйДокумент.ОрганизацияПолучатель
	|					ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Организация
	|				КОНЕЦ
	|		ИНАЧЕ ТоварыКонтролируемыхСделок.РасчетныйДокумент.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ТоварыКонтролируемыхСделок.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	-1 КАК МножительСуммовыхДанных,
	|	ТоварыКонтролируемыхСделок.Сделка КАК РегистраторРегистраСумм,
	|	ТоварыКонтролируемыхСделок.РасчетныйДокумент.Договор КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ТоварыКонтролируемыхСделок КАК ТоварыКонтролируемыхСделок
	|ГДЕ
	|	(ТоварыКонтролируемыхСделок.ТоварМировойБиржевойТорговли
	|				И ТоварыКонтролируемыхСделок.ИностраннаяОрганизация
	|			ИЛИ ТоварыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ТоварыКонтролируемыхСделок.ЗарегистрированаВСтранеСЛьготнымНалогообложением)
	|	И ТоварыКонтролируемыхСделок.ВключатьСоставСделок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТоварыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеСделокКредитовИДепозитов

Процедура ДобавитьСделкиНачисленияКредитовИДепозитов(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачисленияКредитовИДепозитов.Ссылка КАК РасчетныйДокумент
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.НачисленияКредитовИДепозитов КАК НачисленияКредитовИДепозитов
	|ГДЕ
	|	НачисленияКредитовИДепозитов.Организация В(&СтруктураОрганизации)
	|	И НачисленияКредитовИДепозитов.Дата >= &НачалоПериода
	|	И НачисленияКредитовИДепозитов.Дата <= &ОкончаниеПериода
	|	И НачисленияКредитовИДепозитов.Проведен = ИСТИНА
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачисленияКредитовИДепозитовНачисления.Ссылка КАК РасчетныйДокумент,
	|	НачисленияКредитовИДепозитовНачисления.Ссылка.Дата КАК Период,
	|	НачисленияКредитовИДепозитовНачисления.Ссылка.Организация,
	|	НачисленияКредитовИДепозитовНачисления.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	НачисленияКредитовИДепозитовНачисления.Ссылка.ХозяйственнаяОперация КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	НачисленияКредитовИДепозитовНачисления.Ссылка.ХозяйственнаяОперация КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПрочаяОперация) КАК ХозяйственнаяОперация,
	|	НачисленияКредитовИДепозитовНачисления.ВалютаВзаиморасчетов КАК Валюта,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмерения,
	|	1 КАК Количество,
	|	ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС) КАК СтавкаНДС,
	|	НачисленияКредитовИДепозитовНачисления.СуммаВзаиморасчетов КАК СуммаБезНДС,
	|	0 КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА НачисленияКредитовИДепозитовНачисления.Договор.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход)
	|	КОНЕЦ КАК ТипКонтролируемойСделки,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузоотправитель,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузополучатель,
	|	НачисленияКредитовИДепозитовНачисления.Ссылка КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	НачисленияКредитовИДепозитовНачисления.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	НачисленияКредитовИДепозитовНачисления.Договор КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.НачисленияКредитовИДепозитов.Начисления КАК НачисленияКредитовИДепозитовНачисления
	|		ПО ДокументыКонтролируемыхСделок.РасчетныйДокумент = НачисленияКредитовИДепозитовНачисления.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И НачисленияКредитовИДепозитовНачисления.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И НачисленияКредитовИДепозитовНачисления.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|			И НачисленияКредитовИДепозитовНачисления.Контрагент = ВзаимозависимыеЛицаПоПериодам.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО НачисленияКредитовИДепозитовНачисления.Контрагент = ИностранныеКонтрагенты.Контрагент
	|ГДЕ
	|	НачисленияКредитовИДепозитовНачисления.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеСделокЛизинга

Процедура ДобавитьСделкиПоступленияУслугПоЛизингу(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриобретениеУслугПоЛизингу.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ПриобретениеУслугПоЛизингу КАК ПриобретениеУслугПоЛизингу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ПриобретениеУслугПоЛизингу.Контрагент)
	|			И ПриобретениеУслугПоЛизингу.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ПриобретениеУслугПоЛизингу.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ПриобретениеУслугПоЛизингу.Контрагент)
	|ГДЕ
	|	ПриобретениеУслугПоЛизингу.Организация В(&СтруктураОрганизации)
	|	И ПриобретениеУслугПоЛизингу.Дата >= &НачалоПериода
	|	И ПриобретениеУслугПоЛизингу.Дата <= &ОкончаниеПериода
	|	И ПриобретениеУслугПоЛизингу.Проведен = ИСТИНА
	|	И ПриобретениеУслугПоЛизингу.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПриобретениеУслугПоЛизингуНачисления.Ссылка КАК РасчетныйДокумент,
	|	ПриобретениеУслугПоЛизингуНачисления.Ссылка.Дата КАК Период,
	|	ПриобретениеУслугПоЛизингуНачисления.Ссылка.Организация,
	|	ПриобретениеУслугПоЛизингуНачисления.Ссылка.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ПриобретениеУслугПоЛизингуНачисления.Содержание КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав) КАК ТипПредметаСделки,
	|	ПриобретениеУслугПоЛизингуНачисления.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	ПриобретениеУслугПоЛизингуНачисления.Ссылка.Валюта,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмерения,
	|	1 КАК Количество,
	|	ПриобретениеУслугПоЛизингуНачисления.СтавкаНДС,
	|	ПриобретениеУслугПоЛизингуНачисления.СуммаСНДС - ПриобретениеУслугПоЛизингуНачисления.СуммаНДС КАК СуммаБезНДС,
	|	ПриобретениеУслугПоЛизингуНачисления.СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ПриобретениеУслугПоЛизингуНачисления.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузоотправитель,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Грузополучатель,
	|	ПриобретениеУслугПоЛизингуНачисления.Ссылка.Договор КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	ПриобретениеУслугПоЛизингуНачисления.Ссылка КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	ПриобретениеУслугПоЛизингуНачисления.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеУслугПоЛизингу.Начисления КАК ПриобретениеУслугПоЛизингуНачисления
	|		ПО ДокументыКонтролируемыхСделок.РасчетныйДокумент = ПриобретениеУслугПоЛизингуНачисления.Ссылка
	|ГДЕ
	|	(ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеСделокВыкупаВозвратнойТары

Процедура ДобавитьСделкиВыкупаВозвратнойТарыКлиентом(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСКлиентами"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыкупВозвратнойТарыКлиентом.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ВыкупВозвратнойТарыКлиентом КАК ВыкупВозвратнойТарыКлиентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ВыкупВозвратнойТарыКлиентом.Контрагент)
	|			И ВыкупВозвратнойТарыКлиентом.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ВыкупВозвратнойТарыКлиентом.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ВыкупВозвратнойТарыКлиентом.Контрагент)
	|ГДЕ
	|	ВыкупВозвратнойТарыКлиентом.Организация В(&СтруктураОрганизации)
	|	И ВыкупВозвратнойТарыКлиентом.Дата >= &НачалоПериода
	|	И ВыкупВозвратнойТарыКлиентом.Дата <= &ОкончаниеПериода
	|	И ВыкупВозвратнойТарыКлиентом.Проведен = ИСТИНА
	|	И ВыкупВозвратнойТарыКлиентом.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА ВыкупВозвратнойТарыКлиентом.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВыкупВозвратнойТарыКлиентом.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратнаяТараДляВыкупа.Ссылка КАК РасчетныйДокумент,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Дата КАК Период,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Организация,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	Аналитика.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	Аналитика.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ЕСТЬNULL(ВозвратнаяТараДляВыкупа.НомерГТД.СтранаПроисхождения, ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)) КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхТоваров) КАК ХозяйственнаяОперация,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Валюта,
	|	Аналитика.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВозвратнаяТараДляВыкупа.Количество КАК Количество,
	|	ВозвратнаяТараДляВыкупа.СтавкаНДС,
	|	ВозвратнаяТараДляВыкупа.СуммаСНДС - ВозвратнаяТараДляВыкупа.СуммаНДС КАК СуммаБезНДС,
	|	ВозвратнаяТараДляВыкупа.СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ВозвратнаяТараДляВыкупа.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВЫБОР
	|		КОГДА ВозвратнаяТараДляВыкупа.Ссылка.Грузоотправитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВозвратнаяТараДляВыкупа.Ссылка.Организация
	|		ИНАЧЕ ВозвратнаяТараДляВыкупа.Ссылка.Грузоотправитель
	|	КОНЕЦ КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА ВозвратнаяТараДляВыкупа.Ссылка.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА ВозвратнаяТараДляВыкупа.Ссылка.Контрагент
	|		ИНАЧЕ ВозвратнаяТараДляВыкупа.Ссылка.Грузополучатель
	|	КОНЕЦ КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ВозвратнаяТараДляВыкупа.Ссылка.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ВозвратнаяТараДляВыкупа.Ссылка.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ВозвратнаяТараДляВыкупа.Ссылка КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	ВозвратнаяТараДляВыкупа.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыкупВозвратнойТарыКлиентом.ВидыЗапасов КАК ВозвратнаяТараДляВыкупа
	|		ПО ДокументыКонтролируемыхСделок.РасчетныйДокумент = ВозвратнаяТараДляВыкупа.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ВозвратнаяТараДляВыкупа.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|ГДЕ
	|	(ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

Процедура ДобавитьСделкиВыкупаВозвратнойТарыУПоставщика(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеСоглашений", ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСПоставщиками"));
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВыкупВозвратнойТарыУПоставщика.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ВыкупВозвратнойТарыУПоставщика КАК ВыкупВозвратнойТарыУПоставщика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ВыкупВозвратнойТарыУПоставщика.Контрагент)
	|			И ВыкупВозвратнойТарыУПоставщика.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ВыкупВозвратнойТарыУПоставщика.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ВыкупВозвратнойТарыУПоставщика.Контрагент)
	|ГДЕ
	|	ВыкупВозвратнойТарыУПоставщика.Организация В(&СтруктураОрганизации)
	|	И ВыкупВозвратнойТарыУПоставщика.Дата >= &НачалоПериода
	|	И ВыкупВозвратнойТарыУПоставщика.Дата <= &ОкончаниеПериода
	|	И ВыкупВозвратнойТарыУПоставщика.Проведен = ИСТИНА
	|	И ВыкупВозвратнойТарыУПоставщика.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА ВыкупВозвратнойТарыУПоставщика.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВыкупВозвратнойТарыУПоставщика.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВозвратнаяТараДляВыкупа.Ссылка КАК РасчетныйДокумент,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Дата КАК Период,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Организация,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ВозвратнаяТараДляВыкупа.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.Товар) КАК ТипПредметаСделки,
	|	ВозвратнаяТараДляВыкупа.Номенклатура.НаименованиеПолное КАК НаименованиеПредметаСделки,
	|	ВЫБОР
	|		КОГДА ВозвратнаяТараДляВыкупа.Ссылка.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицоНеРезидент)
	|			ТОГДА ЕСТЬNULL(ВозвратнаяТараДляВыкупа.Ссылка.Контрагент.СтранаРегистрации, ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка))
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|	КОНЕЦ КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПриобретениеТоваров) КАК ХозяйственнаяОперация,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Валюта,
	|	ВозвратнаяТараДляВыкупа.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВозвратнаяТараДляВыкупа.Количество КАК Количество,
	|	ВозвратнаяТараДляВыкупа.СтавкаНДС,
	|	ВозвратнаяТараДляВыкупа.СуммаСНДС - ВозвратнаяТараДляВыкупа.СуммаНДС КАК СуммаБезНДС,
	|	ВозвратнаяТараДляВыкупа.СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ВозвратнаяТараДляВыкупа.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Контрагент КАК Грузоотправитель,
	|	ВозвратнаяТараДляВыкупа.Ссылка.Организация КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ВозвратнаяТараДляВыкупа.Ссылка.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА &ИспользованиеСоглашений
	|			ТОГДА ВозвратнаяТараДляВыкупа.Ссылка.Соглашение
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Соглашение,
	|	ВозвратнаяТараДляВыкупа.Ссылка КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	ВозвратнаяТараДляВыкупа.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВыкупВозвратнойТарыУПоставщика.Товары КАК ВозвратнаяТараДляВыкупа
	|		ПО ДокументыКонтролируемыхСделок.РасчетныйДокумент = ВозвратнаяТараДляВыкупа.Ссылка
	|ГДЕ
	|	(ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

//++ НЕ УТКА

#Область ДобавлениеСделокСПереработчиком

Процедура ДобавитьСделкиОтчетаПереработчика(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетПереработчика.Ссылка КАК РасчетныйДокумент,
	|	ОтчетПереработчика.Дата КАК Период,
	|	ОтчетПереработчика.Организация КАК Организация,
	|	ОтчетПереработчика.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ОтчетПереработчика.Содержание КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ОтчетПереработчика.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.ПолучениеУслуг) КАК ХозяйственнаяОперация,
	|	ОтчетПереработчика.Валюта,
	|	&ЕдиницаИзмеренияШтука КАК ЕдиницаИзмерения,
	|	1 КАК Количество,
	|	ОтчетПереработчика.СтавкаНДС,
	|	ОтчетПереработчика.СуммаСНДС - ОтчетПереработчика.СуммаНДС КАК СуммаБезНДС,
	|	ОтчетПереработчика.СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ОсуществленРасход) КАК ТипКонтролируемойСделки,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ЛОЖЬ КАК ОперацияОблагаетсяЕНВД,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ОтчетПереработчика.Организация КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ОтчетПереработчика.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	ОтчетПереработчика.Ссылка КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	"""" КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	Документ.ОтчетПереработчика КАК ОтчетПереработчика
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетПереработчика.Контрагент)
	|			И ОтчетПереработчика.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетПереработчика.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетПереработчика.Контрагент)
	|ГДЕ
	|	ОтчетПереработчика.Организация В(&СтруктураОрганизации)
	|	И ОтчетПереработчика.Дата >= &НачалоПериода
	|	И ОтчетПереработчика.Дата <= &ОкончаниеПериода
	|	И ОтчетПереработчика.Проведен = ИСТИНА
	|	И ОтчетПереработчика.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА ОтчетПереработчика.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОтчетПереработчика.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПереработчиком)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#Область ДобавлениеСделокСДавальцем

Процедура ДобавитьСделкиОтчетаДавальцу(СтруктураПараметров, МенеджерВременныхТаблиц, ТаблицаСделок)
	
	Запрос = ПодготовитьЗапросКДокументамИсточникам(СтруктураПараметров);
	Запрос.УстановитьПараметр("ИспользованиеДоговоров", ПолучитьФункциональнуюОпцию("ИспользоватьДоговорыСПоставщиками"));
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетДавальцу.Ссылка КАК РасчетныйДокумент,
	|	ВЫБОР
	|		КОГДА ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВзаимозависимыеЛица,
	|	ВЫБОР
	|		КОГДА ИностранныеКонтрагенты.Контрагент ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ИностранныйКонтрагент,
	|	ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ) КАК ЗарегистрированВСтранеСЛьготнымНалогообложением
	|ПОМЕСТИТЬ ДокументыКонтролируемыхСделок
	|ИЗ
	|	Документ.ОтчетДавальцу КАК ОтчетДавальцу
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВзаимозависимыеЛицаПоПериодам КАК ВзаимозависимыеЛицаПоПериодам
	|		ПО (ВзаимозависимыеЛицаПоПериодам.Организация = &Организация)
	|			И (ВзаимозависимыеЛицаПоПериодам.Контрагент = ОтчетДавальцу.Контрагент)
	|			И ОтчетДавальцу.Дата >= ВзаимозависимыеЛицаПоПериодам.НачалоПериода
	|			И ОтчетДавальцу.Дата <= ВзаимозависимыеЛицаПоПериодам.ОкончаниеПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИностранныеКонтрагенты КАК ИностранныеКонтрагенты
	|		ПО (ИностранныеКонтрагенты.Контрагент = ОтчетДавальцу.Контрагент)
	|ГДЕ
	|	ОтчетДавальцу.Организация В(&СтруктураОрганизации)
	|	И ОтчетДавальцу.Дата >= &НачалоПериода
	|	И ОтчетДавальцу.Дата <= &ОкончаниеПериода
	|	И ОтчетДавальцу.Проведен = ИСТИНА
	|	И ОтчетДавальцу.Контрагент В
	|			(ВЫБРАТЬ
	|				КонтролируемыеКонтрагенты.Контрагент
	|			ИЗ
	|				КонтролируемыеКонтрагенты КАК КонтролируемыеКонтрагенты)
	|	И (НЕ ВзаимозависимыеЛицаПоПериодам.Контрагент ЕСТЬ NULL 
	|			ИЛИ ЕСТЬNULL(ИностранныеКонтрагенты.ЗарегистрированВСтранеСЛьготнымНалогообложением, ЛОЖЬ))
	|	И ВЫБОР
	|			КОГДА ОтчетДавальцу.Договор = ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ОтчетДавальцу.Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СДавальцем)
	|		КОНЕЦ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РасчетныйДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтчетДавальцуПродукция.Ссылка КАК РасчетныйДокумент,
	|	ОтчетДавальцуПродукция.Ссылка.Дата КАК Период,
	|	ОтчетДавальцуПродукция.Ссылка.Организация,
	|	ОтчетДавальцуПродукция.Ссылка.Контрагент,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК Комиссионер,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура КАК ПредметСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыПредметовКонтролируемыхСделок.РаботаУслуга) КАК ТипПредметаСделки,
	|	ОтчетДавальцуПродукция.Ссылка.Содержание КАК НаименованиеПредметаСделки,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаПроисхожденияПредметаСделки,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперацииКонтролируемыхСделок.РеализацияСобственныхУслуг) КАК ХозяйственнаяОперация,
	|	ОтчетДавальцуПродукция.Ссылка.Валюта,
	|	ОтчетДавальцуПродукция.Ссылка.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	1 КАК Количество,
	|	ОтчетДавальцуПродукция.СтавкаНДС,
	|	ОтчетДавальцуПродукция.СуммаСНДС - ОтчетДавальцуПродукция.СуммаНДС КАК СуммаБезНДС,
	|	ОтчетДавальцуПродукция.СуммаНДС,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыКонтролируемыхСделок.ПолученДоход) КАК ТипКонтролируемойСделки,
	|	ЛОЖЬ КАК ТоварМировойБиржевойТорговли,
	|	ВЫБОР
	|		КОГДА ОтчетДавальцуПродукция.Ссылка.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОперацияОблагаетсяЕНВД,
	|	НЕОПРЕДЕЛЕНО КАК Грузоотправитель,
	|	ОтчетДавальцуПродукция.Ссылка.Контрагент КАК Грузополучатель,
	|	ВЫБОР
	|		КОГДА &ИспользованиеДоговоров
	|			ТОГДА ОтчетДавальцуПродукция.Ссылка.Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	НЕОПРЕДЕЛЕНО КАК Соглашение,
	|	ОтчетДавальцуПродукция.Ссылка КАК РегистраторРегистраСумм,
	|	1 КАК МножительСуммовыхДанных,
	|	ОтчетДавальцуПродукция.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ТаблицаСделок
	|ИЗ
	|	ДокументыКонтролируемыхСделок КАК ДокументыКонтролируемыхСделок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОтчетДавальцу.Продукция КАК ОтчетДавальцуПродукция
	|		ПО ДокументыКонтролируемыхСделок.РасчетныйДокумент = ОтчетДавальцуПродукция.Ссылка
	|ГДЕ
	|	(ДокументыКонтролируемыхСделок.ВзаимозависимыеЛица
	|			ИЛИ ДокументыКонтролируемыхСделок.ЗарегистрированВСтранеСЛьготнымНалогообложением)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистраторРегистраСумм,
	|	ИдентификаторСтроки";
	
	
	Запрос.Выполнить();
	
	ВыборкаСделокРеализации = ПолучитьВыборкуТаблицыСделокСПреобразованиемСуммКРублевым(Запрос.МенеджерВременныхТаблиц);
	
	Пока ВыборкаСделокРеализации.Следующий() Цикл
		СтрокаСделки = ТаблицаСделок.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСделки, ВыборкаСделокРеализации);
	КонецЦикла;
	
	ЗапросУдаленияВременныхТаблиц = Новый Запрос();
	ЗапросУдаленияВременныхТаблиц.МенеджерВременныхТаблиц = Запрос.МенеджерВременныхТаблиц;
	ЗапросУдаленияВременныхТаблиц.Текст = 
	"УНИЧТОЖИТЬ ДокументыКонтролируемыхСделок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаСделок";
	
	ЗапросУдаленияВременныхТаблиц.Выполнить();
	
КонецПроцедуры

#КонецОбласти

//-- НЕ УТКА

#КонецОбласти

#Область ПараметрыДляРегламентированнойОтчетности

Функция ПолучитьСведенияОбУведомлении(Уведомление) Экспорт
	
	Реквизиты = Новый Структура();
	Реквизиты.Вставить("Уведомление", "Ссылка");
	Реквизиты.Вставить("Организация", "Организация");
	Реквизиты.Вставить("НаименованиеОрганизации", "Организация.НаименованиеПолное");
	Реквизиты.Вставить("ИНН", "Организация.ИНН");
	Реквизиты.Вставить("КПП", "Организация.КПП");
	Реквизиты.Вставить("ОтчетныйГод", "ОтчетныйГод");
	Реквизиты.Вставить("ВерсияУведомления", "ВерсияУведомления");
	Реквизиты.Вставить("ЮридическоеФизическоеЛицо", "Организация.ЮридическоеФизическоеЛицо");
	Реквизиты.Вставить("НомерКорректировки", "НомерКорректировки");
	Реквизиты.Вставить("ИндивидуальныйПредприниматель", "Организация.ИндивидуальныйПредприниматель");
	
	Сведения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, Реквизиты);
	
	Если Сведения.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо
		И ЗначениеЗаполнено(Сведения.ИндивидуальныйПредприниматель) Тогда
		
		ДатаСведений = ТекущаяДатаСеанса();
		
		Сведения.Вставить("ИндивидуальныйПредпринимательФИО", ПолучитьФИОФизлица(Сведения.ИндивидуальныйПредприниматель, ДатаСведений));
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Сведения.ВерсияУведомления) Тогда
		Сведения.ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012();
	КонецЕсли;
	
	Сведения.Вставить("ПараметрыВерсии", ПараметрыВерсииУведомления(Сведения.ВерсияУведомления));
	
	Возврат Сведения;
	
КонецФункции

Функция ПараметрыВерсииУведомления(Версия)
	
	ПараметрыПечати = Новый Структура();
	
	Если Версия < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		
		ПараметрыПечати.Вставить("ДлинаНомераСтраница", 5);
		
		Макеты = Новый Структура;
		Макеты.Вставить("ТитульныйЛист", "Лист1");
		Макеты.Вставить("ТитульныйЛистФизическоеЛицо", "Лист2");
		Макеты.Вставить("Лист1А", "Страница1А");
		Макеты.Вставить("Лист1Б", "Страница1Б");
		Макеты.Вставить("Раздел2", "Раздел2");
		Макеты.Вставить("Раздел3", "Раздел3");
		
		ПараметрыПечати.Вставить("Макеты", Макеты);
		
	Иначе
		
		ПараметрыПечати.Вставить("ДлинаНомераСтраница", 3);
		
		Макеты = Новый Структура;
		Макеты.Вставить("ТитульныйЛист", "Лист1_2018");
		Макеты.Вставить("ТитульныйЛистФизическоеЛицо", "Лист2_2018");
		Макеты.Вставить("Лист1А", "Страница1А_2018");
		Макеты.Вставить("Лист1Б", "Страница1Б_2018");
		Макеты.Вставить("Раздел2", "Раздел2_2018");
		Макеты.Вставить("Раздел3", "Раздел3_2018");
		
		ПараметрыПечати.Вставить("Макеты", Макеты);
		
	КонецЕсли;
	
	Возврат ПараметрыПечати;
	
КонецФункции

Функция ПолучитьОсновныеСведенияУведомленияДляВыгрузки(Уведомление) Экспорт
	
	ОсновныеСведения = Новый Структура;
	
	РеквизитыУведомления = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление,
		"Организация, НомерКорректировки, ВерсияУведомления, КодМестаПредставления,
		|ОтчетныйГод, КодФормыРеорганизации, ИННРеорганизованнойОрганизации, КППРеорганизованнойОрганизации");
	
	ВерсияУведомления = РеквизитыУведомления.ВерсияУведомления;
	Организация  = РеквизитыУведомления.Организация;
	ДатаСведений = ТекущаяДатаСеанса();
	
	ОсновныеСведения.Вставить("ВерсияУведомления", ВерсияУведомления);
	ОсновныеСведения.Вставить("Организация", Организация);
	ОсновныеСведения.Вставить("ДатаДок", ДатаСведений);
	ОсновныеСведения.Вставить("НомКорр", Формат(РеквизитыУведомления.НомерКорректировки, "ЧН=; ЧГ=0"));
	ОсновныеСведения.Вставить("ПоМесту", РеквизитыУведомления.КодМестаПредставления);
	ОсновныеСведения.Вставить("ВерсПрог", РегламентированнаяОтчетность.НазваниеИВерсияПрограммы());
	
	Если РеквизитыУведомления.КодФормыРеорганизации <> "" Тогда
		ОсновныеСведения.Вставить("ФормРеорг",  РеквизитыУведомления.КодФормыРеорганизации);
		ОсновныеСведения.Вставить("ИННЮЛРеорг", РеквизитыУведомления.ИННРеорганизованнойОрганизации);
		ОсновныеСведения.Вставить("КППЮЛРеорг", РеквизитыУведомления.КППРеорганизованнойОрганизации);
	КонецЕсли;
	
	ОтчетГод = Формат(РеквизитыУведомления.ОтчетныйГод, "ДФ=yyyy");
	ОсновныеСведения.Вставить("ОтчетГод", ОтчетГод);
	ОсновныеСведения.Вставить("ОтчетныйГод", РеквизитыУведомления.ОтчетныйГод);
	
	ПараметрыОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация,
		"ИНН, КПП, НаименованиеПолное, КодНалоговогоОргана, ЮридическоеФизическоеЛицо, ИндивидуальныйПредприниматель, КодОКВЭД, КодОКВЭД2, РегистрацияВНалоговомОргане");
	
	ОрганизацияФизЛицо = ПараметрыОрганизации.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
	
	ТелефонОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
				Организация, ?(ОрганизацияФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации), ДатаСведений);
	ЭлектроннаяПочтаОрганизации = ?(ОрганизацияФизЛицо, "", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Организация, Справочники.ВидыКонтактнойИнформации.EmailОрганизации, ДатаСведений));
	
	ТелефонОрганизации = СтрЗаменить(ТелефонОрганизации, " ", "");
	
	ОКАТО = "";
	ОКТМО = "";
	
	Если ЗначениеЗаполнено(ПараметрыОрганизации.РегистрацияВНалоговомОргане) Тогда
		ОКАТО = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОрганизации.РегистрацияВНалоговомОргане, "КодПоОКАТО"));
		ОКТМО = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыОрганизации.РегистрацияВНалоговомОргане, "КодПоОКТМО"));
	КонецЕсли;
	
	Если ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		Если СтрДлина(ОКТМО) > 0 Тогда
			Пока СтрДлина(ОКТМО)< 11 Цикл
				ОКТМО = ОКТМО + "0";
			КонецЦикла;
		КонецЕсли;
		Если РеквизитыУведомления.ОтчетныйГод < Дата(2012,12,31) Тогда
			ОсновныеСведения.Вставить("ОКАТО", ОКАТО);
		Иначе
			ОсновныеСведения.Вставить("ОКТМО", ОКТМО);
		КонецЕсли;
		ОсновныеСведения.Вставить("ОКВЭД", ПараметрыОрганизации.КодОКВЭД);
	Иначе
		ОсновныеСведения.Вставить("ОКТМО", ОКТМО);
	КонецЕсли;
	
	Если ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012() Тогда
		ОсновныеСведения.Вставить("ОКВЭД", ПараметрыОрганизации.КодОКВЭД);
	Иначе
		ОсновныеСведения.Вставить("ОКВЭД", ПараметрыОрганизации.КодОКВЭД2);
	КонецЕсли;
	
	ОсновныеСведения.Вставить("Тлф",   ТелефонОрганизации);
	ОсновныеСведения.Вставить("ЭлПочта", ЭлектроннаяПочтаОрганизации);
	
	ОсновныеСведения.Вставить("НаименованиеОрганизации", ПараметрыОрганизации.НаименованиеПолное);
	ОсновныеСведения.Вставить("РегистрацияВНалоговомОргане", ПараметрыОрганизации.РегистрацияВНалоговомОргане);
	
	Если ОрганизацияФизЛицо Тогда
		ИНН = ПараметрыОрганизации.ИНН;
		ЕстьИНН = ЗначениеЗаполнено(ИНН);
		
		ОсновныеСведения.Вставить("ЭтоПБОЮЛ", Истина);
		ОсновныеСведения.Вставить("ИндивидуальныйПредприниматель", ПараметрыОрганизации.ИндивидуальныйПредприниматель);
		ОсновныеСведения.Вставить("ЕстьИННФЛ", ЕстьИНН);
		ОсновныеСведения.Вставить("ИННФЛ", ИНН);
		
		СписокКадровыхДанных = "Фамилия, Имя, Отчество, ФамилияИО, ФИОПолные, ДокументВид, ДокументСерия, ДокументНомер, ДокументДатаВыдачи, ДокументКемВыдан, ДокументКодПодразделения, ДокументПредставление, Страна, СтатусНалогоплательщика, ДатаРождения, МестоРождения, АдресПоПрописке, АдресЗаПределамиРФ";
		
		КадровыеДанныеФизЛиц = КадровыйУчет.КадровыеДанныеФизическихЛиц(Истина, ПараметрыОрганизации.ИндивидуальныйПредприниматель, СписокКадровыхДанных, ДатаСведений);
		Если КадровыеДанныеФизЛиц.Количество()>0 Тогда
			ДанныеФизЛица = КадровыеДанныеФизЛиц[0];
			
			ОсновныеСведения.Вставить("НПФЛФамилия",  ДанныеФизЛица.Фамилия);
			ОсновныеСведения.Вставить("НПФЛИмя",      ДанныеФизЛица.Имя);
			ОсновныеСведения.Вставить("НПФЛОтчество", ДанныеФизЛица.Отчество);
			ОсновныеСведения.Вставить("НаименованиеДляЛиста1", ДанныеФизЛица.ФИОПолные);
			
			ОсновныеСведения.Вставить("НПФЛДатаРожд",  ДанныеФизЛица.ДатаРождения);
			ОсновныеСведения.Вставить("НПФЛМестоРожд", ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(ДанныеФизЛица.МестоРождения));
			
			Если ДанныеФизЛица.Страна = Справочники.СтраныМира.Россия Тогда
				ОсновныеСведения.Вставить("НПФЛНалГражд", "1");
				ОсновныеСведения.Вставить("НПФЛОКСМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФизЛица.Страна, "Код"));
			ИначеЕсли ЗначениеЗаполнено(ДанныеФизЛица.Страна) Тогда
				ОсновныеСведения.Вставить("НПФЛНалГражд", "2");
				ОсновныеСведения.Вставить("НПФЛОКСМ", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФизЛица.Страна, "Код"));
			Иначе
				ОсновныеСведения.Вставить("НПФЛНалГражд", "3");
				ОсновныеСведения.Вставить("НПФЛОКСМ", "");
			КонецЕсли;
			
			Если ДанныеФизЛица.СтатусНалогоплательщика = Справочники.СтатусыНалогоплательщиковПоНДФЛ.Резидент Тогда
				ОсновныеСведения.Вставить("НПФЛСтатусНП", "1");
			Иначе
				ОсновныеСведения.Вставить("НПФЛСтатусНП", "2");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеФизЛица.ДокументВид) Тогда
				ОсновныеСведения.Вставить("НПФЛКодВидДок", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеФизЛица.ДокументВид, "КодМВД"));
				ОсновныеСведения.Вставить("НПФЛСерНомДок", Строка(ДанныеФизЛица.ДокументСерия)+" "+Строка(ДанныеФизЛица.ДокументНомер));
				ОсновныеСведения.Вставить("НПФЛДатаДок",   ДанныеФизЛица.ДокументДатаВыдачи);
				ОсновныеСведения.Вставить("НПФЛВыдДок",    ДанныеФизЛица.ДокументКемВыдан);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеФизЛица.АдресПоПрописке) Тогда
				
				Если ДанныеФизЛица.Страна = Справочники.СтраныМира.Россия Тогда
					ОсновныеСведения.Вставить("НПФЛПрАдр", "1");
				Иначе
					ОсновныеСведения.Вставить("НПФЛПрАдр", "2");
				КонецЕсли;
				
				АдресСтруктурой = РаботаСАдресами.СведенияОбАдресе(ДанныеФизЛица.АдресПоПрописке);
				
				Если АдресСтруктурой.Свойство("Регион") Тогда
					ОсновныеСведения.Вставить("НПФЛКодРегион", РегламентированнаяОтчетностьВызовСервера.КодРегионаПоНазванию(АдресСтруктурой.Регион));
				Иначе
					ОсновныеСведения.Вставить("НПФЛКодРегион", "");
				КонецЕсли;
				
				ОсновныеСведения.Вставить("НПФЛИндекс", АдресСтруктурой.Индекс);
				ОсновныеСведения.Вставить("НПФЛРайон",  АдресСтруктурой.Район);
				ОсновныеСведения.Вставить("НПФЛГород",  АдресСтруктурой.Город);
				ОсновныеСведения.Вставить("НПФЛНаселПункт", АдресСтруктурой.НаселенныйПункт);
				ОсновныеСведения.Вставить("НПФЛУлица",   АдресСтруктурой.Улица);
				ОсновныеСведения.Вставить("НПФЛДом",     АдресСтруктурой.Дом);
				ОсновныеСведения.Вставить("НПФЛКорпус",  АдресСтруктурой.Корпус);
				ОсновныеСведения.Вставить("НПФЛКварт",   АдресСтруктурой.Квартира);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДанныеФизЛица.АдресЗаПределамиРФ) Тогда
				АдресСтруктурой = РаботаСАдресами.СведенияОбАдресе(ДанныеФизЛица.АдресЗаПределамиРФ);
				ОсновныеСведения.Вставить("АдрИнКодСтраны", АдресСтруктурой.КодСтраны);
				Если СтрНайти(АдресСтруктурой.Представление, АдресСтруктурой.Страна+", ") = 1 Тогда
					ОсновныеСведения.Вставить("АдрИнТекст", Сред(АдресСтруктурой.Представление, СтрДлина(АдресСтруктурой.Страна+", ") + 1));
				Иначе
					ОсновныеСведения.Вставить("АдрИнТекст", АдресСтруктурой.Представление);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			
			// Заполним пустыми данными.
			ОсновныеСведения.Вставить("НПФЛФамилия");
			ОсновныеСведения.Вставить("НПФЛИмя");
			ОсновныеСведения.Вставить("НПФЛОтчество");
			ОсновныеСведения.Вставить("НПФЛДатаРожд");
			ОсновныеСведения.Вставить("НПФЛМестоРожд");
			ОсновныеСведения.Вставить("НПФЛНалГражд");
			ОсновныеСведения.Вставить("НПФЛСтатусНП");
			
		КонецЕсли;
		
	Иначе
		ОсновныеСведения.Вставить("ЭтоПБОЮЛ", Ложь);
		ОсновныеСведения.Вставить("НаимОрг", ПараметрыОрганизации.НаименованиеПолное);
		ОсновныеСведения.Вставить("НаименованиеДляЛиста1", ПараметрыОрганизации.НаименованиеПолное);
		ОсновныеСведения.Вставить("ИННЮЛ",   ПараметрыОрганизации.ИНН);
		ОсновныеСведения.Вставить("КППЮЛ",   ПараметрыОрганизации.КПП);
	КонецЕсли;
	
	ОсновныеСведения.Вставить("КодНО", ПараметрыОрганизации.КодНалоговогоОргана);
	
	КПП = ?(ОсновныеСведения.Свойство("КППЮЛ"), ОсновныеСведения.КППЮЛ, "");
	
	ДобавитьСведенияОПодписанте(ОсновныеСведения, ДатаСведений);
	
	ИдентификаторФайла = ИдентификаторФайлаЭлектронногоПредставления(ОсновныеСведения);
	ОсновныеСведения.Вставить("ИдФайл", ИдентификаторФайла);
	
	Возврат ОсновныеСведения;
	
КонецФункции

Процедура ДобавитьСведенияОПодписанте(ОсновныеСведения, ДатаСведений)
	
	ТипПодписанта = "1";
	Подписант = "";
	НаименованиеОрганизацииПредставителя = "";
	ДокументПредставителя = "";
	
	Организация = ОсновныеСведения.Организация;
	КодНО = ОсновныеСведения.КодНО;
	КПП   = ?(ОсновныеСведения.Свойство("КППЮЛ"), ОсновныеСведения.КППЮЛ, "");
	
	СведенияОПредставителе = РегламентированнаяОтчетностьВызовСервера.ПолучитьПоКодамСведенияОПредставителе(Организация, КодНО, КПП);
	
	ТипПодписанта = СведенияОПредставителе.ТипПодписанта;
	ОсновныеСведения.Вставить("ПрПодп", ТипПодписанта);
	
	Если ТипПодписанта = "1" Тогда
		// Представителя нет.
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо")
				= Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
			// ФИО подписанта не заполняется.
		Иначе
			РеквизитыОтветственныхЛиц = ОтветственныеЛицаБП.ОтветственныеЛица(Организация, ДатаСведений);
			
			ОсновныеСведения.Вставить("ПодпФамилия",  РеквизитыОтветственныхЛиц.РуководительФИО.Фамилия);
			ОсновныеСведения.Вставить("ПодпИмя",      РеквизитыОтветственныхЛиц.РуководительФИО.Имя);
			ОсновныеСведения.Вставить("ПодпОтчество", РеквизитыОтветственныхЛиц.РуководительФИО.Отчество);
		КонецЕсли;
	Иначе
		// Есть представитель.
		Если ТипЗнч(СведенияОПредставителе.ПредставительСсылка) = Тип("СправочникСсылка.Контрагенты") Тогда
			ФИОПодписанта = ФизическиеЛицаКлиентСервер.ЧастиИмени(СведенияОПредставителе.ФИОПредставителя);
			ОсновныеСведения.Вставить("НаимОргПодп", СведенияОПредставителе.НаименованиеОрганизацииПредставителя);
		Иначе
			ФИОПодписанта = ПолучитьФИОФизлица(СведенияОПредставителе.ПредставительСсылка, ДатаСведений);
		КонецЕсли;
		
		ОсновныеСведения.Вставить("ПодпФамилия",  ФИОПодписанта.Фамилия);
		ОсновныеСведения.Вставить("ПодпИмя",      ФИОПодписанта.Имя);
		ОсновныеСведения.Вставить("ПодпОтчество", ФИОПодписанта.Отчество);
		
		ОсновныеСведения.Вставить("НаимДокПодп", СведенияОПредставителе.ДокументПредставителя);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИдентификаторФайлаЭлектронногоПредставления(СведенияОтправки) Экспорт
	
	Префикс = "UT_UVKNRSD";
	Если СведенияОтправки.ЭтоПБОЮЛ Тогда
		ИдентификаторОтправителя = СокрЛП(СведенияОтправки.ИННФЛ);
	Иначе
		ИдентификаторОтправителя = СокрЛП(СведенияОтправки.ИННЮЛ) + СокрЛП(СведенияОтправки.КППЮЛ);
	КонецЕсли;
	ИдентификаторПолучателя = СокрЛП(СведенияОтправки.КодНО) + "_" + СокрЛП(СведенияОтправки.КодНО);
	ДатаФормированияФайла = Формат(СведенияОтправки.ДатаДок, "ДФ=yyyyMMdd");
	ИдентификационныйНомер = Строка(Новый УникальныйИдентификатор);
	
	ИдентификаторФайла = Префикс
	                   + "_" + ИдентификаторПолучателя
	                   + "_" + ИдентификаторОтправителя
	                   + "_" + ДатаФормированияФайла
	                   + "_" + ИдентификационныйНомер;
	
	Возврат ИдентификаторФайла;
	
КонецФункции

Функция ПолучитьФИОФизлица(ФизЛицо, ДатаСведений)
	
	ФИО = Новый Структура("Фамилия, Имя, Отчество", "", "", "");
	ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаСведений, Новый Структура("ФизическоеЛицо", ФизЛицо));
	Если ДанныеФЛ.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(ФИО, ДанныеФЛ[0]);
	КонецЕсли;
	
	Возврат ФИО;
	
КонецФункции

#КонецОбласти

#Область ПроверкаЗаполненияДанныхУведомления

Функция ПроверитьЗаполнениеУведомления(Уведомление, УникальныйИдентификатор = Неопределено) Экспорт
	
	ОсновныеСведения = ПолучитьОсновныеСведенияУведомленияДляВыгрузки(Уведомление);
	ОсновныеСведения.Вставить("УведомлениеОКонтролируемыхСделках", Уведомление);
	
	ЛистыУведомления = КонтролируемыеСделки.ПолучитьЛистыУведомления(Уведомление);
	
	ИнформацияОбОшибках = ВыводСообщенийОбОшибках.НовыйДетальнаяИнформацияОбОшибках();
	
	Ошибки = Новый СписокЗначений;
	
	ПроверитьТитульныйЛист(ОсновныеСведения, Ошибки);
	ПроверитьТитульныйЛистФизЛицо(ОсновныеСведения, Ошибки);
	ПроверитьЛисты1А(ОсновныеСведения, ЛистыУведомления, Ошибки);
	ПроверитьЛисты1Б(ОсновныеСведения, ЛистыУведомления, Ошибки);
	ПроверитьЛистыРаздела2(ЛистыУведомления, Ошибки);
	ПроверитьЛистыРаздела3(ЛистыУведомления, Ошибки);
	
	СформироватьИнформациюОбОшибках(ИнформацияОбОшибках, Ошибки);
	
	ДанныеДляВывода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Уведомление, "Организация");
	ХранилищеЗначения = ВыводСообщенийОбОшибках.ОписаниеОшибок(ИнформацияОбОшибках, ПолучитьМакет("МакетВыводаОшибок"), ДанныеДляВывода);
	
	Если УникальныйИдентификатор = Неопределено Тогда
		АдресХранилища = ПоместитьВоВременноеХранилище(ХранилищеЗначения, Новый УникальныйИдентификатор);
	Иначе
		АдресХранилища = ПоместитьВоВременноеХранилище(ХранилищеЗначения, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Новый Структура("АдресХранилища", АдресХранилища);
	
КонецФункции

Процедура ПроверитьТитульныйЛист(ОсновныеСведения, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	// Код налогового органа
	Если Не ЗначениеЗаполнено(ОсновныеСведения.КодНО) Или СтрДлина(ОсновныеСведения.КодНО) <> 4 Тогда
		ДобавитьОшибку("1010", ОсновныеСведения.Организация, ТекущиеОшибки);		
	КонецЕсли;
	
	// Код по месту учета
	Если Не ЗначениеЗаполнено(ОсновныеСведения.ПоМесту) Тогда
		ДобавитьОшибку("1020", ОсновныеСведения.УведомлениеОКонтролируемыхСделках, ТекущиеОшибки);
	КонецЕсли;
	
	Если ОсновныеСведения.ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		Если ОсновныеСведения.ОтчетныйГод < Дата(2012,12,31) Тогда
			// Код ОКАТО
			Если Не ЗначениеЗаполнено(ОсновныеСведения.ОКАТО) Или СтрДлина(ОсновныеСведения.ОКАТО) <> 11 Тогда
				ДобавитьОшибку("1030", ОсновныеСведения.Организация, ТекущиеОшибки);
			КонецЕсли;
		Иначе
			// Код ОКТМО
			Если Не ЗначениеЗаполнено(ОсновныеСведения.ОКТМО) Тогда
				ДобавитьОшибку("1031", ОсновныеСведения.Организация, ТекущиеОшибки);
			КонецЕсли;
		КонецЕсли;
	Иначе
		// Код ОКТМО
		Если Не ЗначениеЗаполнено(ОсновныеСведения.ОКТМО) Тогда
			ДобавитьОшибку("1031", ОсновныеСведения.Организация, ТекущиеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	// Наименование организации
	Если Не ЗначениеЗаполнено(ОсновныеСведения.НаименованиеОрганизации) Тогда
		ДобавитьОшибку("1050", ОсновныеСведения.Организация, ТекущиеОшибки);
	КонецЕсли;
	
	Если Не ОсновныеСведения.ЭтоПБОЮЛ Тогда
		
		// ИНН, КПП юр. лица
		Если Не ЗначениеЗаполнено(ОсновныеСведения.ИННЮЛ) Или СтрДлина(ОсновныеСведения.ИННЮЛ) <> 10
			Или Не ЗначениеЗаполнено(ОсновныеСведения.КППЮЛ) Или СтрДлина(ОсновныеСведения.КППЮЛ) <> 9 Тогда
			ДобавитьОшибку("1040", ОсновныеСведения.Организация, ТекущиеОшибки);
		КонецЕсли;
		
		// ИНН/КПП реорганизованной организации
		Если ОсновныеСведения.Свойство("ФормРеорг") И ЗначениеЗаполнено(ОсновныеСведения.ФормРеорг) Тогда 
			Если Не ЗначениеЗаполнено(ОсновныеСведения.ИННЮЛРеорг) Или Не ЗначениеЗаполнено(ОсновныеСведения.КППЮЛРеорг) Тогда
				ДобавитьОшибку("1060", ОсновныеСведения.УведомлениеОКонтролируемыхСделках, ТекущиеОшибки);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
	Если ОсновныеСведения.ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
		// Код ОКВЭД
		СтрокаПоиска = "/" + ОсновныеСведения.ПоМесту + "/";
		Если СтрНайти("/120/213/214/215/", СтрокаПоиска) > 0 Тогда
			Если Не ЗначениеЗаполнено(ОсновныеСведения.ОКВЭД) Тогда
				ДобавитьОшибку("1070", ОсновныеСведения.Организация, ТекущиеОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Титульный лист ФИО подписанта
	ФамилияПодписанта = Неопределено; ИмяПодписанта = Неопределено;
	
	ОсновныеСведения.Свойство("ПодпФамилия", ФамилияПодписанта);
	ОсновныеСведения.Свойство("ПодпИмя", ИмяПодписанта); 
	
	ФИОПодписантаЗаполнено = ЗначениеЗаполнено(ФамилияПодписанта) И ЗначениеЗаполнено(ИмяПодписанта);
	
	Если Не ФИОПодписантаЗаполнено Тогда
		Если ОсновныеСведения.ПрПодп = "1" Тогда // Если представителя нет
			Если Не ОсновныеСведения.ЭтоПБОЮЛ  Тогда
				ДобавитьОшибку("1080", ОсновныеСведения.Организация, ТекущиеОшибки);
			КонецЕсли;
		Иначе // есть представитель
			ДобавитьОшибку("1090", ОсновныеСведения.РегистрацияВНалоговомОргане, ТекущиеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	// Наименование документа представителя
	Если ОсновныеСведения.ПрПодп <> "1" И Не ЗначениеЗаполнено(ОсновныеСведения.НаимДокПодп) Тогда
		ДобавитьОшибку("1100", ОсновныеСведения.РегистрацияВНалоговомОргане, ТекущиеОшибки);
	КонецЕсли;
	
	Ошибки.Добавить(ТекущиеОшибки, НСтр("ru = 'Титульный лист';
										|en = 'Cover page'"));
		
КонецПроцедуры

Процедура ПроверитьТитульныйЛистФизЛицо(ОсновныеСведения, Ошибки)
	
	Если Не ОсновныеСведения.ЭтоПБОЮЛ Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	// Фамилия, Имя
	Если Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛФамилия) Или Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛИмя) Тогда
		ДобавитьОшибку("2010", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
	КонецЕсли;
	
	// ИНН физ. лица
	СтрокаПоиска = "/" + ОсновныеСведения.ПоМесту + "/";
	Если СтрНайти("/120/125/126/", СтрокаПоиска) > 0 Тогда
		Если Не ЗначениеЗаполнено(ОсновныеСведения.ИННФЛ) Или СтрДлина(ОсновныеСведения.ИННФЛ) <> 12 Тогда
			ДобавитьОшибку("2020", ОсновныеСведения.Организация, ТекущиеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОсновныеСведения.ИННФЛ) Тогда
		
		// Дата рождения
		Если Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛДатаРожд) Тогда
			ДобавитьОшибку("2030", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
		
		// Место рождения
		Если Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛМестоРожд) Тогда
			ДобавитьОшибку("2040", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
		
		// Сведения о гражданстве
		ОшибкаЗаполнения = Не (ОсновныеСведения.НПФЛНалГражд = "1" Или (ОсновныеСведения.НПФЛНалГражд = "2" И ЗначениеЗаполнено(ОсновныеСведения.НПФЛОКСМ)));
		Если ОшибкаЗаполнения Тогда
			ДобавитьОшибку("2050", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
		
		Если ОсновныеСведения.НПФЛНалГражд = "1" Тогда
			
			// Адрес места жительства/прибывания
			АдресЗаполнен = ОсновныеСведения.Свойство("НПФЛКодРегион") И ЗначениеЗаполнено(ОсновныеСведения.НПФЛКодРегион);
			Если Не АдресЗаполнен Тогда
				ДобавитьОшибку("2060", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
			КонецЕсли;
			
		Иначе
			
			// Адрес за пределами РФ
			АдресЗаполнен = ОсновныеСведения.Свойство("АдрИнКодСтраны") И ЗначениеЗаполнено(ОсновныеСведения.АдрИнКодСтраны)
				И ЗначениеЗаполнено(ОсновныеСведения.АдрИнТекст);
				
			Если Не АдресЗаполнен Тогда
				ДобавитьОшибку("2070", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		// Статус налогоплательщика
		Если Не ЗначениеЗаполнено(ОсновныеСведения.НПФЛСтатусНП) Тогда
			ДобавитьОшибку("2080", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
		
		// Документ удостоверяющий личность
		// Код вида документа, серия, номер, дата выдачи, кем выдан.
		ДанныеДокументаЗаполнены = ОсновныеСведения.Свойство("НПФЛКодВидДок") И ЗначениеЗаполнено(ОсновныеСведения.НПФЛКодВидДок) 
			И ЗначениеЗаполнено(ОсновныеСведения.НПФЛСерНомДок)	И ЗначениеЗаполнено(ОсновныеСведения.НПФЛДатаДок) 
			И ЗначениеЗаполнено(ОсновныеСведения.НПФЛВыдДок);
		
		Если Не ДанныеДокументаЗаполнены Тогда
			ДобавитьОшибку("2090", ОсновныеСведения.ИндивидуальныйПредприниматель, ТекущиеОшибки);
		КонецЕсли;
			
	КонецЕсли;
	
	Ошибки.Добавить(ТекущиеОшибки, НСтр("ru = 'Титульный лист (сведения о физ. лице)';
										|en = 'Cover page (information on an individual)'"));
		
КонецПроцедуры

Процедура ПроверитьЛисты1А(ОсновныеСведения, ЛистыУведомления, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	Для Каждого Лист Из ЛистыУведомления.ЛистыРаздела1А Цикл
		
		// Код наименования сделки
		Если Не ЗначениеЗаполнено(Лист.Строка210КодНаименованияСделки) Тогда
			ДобавитьОшибку("3010", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Код стороны сделки
		Если Не ЗначениеЗаполнено(Лист.Строка211КодСтороныСделки) Тогда
			ДобавитьОшибку("3020", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Соответствие кодов
		Если ЗначениеЗаполнено(Лист.Строка210КодНаименованияСделки) И ЗначениеЗаполнено(Лист.Строка211КодСтороныСделки) Тогда
			
			СоответствиеКодов = КонтролируемыеСделкиПовтИсп.СоответствиеКодовСтороныСделки();
			
			КодыСторонСделки = СоответствиеКодов.Получить(Лист.Строка210КодНаименованияСделки);
			
			Если КодыСторонСделки = Неопределено Тогда
				ДобавитьОшибку("3030", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);	
			ИначеЕсли КодыСторонСделки.НайтиПоЗначению(Лист.Строка211КодСтороныСделки) = Неопределено Тогда
				ДобавитьОшибку("3040", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		// Комментарий по признаку определения цены сделки
		Если Лист.Строка220ПризнакОпределенияЦеныСделки = "1"
			И Не ЗначениеЗаполнено(Лист.Строка220_1Комментарий) Тогда
			ДобавитьОшибку("3050", Лист.СпособОпределенияЦеныСделки, ТекущиеОшибки);
		КонецЕсли;
		
		// наличие листов раздела 1Б
		Если Лист.Количество1Б = 0 Тогда
			ДобавитьОшибку("3060", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Одновременное заполнение показателей 122-123 и 131-138
		Если Лист.Строка122СделкаВОбластиВнешнейТорговли = "1"
			ИЛИ Лист.Строка123СделкаСКонтрагентомСЛьготнымНалогообложением = "1" Тогда
			
			Если ОсновныеСведения.ВерсияУведомления < КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
				Если Лист.Строка131СуммаДоходовПоСделкамПревышаетПредел = "1"
					ИЛИ Лист.Строка132СделкаСПлательщикомНДПИ = "1"
					ИЛИ Лист.Строка133СделкаСКонтрагентомНаСпецрежимах = "1"
					ИЛИ Лист.Строка134СделкаСПлательщикомНалогаНаПрибыль = "1"
					ИЛИ Лист.Строка135СделкаСРезидентомОЭЗ = "1" Тогда
					
					ДобавитьОшибку("3070", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					
				КонецЕсли;
				
			Иначе
				
				Если Лист.Строка131СуммаДоходовПоСделкамПревышаетПредел = "1"
					ИЛИ Лист.Строка132СделкаСПлательщикомНДПИ = "1"
					ИЛИ Лист.Строка133СделкаСКонтрагентомНаСпецрежимах = "1"
					ИЛИ Лист.Строка134СделкаСПлательщикомНалогаНаПрибыль = "1"
					ИЛИ Лист.Строка135СделкаСРезидентомОЭЗ = "1"
					ИЛИ Лист.Строка136СделкаМорскогоМесторождения = "1"
					ИЛИ Лист.Строка137СделкаИнвестиционныйПроект = "1"
					ИЛИ Лист.Строка138СделкаОсвобождениеОтНДС = "1"
					ИЛИ Лист.Строка139СделкаНалоговыйВычетПоНалогуНаПрибыль = "1"
					ИЛИ Лист.Строка140СделкаНалогНаДополнительныйДоходУглеводородов = "1" Тогда
					
					ДобавитьОшибку("3070", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ОсновныеСведения.ВерсияУведомления >= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
			Если Лист.СделкаСовАгент = "1"
				И Не ЗначениеЗаполнено(Лист.Комиссионер) Тогда
				ДобавитьОшибку("3080", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Ошибки.Добавить(ТекущиеОшибки, НСтр("ru = 'Лист 1А';
										|en = 'Sheet 1A'"));
	
КонецПроцедуры

Процедура ПроверитьЛисты1Б(ОсновныеСведения, ЛистыУведомления, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	Для Каждого Лист Из ЛистыУведомления.ЛистыРаздела1Б Цикл
		
		Если ЗначениеЗаполнено(Лист.Строка020ТипПредмета) Тогда
			
			Если ОсновныеСведения.ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012() Тогда
			
				Если Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
					
					// Код ОКВЭД
					Если ЗначениеЗаполнено(Лист.Строка045КодОКВЭД) Тогда
						ДобавитьОшибку("4030", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
					// Должен быть указан код ОКП или код ТНВЭД
					Если НЕ ЗначениеЗаполнено(Лист.Строка040КодПоТНВЭД)
						И НЕ ЗначениеЗаполнено(Лист.Строка043КодПоОКП) Тогда
						ДобавитьОшибку("4055", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
				ИначеЕсли Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.РаботаУслуга
					Или Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав Тогда
					
					// Код ТНВЭД
					Если ЗначениеЗаполнено(Лист.Строка040КодПоТНВЭД) Тогда
						ДобавитьОшибку("4040", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
					// Код ОКП
					Если ЗначениеЗаполнено(Лист.Строка043КодПоОКП) Тогда
						ДобавитьОшибку("4050", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Если Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
					
					// Код ОКВЭД2 для товаров не заполняется
					Если ЗначениеЗаполнено(Лист.Строка045КодОКВЭД2) Тогда
						ДобавитьОшибку("4130", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
					// Для внешнеторговых сделок должен быть указан код код ТНВЭД
					Если НЕ ЗначениеЗаполнено(Лист.Строка040КодПоТНВЭД)
						И Лист.ВнешнеторговаяСделка Тогда
						ДобавитьОшибку("4150", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
					// Для внутрироссийских сделок должен быть указан код код по ОКПД2
					Если НЕ ЗначениеЗаполнено(Лист.Строка043КодПоОКПД2)
						И НЕ Лист.ВнешнеторговаяСделка Тогда
						ДобавитьОшибку("4160", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
				Иначе
					
					// Код ТНВЭД
					Если ЗначениеЗаполнено(Лист.Строка040КодПоТНВЭД) Тогда
						ДобавитьОшибку("4040", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
					// Код ОКПД2
					Если ЗначениеЗаполнено(Лист.Строка043КодПоОКПД2) Тогда
						ДобавитьОшибку("4140", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
					// Код ОКВЭД2
					Если НЕ ЗначениеЗаполнено(Лист.Строка045КодОКВЭД2) Тогда
						ДобавитьОшибку("4135", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			// Тип предмета сделки
			ДобавитьОшибку("4010", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Наименование предмета сделки
		Если Не ЗначениеЗаполнено(Лист.Строка030НаименованиеПредмета) Тогда
			ДобавитьОшибку("4020", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Лист.Строка060НомерДоговора) Или Не ЗначениеЗаполнено(Лист.Строка065ДатаДоговора) Тогда
			// Номер, дата договора
			ДобавитьОшибку("4070", Лист.Договор, ТекущиеОшибки);
			
		КонецЕсли;
		
		Если Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.Товар Тогда
			
			// Код страны происхождения
			Если Не ЗначениеЗаполнено(Лист.Строка070КодСтраныПроисхождения) Тогда
				ДобавитьОшибку("4080", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
			КонецЕсли;
			
		ИначеЕсли Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.РаботаУслуга
			Или Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.ИнойОбъектГражданскихПрав Тогда
			
			// Код условий поставки
			Если ЗначениеЗаполнено(Лист.Строка100КодУсловийПоставки) Тогда
				ДобавитьОшибку("4100", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
			КонецЕсли;
			
		КонецЕсли;
		
		// Код региона совершения сделки
		Если Лист.Строка090КодСтраныСовершенияСделки = "643" 
			И НЕ ЗначениеЗаполнено(Лист.Строка090КодРегионаСовершенияСделки) Тогда
			ДобавитьОшибку("4090", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Код единицы измерения
		Если Не ЗначениеЗаполнено(Лист.Строка110КодЕдиницыИзмерения) Тогда
			ДобавитьОшибку("4110", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		Если СтрДлина(СокрЛП((Лист.Строка110КодЕдиницыИзмерения)))>3 Тогда
			ДобавитьОшибку("4111", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		// Количество
		Если Лист.Строка120Количество <= 0 Тогда
			ДобавитьОшибку("4120", ДанныеВыводаОшибкиСведенияОПредметеСделки(Лист), ТекущиеОшибки);
		КонецЕсли;
		
		Если ОсновныеСведения.ВерсияУведомления >= КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018() Тогда
			// Код валюты сделки
			Если Не ЗначениеЗаполнено(Лист.Строка140КодВалюты) Тогда
				ДобавитьОшибку("4170", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
			КонецЕсли;
			
			// Долговое обязательство должно быть заполнено.
			Если Лист.ТипПредметаСделки = Перечисления.ТипыПредметовКонтролируемыхСделок.ДолговоеОбязательство Тогда
				Если Не ЗначениеЗаполнено(Лист.Строка150ПроцентнаяСтавка) Тогда
					ДобавитьОшибку("4180", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Лист.Строка130Цена)
					ИЛИ ЗначениеЗаполнено(Лист.Строка160Стоимость) Тогда
					ДобавитьОшибку("4190", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
				КонецЕсли;
			Иначе
				Если ЗначениеЗаполнено(Лист.Строка150ПроцентнаяСтавка) Тогда
					ДобавитьОшибку("4200", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
				КонецЕсли;
				Если Не ЗначениеЗаполнено(Лист.Строка130Цена)
					ИЛИ Не ЗначениеЗаполнено(Лист.Строка160Стоимость) Тогда
					ДобавитьОшибку("4210", ДанныеВыводаОшибкиСделка(Лист), ТекущиеОшибки);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ошибки.Добавить(ТекущиеОшибки, НСтр("ru = 'Лист 1Б';
										|en = 'Sheet 1B'"));
	
КонецПроцедуры

Процедура ПроверитьЛистыРаздела2(ЛистыУведомления, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	Для Каждого Лист Из ЛистыУведомления.ДанныеРаздела2 Цикл
		
		// Наименование контрагента
		Если Не ЗначениеЗаполнено(Лист.Строка040Наименование) Тогда
			ДобавитьОшибку("5010", Лист.Контрагент, ТекущиеОшибки);
		КонецЕсли;

		Если ЗначениеЗаполнено(Лист.Строка030КакКодСтраныРегистрации) Тогда 
			
			Если Лист.Строка020ТипОрганизации = 1 Тогда
				
				// ИНН/КПП
				Если Не ЗначениеЗаполнено(Лист.Строка050ИНН) Или СтрДлина(Лист.Строка050ИНН) <> 10
					Или Не ЗначениеЗаполнено(Лист.Строка060КПП) Или СтрДлина(Лист.Строка060КПП) <> 9 Тогда
					ДобавитьОшибку("5030", Лист.Контрагент, ТекущиеОшибки);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Лист.Строка050ИНН) Тогда
					РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(
						Лист.Строка050ИНН, Истина);
					Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
						ДобавитьОшибку("5050", Лист.Контрагент, ТекущиеОшибки);
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Лист.Строка060КПП) Тогда
					РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямФорматаКПП(
						Лист.Строка060КПП, Истина);
					Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
						ДобавитьОшибку("5055", Лист.Контрагент, ТекущиеОшибки);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				
				// Должен быть заполнен один из:
				//   Регистрационный номер в стране регистрации (инкорпорации)
				//   Код налогоплательщика в стране регистрации (инкорпорациии).
				
				ОшибкаЗаполнения = Не (ЗначениеЗаполнено(Лист.Строка070РегНомерВСтрокеРегистрации) ИЛИ ЗначениеЗаполнено(Лист.Строка080КодНалогВСтранеРегистрации));
				Если ОшибкаЗаполнения Тогда
					ДобавитьОшибку("5040", Лист.Контрагент, ТекущиеОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			// Страна регистрации
			ДобавитьОшибку("5020", Лист.Контрагент, ТекущиеОшибки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ошибки.Добавить(ТекущиеОшибки, "Раздел 2");
	
КонецПроцедуры

Процедура ПроверитьЛистыРаздела3(ЛистыУведомления, Ошибки)
	
	ТекущиеОшибки = ОписаниеТаблицыОшибок();
	
	Для Каждого Лист Из ЛистыУведомления.ДанныеРаздела3 Цикл
		
		//
		Если Не ЗначениеЗаполнено(Лист.ФизическоеЛицо) Тогда
			ДобавитьОшибку("6010", ДанныеВыводаОшибкиСведенияОРегистрации(Лист.Контрагент), ТекущиеОшибки);
		КонецЕсли;
		
		// Код вида деятельности
		Если Не ЗначениеЗаполнено(Лист.Строка020КодВидаДеятельности) Тогда
			ДобавитьОшибку("6030", ДанныеВыводаОшибкиСведенияОРегистрации(Лист.Контрагент), ТекущиеОшибки);
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(Лист.ФизическоеЛицо) Тогда
			Продолжить;
		КонецЕсли;
		
		// Фамилия, имя физ. лица
		Если Не ЗначениеЗаполнено(Лист.Фамилия) Или Не ЗначениеЗаполнено(Лист.Имя) Тогда
			ДобавитьОшибку("6020", Лист.ФизическоеЛицо, ТекущиеОшибки);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Лист.Строка030ИНН) Тогда
			
			// Дата рождения
			Если Не ЗначениеЗаполнено(Лист.ДатаРождения) Тогда
				ДобавитьОшибку("6050", Лист.ФизическоеЛицо, ТекущиеОшибки);
			КонецЕсли;
			
			// Место рождения
			МестоРождения = ПерсонифицированныйУчетКлиентСервер.ПредставлениеМестаРождения(Лист.МестоРождения);
			Если Не ЗначениеЗаполнено(МестоРождения) Тогда
				ДобавитьОшибку("6060", Лист.ФизическоеЛицо, ТекущиеОшибки);
			КонецЕсли;
			
			// Сведения о гражданстве
			Если Не ЗначениеЗаполнено(Лист.ГражданствоФизЛицСтрана) Тогда
				ДобавитьОшибку("6070", Лист.ФизическоеЛицо, ТекущиеОшибки);
			КонецЕсли;
			
			Если Лист.ГражданствоФизЛицСтрана = Справочники.СтраныМира.Россия ИЛИ Не ЗначениеЗаполнено(Лист.ГражданствоФизЛицСтрана) Тогда
				
				// ИНН физ. лица.
				ДобавитьОшибку("6040", Лист.Контрагент, ТекущиеОшибки);
				
				// Адрес места жительства/прибывания
				АдресСтруктурой = РаботаСАдресами.СведенияОбАдресе(Лист.КонтактнаяИнформацияЗначенияПолей);
				
				АдресЗаполнен = АдресСтруктурой.Свойство("КодРегиона") И ЗначениеЗаполнено(АдресСтруктурой.КодРегиона);  
				Если Не АдресЗаполнен Тогда
					ДобавитьОшибку("6080", Лист.ФизическоеЛицо, ТекущиеОшибки);	
				КонецЕсли;
				
			Иначе
				
				// Адрес за пределами РФ
				АдресЗаполнен = ЗначениеЗаполнено(Лист.КонтактнаяИнформацияЗаРФСтрана) И ЗначениеЗаполнено(Лист.КонтактнаяИнформацияЗаРФПредставление); 
				Если Не АдресЗаполнен Тогда
					ДобавитьОшибку("6090", Лист.ФизическоеЛицо, ТекущиеОшибки);
				КонецЕсли;
				
			КонецЕсли;
			
			// Документ удостоверяющий личность
			// Код вида документа, серия, номер, дата выдачи, кем выдан.
			КодВидаДокумента = КонтролируемыеСделкиПовтИсп.ПолучитьКодВидаДокументаПоВидуДокумента(Лист.ВидДокумента);
			
			ДанныеДокументаЗаполнены = ЗначениеЗаполнено(КодВидаДокумента) И ЗначениеЗаполнено(Лист.ДокументСерия) И ЗначениеЗаполнено(Лист.ДокументНомер)
				И ЗначениеЗаполнено(Лист.ДокументДатаВыдачи) И ЗначениеЗаполнено(Лист.ДокументКемВыдан);
				
			Если Не ДанныеДокументаЗаполнены Тогда
				ДобавитьОшибку("6100", Лист.ФизическоеЛицо, ТекущиеОшибки);
			КонецЕсли;
			
		Иначе
			
			Если ЗначениеЗаполнено(Лист.Строка030ИНН) Тогда
				РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(
					Лист.Строка030ИНН, Ложь);
				Если НЕ РезультатПроверки.СоответствуетТребованиям Тогда
					ДобавитьОшибку("6045", Лист.Контрагент, ТекущиеОшибки);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Ошибки.Добавить(ТекущиеОшибки, "Раздел 3");
	
КонецПроцедуры

Процедура СформироватьИнформациюОбОшибках(ИнформацияОбОшибках, Ошибки)
	
	ПредставлениеОшибок = ПолучитьОписаниеОшибок();
	
	Для Каждого Ошибка Из Ошибки Цикл
		
		РазделОтчета  = Ошибка.Представление;
		ТаблицаОшибок = Ошибка.Значение;
		
		ОписаниеОшибки = ВыводСообщенийОбОшибках.ДобавитьОписаниеОшибки(ИнформацияОбОшибках);
		
		СекцияРазделОтчета = ВыводСообщенийОбОшибках.ДобавитьСекцию(ОписаниеОшибки, "Раздел", РазделОтчета);
		
		Если ТаблицаОшибок.Количество() > 0 Тогда
			
			ТаблицаОшибок.Сортировать("Код");
			
			Для Каждого ДанныеОшибки Из ТаблицаОшибок Цикл
				
				ОписаниеОшибки = ПредставлениеОшибок.Найти(ДанныеОшибки.Код, "Код");
				
				Если ОписаниеОшибки = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СекцияОшибка = ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияРазделОтчета, "Раздел", ОписаниеОшибки.Текст);
				
				Если ЗначениеЗаполнено(ОписаниеОшибки.Описание) Тогда
					ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияОшибка, "Текст", ОписаниеОшибки.Описание);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ОписаниеОшибки.Рекомендации) Тогда
					ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияОшибка, "Текст", ОписаниеОшибки.Рекомендации);
				КонецЕсли;
				
				Для Каждого ЭлементКоллекции Из ДанныеОшибки.Объекты Цикл
					Если ТипЗнч(ЭлементКоллекции.Значение) = Тип("Структура") Тогда
						ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияОшибка, "СсылкаПроизвольная", ЭлементКоллекции.Значение);
					Иначе
						ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияОшибка, "Ссылка", ЭлементКоллекции.Значение);
					КонецЕсли;
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			ВыводСообщенийОбОшибках.ДобавитьСекцию(СекцияРазделОтчета, "Текст", НСтр("ru = 'Ошибок не обнаружено.';
																					|en = 'No errors detected.'"));
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОшибку(КодОшибки, Объект, ТаблицаОшибок)
	
	ДанныеОшибки = ТаблицаОшибок.Найти(КодОшибки, "Код");
	
	Если ДанныеОшибки = Неопределено Тогда
		ДанныеОшибки = ТаблицаОшибок.Добавить();
		ДанныеОшибки.Код 	 = КодОшибки;
		ДанныеОшибки.Объекты = Новый Соответствие;
	КонецЕсли;
	
	Если ТипЗнч(Объект) = Тип("Структура") Тогда
		ДанныеОшибки.Объекты.Вставить(Объект.Ключ, Объект);	
	Иначе
		ДанныеОшибки.Объекты.Вставить(Объект, Объект);	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьОписаниеОшибок()
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка");
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("Код", ОписаниеТиповСтрока);
	Таблица.Колонки.Добавить("Текст", ОписаниеТиповСтрока);
	Таблица.Колонки.Добавить("Описание", ОписаниеТиповСтрока);
	Таблица.Колонки.Добавить("Рекомендации", ОписаниеТиповСтрока);
	
	Макет = ПолучитьМакет("ОписаниеОшибок");
	ОписаниеОшибок = Макет.ПолучитьОбласть("ОписаниеОшибок");
	
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		
		Код = ОписаниеОшибок.Область(НомерСтроки, 1).Текст;
		
		Если Не ЗначениеЗаполнено(Код) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Код = Код;
		НоваяСтрока.Текст = ОписаниеОшибок.Область(НомерСтроки, 2).Текст;
		НоваяСтрока.Описание = ОписаниеОшибок.Область(НомерСтроки, 3).Текст;
		НоваяСтрока.Рекомендации = ОписаниеОшибок.Область(НомерСтроки, 4).Текст;
		
	КонецЦикла;
	
	Таблица.Индексы.Добавить("Код");
	
	Возврат Таблица;
	
КонецФункции

Функция ОписаниеТаблицыОшибок()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Код");
	Таблица.Колонки.Добавить("Объекты");
	
	Возврат Таблица;
	
КонецФункции

Функция ДанныеВыводаОшибкиСведенияОРегистрации(Контрагент)
	
	Расшифровка = ВыводСообщенийОбОшибках.НовыйОписаниеРасшифровки("ФормаЗаписиУчастникиКонтролируемыхСделок");
	Расшифровка.Вставить("Контрагент", Контрагент);
	
	ДанныеВывода = Новый Структура;
	ДанныеВывода.Вставить("Ключ",   Контрагент);
	ДанныеВывода.Вставить("Ссылка", Расшифровка);
	ДанныеВывода.Вставить("Представление", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сведения о регистрации %1';
			|en = 'Information on registration %1'"),
		Контрагент));
	
	Возврат ДанныеВывода;

КонецФункции

Функция ДанныеВыводаОшибкиСведенияОПредметеСделки(ДанныеЛиста)
	
	КлючОбъекта = ПолучитьНавигационнуюСсылку(ДанныеЛиста.Сделка, "Сделки.НомерСтроки", ДанныеЛиста.НомерСтроки - 1);
	
	Расшифровка = ВыводСообщенийОбОшибках.НовыйОписаниеРасшифровки("ФормаДокументаСтрокаТабличнойЧасти");
	Расшифровка.Вставить("Объект", "Документ.КонтролируемаяСделка");
	Расшифровка.Вставить("Документ", ДанныеЛиста.Сделка);
	Расшифровка.Вставить("ИмяТабличнойЧасти", "Сделки");
	Расшифровка.Вставить("НомерСтроки", ДанныеЛиста.НомерСтроки);
	
	ДанныеВывода = Новый Структура;
	
	ДанныеВывода.Вставить("Ключ", 	КлючОбъекта);
	ДанныеВывода.Вставить("Ссылка", Расшифровка);
	ДанныеВывода.Вставить("Представление", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Лист 1А № %1, листы 1Б, строка %2';
			|en = 'Sheet 1A No. %1, sheets 1B, line %2'"),
		ДанныеЛиста.НомерЛиста1А,
		ДанныеЛиста.НомерСтроки));
	
	Возврат ДанныеВывода;

КонецФункции

Функция ДанныеВыводаОшибкиСделка(ДанныеЛиста)
	
	Расшифровка = ВыводСообщенийОбОшибках.НовыйОписаниеРасшифровки("Ссылка");
	Расшифровка.Вставить("Ссылка", ДанныеЛиста.Сделка);
	
	ДанныеВывода = Новый Структура;
	ДанныеВывода.Вставить("Ключ",   ДанныеЛиста.Сделка);
	ДанныеВывода.Вставить("Ссылка", Расшифровка);
	ДанныеВывода.Вставить("Представление", СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Лист 1А № %1';
			|en = 'Sheet 1A No. %1'"),
		ДанныеЛиста.НомерЛиста1А));
	
	Возврат ДанныеВывода	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВерсияУведомления

Функция ВерсияУведомления(Уведомление) Экспорт
	
	ВерсияУведомления = КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012();
	
	Если ЗначениеЗаполнено(Уведомление) Тогда
		
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Уведомление, "ВерсияУведомления");
		
	КонецЕсли;
	
	Возврат ВерсияУведомления;
	
КонецФункции

Функция ВерсияУведомленияПоОтчетномуГоду(ОтчетныйГод) Экспорт
	
	Если ОтчетныйГод >= Дата(2018, 1, 1) Тогда
		Возврат КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2018();
	ИначеЕсли ОтчетныйГод >= Дата(2017, 1, 1) Тогда
		Возврат КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2017();
	Иначе
		Возврат КонтролируемыеСделкиКлиентСервер.ВерсияУведомления_2012();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
