
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Позиция") Тогда
		ПозицияЛС = Параметры.Позиция;
	КонецЕсли;
	
	Если Параметры.Свойство("АктВыполненныхРабот") Тогда
		ЭтаФорма.АктВыполненныхРабот = Параметры.АктВыполненныхРабот;
	КонецЕсли;
	
	МассивРесурсов = Новый Массив;
	Если Параметры.Свойство("АдресРесурсов") Тогда
		МассивРесурсов 	= ПолучитьИзВременногоХранилища(Параметры.АдресРесурсов); 
	КонецЕсли;		
	
	// ******************************************************
	// ++ AVV
	// Старый вариант заполнения 
	//Если ЗначениеЗаполнено(ПозицияЛС) и ЗначениеЗаполнено(ЭтаФорма.АктВыполненныхРабот) Тогда
	//	МассивСтрокРесурсов = СМ_СметаВызовСервера.МассивСтрокРесурсовПозицииАкта(ЭтаФорма.АктВыполненныхРабот,ПозицияЛС);
	//	Для Каждого ТекСтрока Из МассивСтрокРесурсов Цикл
	//		НоваяСтрока = ЭтаФорма.РесурсыПозиций.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока); 
	//	КонецЦикла;
	//КонецЕсли;
		
	// ******************************************************
	// Новый вариант заполнения
	Если ЗначениеЗаполнено(ПозицияЛС) И ЗначениеЗаполнено(АктВыполненныхРабот) Тогда
		СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,ПозицияЛС);
		
		СписокАктов = Новый СписокЗначений();
		СписокАктов.Добавить(ЭтаФорма.АктВыполненныхРабот);
		
//		МассивРесурсов 		= СМ_СметаВызовСервера.МассивСтрокРесурсовПозицииАкта(АктВыполненныхРабот,ПозицияЛС);
		ТабЗамен 			= СМ_СметаВызовСервера.ПолучитьЗамененныеРесурсыАктов(СписокАктов); 
		ЗамененныеРесурсы	= Новый Соответствие;
		СортировкаЗамен 	= 1;
	КонецЕсли;
	
	Для Каждого ТекСтрока Из МассивРесурсов Цикл
		
		// Добавляем новую строку ресурса
		НоваяСтрока = ЭтаФорма.РесурсыПозиций.Добавить();
	    ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока); 
		НоваяСтрока.ЭтоЗамена		= Ложь;
		НоваяСтрока.Заменен 		= Ложь;
		НоваяСтрока.СортировкаЗамен	= 0;
		
		// Поиск ресурса который был заменен текущим ресурсом
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Смета", ЭтаФорма.АктВыполненныхРабот);
		СтруктураОтбора.Вставить("Позиция",ПозицияЛС);
		СтруктураОтбора.Вставить("НовыйРесурс",ТекСтрока.Ресурс);
		
		МассивСтрок = ТабЗамен.НайтиСтроки(СтруктураОтбора);
		Если МассивСтрок.Количество() > 0 Тогда
			
			// Добавляем строку замененного ресурса
			СтрокаСтарогоРесурса 	= МассивСтрок[0];
			ЗамененныйРесурс 		= СтрокаСтарогоРесурса.ЗамененныйРесурс;
			
			ТекСортировка = ЗамененныеРесурсы.Получить(СтрокаСтарогоРесурса.ЗамененныйРесурс); 
			Если ТекСортировка = Неопределено Тогда
				
				СортировкаЗамен			= СортировкаЗамен + 2;
				СортировкаПодчиненных 	= СортировкаЗамен + 1;
				ЗамененныеРесурсы.Вставить(ЗамененныйРесурс,СортировкаЗамен);
				
				ФактОбъем = ПолучитьОбъемПоПозицииАкта(АктВыполненныхРабот,ПозицияЛС);
				
				НоваяСтрока2 							= ЭтаФорма.РесурсыПозиций.Добавить();
				НоваяСтрока2.Ресурс                     = ЗамененныйРесурс;
				НоваяСтрока2.НаименованиеРесурса        = ЗамененныйРесурс.Наименование;  
				НоваяСтрока2.СметныйКодРесурса 			= ЗамененныйРесурс.Код;
				НоваяСтрока2.Позиция					= ПозицияЛС;
				НоваяСтрока2.ЕдиницаИзмеренияРесурса    = ЗамененныйРесурс.ЕдиницаИзмерения;
				НоваяСтрока2.ВидРесурса                 = ТекСтрока.ВидРесурса;
				НоваяСтрока2.ТипМатериала               = ТекСтрока.ТипМатериала;
				НоваяСтрока2.НормаРасходаОбъем          = СтрокаСтарогоРесурса.НормаРасходаСтарогоМатериала * ФактОбъем;
				НоваяСтрока2.ФактРасходаОбъем           = 0;
				НоваяСтрока2.БазиснаяЦена               = СтрокаСтарогоРесурса.БазиснаяЦенаСтарогоМатериала;
				НоваяСтрока2.ТекущаяЦена                = СтрокаСтарогоРесурса.ТекущаяЦенаСтарогоМатериала;
		       	НоваяСтрока2.БазиснаяЗарплатаМашинистов = СтрокаСтарогоРесурса.БазисЗарплМашСтарРесурс;
				НоваяСтрока2.ТекущаяЗарплатаМашинистов  = СтрокаСтарогоРесурса.ТекЗарплМашСтарРесурс;
				НоваяСтрока2.ВариантОтклонения          = ТекСтрока.ВариантОтклонения;
				НоваяСтрока2.СтатусРесурса              = ТекСтрока.СтатусРесурса;
				НоваяСтрока2.НеИзменятьЦены             = ТекСтрока.НеИзменятьЦены;
				НоваяСтрока2.ВариантСписанияПревышения  = ТекСтрока.ВариантСписанияПревышения;
				НоваяСтрока2.Удален                     = Ложь;
				НоваяСтрока2.Добавлен                   = Ложь;
				НоваяСтрока2.Заменен 					= Истина;
				НоваяСтрока2.ЭтоЗамена 					= Ложь;
				НоваяСтрока2.СортировкаЗамен 			= СортировкаЗамен;
				НоваяСтрока2.ЗаменаРегистр 				= Истина;
			Иначе
				СортировкаЗамен 		= ТекСортировка;
				СортировкаПодчиненных 	= СортировкаЗамен + 1;
			КонецЕсли;
			
			НоваяСтрока.ЭтоЗамена 			= Истина;
			НоваяСтрока.СортировкаЗамен 	= СортировкаПодчиненных;
			НоваяСтрока.ЗамененныйРесурс 	= ЗамененныйРесурс;
			НоваяСтрока.ЗаменаРегистр 		= Истина;
		КонецЕсли;
	КонецЦикла;	
	
	ЭтаФорма.РесурсыПозиций.Сортировать("СортировкаЗамен");
	
	// -- AVV
	// ******************************************************

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Ответы на вопросы, задаваемые на форме

// Процедура обрабатывает действия после выбора пользователем нового ресурса
//
// Параметры:
//		НовыйРесурс 		- СправочникСсылка.СМ_Ресурсы - выбранный ресурс.
// 		СтруктураПараметров - Структура	- дополнительные параметры, переданные при формировании вопроса пользователю.
//
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораРесурса(НовыйРесурс, СтруктураПараметров) Экспорт
	
	// Результат - это новый ресурс, на который заменяем
	НовыйРесурс	= СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(НовыйРесурс);
	Если Не ЗначениеЗаполнено(НовыйРесурс) Тогда
		Возврат;
	КонецЕсли;
	
	// Определение цен ресурса
	СтруктураЦен = Новый Структура();
	СтруктураЦен.Вставить("БазиснаяЦена");
	СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
	СтруктураЦен.Вставить("ТекущаяЦена");
	СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
	
	ОписаниеРесурса = ИнициироватьСтруктуруОписанияРесурса(НовыйРесурс);
	СМ_СметаВызовСервера.ПолучитьЦеныНовогоРесурса(НовыйРесурс,ОписаниеРесурса.Район,,ОписаниеРесурса.ДатаТекущихЦен,СтруктураЦен,ОписаниеРесурса.ЗагружатьТекущиеЦены);
	Если ОписаниеРесурса.ФайлСборникаТекущихЦен <> "" И ОписаниеРесурса.ЗагружатьТекущиеЦены Тогда
		Район = ОписаниеРесурса.Район;
		ИмяФайлаСборникаТекущихЦен = ОписаниеРесурса.ФайлСборникаТекущихЦен;
		КодРегиональнойБазы = ОписаниеРесурса.КодРегионаФайлаТекущихЦен; 
		СМ_СметаКлиент.ПолучитьЦеныНовогоРесурса(НовыйРесурс,Район,ИмяФайлаСборникаТекущихЦен,КодРегиональнойБазы,СтруктураЦен); 	
	КонецЕсли;	
	
	Элементы.РесурсыПозицийАкта.ДобавитьСтроку();
	ТекДанные = Элементы.РесурсыПозицийАкта.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекДанные,ОписаниеРесурса);
	ТекДанные.НормаРасходаОбъем	 			= СтруктураПараметров.НормаРасходаСтарогоМатериала;
	ТекДанные.БазиснаяЦена 					= СтруктураЦен.БазиснаяЦена;
	ТекДанные.БазиснаяЗарплатаМашинистов 	= СтруктураЦен.БазиснаяЗарплатаМашинистов;
	ТекДанные.ТекущаяЦена 					= СтруктураЦен.ТекущаяЦена;
	ТекДанные.ТекущаяЗарплатаМашинистов 	= СтруктураЦен.ТекущаяЗарплатаМашинистов;
	
	НовЗамена 					= ТаблицаЗамен.Добавить();
	НовЗамена.БазисЗарплМаш 	= СтруктураПараметров.БазисЗарплМашСтарРесурс; 
	НовЗамена.БазисЦена 		= СтруктураПараметров.БазиснаяЦенаСтарогоМатериала;
	НовЗамена.ЗаменяемыйРесурс 	= СтруктураПараметров.ЗамененныйРесурс;
	НовЗамена.РасходПоНорме 	= СтруктураПараметров.НормаРасходаСтарогоМатериала;
	НовЗамена.РасходПоФакту 	= СтруктураПараметров.ФактРасходаСтарогоМатериала;
	НовЗамена.Ресурс 			= НовыйРесурс;
	НовЗамена.ТекЗарплМаш 		= СтруктураПараметров.ТекЗарплМашСтарРесурс;
	НовЗамена.ТекЦена 			= СтруктураПараметров.ТекущаяЦенаСтарогоМатериала;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРесурсыПозицийАкта

&НаКлиенте
Процедура РесурсыПозицийАктаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекДанные = Элементы.РесурсыПозицийАкта.ТекущиеДанные;
	ТекДанные.Позиция = ПозицияЛС; 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	СтруктураВозврата = СформироватьСтруктуруВозврата();
	ЭтаФорма.Закрыть(СтруктураВозврата);	
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗамену(Команда)
	
	ТекДанные = Элементы.РесурсыПозицийАкта.ТекущиеДанные;
	Если ТекДанные.ЭтоЗамена Тогда
		
		// Удаляем строку замены из таблицы "РесурсыПозиций".
		// На форму данные выводятся из этой ТЗ.
		ЭтаФорма.СписокУдаления.Добавить(ТекДанные.Ресурс);
		УдалитьРесурсИзТЧ(ТекДанные.Ресурс,ТекДанные.Позиция);
		
		// Проверяем наличие других замен по замененному ресурсу.
		ЗамененныйРесурс = ТекДанные.ЗамененныйРесурс;
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЗамененныйРесурс",ЗамененныйРесурс);
		СтруктураОтбора.Вставить("Позиция",ПозицияЛС);
		МассивСтрок = РесурсыПозиций.НайтиСтроки(СтруктураОтбора);
		Если МассивСтрок.Количество() = 0 Тогда
			// Вернем обычный статус строке с замененным ресурсом.
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Ресурс",ЗамененныйРесурс);
			СтруктураОтбора.Вставить("Позиция",ПозицияЛС);
			СтруктураОтбора.Вставить("Заменен",Истина);
			
			МассивСтрок 				= РесурсыПозиций.НайтиСтроки(СтруктураОтбора);
			ТекСтрока 					= МассивСтрок[0];
			ТекСтрока.Заменен 			= Ложь;
			ТекСтрока.ЗаменаРегистр		= Ложь;
			ТекСтрока.СортировкаЗамен 	= 0;
		КонецЕсли;
		
		// Если строка получена по данным регистра замен, при создании на сервере,
		// То нужно добавить ее в таблицу удаления, которая возвращается при закрытии формы. 
		Если ТекДанные.ЗаменаРегистр Тогда
			НоваяСтрока 					= ТаблицаУдаленияЗамен.Добавить();
			НоваяСтрока.ЗаменяемыйРесурс	= ТекДанные.ЗамененныйРесурс;
			НоваяСтрока.Ресурс              = ТекДанные.Ресурс;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СформироватьСтруктуруВозврата()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЭтоЗамена",Истина);
	СтруктураОтбора.Вставить("ЗаменаРегистр",Ложь);
	
	ТабРесурсы	= РеквизитФормыВЗначение("РесурсыПозиций");
	ТабЗамен	= ТабРесурсы.Скопировать(СтруктураОтбора);
	ТабУдаления = РеквизитФормыВЗначение("ТаблицаУдаленияЗамен");

	АдресТабРесурсы	 = ПоместитьВоВременноеХранилище(ТабРесурсы,Новый УникальныйИдентификатор);
	АдресТабЗамен	 = ПоместитьВоВременноеХранилище(ТабЗамен,Новый УникальныйИдентификатор);
	АдресТабУдаления = ПоместитьВоВременноеХранилище(ТабУдаления,Новый УникальныйИдентификатор);
	
	СтруктураВозврата = Новый Структура("АдресТабРесурсы,АдресТабЗамен,АдресТабУдаления",АдресТабРесурсы, АдресТабЗамен, АдресТабУдаления);
	
	Возврат СтруктураВозврата;
	
КонецФункции

&НаКлиенте
Процедура ЗаменитьРесурс(Команда)
	
	ТекДанные = Элементы.РесурсыПозицийАкта.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.Заменен Тогда
		Возврат;
	КонецЕсли;
	
	ТекРесурс 	= ТекДанные.Ресурс;
	ТекПозиция	= ТекДанные.Позиция;
	
	// Перезамена (замена уже замененного ресурса)
	Если ТекДанные.ЭтоЗамена Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗамененныйРесурс",ТекДанные.ЗамененныйРесурс);
		СтруктураПараметров.Вставить("Ресурс",ТекДанные.Ресурс);
		
		Оповещение 		= Новый ОписаниеОповещения("ПерезаменаРесурсаПодтверждение", ЭтотОбъект,СтруктураПараметров);
		ТекстВопроса 	= "Текущая замена будет удалена. Продолжить?"; 
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет); 
	Иначе
		ФактОбъем = ПолучитьОбъемПоПозицииАкта(АктВыполненныхРабот,ТекДанные.Позиция);
		Если ФактОбъем = 0 Тогда
			ФактОбъем = 1;	
		КонецЕсли;
		
		Структура 					= Новый Структура("ЗаменяемыйРесурс, Ресурс, РасходПоНорме, РасходПоФакту,БазисЦена,БазисЗарплМаш,ТекЦена,ТекЗарплМаш");
		Структура.ЗаменяемыйРесурс 	= ТекРесурс;
		Структура.РасходПоНорме 	= ТекДанные.НормаРасходаОбъем / ФактОбъем;
		Структура.РасходПоФакту 	= ТекДанные.ФактРасходаОбъем / ФактОбъем;
		
		ПараметрыПоиска	= ПолучитьСтруктуруПоискаРесурса(АктВыполненныхРабот,ТекРесурс,ТекПозиция);
		Оповещение 		= Новый ОписаниеОповещения("ПровестиЗаменуРесурса", ЭтотОбъект,Структура);
		ОткрытьФорму("Справочник.СМ_Ресурсы.Форма.ФормаВыбора",ПараметрыПоиска,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРесурсИзТЧ(ТекРесурс,Позиция)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ресурс",ТекРесурс);
	СтруктураОтбора.Вставить("Позиция",Позиция);
	
	МассивСтрок = ЭтаФорма.РесурсыПозиций.НайтиСтроки(СтруктураОтбора);
	Для Каждого ТекСтрока Из МассивСтрок Цикл
		ЭтаФорма.РесурсыПозиций.Удалить(ТекСтрока);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере 
Функция ИнициироватьСтруктуруОписанияРесурса(Ресурс) 
	
	ТекПредставление = "" + ПозицияЛС.ШифрРасценки + ", " + ПозицияЛС.Наименование;
	
	СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,ПозицияЛС);

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Позиция",ПозицияЛС);
	СтруктураПараметров.Вставить("СметныйКодРесурса",Ресурс.Код);
	СтруктураПараметров.Вставить("Ресурс",Ресурс);
	СтруктураПараметров.Вставить("ВидРесурса",Ресурс.ВидРесурса);
	СтруктураПараметров.Вставить("НормаРасходаОбъем",0);
	СтруктураПараметров.Вставить("ФактРасходаОбъем",0);
	СтруктураПараметров.Вставить("ТипМатериала",Перечисления.СМ_ТипыМатериалов.Учтенный);
	СтруктураПараметров.Вставить("БазиснаяЦена",0);
	СтруктураПараметров.Вставить("БазиснаяЗарплатаМашинистов",0);
	СтруктураПараметров.Вставить("ТекущаяЦена",0);
	СтруктураПараметров.Вставить("ТекущаяЗарплатаМашинистов",0);
	СтруктураПараметров.Вставить("Заменен",Истина);
	СтруктураПараметров.Вставить("Удален",Ложь);
	СтруктураПараметров.Вставить("Добавлен",Ложь);
	СтруктураПараметров.Вставить("НаименованиеРесурса",Ресурс.ДлинноеНаименование);
	СтруктураПараметров.Вставить("ЕдиницаИзмеренияРесурса",Ресурс.ЕдиницаИзмерения);
	СтруктураПараметров.Вставить("Район",СтруктураПараметровРасчетаЛС.Район);
	СтруктураПараметров.Вставить("ДатаТекущихЦен",АктВыполненныхРабот.ДатаТекущихЦен);
	СтруктураПараметров.Вставить("ФайлСборникаТекущихЦен",АктВыполненныхРабот.ФайлСборникаТекущихЦен);
	СтруктураПараметров.Вставить("КодРегионаФайлаТекущихЦен",АктВыполненныхРабот.КодРегионаФайлаТекущихЦен);
	Если АктВыполненныхРабот.ФайлСборникаТекущихЦен = "" Тогда
		СтруктураПараметров.Вставить("ЗагружатьТекущиеЦены",АктВыполненныхРабот.АвтозагрузкаЦен);
	Иначе
		СтруктураПараметров.Вставить("ЗагружатьТекущиеЦены",Ложь);
	КонецЕсли;

	// ++ АVV
	СтруктураПараметров.Вставить("ЛокальнаяСмета",ПозицияЛС.ИДСметы);
	СтруктураПараметров.Вставить("РегионДляВыбораЦен",СтруктураПараметровРасчетаЛС.РегионДляВыбораЦен);
	СтруктураПараметров.Вставить("АвтозагрузкаЦен",СтруктураПараметровРасчетаЛС.АвтозагрузкаЦен);
	// -- AVV
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере 
Функция ПолучитьСтруктуруПоискаРесурса(АктВыполненныхРабот,ТекРесурс,ТекПозиция)

	ПараметрыПоиска = Новый Структура;
	ПараметрыПоиска.Вставить("РегиональнаяБаза",СтруктураПараметровРасчетаЛС.РегионДляВыбораЦен);
	ПараметрыПоиска.Вставить("Район",СтруктураПараметровРасчетаЛС.Район);
	ПараметрыПоиска.Вставить("ДатаТекущихЦен",АктВыполненныхРабот.ДатаТекущихЦен);
	ПараметрыПоиска.Вставить("ТекРесурс",ТекРесурс);
	ПараметрыПоиска.Вставить("Проект",АктВыполненныхРабот.Стройка);
	ПараметрыПоиска.Вставить("Акт",АктВыполненныхРабот.Ссылка);
	
	Возврат ПараметрыПоиска;
	
КонецФункции

// Осуществляет замену ресурсов после диалога пользователя (из функции ЗаменаРесурсовПоПозиции).
//
// Параметры:
//   Результат - Произвольный - ответ пользователя на вопрос (продолжать или нет).
//   СтруктураПараметров - Структура - структура описания нового ресурса.
//
&НаКлиенте
Процедура ПровестиЗаменуРесурса(Результат, СтруктураПараметров) Экспорт

	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураПараметров.Ресурс = СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(Результат);
	Если Не ЗначениеЗаполнено(СтруктураПараметров.Ресурс) Тогда
		Возврат;
	КонецЕсли;
	
	// Получение текущих и базисных цен
	СтруктураЦен = Новый Структура();
	СтруктураЦен.Вставить("БазиснаяЦена");
	СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
	СтруктураЦен.Вставить("ТекущаяЦена");
	СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
	
	СтруктураОписанияРесурса 	= ИнициироватьСтруктуруОписанияРесурса(СтруктураПараметров.Ресурс); 
	ТекРесурс					= СтруктураПараметров.Ресурс;
	Район 						= СтруктураОписанияРесурса.Район;
	РегиональнаяБаза 			= СтруктураОписанияРесурса.РегионДляВыбораЦен;
	ДатаТекущихЦен 				= СтруктураОписанияРесурса.ДатаТекущихЦен;
	АвтозагрузкаЦен				= СтруктураОписанияРесурса.АвтозагрузкаЦен;
	ФайлТекущихЦен				= СтруктураОписанияРесурса.ФайлСборникаТекущихЦен;
	КодРегионаФайлаТекущихЦен 	= СтруктураОписанияРесурса.КодРегионаФайлаТекущихЦен;
		
	// Получим цены	
	ВыбиратьТекущиеЦены = Истина;
	Если ЗначениеЗаполнено(ФайлТекущихЦен) Тогда
		ВыбиратьТекущиеЦены = Ложь;	
	КонецЕсли;	
	СМ_СметаВызовСервера.ПолучитьЦеныНовогоРесурса(ТекРесурс,Район,РегиональнаяБаза,ДатаТекущихЦен,СтруктураЦен,ВыбиратьТекущиеЦены);

	СтруктураПараметров.БазисЦена 		= СтруктураЦен.БазиснаяЦена;
	СтруктураПараметров.БазисЗарплМаш 	= СтруктураЦен.БазиснаяЗарплатаМашинистов;
	СтруктураПараметров.ТекЦена 		= СтруктураЦен.ТекущаяЦена;
	СтруктураПараметров.ТекЗарплМаш 	= СтруктураЦен.ТекущаяЗарплатаМашинистов;
	
	Если Не СметнаяКомпонента = Неопределено Тогда
		Если АвтозагрузкаЦен И ЗначениеЗаполнено(ФайлТекущихЦен) Тогда
			СМ_СметаКлиент.ПолучитьЦеныНовогоРесурса(ТекРесурс,Район,ФайлТекущихЦен,КодРегионаФайлаТекущихЦен,СтруктураЦен); 
			СтруктураПараметров.ТекЦена 	= СтруктураЦен.ТекущаяЦена;
			СтруктураПараметров.ТекЗарплМаш = СтруктураЦен.ТекущаяЗарплатаМашинистов;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ЛокальнаяСмета",СтруктураОписанияРесурса.ЛокальнаяСмета);
	СтруктураПараметров.Вставить("МестоВызова", "АктВыполненныхРабот");
	
	Оповещение = Новый ОписаниеОповещения("ЗаменитьРесурсыНаФорме", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.СМ_ВводРасходаРесурса",СтруктураПараметров,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

// Получить факт объем позиции по акту.
&НаСервере
Функция ПолучитьОбъемПоПозицииАкта(АктСсылка,ПозицияСсылка)
	
	ТекСтрока = АктСсылка.Позиции.Найти(ПозицияСсылка);
	Если ТекСтрока = Неопределено Тогда
		Возврат 0;
	Иначе
		Возврат ТекСтрока.ФактОбъем;
	КонецЕсли;
	
КонецФункции

// Обрабатывает действия после выбора пользователем нового ресурса.
//
// Параметры:
// 	НовыйРесурс - выбранный ресурс.
// 	Параметры 	- дополнительные параметры переданные при формировании вопроса пользователю.
//
&НаСервере
Процедура ЗаменитьРесурсыНаФорме(Структура, Параметры) Экспорт
	
	Если ТипЗнч(Структура) = Тип("Строка") Тогда
		ТабЗамен 		= ПолучитьИзВременногоХранилища(Структура);
		ТабЗамененных 	= ТабЗамен.Скопировать();
		ТабЗамененных.Свернуть("ЗаменяемыйРесурс");
		ЗамененныйРесурс = ТабЗамененных[0].ЗаменяемыйРесурс;
		
		// Определяем максимальное значение сортировки замен
		ТекСортировка = 0;
		ТабРесурсов = РеквизитФормыВЗначение("РесурсыПозиций");
		Если ТабРесурсов.Количество() > 0 Тогда
			ТабРесурсов.Сортировать("СортировкаЗамен Убыв");
			ТекСортировка = ТабРесурсов[0].СортировкаЗамен;
		КонецЕсли;
		
		// Устанавливаем нужные параметры у строки замененного ресурса
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ресурс", ЗамененныйРесурс);
		СтруктураОтбора.Вставить("Позиция", ПозицияЛС);
		МассивСтрок = ЭтаФорма.РесурсыПозиций.НайтиСтроки(СтруктураОтбора);
		Для Каждого ТекСтрока Из МассивСтрок Цикл
			ТекСортировка				= ТекСортировка + 1;
			ТекСтрока.Заменен 			= Истина;
			ТекСтрока.СортировкаЗамен 	= ТекСортировка;
		КонецЦикла;
		
		// Получение факт объема текущей позиции из таб. части акта
		ФактОбъем = 0;
		ТекСтрока = АктВыполненныхРабот.Позиции.Найти(ПозицияЛС);
		Если ТекСтрока <> Неопределено Тогда
			ФактОбъем = ТекСтрока.ФактОбъем;
		КонецЕсли;
		
		// Добавление данных по заменам на форму 
		Для Каждого ТекСтрока Из ТабЗамен Цикл
			ТекСортировка							= ТекСортировка + 1;
			НоваяСтрока								= РесурсыПозиций.Добавить();
			НоваяСтрока.Позиция                     = ПозицияЛС;
			НоваяСтрока.СметныйКодРесурса           = ТекСтрока.Ресурс.Код;
			НоваяСтрока.Ресурс                      = ТекСтрока.Ресурс;
			НоваяСтрока.ВидРесурса                  = ТекСтрока.Ресурс.ВидРесурса;
			НоваяСтрока.ТипМатериала                = Перечисления.СМ_ТипыМатериалов.Учтенный;
			НоваяСтрока.НаименованиеРесурса         = ТекСтрока.Ресурс.ДлинноеНаименование;
			НоваяСтрока.ЕдиницаИзмеренияРесурса     = ТекСтрока.Ресурс.ЕдиницаИзмерения;
			НоваяСтрока.НормаРасходаОбъем	 		= ТекСтрока.РасходПоНорме * ФактОбъем;
			НоваяСтрока.ФактРасходаОбъем			= ТекСтрока.РасходПоФакту * ФактОбъем;
			НоваяСтрока.БазиснаяЦена 				= ТекСтрока.БазисЦена;
			НоваяСтрока.БазиснаяЗарплатаМашинистов 	= ТекСтрока.БазисЗарплМаш;
			НоваяСтрока.ТекущаяЦена 				= ТекСтрока.ТекЦена;
			НоваяСтрока.ТекущаяЗарплатаМашинистов 	= ТекСтрока.ТекЗарплМаш;
			НоваяСтрока.ЭтоЗамена					= Истина;
			НоваяСтрока.СортировкаЗамен				= ТекСортировка;
			НоваяСтрока.ЗамененныйРесурс			= ТекСтрока.ЗаменяемыйРесурс;
			
		КонецЦикла;
	
	Иначе
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.РесурсыПозиций.Сортировать("СортировкаЗамен");
	
КонецПроцедуры

&НаКлиенте 
Процедура ПерезаменаРесурсаПодтверждение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда 
		ВыполнитьПерезаменуРесурса(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыполнитьПерезаменуРесурса(ПараметрыЗамены)
	
	// Удаляем все замены ресурса и возвращаем обычный статус строки для замененного ресурса.
	// Возвращается структура старого ресурса для вызова его новой замены.
	ЗамененныйРесурс = ПараметрыЗамены.ЗамененныйРесурс;
	СтруктураРесурса = УдалитьВсеЗаменыРесурсаПоЗамене(ЗамененныйРесурс);
	Если СтруктураРесурса = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось провести перезамену ресурса'"));
		Возврат;	
	КонецЕсли;
	
	ПараметрыПоиска	= ПолучитьСтруктуруПоискаРесурса(АктВыполненныхРабот,ЗамененныйРесурс,ПозицияЛС);
	Оповещение 		= Новый ОписаниеОповещения("ПровестиЗаменуРесурса", ЭтотОбъект,СтруктураРесурса);
	ОткрытьФорму("Справочник.СМ_Ресурсы.Форма.ФормаВыбора",ПараметрыПоиска,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаСервере
// Функция удаляет все замены ресурса и старый ресурс возвращается в ТЧ.
Функция УдалитьВсеЗаменыРесурсаПоЗамене(ЗамененныйРесурс)
	
	// Получаем все замены старого ресурса в текущем акте и удаляем их
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ЗамененныйРесурс",ЗамененныйРесурс);
	СтруктураОтбора.Вставить("ЭтоЗамена",Истина);
	СтруктураОтбора.Вставить("Позиция",ПозицияЛС);
	МассивСтрок = РесурсыПозиций.НайтиСтроки(СтруктураОтбора);
	Для Каждого ТекСтрока Из МассивСтрок Цикл
		РесурсыПозиций.Удалить(ТекСтрока);	
	КонецЦикла;
	
	ФактОбъем = ПолучитьОбъемПоПозицииАкта(АктВыполненныхРабот,ПозицияЛС);
	Если ФактОбъем = 0 Тогда
		ФактОбъем = 1;	
	КонецЕсли;
	
	// Получаем строку с заменяемым ресурсом
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ресурс",ЗамененныйРесурс);
	СтруктураОтбора.Вставить("Заменен",Истина);
	СтруктураОтбора.Вставить("Позиция",ПозицияЛС);
	МассивСтрок = РесурсыПозиций.НайтиСтроки(СтруктураОтбора);
	Если МассивСтрок.Количество() > 0 Тогда
		ТекСтрока 							= МассивСтрок[0];
		СтруктураРесурса 					= Новый Структура("ЗаменяемыйРесурс, Ресурс, РасходПоНорме, РасходПоФакту,БазисЦена,БазисЗарплМаш,ТекЦена,ТекЗарплМаш");
		СтруктураРесурса.ЗаменяемыйРесурс 	= ТекСтрока.Ресурс;
		СтруктураРесурса.РасходПоНорме 		= ТекСтрока.НормаРасходаОбъем / ФактОбъем;
		СтруктураРесурса.РасходПоФакту 		= ТекСтрока.ФактРасходаОбъем / ФактОбъем;
		Возврат СтруктураРесурса;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура РесурсыПозицийАктаФактРасходаОбъемПриИзменении(Элемент)
	ТекДанные = Элементы.РесурсыПозицийАкта.ТекущиеДанные;
	ПроверитьПревышениеФактическогоРасхода(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПревышениеФактическогоРасхода(ТекДанные)
	
	Если СМ_СметаВызовСервера.ЗначениеОпции("СМ_ПодтверждатьПревышениеОбъемаАкта")
		И ТекДанные.ФактРасходаОбъем > ТекДанные.НормаРасходаОбъем
		И ТекДанные.НормаРасходаОбъем >= 0 Тогда 
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ТекДанные",ТекДанные);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораВариантаСписания", ЭтотОбъект, ДопПараметры);
		ПоказатьВводЗначения(Оповещение,ПредопределенноеЗначение("Перечисление.СМ_ВариантыСписанияПревышения.ДефектныйАкт"), "Вариант списания превышения");
	Иначе
		ЗаполнитьВариантОтклоненияТЧРесурсы(ТекДанные,ПредопределенноеЗначение("Перечисление.СМ_ВариантыОтклоненияНормы.ПустаяСсылка"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВариантОтклоненияТЧРесурсы(ТекДанные,ВариантОтклонения)
	
	ТекДанные.ВариантОтклонения = ВариантОтклонения;
	ТекДанные.СсылкаНаФайл = ПредопределенноеЗначение("Справочник.СМ_АктВыполненныхРаботПрисоединенныеФайлы.ПустаяСсылка");
	ТекДанные.СсылкаНаАкт = ПредопределенноеЗначение("Документ.СМ_АктВыполненныхРабот.ПустаяСсылка");
	ТекДанные.КомментарийКФайлу = "";
	ТекДанные.ВариантСписанияПревышения = ПредопределенноеЗначение("Перечисление.СМ_ВариантыСписанияПревышения.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВариантаСписания(Результат, ДопПараметры) Экспорт
	
	Если Результат = ПредопределенноеЗначение("Перечисление.СМ_ВариантыСписанияПревышения.ДефектныйАкт") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла",  АктВыполненныхРабот);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		
		ДопПараметры.Вставить("ВариантСписания", Результат);
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайлаДефектныйАкт", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Документ.СМ_АктВыполненныхРабот.Форма.ПрисоединенныеФайлы",ПараметрыФормы,ЭтаФорма,Ложь,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.СМ_ВариантыСписанияПревышения.ПредыдущийПериод") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекущийАкт",  АктВыполненныхРабот);
		
		ДопПараметры.Вставить("ВариантСписания", Результат);
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайлаПредыдущийАкт", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Документ.СМ_АктВыполненныхРабот.Форма.ФормаВыбораПредыдущего",ПараметрыФормы,ЭтаФорма,Ложь,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе
		ТекДанные = ДопПараметры.ТекДанные; 
		ТекДанные.ФактРасходаОбъем = ТекДанные.НормаРасходаОбъем;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Расход по факту установлен по норме.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайлаПредыдущийАкт(Результат, ДопПараметры) Экспорт
	ТекДанные = ДопПараметры.ТекДанные;
	Если Не Результат = Неопределено Тогда
		ЗаполнитьФайлТЧРесурсыПредыдущий(ДопПараметры.ВариантСписания,ТекДанные,Результат);
	Иначе
		ТекДанные.ФактРасходаОбъем = ТекДанные.НормаРасходаОбъем;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Фактический расход установлен по норме.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайлаДефектныйАкт(Результат, ДопПараметры) Экспорт
	ТекДанные = ДопПараметры.ТекДанные;
	Если Не Результат = Неопределено Тогда
		ЗаполнитьФайлТЧРесурсыДефект(ДопПараметры.ВариантСписания,ТекДанные,Результат);
	Иначе
		ТекДанные.ФактРасходаОбъем = ТекДанные.НормаРасходаОбъем;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Фактический расход установлен по норме.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФайлТЧРесурсыПредыдущий(ВариантСписания,ТекДанные,СтруктураДанных)
	
	ТекДанные.ВариантСписанияПревышения = ВариантСписания;
	ТекДанные.СсылкаНаАкт = СтруктураДанных.Акт;
	ТекДанные.СсылкаНаФайл = ПредопределенноеЗначение("Справочник.СМ_АктВыполненныхРаботПрисоединенныеФайлы.ПустаяСсылка");
	ТекДанные.КомментарийКФайлу = СтруктураДанных.Комментарий;
	ТекДанные.ВариантОтклонения = ПредопределенноеЗначение("Перечисление.СМ_ВариантыОтклоненияНормы.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФайлТЧРесурсыДефект(ВариантСписания,ТекДанные,СтруктураДанных)
	
	ТекДанные.ВариантСписанияПревышения = ВариантСписания;
	ТекДанные.СсылкаНаФайл = СтруктураДанных.Файл;
	ТекДанные.СсылкаНаАкт = ПредопределенноеЗначение("Документ.СМ_АктВыполненныхРабот.ПустаяСсылка");
	ТекДанные.КомментарийКФайлу = СтруктураДанных.Комментарий;
	ТекДанные.ВариантОтклонения = ПредопределенноеЗначение("Перечисление.СМ_ВариантыОтклоненияНормы.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсСобственный(Команда)
	
	ТекДанные 				= Элементы.РесурсыПозицийАкта.ТекущиеДанные;
	СтатусРесурса 			= ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.Собственный");
	ТекДанные.СтатусРесурса = СтатусРесурса;
	
КонецПроцедуры         

&НаКлиенте
Процедура РесурсПодрядчика(Команда)
	
	ТекДанные 				= Элементы.РесурсыПозицийАкта.ТекущиеДанные;
	СтатусРесурса 			= ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.Подрядчика");
	ТекДанные.СтатусРесурса = СтатусРесурса;

КонецПроцедуры

#КонецОбласти
