  
  #Область ОбработчикиСобытий
  
  Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	  
	  Ответственный = Пользователи.ТекущийПользователь();
	  
	ВидВерсии= Перечисления.А_ВидыВерсийБюджетов.Первичный;
	ВидПериода=Перечисления.А_ВидыПериодовБюджетирования.Месяц;
	  
  КонецПроцедуры
  
  Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	  
	  Если ОбменДанными.Загрузка Тогда
		  Возврат;
	  КонецЕсли;
	  
	  Если не ЗначениеЗаполнено(ВидВерсии) Тогда
		  ВидВерсии= Перечисления.А_ВидыВерсийБюджетов.Первичный;
	  КонецЕсли;
	  
	  Если не ЗначениеЗаполнено(ВидПериода) Тогда
		  ВидПериода=Перечисления.А_ВидыПериодовБюджетирования.Месяц;
	  КонецЕсли;
	  
  КонецПроцедуры
  
  Процедура ПриКопировании(ОбъектКопирования)
	  ДокументОснование=Документы.БюджетМесяц.ПустаяСсылка();
  КонецПроцедуры

  Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	  
	  	Движения.А_БюджетыНаМесяц.Записывать = Истина;
	
	
	Для Каждого Строка Из ПоказателиБДДС Цикл
		Движение	= Движения.А_БюджетыНаМесяц.Добавить();
		Движение.Регистратор		= Ссылка;
		Движение.Период				= Дата;
		Движение.Подразделение		= Подразделение;//Строка.Подразделение;
		Движение.СтатьяДвиженияДенежныхСредств	= Строка.СтатьяДвиженияДенежныхСредств;
		Если ВидПериода= Перечисления.А_ВидыПериодовБюджетирования.Неделя Тогда
			Движение.Месяц				= НачалоНедели(Месяц);	
		Иначе	
		     Движение.Месяц				= НачалоМесяца(Месяц);
		КонецЕсли;
		Движение.ВидОплаты				= Строка.ВидОплаты;
		Движение.Сумма				= Строка.Сумма  ;
		Движение.ВидПериода				= ВидПериода ;
		Если ЗначениеЗаполнено(Направление) Тогда
			Движение.Направление=Направление;
		КонецЕсли;
	КонецЦикла;
	
	Если ВидВерсии=Перечисления.А_ВидыВерсийБюджетов.Корректировка Тогда
		
		
		Для Каждого Строка Из ДокументОснование.ПоказателиБДДС Цикл
			Движение	= Движения.А_БюджетыНаМесяц.Добавить();
			Движение.Регистратор		= Ссылка;
			Движение.Период				= ДокументОснование.Дата;
			Движение.Подразделение		= Подразделение;//Строка.Подразделение;
			Движение.СтатьяДвиженияДенежныхСредств	= Строка.СтатьяДвиженияДенежныхСредств;
			Если ВидПериода= Перечисления.А_ВидыПериодовБюджетирования.Неделя Тогда
				Движение.Месяц				= НачалоНедели(ДокументОснование.Месяц);	
			Иначе	
				Движение.Месяц				= НачалоМесяца(ДокументОснование.Месяц);
			КонецЕсли;
			Движение.ВидОплаты				= Строка.ВидОплаты;
			Движение.Сумма				= -Строка.Сумма  ;
			Движение.ВидПериода				= ВидПериода ;
			Движение.Направление=Направление;
		КонецЦикла;
		
		
		
	КонецЕсли;  
	
  КонецПроцедуры
  
  #КонецОбласти
