
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если НЕ Пактум_Сервер.ИспользованиеСервисаВозможно() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Использование сервиса ""Пактум.Контрагент"" в текущем режиме работы недоступно.';uk='Використання сервісу ""Пактум.Контрагент"" в поточному режимі роботи недоступне.'"));
		Возврат;
	КонецЕсли; 
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("Обработка.Пактум_Настройка.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
