
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов	
	
КонецПроцедуры

&НаКлиенте
Процедура ЛимитыПодразделениеОбработкаВыбора(пЭлемент, пВыбранноеЗначение, пСтандартнаяОбработка)
	
	//Сава 2016/08
	//Если выбрали подразделение и оно не используется ( т.е. группировочное) 
	//Тютюн отключил заполнение подчиненніми подразделениями
	//лЗначения = ЛимитыПодразделениеОбработкаВыбораНаСервере(пВыбранноеЗначение);
	//Если НЕ лЗначения = Неопределено Тогда 
	//	пСтандартнаяОбработка = Ложь;
	//	
	//	лТекСтрока = ЭтаФорма.Элементы.Лимиты.ТекущиеДанные;
	//	лНовСтрока = Неопределено;
	//	
	//	Для Каждого лЗнач Из  лЗначения Цикл
	//		Если  Объект.Лимиты.НайтиСтроки(Новый Структура("Подразделение", лЗнач) ).Количество() > 0 Тогда 
	//			Продолжить;
	//		КонецЕсли;
	//		лНовСтрока 					= ?(лНовСтрока = Неопределено, лТекСтрока, Объект.Лимиты.Добавить());
	//		лНовСтрока.Подразделение 	= лЗнач;
	//		лНовСтрока.Сумма			= лТекСтрока.Сумма;
	//	КонецЦикла;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЛимитыПодразделениеОбработкаВыбораНаСервере(пПодразделение)
	
	лЗапрос 		= Новый Запрос();
	лЗапрос.Текст 	= "ВЫБРАТЬ
	              	  |	Т.Ссылка КАК Подразделение
	              	  |ИЗ
	              	  |	Справочник.Подразделения КАК Т
	              	  |ГДЕ
	              	  |	Т.Ссылка В ИЕРАРХИИ(&Подразделение)
	              	  |	И Т.НеИспользовать = ЛОЖЬ";
	лЗапрос.УстановитьПараметр("Подразделение", пПодразделение);
	
	Возврат Новый ФиксированныйМассив( лЗапрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Подразделение")  );
	
КонецФункции


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

