
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		ТаблицаИсточник = Параметры.ТаблицаИсточник.Выгрузить(Параметры.ПараметрыОтбора);
	Иначе
		ТаблицаИсточник = Параметры.ТаблицаИсточник.Выгрузить();
	КонецЕсли; 
	
	ТаблицаИсточник.Свернуть("Номенклатура,Характеристика,ХарактеристикиИспользуются", "Количество");
	СписокИзделий.Загрузить(ТаблицаИсточник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)

	Закрыть(СписокИзделий);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//

	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма, 
																			 "СписокИзделийХарактеристика",
																		     "СписокИзделий.ХарактеристикиИспользуются");

КонецПроцедуры

#КонецОбласти
