#Область ПрограммныйИнтерфейс

// Дополняет параметры отражения необходимыми для формирования проводок по регистрам оперативного учета.
// 
// Параметры:
// 	 ПараметрыОтражения - Структура - Параметры формирования проводок
//
Процедура ДополнитьПараметрыОтражения(ПараметрыОтражения) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ФормироватьПроводкиМеждународногоУчетаПоДаннымОперативного") Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтражения.Вставить("НастройкиОтражения", НастройкиОтраженияВМеждународномУчете());
	ПараметрыОтражения.Вставить("ТекстыЗапросовПоРегистрам", ТекстыЗапросовПоРегистрам());
	ПараметрыОтражения.Вставить("ТаблицаУточненияСчетов", ТаблицаУточненияСчетов());
	ИнициализироватьТаблицуНастройкиОпераций(ПараметрыОтражения.МенеджерВременныхТаблиц);
	ПараметрыОтражения.СвернутьТаблицуПроводок   = ПолучитьФункциональнуюОпцию("СворачиватьТаблицуПроводокМеждународногоУчета");
	ПараметрыОтражения.УдалитьНезначащиеПроводки = ПолучитьФункциональнуюОпцию("УдалятьНезначащиеПроводкиМеждународногоУчета");
	
КонецПроцедуры

// Выполняет формирование проводок международного учета по данным регистров оперативного учета.
// 
// Параметры:
// 	ПараметрыОтражения - Структура - Параметры формирования проводок.
// 	ТаблицаПроводок - ТаблицаЗначений - Таблица, в которую добавляются сформированные проводки.
//
Процедура Отразить(ПараметрыОтражения, ТаблицаПроводок) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ФормироватьПроводкиМеждународногоУчетаПоДаннымОперативного") Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ЭлементКоллекции Из ПараметрыОтражения.ТекстыЗапросовПоРегистрам Цикл
		ИмяРегистра = ЭлементКоллекции.Ключ;
		ТекстЗапроса = ЭлементКоллекции.Значение;
		ОтразитьДанныеРегистра(ИмяРегистра, ТекстЗапроса, ПараметрыОтражения, ТаблицаПроводок);
	КонецЦикла;
	
КонецПроцедуры

// Дополняет таблицы регистрации документа к отражению в международном учете по данным движений в оперативном.
// 
// Параметры:
// 	Объект - ДокументОбъект - Документ, который проводится.
// 	ДополнительныеСвойства - Структура - Дополнительные свойства РС ОтражениеДокументовВМеждународномУчете.
// 	ТаблицаРегистрации - ТаблицаЗначений - Таблица с данными регистрации к отражению, которую необходимо дополнить.
// 	                      Колонки таблицы:
// 	                      * Период - Дата - период регистрации (дата документа);
// 	                      * Организация - СправочникСсылка.Организации - организация по которой документ формирует проводки;
// 	                      * ДатаОтражения - Дата - дата, на которую документ формирует проводки;
// 	                      * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - отражаемая хозяйственная операция.
//
Процедура ДополнитьТаблицыРегистрацииКОтражению(Объект, ДополнительныеСвойства, ТаблицаРегистрации) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ФормироватьПроводкиМеждународногоУчетаПоДаннымОперативного") Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаОтражениеДокументовВМеждународномУчете = Неопределено;
	ПереданаТаблицаОтражениеДокументовВМеждународномУчете = 
		ДополнительныеСвойства.Свойство("ТаблицаОтражениеДокументовВМеждународномУчете", ТаблицаОтражениеДокументовВМеждународномУчете);
	
	Если ПереданаТаблицаОтражениеДокументовВМеждународномУчете  Тогда 
		// В модуле менеджера была подготовлена таблица данных для регистрации.
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаОтражениеДокументовВМеждународномУчете, ТаблицаРегистрации);
	Иначе
		// Документ регистрируется общим порядком - по движениям оборотных регистров.
		ТаблицаРегистрации = ТаблицаОтражениеДокументовВМеждународномУчете(Объект);
	КонецЕсли;
	
КонецПроцедуры

// Выполняет проверку наличия шаблонов проводок по хозяйственным операциям документов, требующих отражения.
// 
// Параметры:
// 	МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - Содержит временную таблицу ДокументыКОтражению
// 	              Колонки таблицы:
// 	              * Документ - ДокументСсылка - Документ, требующий отражения в учете
// 	              * Организация - СправочникСсылка.Организации - Организация, по которой требуется отражение в учете.
// 	              * УчетнаяПолитика - СправочникСсылка.УчетныеПолитики - Учетная политика, по которой требуется отражение в учете.
// 	Организация - СправочникСсылка.Организации - Организация, для которой необходимо выполнить проверку.
// 	
// Возвращаемое значение:
// 	ТаблицаЗначений - Таблица необходимых настроек:
// 	              * Операция - СправочникСсылка.НастройкиХозяйственныхОпераций - Операция, для которой требуется настройка.
// 	              * УчетнаяПолитика - СправочникСсылка.УчетныеПолитики - Учетная политика, для которой требуется настройка.
// 	              * ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операция документа.
// 	              * ИсточникДанных - Строка - Имя источника данных (регистра).
//
Функция ПроверитьПравилаОтражения(МенеджерВременныхТаблиц, Организация) Экспорт
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	
	Если Не ПолучитьФункциональнуюОпцию("ФормироватьПроводкиМеждународногоУчетаПоДаннымОперативного") Тогда
		Возврат ТаблицаОшибок;
	КонецЕсли;
		
	ТаблицаОшибок.Колонки.Добавить("Операция", Новый ОписаниеТипов("СправочникСсылка.НастройкиХозяйственныхОпераций"));
	ТаблицаОшибок.Колонки.Добавить("УчетнаяПолитика", Новый ОписаниеТипов("СправочникСсылка.УчетныеПолитики"));
	ТаблицаОшибок.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
	ТаблицаОшибок.Колонки.Добавить("ИсточникДанных", Новый ОписаниеТипов("Строка"));
	ТаблицаОшибок.Индексы.Добавить("Операция, УчетнаяПолитика");
	
	ИнициализироватьТаблицуНастройкиОпераций(МенеджерВременныхТаблиц);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХозоперацииКОтражению.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ХозоперацииКОтражению.Организация КАК Организация,
	|	ХозоперацииКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ПОМЕСТИТЬ ХозоперацииКОтражению
	|ИЗ
	|	(&ТекстЗапросаПоРегистрам) КАК ХозоперацииКОтражению
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныПроводок.Ссылка КАК ШаблонПроводки,
	|	ШаблоныПроводок.Операция КАК Операция,
	|	ПравилаОтражения.УчетнаяПолитика КАК УчетнаяПолитика
	|ПОМЕСТИТЬ ШаблоныПроводок
	|ИЗ
	|	Справочник.ШаблоныПроводокДляМеждународногоУчета КАК ШаблоныПроводок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ПравилаОтраженияВМеждународномУчете КАК ПравилаОтражения
	|	ПО
	|		ШаблоныПроводок.Ссылка = ПравилаОтражения.ШаблонПроводки
	|ИНДЕКСИРОВАТЬ ПО
	|	ШаблонПроводки,
	|	Операция,
	|	УчетнаяПолитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НастройкиХозопераций.Ссылка КАК Операция,
	|	НастройкиХозопераций.ИсточникДанных КАК ИсточникДанных,
	|	НастройкиХозопераций.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НастройкиХозопераций.Наименование КАК Наименование,
	|	ХозоперацииКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозопераций
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ХозоперацииКОтражению КАК ХозоперацииКОтражению
	|	ПО
	|		НастройкиХозопераций.ХозяйственнаяОперация = ХозоперацииКОтражению.ХозяйственнаяОперация
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ШаблоныПроводок КАК ШаблоныПроводок
	|	ПО
	|		НастройкиХозопераций.Ссылка = ШаблоныПроводок.Операция
	|		И ХозоперацииКОтражению.УчетнаяПолитика = ШаблоныПроводок.УчетнаяПолитика
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете КАК НеОтражаемыеХозоперации
	|	ПО
	|		НастройкиХозопераций.Ссылка = НеОтражаемыеХозоперации.Операция
	|		И ХозоперацииКОтражению.УчетнаяПолитика = НеОтражаемыеХозоперации.УчетнаяПолитика
	|ГДЕ
	|	НастройкиХозопераций.ИспользоватьВМеждународномУчете
	|	И ШаблоныПроводок.ШаблонПроводки ЕСТЬ NULL
	|	И НеОтражаемыеХозоперации.Операция ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	НастройкиХозопераций.Наименование
	|";
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ТекстыЗапросовПоРегистрам = ТекстыЗапросовПоРегистрам();
	ШаблонЗапросаПоРегистру =
	"ВЫБРАТЬ
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	(&ДанныеРегистра) КАК ДанныеРегистра
	|";
	МассивТекстов = Новый Массив;
	Для каждого ТекстыЗапроса Из ТекстыЗапросовПоРегистрам Цикл
		ТекстЗапросаПоРегистру = СтрЗаменить(ШаблонЗапросаПоРегистру, "&ДанныеРегистра", ТекстыЗапроса.Значение);
		МассивТекстов.Добавить(ТекстЗапросаПоРегистру);
	КонецЦикла;
	ТекстЗапросаПоРегистрам = СтрСоединить(МассивТекстов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстЗапросаПоРегистрам", ТекстЗапросаПоРегистрам);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТаблицаОшибок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	ТаблицаОшибок.Сортировать("Операция, УчетнаяПолитика");
	
	Возврат ТаблицаОшибок;
	
КонецФункции

// Заполняет таблицу документами, требующими отражения и формирующими  движения в опер. учете по определенной хоз. операции.
// 
// Параметры:
// 	ТаблицаДокументов - ТаблицаЗначений - Заполняемая таблица значений:
// 		* Документ - ДокументСсылка - Ссылка на документ;
// 		* Дата - Дата - Дата отражения;
// 		* Организация - СправочникСсылка.Организации - Организация, по которой документ формирует движения;
// 		* Комментарий - Строка - Комментарий к статусу отражения документа в международном учете;
// 	ХозяйственнаяОперация - СправочникСсылка.НастройкиХозяйственныхОпераций - Операция, по которой необходимо выполнить отбор.
// 	ИсточникДанных - Строка - Имя источник данных (регистра).
// 	УчетнаяПолитика - СправочникСсылка.УчетныеПолитики - Учетная политика для отбора документов.
// 	Организация - СправочникСсылка.Организации - Организация для отбора документов.
//
Процедура ЗаполнитьТаблицуДокументовПоОперации(ТаблицаДокументов, ХозяйственнаяОперация, ИсточникДанных, УчетнаяПолитика, Организация) Экспорт
	
	ТаблицаДокументов.Очистить();
	
	ТекстыЗапросов = ТекстыЗапросовПоРегистрам();
	Если ЗначениеЗаполнено(ИсточникДанных) Тогда 
		ТекстЗапросаДанныеРегистра = ТекстыЗапросов[ИсточникДанных];
		Если ЗначениеЗаполнено(ТекстЗапросаДанныеРегистра) Тогда
			ЗаполнитьТаблицуДокументовПоТекстуЗапроса(ТаблицаДокументов, ТекстЗапросаДанныеРегистра, ХозяйственнаяОперация, УчетнаяПолитика, Организация);
		КонецЕсли;	
	Иначе                         
		Для Каждого ЭлементТекстыЗапросов Из ТекстыЗапросов Цикл
			ТекстЗапросаДанныеРегистра = ЭлементТекстыЗапросов.Значение;
			Если НЕ ЗначениеЗаполнено(ТекстЗапросаДанныеРегистра) Тогда
				Продолжить;
			КонецЕсли;	
			ЗаполнитьТаблицуДокументовПоТекстуЗапроса(ТаблицаДокументов, ТекстЗапросаДанныеРегистра, ХозяйственнаяОперация, УчетнаяПолитика, Организация);
		КонецЦикла;
	КонецЕсли;	
	
	
КонецПроцедуры      

// Заполняет таблицу документами, требующими отражения и формирующими движения в опер. учете по определенной хоз. операции и тексту запроса по определенному источнику
// 
// Параметры:        
// 	ТаблицаДокументов - ТаблицаЗначений - Заполняемая таблица значений:
// 		* Документ - ДокументСсылка - Ссылка на документ;
// 		* Дата - Дата - Дата отражения;
// 		* Организация - СправочникСсылка.Организации - Организация, по которой документ формирует движения;
// 		* Комментарий - Строка - Комментарий к статусу отражения документа в международном учете;
// 	ТекстЗапросаДанныеРегистра - Строка - текст запроса по источнику.
// 	ХозяйственнаяОперация - СправочникСсылка.НастройкиХозяйственныхОпераций - Операция, по которой необходимо выполнить отбор.
// 	УчетнаяПолитика - СправочникСсылка.УчетныеПолитики - Учетная политика для отбора документов.
// 	Организация - СправочникСсылка.Организации - Организация для отбора документов.
//
Процедура ЗаполнитьТаблицуДокументовПоТекстуЗапроса(ТаблицаДокументов, ТекстЗапросаДанныеРегистра, ХозяйственнаяОперация, УчетнаяПолитика, Организация) 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументыКОтражению.ДатаОтражения КАК ДатаОтражения,
	|	ДокументыКОтражению.Регистратор КАК Регистратор,
	|	ДокументыКОтражению.Организация КАК Организация,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика,
	|	ДокументыКОтражению.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ДокументыКОтражению
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВМеждународномУчете КАК ДокументыКОтражению
	|	
	|ГДЕ
	|	ДокументыКОтражению.Организация = &Организация
	|	И ДокументыКОтражению.УчетнаяПолитика = &УчетнаяПолитика
	|	И ДокументыКОтражению.Статус В (
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияВМеждународномУчете.КОтражениюВУчете),
	|		ЗНАЧЕНИЕ(Перечисление.СтатусыОтраженияВМеждународномУчете.ОтсутствуютПравилаОтраженияВУчете))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	ДатаОтражения,
	|	Регистратор
	|;
	|ВЫБРАТЬ
	|	НастройкиХозяйственныхОпераций.ХозяйственнаяОперация КАК Операция,
	|	НастройкиХозяйственныхОпераций.ИсточникДанных КАК ИсточникДанных
	|ПОМЕСТИТЬ НастройкиОпераций
	|ИЗ
	|	Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|ГДЕ
	|	НастройкиХозяйственныхОпераций.ИспользоватьВМеждународномУчете = ИСТИНА
	|	И НастройкиХозяйственныхОпераций.ЭтоГруппа = ЛОЖЬ
	|	И НастройкиХозяйственныхОпераций.ПометкаУдаления = ЛОЖЬ
	|	И НастройкиХозяйственныхОпераций.ИсточникДанных <> """"
	|;
	|
	|/////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеРегистра.Регистратор КАК Документ,
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.УчетнаяПолитика КАК УчетнаяПолитика
	|ПОМЕСТИТЬ ДанныеРегистра
	|ИЗ 
	|	(&ТекстЗапросаДанныеРегистра) КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация = &ХозяйственнаяОперация
	|ИНДЕКСИРОВАТЬ ПО
	|	ДанныеРегистра.Регистратор,
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Организация
	|;
	|
	|/////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРегистра.Документ КАК Документ,
	|	ДанныеРегистра.Период КАК Дата,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДокументыКОтражению.Комментарий КАК Комментарий
	|ИЗ
	|	ДанныеРегистра КАК ДанныеРегистра
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Документ = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И ДанныеРегистра.УчетнаяПолитика = ДокументыКОтражению.УчетнаяПолитика
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|
	|";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекстЗапросаДанныеРегистра", ТекстЗапросаДанныеРегистра);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", ХозяйственнаяОперация);
	Запрос.УстановитьПараметр("УчетнаяПолитика", УчетнаяПолитика);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ДанныеРегистра = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаДанныеРегистра Из ДанныеРегистра Цикл 
		СтрокаТаблицаДокументов = ТаблицаДокументов.Добавить();		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицаДокументов, СтрокаДанныеРегистра);
	КонецЦикла;
	
КонецПроцедуры

// Выполняет проверку правил отражения перед их записью в регистр ПравилаОтраженияВМеждународномУчете.
//
// Параметры:
// 	ПравилаОтраженияВМеждународномУчете - ТаблицаЗначений - Выгрузка набора записей регистра ПравилаОтраженияВМеждународномУчете.
// 	Отказ - Булево - Признак отказа записи, устанавливается в случае ошибки.
//
Процедура ПередЗаписьюПравилОтражения(ПравилаОтраженияВМеждународномУчете, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШаблоныПроводок.УчетнаяПолитика КАК УчетнаяПолитика,
	|	ШаблоныПроводок.ШаблонПроводки КАК ШаблонПроводки
	|ПОМЕСТИТЬ ШаблоныПроводок
	|ИЗ
	|	&ШаблоныПроводок КАК ШаблоныПроводок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ШаблоныПроводок.ШаблонПроводки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШаблоныПроводок.УчетнаяПолитика КАК УчетнаяПолитика,
	|	ШаблоныПроводок.ШаблонПроводки КАК ШаблонПроводки,
	|	ДанныеСправочника.Операция КАК Операция
	|ПОМЕСТИТЬ ХозяйственныеОперации
	|ИЗ
	|	ШаблоныПроводок КАК ШаблоныПроводок
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ШаблоныПроводокДляМеждународногоУчета КАК ДанныеСправочника
	|	ПО
	|		ШаблоныПроводок.ШаблонПроводки = ДанныеСправочника.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДанныеСправочника.Операция
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ХозяйственныеОперации.ШаблонПроводки КАК ШаблонПроводки,
	|	ХозяйственныеОперации.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	ХозяйственныеОперации КАК ХозяйственныеОперации
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете КАК НеОтражаемыеХозоперации
	|	ПО
	|		ХозяйственныеОперации.УчетнаяПолитика = НеОтражаемыеХозоперации.УчетнаяПолитика
	|		И ХозяйственныеОперации.Операция = НеОтражаемыеХозоперации.Операция
	|";
	
	Запрос.УстановитьПараметр("ШаблоныПроводок", ПравилаОтраженияВМеждународномУчете);
	ВыборкаПоНеОтражаемымОперациям = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаПоНеОтражаемымОперациям.Следующий() Цикл
		ТекстСообщения = 
			СтрШаблон(НСтр("ru='Хозяйственная операция, используемая в шаблоне проводки ""%1"", исключена из учетной политики ""%2"".';uk='Господарська операція, яка використовується в шаблоні проводки ""%1"", виключена з облікової політики ""%2"".'"),
				ВыборкаПоНеОтражаемымОперациям.ШаблонПроводки, 
				ВыборкаПоНеОтражаемымОперациям.УчетнаяПолитика);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	КонецЦикла;
	
КонецПроцедуры


// См. ОбщийМодуль.ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов()
// 
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	#Область ОшибкиНастройкиШаблоновПроводок
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОшибкиНастройкиШаблоновПроводок);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетовУТПереопределяемый.ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область ОшибкиУточненияСчетов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ОшибкиУточненияСчетов);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетовУТПереопределяемый.ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТекстыЗапросовДанныхРегистров

Функция ТекстыЗапросовПоРегистрам() Экспорт

	ТекстыЗапросов = Новый Структура();
	ТекстыЗапросов.Вставить("АмортизацияНМА", ТекстЗапросаАмортизацияНМА());
	ТекстыЗапросов.Вставить("АмортизацияОС", ТекстЗапросаАмортизацияОС());
	ТекстыЗапросов.Вставить("ВыручкаИСебестоимостьПродаж", ТекстЗапросаВыручкаИСебестоимостьПродаж());
	ТекстыЗапросов.Вставить("ДвиженияДенежныеСредстваДоходыРасходы", ТекстЗапросаДвиженияДенежныеСредстваДоходыРасходы());
	ТекстыЗапросов.Вставить("ДвиженияДенежныеСредстваКонтрагент", ТекстЗапросаДвиженияДенежныеСредстваКонтрагент());
	ТекстыЗапросов.Вставить("ДвиженияДенежныхСредств", ТекстЗапросаДвиженияДенежныхСредств());
	ТекстыЗапросов.Вставить("ДвиженияДоходыРасходыПрочиеАктивыПассивы", ТекстЗапросаДвиженияДоходыРасходыПрочиеАктивыПассивы());
	ТекстыЗапросов.Вставить("ДвиженияКонтрагентДоходыРасходы", ТекстЗапросаДвиженияКонтрагентДоходыРасходы());
	ТекстыЗапросов.Вставить("ДвиженияКонтрагентКонтрагент", ТекстЗапросаДвиженияКонтрагентКонтрагент());
	ТекстыЗапросов.Вставить("ДвиженияНоменклатураДоходыРасходы", ТекстЗапросаДвиженияНоменклатураДоходыРасходы());
	ТекстыЗапросов.Вставить("ДвиженияНоменклатураНоменклатура", ТекстЗапросаДвиженияНоменклатураНоменклатура());
	ТекстыЗапросов.Вставить("Закупки", ТекстЗапросаЗакупки());
	ТекстыЗапросов.Вставить("ПрочиеРасходы", ТекстЗапросаПрочиеРасходы());
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		ТекстыЗапросов.Вставить("РасчетыСКлиентамиПоСрокам", ТекстЗапросаРасчетыСКлиентамиПоСрокам());
		ТекстыЗапросов.Вставить("РасчетыСПоставщикамиПоСрокам", ТекстЗапросаРасчетыСПоставщикамиПоСрокам());
	Иначе
		ТекстыЗапросов.Вставить("РасчетыСКлиентамиПоДокументам", ТекстЗапросаРасчетыСКлиентамиПоДокументам());
		ТекстыЗапросов.Вставить("РасчетыСПоставщикамиПоДокументам", ТекстЗапросаРасчетыСПоставщикамиПоДокументам());
	КонецЕсли;
	ТекстыЗапросов.Вставить("СтоимостьНМА", ТекстЗапросаСтоимостьНМА());
	ТекстыЗапросов.Вставить("СтоимостьОС", ТекстЗапросаСтоимостьОС());
	ТекстыЗапросов.Вставить("КорректировкиНДСПартий", ТекстЗапросаКорректировкиНДСПартий());
	ТекстыЗапросов.Вставить("ДетализацияПартийТоваровДляНДС2_4", ТекстЗапросаДетализацияПартийТоваровДляНДС2_4());
	ТекстыЗапросов.Вставить("ДетализацияПартийТоваровДляНДС", ТекстЗапросаДетализацияПартийТоваровДляНДС());
	ТекстыЗапросов.Вставить("НДСРеестрВыданныхНалоговыхДокументов", ТекстЗапросаНДСРеестрВыданныхНалоговыхДокументов());
	ТекстыЗапросов.Вставить("НДСРеестрПолученныхНалоговыхДокументов", ТекстЗапросаНДСРеестрПолученныхНалоговыхДокументов());
    ТекстыЗапросов.Вставить("ПрочиеРасходыНезавершенногоПроизводства", ТекстЗапросаПрочиеРасходыНезавершенногоПроизводства());
    ТекстыЗапросов.Вставить("ТрудозатратыНезавершенногоПроизводства", ТекстЗапросаТрудозатратыНезавершенногоПроизводства());
	
	МеждународныйУчетПоДаннымРеглУчета.ДополнитьТекстыЗапросовПоРегистрам(ТекстыЗапросов);
	
	Возврат ТекстыЗапросов;

КонецФункции

Функция ТекстЗапросаВыручкаИСебестоимостьПродаж()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	
	|	ДанныеРегистра.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ДанныеРегистра.Номенклатура КАК Номенклатура,
	|	ДанныеРегистра.Характеристика КАК Характеристика,
	|	ДанныеРегистра.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ДанныеРегистра.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|	ДанныеРегистра.Склад КАК Склад,
	|	ДанныеРегистра.СкладПодразделение КАК СкладПодразделение,
	|	ДанныеРегистра.ТипЗапасов КАК ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|	
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер КАК Партнер,
	|	ДанныеРегистра.Контрагент КАК Контрагент,
	|	ДанныеРегистра.Поставщик КАК Поставщик,
	|	ДанныеРегистра.КонтрагентПоставщика КАК КонтрагентПоставщика,
	|	ДанныеРегистра.Соглашение КАК Соглашение,
	|	ДанныеРегистра.Договор КАК Договор,
	|	ДанныеРегистра.ЗаказКлиента КАК ЗаказКлиента,
	|	
	|	СУММА(ДанныеРегистра.СуммаВыручки) КАК СуммаВыручки,
	|	СУММА(ДанныеРегистра.СуммаВыручкиБезНДС) КАК СуммаВыручкиБезНДС,
	|	СУММА(ДанныеРегистра.СуммаВыручки - ДанныеРегистра.СуммаВыручкиБезНДС) КАК СуммаНДС,
	|	СУММА(ДанныеРегистра.СуммаВыручкиСНДСРегл) КАК СуммаВыручкиСНДСРегл,
	|	СУММА(ДанныеРегистра.СуммаВыручкиРегл) КАК СуммаВыручкиРегл,
	|	СУММА(ДанныеРегистра.СуммаВыручкиСНДСРегл - ДанныеРегистра.СуммаВыручкиРегл) КАК СуммаНДСРегл,
	|	
	|	СУММА(ДанныеРегистра.Стоимость) КАК Стоимость,
	|	СУММА(ДанныеРегистра.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДанныеРегистра.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(ДанныеРегистра.СтоимостьРегл) КАК СтоимостьРегл,
	|	
	|	СУММА(ДанныеРегистра.СтоимостьЗабалансовая) КАК СтоимостьЗабалансовая,
	|	СУММА(ДанныеРегистра.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
	|
	|	СУММА(ДанныеРегистра.ДопРасходы) КАК ДопРасходы,
	|	СУММА(ДанныеРегистра.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(ДанныеРегистра.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(ДанныеРегистра.ДопРасходыРегл) КАК ДопРасходыРегл,
	|	СУММА(ДанныеРегистра.ДопРасходы - ДанныеРегистра.ДопРасходыБезНДС) КАК СуммаНДСДополнительныхРасходов,
	|	
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|	
	|	СУММА(ДанныеРегистра.Трудозатраты) КАК Трудозатраты,
	|	СУММА(ДанныеРегистра.ТрудозатратыУпр) КАК ТрудозатратыУпр,
	|	СУММА(ДанныеРегистра.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|	
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	|	
	|	СУММА(ДанныеРегистра.СебестоимостьУпр) КАК СебестоимостьУпр,
	|	СУММА(ДанныеРегистра.СебестоимостьРегл) КАК СебестоимостьРегл,
	|	СУММА(ДанныеРегистра.СебестоимостьУпрСНДС) КАК СебестоимостьУпрСНДС,
	|	СУММА(ДанныеРегистра.СебестоимостьУпрБезНДС) КАК СебестоимостьУпрБезНДС,
	|	СУММА(ДанныеРегистра.СуммаНДСВходящийРегл) КАК СуммаНДСВходящийРегл,
	|	
	|	ДанныеРегистра.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СУММА(ДанныеРегистра.СуммаВВалютеВзаиморасчетов) КАК СуммаВВалютеВзаиморасчетов,
	|	СУММА(ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов) КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	СУММА(ДанныеРегистра.СуммаВВалютеВзаиморасчетов - ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов) КАК СуммаНДСВВалютеВзаиморасчетов,
	|	
	|	ДанныеРегистра.ВалютаДокумента КАК ВалютаДокумента,
	|	СУММА(ДанныеРегистра.СуммаВВалютеДокумента) КАК СуммаВВалютеДокумента,
	|	СУММА(ДанныеРегистра.СуммаБезНДСВВалютеДокумента) КАК СуммаБезНДСВВалютеДокумента,
	|	СУММА(ДанныеРегистра.СуммаВВалютеДокумента - ДанныеРегистра.СуммаБезНДСВВалютеДокумента) КАК СуммаНДСВВалютеДокумента,
	|	
	|	СУММА(ДанныеРегистра.Количество) КАК Количество,
	|	
	|	ДанныеРегистра.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ДанныеРегистра.ИсточникГФУРасчетов КАК ИсточникГФУРасчетов,
	|	ДанныеРегистра.ГФУНоменклатуры КАК ГФУНоменклатуры,
	|	ДанныеРегистра.ГФУРасчетов КАК ГФУРасчетов,
	|	ДанныеРегистра.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеРегистра.Период КАК Период,
	|		ДанныеРегистра.Регистратор КАК Регистратор,
	|		ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|		ДанныеРегистра.Подразделение КАК Подразделение,
	|	
	|		ДанныеРегистра.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		ДанныеРегистра.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|		ДанныеРегистра.Склад КАК Склад,
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.Склады
	|				ТОГДА ДанныеРегистра.Склад.Подразделение
	|			ИНАЧЕ ДанныеРегистра.Склад
	|		КОНЕЦ КАК СкладПодразделение,
	|		ДанныеРегистра.ТипЗапасов КАК ТипЗапасов,
	|		ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|	
	|		ДанныеРегистра.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|		ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|		ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|		ДанныеРегистра.АналитикаУчетаПартий.Поставщик КАК Поставщик,
	|		ДанныеРегистра.АналитикаУчетаПартий.Контрагент КАК КонтрагентПоставщика,
	|		ДанныеРегистра.Соглашение КАК Соглашение,
	|		ДанныеРегистра.Договор КАК Договор,
	|		ДанныеРегистра.ЗаказКлиента КАК ЗаказКлиента,
	|		
	|		ДанныеРегистра.СуммаВыручки КАК СуммаВыручки,
	|		ДанныеРегистра.СуммаВыручкиБезНДС КАК СуммаВыручкиБезНДС,
	|		ДанныеРегистра.СуммаВыручкиСНДСРегл КАК СуммаВыручкиСНДСРегл,
	|		ДанныеРегистра.СуммаВыручкиРегл КАК СуммаВыручкиРегл,
	|	
	|		ДанныеРегистра.Стоимость КАК Стоимость,
	|		ДанныеРегистра.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		ДанныеРегистра.СтоимостьУпр КАК СтоимостьУпр,
	|		ДанныеРегистра.СтоимостьРегл КАК СтоимостьРегл,
	|
	|		ДанныеРегистра.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|		ДанныеРегистра.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|
	|		ДанныеРегистра.ДопРасходы КАК ДопРасходы,
	|		ДанныеРегистра.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|		ДанныеРегистра.ДопРасходыУпр КАК ДопРасходыУпр,
	|		ДанныеРегистра.ДопРасходыРегл КАК ДопРасходыРегл,
	|
	|		ДанныеРегистра.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|		ДанныеРегистра.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|		ДанныеРегистра.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|		ДанныеРегистра.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|
	|		ДанныеРегистра.ТрудозатратыУпр КАК Трудозатраты,
	|		ДанныеРегистра.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|		ДанныеРегистра.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|
	|		ДанныеРегистра.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|		ДанныеРегистра.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|		ДанныеРегистра.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|		ДанныеРегистра.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|
	|		ДанныеРегистра.СтоимостьУпр + ДанныеРегистра.ДопРасходыУпр + ДанныеРегистра.ПостатейныеПостоянныеУпр + ДанныеРегистра.ТрудозатратыУпр + ДанныеРегистра.ПостатейныеПеременныеУпр КАК СебестоимостьУпр,
	|		ДанныеРегистра.СтоимостьРегл + ДанныеРегистра.ДопРасходыРегл + ДанныеРегистра.ПостатейныеПостоянныеРегл + ДанныеРегистра.ТрудозатратыРегл + ДанныеРегистра.ПостатейныеПеременныеРегл КАК СебестоимостьРегл,
	|       ДанныеРегистра.Стоимость + ДанныеРегистра.ДопРасходы + ДанныеРегистра.ПостатейныеПостоянныеСНДС + ДанныеРегистра.Трудозатраты + ДанныеРегистра.ПостатейныеПеременныеСНДС КАК СебестоимостьУпрСНДС, 
	|		ДанныеРегистра.СтоимостьБезНДС + ДанныеРегистра.ДопРасходыБезНДС + ДанныеРегистра.ПостатейныеПостоянныеБезНДС + ДанныеРегистра.Трудозатраты + ДанныеРегистра.ПостатейныеПеременныеБезНДС КАК СебестоимостьУпрБезНДС,
	|		ДанныеРегистра.НДСРегл КАК СуммаНДСВходящийРегл,
	|	
	|		ДанныеРегистра.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|		ДанныеРегистра.СуммаВВалютеВзаиморасчетов КАК СуммаВВалютеВзаиморасчетов,
	|		ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	
	|		ДанныеРегистра.ВалютаДокумента КАК ВалютаДокумента,
	|		ДанныеРегистра.СуммаВВалютеДокумента КАК СуммаВВалютеДокумента,
	|		ДанныеРегистра.СуммаБезНДСВВалютеДокумента КАК СуммаБезНДСВВалютеДокумента,
	|		
	|		ДанныеРегистра.Количество КАК Количество,
	|	
	|		ДанныеРегистра.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|		ДанныеРегистра.ИсточникГФУРасчетов КАК ИсточникГФУРасчетов,
	|		ДанныеРегистра.ИсточникГФУНоменклатуры.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
	|		ДанныеРегистра.ИсточникГФУРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|		ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаПартнеров
	|		ПО
	|			ДанныеРегистра.АналитикаУчетаПоПартнерам = АналитикаПартнеров.КлючАналитики
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО
	|			ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|			И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|			И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|	ГДЕ
	|		ДанныеРегистра.Активность
	// Отсечем движения сделанные расчетом себестоимости (они попадут в результат после выполнения объединения со следующим запросом):
	|		И ДанныеРегистра.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ДанныеРегистра.Период КАК Период,
	|		ДанныеРегистра.ДокументДвижения КАК Регистратор,
	|		ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|		ДанныеРегистра.Подразделение КАК Подразделение,
	|	
	|		ДанныеРегистра.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		ДанныеРегистра.АналитикаУчетаНаборов КАК АналитикаУчетаНаборов,
	|		ДанныеРегистра.Склад КАК Склад,
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.Склады
	|				ТОГДА ДанныеРегистра.Склад.Подразделение
	|			ИНАЧЕ ДанныеРегистра.Склад
	|		КОНЕЦ КАК СкладПодразделение,
	|		ДанныеРегистра.ТипЗапасов КАК ТипЗапасов,
	|		ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|	
	|		ДанныеРегистра.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|		ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|		ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|		ДанныеРегистра.АналитикаУчетаПартий.Поставщик КАК Поставщик,
	|		ДанныеРегистра.АналитикаУчетаПартий.Контрагент КАК КонтрагентПоставщика,
	|		ДанныеРегистра.Соглашение КАК Соглашение,
	|		ДанныеРегистра.Договор КАК Договор,
	|		ДанныеРегистра.ЗаказКлиента КАК ЗаказКлиента,
	|		
	|		ДанныеРегистра.СуммаВыручки КАК СуммаВыручки,
	|		ДанныеРегистра.СуммаВыручкиБезНДС КАК СуммаВыручкиБезНДС,
	|		ДанныеРегистра.СуммаВыручкиСНДСРегл КАК СуммаВыручкиСНДСРегл,
	|		ДанныеРегистра.СуммаВыручкиРегл КАК СуммаВыручкиРегл,
	|	
	|		ДанныеРегистра.Стоимость КАК Стоимость,
	|		ДанныеРегистра.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		ДанныеРегистра.СтоимостьУпр КАК СтоимостьУпр,
	|		ДанныеРегистра.СтоимостьРегл КАК СтоимостьРегл,
	|
	|		ДанныеРегистра.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|		ДанныеРегистра.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|
	|		ДанныеРегистра.ДопРасходы КАК ДопРасходы,
	|		ДанныеРегистра.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|		ДанныеРегистра.ДопРасходыУпр КАК ДопРасходыУпр,
	|		ДанныеРегистра.ДопРасходыРегл КАК ДопРасходыРегл,
	|
	|		ДанныеРегистра.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|		ДанныеРегистра.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|		ДанныеРегистра.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|		ДанныеРегистра.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|
	|		ДанныеРегистра.Трудозатраты КАК Трудозатраты,
	|		ДанныеРегистра.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|		ДанныеРегистра.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|
	|		ДанныеРегистра.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|		ДанныеРегистра.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|		ДанныеРегистра.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|		ДанныеРегистра.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|
	|		ДанныеРегистра.СтоимостьУпр + ДанныеРегистра.ДопРасходыУпр + ДанныеРегистра.ПостатейныеПостоянныеУпр + ДанныеРегистра.ТрудозатратыУпр + ДанныеРегистра.ПостатейныеПеременныеУпр КАК СебестоимостьУпр,
	|		ДанныеРегистра.СтоимостьРегл + ДанныеРегистра.ДопРасходыРегл + ДанныеРегистра.ПостатейныеПостоянныеРегл + ДанныеРегистра.ТрудозатратыРегл + ДанныеРегистра.ПостатейныеПеременныеРегл КАК СебестоимостьРегл,
	|       ДанныеРегистра.Стоимость + ДанныеРегистра.ДопРасходы + ДанныеРегистра.ПостатейныеПостоянныеСНДС + ДанныеРегистра.Трудозатраты + ДанныеРегистра.ПостатейныеПеременныеСНДС КАК СебестоимостьУпрСНДС, 
	|		ДанныеРегистра.СтоимостьБезНДС + ДанныеРегистра.ДопРасходыБезНДС + ДанныеРегистра.ПостатейныеПостоянныеБезНДС + ДанныеРегистра.Трудозатраты + ДанныеРегистра.ПостатейныеПеременныеБезНДС КАК СебестоимостьУпрБезНДС,
	|		ДанныеРегистра.НДСРегл КАК СуммаНДСВходящийРегл,
	|	
	|		ДанныеРегистра.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|		ДанныеРегистра.СуммаВВалютеВзаиморасчетов КАК СуммаВВалютеВзаиморасчетов,
	|		ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	
	|		ДанныеРегистра.ВалютаДокумента КАК ВалютаДокумента,
	|		ДанныеРегистра.СуммаВВалютеДокумента КАК СуммаВВалютеДокумента,
	|		ДанныеРегистра.СуммаБезНДСВВалютеДокумента КАК СуммаБезНДСВВалютеДокумента,
	|		
	|		ДанныеРегистра.Количество КАК Количество,
	|	
	|		ДанныеРегистра.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|		ДанныеРегистра.ИсточникГФУРасчетов КАК ИсточникГФУРасчетов,
	|		ДанныеРегистра.ИсточникГФУНоменклатуры.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
	|		ДанныеРегистра.ИсточникГФУРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|		ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|	ИЗ
	|		РегистрНакопления.ВыручкаИСебестоимостьПродаж КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО
	|			ДанныеРегистра.ДокументДвижения = ДокументыКОтражению.Регистратор
	|			И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|			И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|	ГДЕ
	|		ДанныеРегистра.Активность
	|	) КАК ДанныеРегистра
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор),
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиНоменклатуры,
	|	ДанныеРегистра.Номенклатура,
	|	ДанныеРегистра.Характеристика,
	|	ДанныеРегистра.ТипНоменклатуры,
	|	ДанныеРегистра.АналитикаУчетаНаборов,
	|	ДанныеРегистра.Поставщик,
	|	ДанныеРегистра.КонтрагентПоставщика,
	|	ДанныеРегистра.Склад,
	|	ДанныеРегистра.СкладПодразделение,
	|	ДанныеРегистра.ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов,
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер,
	|	ДанныеРегистра.Контрагент,
	|	ДанныеРегистра.ВидЗапасов.Контрагент,
	|	ДанныеРегистра.Соглашение,
	|	ДанныеРегистра.Договор,
	|	ДанныеРегистра.ЗаказКлиента,
	|	ДанныеРегистра.ВалютаВзаиморасчетов,
	|	ДанныеРегистра.ВалютаДокумента,
	|	ДанныеРегистра.ИсточникГФУНоменклатуры,
	|	ДанныеРегистра.ИсточникГФУРасчетов,
	|	ДанныеРегистра.ГФУНоменклатуры,
	|	ДанныеРегистра.ГФУРасчетов,
	|	ДанныеРегистра.УчетнаяПолитика
	|";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаДвиженияДенежныеСредстваДоходыРасходы()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ПодразделениеДоходовРасходов КАК ПодразделениеДоходовРасходов,
	|
	|	ДанныеРегистра.НаправлениеДеятельностиДС КАК НаправлениеДеятельностиДС,
	|	ДанныеРегистра.ДенежныеСредства КАК ДенежныеСредства,
	|	ДанныеРегистра.ДенежныеСредства.Подразделение КАК ДенежныеСредстваПодразделение,
	|	ДанныеРегистра.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.НаправлениеДеятельностиСтатьи КАК НаправлениеДеятельностиСтатьи,
	|	ДанныеРегистра.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов КАК АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеРегистра.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяДоходовРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|			ТОГДА ДанныеРегистра.АналитикаДоходов
	|		ИНАЧЕ ДанныеРегистра.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаДоходовРасходовПодразделение,
	|	ДанныеРегистра.СтавкаНДС КАК СтавкаНДС,
	|
	|	ДанныеРегистра.Сумма КАК Сумма,
	|	ДанныеРегистра.СуммаРегл КАК СуммаРегл,
	|	ДанныеРегистра.СуммаВВалюте КАК СуммаВВалюте,
	|
	|	ДанныеРегистра.Сумма - ДанныеРегистра.СуммаНДС КАК СуммаБезНДС,
	|	ДанныеРегистра.СуммаРегл - ДанныеРегистра.СуммаНДСРегл КАК СуммаРеглБезНДС,
	|	ДанныеРегистра.СуммаВВалюте - ДанныеРегистра.СуммаНДСВВалютеПлатежа КАК СуммаБезНДСВВалютеПлатежа,
	|
	|	ДанныеРегистра.СуммаНДС КАК СуммаНДС,
	|	ДанныеРегистра.СуммаНДСРегл КАК СуммаНДСРегл,
	|	ДанныеРегистра.СуммаНДСВВалютеПлатежа КАК СуммаНДСВВалютеПлатежа,
	|
	|	ДанныеРегистра.СуммаКВыплатеВРамкахЛимита + ДанныеРегистра.СуммаКВыплатеСверхЛимита КАК СуммаКВыплате,
	|	ДанныеРегистра.СуммаКВыплатеВРамкахЛимита КАК СуммаКВыплатеВРамкахЛимита,
	|	ДанныеРегистра.СуммаКВыплатеСверхЛимита КАК СуммаКВыплатеСверхЛимита,
	|	
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.ИсточникГФУДенежныхСредств ССЫЛКА Справочник.ДоговорыКредитовИДепозитов
	|			ТОГДА ДанныеРегистра.ИсточникГФУДенежныхСредств.ГруппаФинансовогоУчетаДенежныхСредств
	|		ИНАЧЕ ДанныеРегистра.ИсточникГФУДенежныхСредств.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГФУДенежныхСредств,
	|	ДанныеРегистра.ИсточникГФУДоходовРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныеСредстваДоходыРасходы КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДвиженияДенежныеСредстваКонтрагент()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|	ДанныеРегистра.ДенежныеСредства КАК ДенежныеСредства,
	|	ДанныеРегистра.НаправлениеДеятельностиДС КАК НаправлениеДеятельностиДС,
	|	ДанныеРегистра.ДенежныеСредства.Подразделение КАК ДенежныеСредстваПодразделение,
	|	ДанныеРегистра.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ДанныеРегистра.ВалютаПлатежа КАК ВалютаПлатежа,
	|
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер КАК Партнер,
	|	ДанныеРегистра.Контрагент КАК Контрагент,
	|	ДанныеРегистра.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК ОбъектРасчетовПодразделение,
	|	ДанныеРегистра.РасчетныйДокумент КАК РасчетныйДокумент,
	|	
	|	ДанныеРегистра.СуммаОплаты КАК СуммаОплаты,
	|	ДанныеРегистра.СуммаОплатыРегл КАК СуммаОплатыРегл,
	|	ДанныеРегистра.СуммаОплатыВВалютеПлатежа КАК СуммаОплатыВВалютеПлатежа,
	|	ДанныеРегистра.СуммаПостоплаты КАК СуммаПостоплаты,
	|	ДанныеРегистра.СуммаПостоплатыРегл КАК СуммаПостоплатыРегл,
	|	ДанныеРегистра.СуммаПостоплатыВВалютеПлатежа КАК СуммаПостоплатыВВалютеПлатежа,
	|	ДанныеРегистра.СуммаПредоплаты КАК СуммаПредоплаты,
	|	ДанныеРегистра.СуммаПредоплатыРегл КАК СуммаПредоплатыРегл,
	|	ДанныеРегистра.СуммаПредоплатыВВалютеПлатежа КАК СуммаПредоплатыВВалютеПлатежа,
	|	
	|	ДанныеРегистра.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДанныеРегистра.СуммаОплатыВВалютеВзаиморасчетов КАК СуммаОплатыВВалютеВзаиморасчетов,
	|	ДанныеРегистра.СуммаПостоплатыВВалютеВзаиморасчетов КАК СуммаПостоплатыВВалютеВзаиморасчетов,
	|	ДанныеРегистра.СуммаПредоплатыВВалютеВзаиморасчетов КАК СуммаПредоплатыВВалютеВзаиморасчетов,
	|
	|	ДанныеРегистра.СтавкаНДС КАК СтавкаНДС,
	|	ДанныеРегистра.СуммаНДС КАК СуммаНДС,
	|	ДанныеРегистра.СуммаНДСРегл КАК СуммаНДСРегл,
	|	ДанныеРегистра.СуммаНДСВВалютеПлатежа КАК СуммаНДСВВалютеПлатежа,
	|
	|	ДанныеРегистра.СуммаКВыплатеВРамкахЛимита + ДанныеРегистра.СуммаКВыплатеСверхЛимита КАК СуммаКВыплате,
	|	ДанныеРегистра.СуммаКВыплатеВРамкахЛимита КАК СуммаКВыплатеВРамкахЛимита,
	|	ДанныеРегистра.СуммаКВыплатеСверхЛимита КАК СуммаКВыплатеСверхЛимита,
	|	
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.ИсточникГФУДенежныхСредств ССЫЛКА Справочник.ДоговорыКредитовИДепозитов
	|			ТОГДА ДанныеРегистра.ИсточникГФУДенежныхСредств.ГруппаФинансовогоУчетаДенежныхСредств
	|		ИНАЧЕ ДанныеРегистра.ИсточникГФУДенежныхСредств.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГФУДенежныхСредств,
	|	ДанныеРегистра.ИсточникГФУРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныеСредстваКонтрагент КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДвиженияДенежныхСредств()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.ДенежныеСредства КАК ДенежныеСредства,
	|	ДанныеРегистра.ДенежныеСредства.Подразделение КАК ДенежныеСредстваПодразделение,
	|	ДанныеРегистра.ТипДенежныхСредств КАК ТипДенежныхСредств,
	|	ДанныеРегистра.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеРегистра.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеРегистра.КорДенежныеСредства КАК КорДенежныеСредства,
	|	ДанныеРегистра.КорДенежныеСредства.Подразделение КАК КорДенежныеСредстваПодразделение,
	|	ДанныеРегистра.КорТипДенежныхСредств КАК КорТипДенежныхСредств,
	|	ДанныеРегистра.КорВалюта КАК КорВалюта,
	|
	|	ДанныеРегистра.Сумма КАК Сумма,
	|	ДанныеРегистра.СуммаРегл КАК СуммаРегл,
	|	ДанныеРегистра.СуммаВВалюте КАК СуммаВВалюте,
	|	ДанныеРегистра.СуммаВКорВалюте КАК СуммаВКорВалюте,
	|
	|	ДанныеРегистра.СуммаКВыплатеВРамкахЛимита + ДанныеРегистра.СуммаКВыплатеСверхЛимита КАК СуммаКВыплате,
	|	ДанныеРегистра.СуммаКВыплатеВРамкахЛимита КАК СуммаКВыплатеВРамкахЛимита,
	|	ДанныеРегистра.СуммаКВыплатеСверхЛимита КАК СуммаКВыплатеСверхЛимита,
	|	
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.ИсточникГФУДенежныхСредств ССЫЛКА Справочник.ДоговорыКредитовИДепозитов
	|			ТОГДА ДанныеРегистра.ИсточникГФУДенежныхСредств.ГруппаФинансовогоУчетаДенежныхСредств
	|		ИНАЧЕ ДанныеРегистра.ИсточникГФУДенежныхСредств.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГФУДенежныхСредств,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.ИсточникКорГФУДенежныхСредств ССЫЛКА Справочник.ДоговорыКредитовИДепозитов
	|			ТОГДА ДанныеРегистра.ИсточникКорГФУДенежныхСредств.ГруппаФинансовогоУчетаДенежныхСредств
	|		ИНАЧЕ ДанныеРегистра.ИсточникКорГФУДенежныхСредств.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК КорГФУДенежныхСредств,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДвиженияДоходыРасходыПрочиеАктивыПассивы()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.Статья КАК Статья,
	|	ДанныеРегистра.АналитикаДоходов КАК АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеРегистра.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.Статья ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|			ТОГДА ДанныеРегистра.АналитикаДоходов
	|		ИНАЧЕ ДанныеРегистра.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаДоходовРасходовПодразделение,
	|	ДанныеРегистра.Статья.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|
	|	ДанныеРегистра.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеРегистра.КорПодразделение КАК КорПодразделение,
	|	ДанныеРегистра.КорСтатья КАК КорСтатья,
	|	ДанныеРегистра.КорАналитикаДоходов КАК КорАналитикаДоходов,
	|	ДанныеРегистра.КорАналитикаРасходов КАК КорАналитикаРасходов,
	|	ДанныеРегистра.КорАналитикаАктивовПассивов КАК КорАналитикаАктивовПассивов,
	|	ДанныеРегистра.КорСтатья.ГруппаФинансовогоУчета КАК КорГФУДоходовРасходов,
	|	ДанныеРегистра.КорГруппаФинансовогоУчета КАК КорГруппаФинансовогоУчета,
	|
	|	ДанныеРегистра.СуммаУпр КАК СуммаУпр,
	|	ДанныеРегистра.Сумма КАК СуммаУпрСНДС,
	|	ДанныеРегистра.СуммаРегл КАК СуммаРегл,
	|	
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	ДанныеРегистра.СуммаВВалюте КАК СуммаВВалюте,
	|
	|	ДанныеРегистра.ВидОперацииПоЗарплате КАК ВидОперацииПоЗарплате,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДвиженияКонтрагентДоходыРасходы()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер КАК Партнер,
	|	ДанныеРегистра.Контрагент КАК Контрагент,
	|	ДанныеРегистра.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК ОбъектРасчетовПодразделение,
	|	
	|	ДанныеРегистра.НаправлениеДеятельностиСтатьи КАК НаправлениеДеятельностиСтатьи,
	|	ДанныеРегистра.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов КАК АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеРегистра.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяДоходовРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|			ТОГДА ДанныеРегистра.АналитикаДоходов
	|		ИНАЧЕ ДанныеРегистра.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаДоходовРасходовПодразделение,
	|
	|	ДанныеРегистра.Сумма КАК Сумма,
	|	ДанныеРегистра.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеРегистра.Сумма - ДанныеРегистра.СуммаБезНДС КАК СуммаНДС,
	|	ДанныеРегистра.СуммаРегл КАК СуммаРегл,
	|	ДанныеРегистра.СуммаРеглБезНДС КАК СуммаРеглБезНДС,
	|	ДанныеРегистра.СуммаРегл - ДанныеРегистра.СуммаРеглБезНДС КАК СуммаНДСРегл,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	ДанныеРегистра.СуммаВВалюте КАК СуммаВВалюте,
	|	ДанныеРегистра.СуммаБезНДСВВалюте КАК СуммаБезНДСВВалюте,
	|	ДанныеРегистра.СуммаВВалюте - ДанныеРегистра.СуммаБезНДСВВалюте КАК СуммаНДСВВалюте,
	|
	|	ДанныеРегистра.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДанныеРегистра.СуммаВВалютеВзаиморасчетов КАК СуммаВВалютеВзаиморасчетов,
	|	ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	ДанныеРегистра.СуммаВВалютеВзаиморасчетов - ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов КАК СуммаНДСВВалютеВзаиморасчетов,
	|
	|	ДанныеРегистра.ИсточникГФУРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДанныеРегистра.СтатьяДоходовРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентДоходыРасходы КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|	ГДЕ
	|		ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаДвиженияКонтрагентКонтрагент()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.Партнер КАК Партнер,
	|	ДанныеРегистра.Контрагент КАК Контрагент,
	|	ДанныеРегистра.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК ОбъектРасчетовПодразделение,
	|	ДанныеРегистра.ТипСуммы КАК ТипСуммы,
	|	
	|	ДанныеРегистра.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеРегистра.КорПартнер КАК КорПартнер,
	|	ДанныеРегистра.КорКонтрагент КАК КорКонтрагент,
	|	ДанныеРегистра.КорДоговор КАК КорДоговор,
	|	ДанныеРегистра.КорОбъектРасчетов КАК КорОбъектРасчетов,
	|	ДанныеРегистра.КорОбъектРасчетов.Подразделение КАК КорОбъектРасчетовПодразделение,
	|	ДанныеРегистра.КорТипСуммы КАК КорТипСуммы,
	|
	|	ДанныеРегистра.Сумма КАК Сумма,
	|	ДанныеРегистра.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеРегистра.Сумма - ДанныеРегистра.СуммаБезНДС КАК СуммаНДС,
	|	ДанныеРегистра.СуммаРегл КАК СуммаРегл,
	|	ДанныеРегистра.СуммаРеглБезНДС КАК СуммаРеглБезНДС,
	|	ДанныеРегистра.СуммаРегл - ДанныеРегистра.СуммаРеглБезНДС КАК СуммаНДСРегл,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|	ДанныеРегистра.СуммаВВалюте КАК СуммаВВалюте,
	|	ДанныеРегистра.СуммаБезНДСВВалюте КАК СуммаБезНДСВВалюте,
	|	ДанныеРегистра.СуммаВВалюте - ДанныеРегистра.СуммаБезНДСВВалюте КАК СуммаНДСВВалюте,
	|
	|	ДанныеРегистра.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДанныеРегистра.СуммаВВалютеВзаиморасчетов КАК СуммаВВалютеВзаиморасчетов,
	|	ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	ДанныеРегистра.СуммаВВалютеВзаиморасчетов - ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов КАК СуммаНДСВВалютеВзаиморасчетов,
	|	
	|	ДанныеРегистра.КорВалютаВзаиморасчетов КАК КорВалютаВзаиморасчетов,
	|	ДанныеРегистра.КорСуммаВВалютеВзаиморасчетов КАК КорСуммаВВалютеВзаиморасчетов,
	|	ДанныеРегистра.КорСуммаБезНДСВВалютеВзаиморасчетов КАК КорСуммаБезНДСВВалютеВзаиморасчетов,
	|	ДанныеРегистра.КорСуммаВВалютеВзаиморасчетов - ДанныеРегистра.КорСуммаБезНДСВВалютеВзаиморасчетов КАК КорСуммаНДСВВалютеВзаиморасчетов,
	|	
	|	ДанныеРегистра.ИсточникГФУРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДанныеРегистра.КорИсточникГФУРасчетов.ГруппаФинансовогоУчета КАК КорГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент КАК ДанныеРегистра	
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаДвиженияНоменклатураДоходыРасходы()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|	ДанныеРегистра.НаправлениеДеятельностиСтатьи КАК НаправлениеДеятельностиСтатьи,
	|	ДанныеРегистра.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов КАК АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеРегистра.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяДоходовРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|			ТОГДА ДанныеРегистра.АналитикаДоходов
	|		ИНАЧЕ ДанныеРегистра.АналитикаРасходов
	|	КОНЕЦ КАК АналитикаДоходовРасходовПодразделение,
	|
	|	ДанныеРегистра.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	ДанныеРегистра.Номенклатура КАК Номенклатура,
	|	ДанныеРегистра.Характеристика КАК Характеристика,
	|	ДанныеРегистра.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ДанныеРегистра.Склад КАК Склад,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Склад) КАК ТипСклада,
	|	ДанныеРегистра.СкладПодразделение КАК СкладПодразделение,
	|	ДанныеРегистра.ТипЗапасов КАК ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|	ДанныеРегистра.ВидЗапасов.Контрагент КАК Поставщик,
	|
	|	СУММА(ДанныеРегистра.Стоимость) КАК Стоимость,
	|	СУММА(ДанныеРегистра.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДанныеРегистра.Стоимость - ДанныеРегистра.СтоимостьБезНДС) КАК СуммаНДС,
	|	СУММА(ДанныеРегистра.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(ДанныеРегистра.СтоимостьРегл) КАК СтоимостьРегл,
	|
	|	СУММА(ДанныеРегистра.СтоимостьЗабалансовая) КАК СтоимостьЗабалансовая,
	|	СУММА(ДанныеРегистра.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
	|
	|	СУММА(ДанныеРегистра.ДопРасходы) КАК ДопРасходы,
	|	СУММА(ДанныеРегистра.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(ДанныеРегистра.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(ДанныеРегистра.ДопРасходыРегл) КАК ДопРасходыРегл,
	|
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|
	|	СУММА(ДанныеРегистра.Трудозатраты) КАК Трудозатраты,
	|	СУММА(ДанныеРегистра.ТрудозатратыУпр) КАК ТрудозатратыУпр,
	|	СУММА(ДанныеРегистра.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	|
	|	СУММА(ДанныеРегистра.Количество) КАК Количество,
	|
	|	ДанныеРегистра.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ДанныеРегистра.ГФУНоменклатуры КАК ГФУНоменклатуры,
	|	ДанныеРегистра.ГФУДоходовРасходов КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеРегистра.Период КАК Период,
	|		ДанныеРегистра.Регистратор КАК Регистратор,
	|		ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		ДанныеРегистра.Организация КАК Организация,
	|		ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|		ДанныеРегистра.НаправлениеДеятельностиСтатьи КАК НаправлениеДеятельностиСтатьи,
	|		ДанныеРегистра.СтатьяДоходовРасходов КАК СтатьяДоходовРасходов,
	|		ДанныеРегистра.АналитикаДоходов КАК АналитикаДоходов,
	|		ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
	|		ДанныеРегистра.АналитикаАктивовПассивов КАК АналитикаАктивовПассивов,
	|
	|		ДанныеРегистра.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		ДанныеРегистра.Склад КАК Склад,
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.Склады
	|				ТОГДА ДанныеРегистра.Склад.Подразделение
	|			ИНАЧЕ ДанныеРегистра.Склад
	|		КОНЕЦ КАК СкладПодразделение,
	|		ДанныеРегистра.ТипЗапасов КАК ТипЗапасов,
	|		ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|
	|		ДанныеРегистра.Стоимость КАК Стоимость,
	|		ДанныеРегистра.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		ДанныеРегистра.СтоимостьУпр + ДанныеРегистра.ДопРасходыУпр + ДанныеРегистра.ПостатейныеПостоянныеУпр + ДанныеРегистра.ТрудозатратыУпр + ДанныеРегистра.ПостатейныеПеременныеУпр КАК СтоимостьУпр,
	|		ДанныеРегистра.СтоимостьРегл + ДанныеРегистра.ДопРасходыРегл + ДанныеРегистра.ПостатейныеПостоянныеРегл + ДанныеРегистра.ТрудозатратыРегл + ДанныеРегистра.ПостатейныеПеременныеРегл КАК СтоимостьРегл,
	|
	|		ДанныеРегистра.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|		ДанныеРегистра.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|
	|		ДанныеРегистра.Количество КАК Количество,
	|
	|		ДанныеРегистра.ДопРасходы КАК ДопРасходы,
	|		ДанныеРегистра.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|		ДанныеРегистра.ДопРасходыУпр КАК ДопРасходыУпр,
	|		ДанныеРегистра.ДопРасходыРегл КАК ДопРасходыРегл,
	|
	|		ДанныеРегистра.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|		ДанныеРегистра.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|		ДанныеРегистра.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|		ДанныеРегистра.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|
	|		ДанныеРегистра.Трудозатраты КАК Трудозатраты,
	|		ДанныеРегистра.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|		ДанныеРегистра.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|
	|		ДанныеРегистра.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|		ДанныеРегистра.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|		ДанныеРегистра.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|		ДанныеРегистра.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|
	|		ДанныеРегистра.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|		ДанныеРегистра.ИсточникГФУНоменклатуры.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
	|		ДанныеРегистра.СтатьяДоходовРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|		ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|	ИЗ
	|		РегистрНакопления.ДвиженияНоменклатураДоходыРасходы КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО
	|			ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|			И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|			И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|	ГДЕ
	|		ДанныеРегистра.Активность
	|	) КАК ДанныеРегистра
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор),
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельностиСтатьи,
	|	ДанныеРегистра.СтатьяДоходовРасходов,
	|	ДанныеРегистра.АналитикаДоходов,
	|	ДанныеРегистра.АналитикаРасходов,
	|	ДанныеРегистра.НаправлениеДеятельностиНоменклатуры,
	|	ДанныеРегистра.АналитикаАктивовПассивов,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяДоходовРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиДоходов
	|			ТОГДА ДанныеРегистра.АналитикаДоходов
	|		ИНАЧЕ ДанныеРегистра.АналитикаРасходов
	|	КОНЕЦ,
	|	ДанныеРегистра.Номенклатура,
	|	ДанныеРегистра.Характеристика,
	|	ДанныеРегистра.ТипНоменклатуры,
	|	ДанныеРегистра.Склад,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Склад),
	|	ДанныеРегистра.СкладПодразделение,
	|	ДанныеРегистра.ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов,
	|	ДанныеРегистра.ВидЗапасов.Контрагент,
	|	ДанныеРегистра.ИсточникГФУНоменклатуры,
	|	ДанныеРегистра.ГФУНоменклатуры,
	|	ДанныеРегистра.ГФУДоходовРасходов,
	|	ДанныеРегистра.УчетнаяПолитика
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.Стоимость) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.Стоимость - ДанныеРегистра.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.СтоимостьУпр) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.СтоимостьРегл) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.Количество) <> 0
	|";

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаДвиженияНоменклатураНоменклатура()

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.Номенклатура КАК Номенклатура,
	|	ДанныеРегистра.Характеристика КАК Характеристика,
	|	ДанныеРегистра.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ДанныеРегистра.Склад КАК Склад,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Склад) КАК ТипСклада,
	|	ДанныеРегистра.СкладПодразделение КАК СкладПодразделение,
	|
	|	ДанныеРегистра.ТипЗапасов КАК ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|	ДанныеРегистра.ВидЗапасов.Контрагент КАК Поставщик,
	|
	|	ДанныеРегистра.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеРегистра.КорНоменклатура КАК КорНоменклатура,
	|	ДанныеРегистра.КорХарактеристика КАК КорХарактеристика,
	|	ДанныеРегистра.КорТипНоменклатуры КАК КорТипНоменклатуры,
	|	ДанныеРегистра.КорСклад КАК КорСклад,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.КорСклад) КАК ТипКорСклада,
	|	ДанныеРегистра.КорСкладПодразделение КАК КорСкладПодразделение,
	|	ДанныеРегистра.ВыпускВПодразделение КАК ВыпускВПодразделение,
	|	ДанныеРегистра.КорТипЗапасов КАК КорТипЗапасов,
	|	ДанныеРегистра.КорВидЗапасов КАК КорВидЗапасов,
	|	ДанныеРегистра.КорВидЗапасов.Контрагент КАК КорПоставщик,
	|
	|	СУММА(ДанныеРегистра.Стоимость) КАК Стоимость,
	|	СУММА(ДанныеРегистра.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДанныеРегистра.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(ДанныеРегистра.СтоимостьРегл) КАК СтоимостьРегл,
	|
	|	СУММА(ДанныеРегистра.СтоимостьЗабалансовая) КАК СтоимостьЗабалансовая,
	|	СУММА(ДанныеРегистра.СтоимостьЗабалансоваяРегл) КАК СтоимостьЗабалансоваяРегл,
	|
	|	СУММА(ДанныеРегистра.Количество) КАК Количество,
	|	СУММА(ДанныеРегистра.КорКоличество) КАК КорКоличество,
	|
	|	СУММА(ДанныеРегистра.ДопРасходы) КАК ДопРасходы,
	|	СУММА(ДанныеРегистра.ДопРасходыБезНДС) КАК ДопРасходыБезНДС,
	|	СУММА(ДанныеРегистра.ДопРасходыУпр) КАК ДопРасходыУпр,
	|	СУММА(ДанныеРегистра.ДопРасходыРегл) КАК ДопРасходыРегл,
	|
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеСНДС) КАК ПостатейныеПостоянныеСНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеБезНДС) КАК ПостатейныеПостоянныеБезНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеУпр) КАК ПостатейныеПостоянныеУпр,
	|	СУММА(ДанныеРегистра.ПостатейныеПостоянныеРегл) КАК ПостатейныеПостоянныеРегл,
	|
	|	СУММА(ДанныеРегистра.Трудозатраты) КАК Трудозатраты,
	|	СУММА(ДанныеРегистра.ТрудозатратыУпр) КАК ТрудозатратыУпр,
	|	СУММА(ДанныеРегистра.ТрудозатратыРегл) КАК ТрудозатратыРегл,
	|
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеСНДС) КАК ПостатейныеПеременныеСНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеБезНДС) КАК ПостатейныеПеременныеБезНДС,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеУпр) КАК ПостатейныеПеременныеУпр,
	|	СУММА(ДанныеРегистра.ПостатейныеПеременныеРегл) КАК ПостатейныеПеременныеРегл,
	|
	|	ДанныеРегистра.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|	ДанныеРегистра.КорИсточникГФУНоменклатуры КАК КорИсточникГФУНоменклатуры,
	|	ДанныеРегистра.ГФУНоменклатуры КАК ГФУНоменклатуры,
	|	ДанныеРегистра.КорГФУНоменклатуры КАК КорГФУНоменклатуры,
	|	ДанныеРегистра.КорОрганизация КАК КорОрганизация,
	|	ДанныеРегистра.РасчетСебестоимости КАК РасчетСебестоимости,
	|	ДанныеРегистра.ОтличаютсяПодразделенияСкладКорСклад КАК ОтличаютсяПодразделенияСкладКорСклад,
	|	ДанныеРегистра.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДанныеРегистра.Период КАК Период,
	|		ДанныеРегистра.Регистратор КАК Регистратор,
	|		ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		ДанныеРегистра.Организация КАК Организация,
	|		ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|		ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика,
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|		ДанныеРегистра.Склад КАК Склад,
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.Склады
	|				ТОГДА ДанныеРегистра.Склад.Подразделение
	|			ИНАЧЕ ДанныеРегистра.Склад
	|		КОНЕЦ КАК СкладПодразделение, 
	|		ДанныеРегистра.ТипЗапасов КАК ТипЗапасов,
	|		ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|
	|		ДанныеРегистра.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Номенклатура КАК КорНоменклатура,
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Характеристика КАК КорХарактеристика,
	|		ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК КорТипНоменклатуры,
	|		ДанныеРегистра.КорСклад КАК КорСклад,
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.КорСклад ССЫЛКА Справочник.Склады
	|				ТОГДА ДанныеРегистра.КорСклад.Подразделение
	|			ИНАЧЕ ДанныеРегистра.КорСклад
	|		КОНЕЦ КАК КорСкладПодразделение, 
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.КорСклад ССЫЛКА Справочник.СтруктураПредприятия
	|				ТОГДА ИСТИНА
	|			КОГДА ДанныеРегистра.КорСклад ССЫЛКА Справочник.Склады И ДанныеРегистра.КорСклад.ЦеховаяКладовая
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ КАК ВыпускВПодразделение,
	|		ДанныеРегистра.КорТипЗапасов КАК КорТипЗапасов,
	|		ДанныеРегистра.КорВидЗапасов КАК КорВидЗапасов,
	|
	|		ДанныеРегистра.Стоимость КАК Стоимость,
	|		ДанныеРегистра.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|		ДанныеРегистра.СтоимостьУпр + ДанныеРегистра.ДопРасходыУпр + ДанныеРегистра.ПостатейныеПостоянныеУпр + ДанныеРегистра.ТрудозатратыУпр + ДанныеРегистра.ПостатейныеПеременныеУпр КАК СтоимостьУпр,
	|		ДанныеРегистра.СтоимостьРегл + ДанныеРегистра.ДопРасходыРегл + ДанныеРегистра.ПостатейныеПостоянныеРегл + ДанныеРегистра.ТрудозатратыРегл + ДанныеРегистра.ПостатейныеПеременныеРегл КАК СтоимостьРегл,
	|
	|		ДанныеРегистра.СтоимостьЗабалансовая КАК СтоимостьЗабалансовая,
	|		ДанныеРегистра.СтоимостьЗабалансоваяРегл КАК СтоимостьЗабалансоваяРегл,
	|
	|		ДанныеРегистра.Количество КАК Количество,
	|		ДанныеРегистра.КорКоличество КАК КорКоличество,
	|
	|		ДанныеРегистра.ДопРасходы КАК ДопРасходы,
	|		ДанныеРегистра.ДопРасходыБезНДС КАК ДопРасходыБезНДС,
	|		ДанныеРегистра.ДопРасходыУпр КАК ДопРасходыУпр,
	|		ДанныеРегистра.ДопРасходыРегл КАК ДопРасходыРегл,
	|
	|		ДанныеРегистра.ПостатейныеПостоянныеСНДС КАК ПостатейныеПостоянныеСНДС,
	|		ДанныеРегистра.ПостатейныеПостоянныеБезНДС КАК ПостатейныеПостоянныеБезНДС,
	|		ДанныеРегистра.ПостатейныеПостоянныеУпр КАК ПостатейныеПостоянныеУпр,
	|		ДанныеРегистра.ПостатейныеПостоянныеРегл КАК ПостатейныеПостоянныеРегл,
	|
	|		ДанныеРегистра.Трудозатраты КАК Трудозатраты,
	|		ДанныеРегистра.ТрудозатратыУпр КАК ТрудозатратыУпр,
	|		ДанныеРегистра.ТрудозатратыРегл КАК ТрудозатратыРегл,
	|
	|		ДанныеРегистра.ПостатейныеПеременныеСНДС КАК ПостатейныеПеременныеСНДС,
	|		ДанныеРегистра.ПостатейныеПеременныеБезНДС КАК ПостатейныеПеременныеБезНДС,
	|		ДанныеРегистра.ПостатейныеПеременныеУпр КАК ПостатейныеПеременныеУпр,
	|		ДанныеРегистра.ПостатейныеПеременныеРегл КАК ПостатейныеПеременныеРегл,
	|
	|		ДанныеРегистра.ИсточникГФУНоменклатуры КАК ИсточникГФУНоменклатуры,
	|		ДанныеРегистра.КорИсточникГФУНоменклатуры КАК КорИсточникГФУНоменклатуры,
	|		ДанныеРегистра.ИсточникГФУНоменклатуры.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
	|		ДанныеРегистра.КорИсточникГФУНоменклатуры.ГруппаФинансовогоУчета КАК КорГФУНоменклатуры,
	|		ДанныеРегистра.КорОрганизация КАК КорОрганизация,
	|		ДанныеРегистра.РасчетСебестоимости КАК РасчетСебестоимости,
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|				ТОГДА ИСТИНА
	|			КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.Склады И ДанныеРегистра.Склад.ЦеховаяКладовая
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ 
	|		И 
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.КорСклад ССЫЛКА Справочник.СтруктураПредприятия
	|				ТОГДА ИСТИНА
	|			КОГДА ДанныеРегистра.КорСклад ССЫЛКА Справочник.Склады И ДанныеРегистра.КорСклад.ЦеховаяКладовая
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ 
	|       И
	|		(ВЫБОР
	|			КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.СтруктураПредприятия
	|				ТОГДА ДанныеРегистра.Склад
	|			КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.Склады И ДанныеРегистра.Склад.ЦеховаяКладовая
	|				ТОГДА ДанныеРегистра.Склад.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ 
	|	    <>
	|		ВЫБОР
	|			КОГДА ДанныеРегистра.КорСклад ССЫЛКА Справочник.СтруктураПредприятия
	|				ТОГДА ДанныеРегистра.КорСклад
	|			КОГДА ДанныеРегистра.КорСклад ССЫЛКА Справочник.Склады И ДанныеРегистра.КорСклад.ЦеховаяКладовая
	|				ТОГДА ДанныеРегистра.КорСклад.Подразделение
	|			ИНАЧЕ НЕОПРЕДЕЛЕНО
	|		КОНЕЦ) КАК ОтличаютсяПодразделенияСкладКорСклад,
	|		ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|	ИЗ
	|		РегистрНакопления.ДвиженияНоменклатураНоменклатура КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|			ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО
	|			ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|			И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|			И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения   
	|	ГДЕ
	|		ДанныеРегистра.Активность
	|	) ДанныеРегистра
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРегистра.Период,
	|	ДанныеРегистра.Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор),
	|	ДанныеРегистра.ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация,
	|	ДанныеРегистра.Подразделение,
	|	ДанныеРегистра.НаправлениеДеятельности,
	|	ДанныеРегистра.Номенклатура,
	|	ДанныеРегистра.Характеристика,
	|	ДанныеРегистра.ТипНоменклатуры,
	|	ДанныеРегистра.Склад,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Склад),
	|	ДанныеРегистра.КорСкладПодразделение,
	|	ДанныеРегистра.ВыпускВПодразделение,
	|	ДанныеРегистра.СкладПодразделение,
	|	ДанныеРегистра.ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов,
	|	ДанныеРегистра.ВидЗапасов.Контрагент,
	|	ДанныеРегистра.КорНаправлениеДеятельности,
	|	ДанныеРегистра.КорНоменклатура,
	|	ДанныеРегистра.КорХарактеристика,
	|	ДанныеРегистра.КорТипНоменклатуры,
	|	ДанныеРегистра.КорСклад,
	|	ДанныеРегистра.КорТипЗапасов,
	|	ДанныеРегистра.КорВидЗапасов,
	|	ДанныеРегистра.КорВидЗапасов.Контрагент,
	|	ДанныеРегистра.ИсточникГФУНоменклатуры,
	|	ДанныеРегистра.КорИсточникГФУНоменклатуры,
	|	ДанныеРегистра.ГФУНоменклатуры,
	|	ДанныеРегистра.КорГФУНоменклатуры,
	|	ДанныеРегистра.КорОрганизация,  
	|	ДанныеРегистра.РасчетСебестоимости,
	|	ДанныеРегистра.ОтличаютсяПодразделенияСкладКорСклад,
	|	ДанныеРегистра.УчетнаяПолитика
	|ИМЕЮЩИЕ
	|	СУММА(ДанныеРегистра.Стоимость) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.СтоимостьБезНДС) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.СтоимостьУпр) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.СтоимостьРегл) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.Количество) <> 0
	|	ИЛИ СУММА(ДанныеРегистра.КорКоличество) <> 0";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаЗакупки()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|
	|	ДанныеРегистра.НаправлениеДеятельностиНоменклатуры КАК НаправлениеДеятельностиНоменклатуры,
	|	Аналитика.Номенклатура КАК Номенклатура,
	|	Аналитика.Характеристика КАК Характеристика,
	|	Аналитика.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ДанныеРегистра.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.Склад ССЫЛКА Справочник.Склады
	|			ТОГДА ДанныеРегистра.Склад.Подразделение
	|		ИНАЧЕ ДанныеРегистра.Склад
	|	КОНЕЦ КАК СкладПодразделение,
	|	ДанныеРегистра.ТипЗапасов КАК ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|
	|	ДанныеРегистра.НаправлениеДеятельностиКонтрагента КАК НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Партнер КАК Партнер,
	|	ДанныеРегистра.Контрагент КАК Контрагент,
	|	ДанныеРегистра.ВидЗапасов.Контрагент КАК Поставщик,
	|	ДанныеРегистра.Соглашение КАК Соглашение,
	|	ДанныеРегистра.Договор КАК Договор,
	|	ДанныеРегистра.Заказ КАК Заказ,
	|	ДанныеРегистра.Заказ.Подразделение КАК ЗаказПодразделение,
	|	ДанныеРегистра.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	
	|	ДанныеРегистра.Сумма КАК Сумма,
	|	ДанныеРегистра.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеРегистра.Сумма - ДанныеРегистра.СуммаБезНДС КАК СуммаНДС,
	|	ДанныеРегистра.СуммаРегл КАК СуммаРегл,
	|	ДанныеРегистра.СуммаРеглБезНДС КАК СуммаРеглБезНДС,
	|	ДанныеРегистра.СуммаРегл - ДанныеРегистра.СуммаРеглБезНДС КАК СуммаНДСРегл,
	|
	|	ДанныеРегистра.Стоимость КАК Стоимость,
	|	ДанныеРегистра.СтоимостьБезНДС КАК СтоимостьБезНДС,
	|	ДанныеРегистра.СтоимостьРегл КАК СтоимостьРегл,
	|
	|	ДанныеРегистра.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДанныеРегистра.СуммаВВалютеВзаиморасчетов КАК СуммаВВалютеВзаиморасчетов,
	|	ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов КАК СуммаБезНДСВВалютеВзаиморасчетов,
	|	ДанныеРегистра.СуммаВВалютеВзаиморасчетов - ДанныеРегистра.СуммаБезНДСВВалютеВзаиморасчетов КАК СуммаНДСВВалютеВзаиморасчетов,
	|
	|	ДанныеРегистра.ВалютаДокумента КАК ВалютаДокумента,
	|	ДанныеРегистра.СуммаВВалютеДокумента КАК СуммаВВалютеДокумента,
	|	ДанныеРегистра.СуммаБезНДСВВалютеДокумента КАК СуммаБезНДСВВалютеДокумента,
	|	ДанныеРегистра.СуммаВВалютеДокумента - ДанныеРегистра.СуммаБезНДСВВалютеДокумента КАК СуммаНДСВВалютеДокумента,
	|
	|	ДанныеРегистра.Количество КАК Количество,
	|
	|	ДанныеРегистра.ИсточникГФУНоменклатуры.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
	|	ДанныеРегистра.ИсточникГФУРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.Закупки КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК Аналитика
	|	ПО
	|		ДанныеРегистра.АналитикаУчетаНоменклатуры = Аналитика.КлючАналитики
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаРасчетыСКлиентамиПоДокументам()

	#Область ЗачетАвансаКлиента
	ТекстЗапросаЗачетАвансаКлиента = 
	"// ЗачетАвансаКлиента, ЗачетВознагражденияОплатойКомиссионера
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) = ТИП(Документ.ОтчетКомиссионера)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетВознагражденияАвансомКомиссионера)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ЗаказКлиента КАК Заказ,
	|	ДанныеРегистра.ЗаказКлиента.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ЗаказКлиента.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ЗаказКлиента.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ПредоплатаРегл > 0 И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеРегистра.Активность";
	#КонецОбласти

	#Область ВосстановлениеАвансаКлиента
	ТекстЗапросаВосстановлениеАвансаКлиента = 
	"// ВосстановлениеАвансаКлиента
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВосстановлениеАвансаКлиента) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ЗаказКлиента КАК Заказ,
	|	ДанныеРегистра.ЗаказКлиента.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ЗаказКлиента.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ЗаказКлиента.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (ТИП(Документ.ВозвратТоваровОтКлиента),
	|			ТИП(Документ.КорректировкаРеализации))
	|	И ДанныеРегистра.ПредоплатаРегл > 0 И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДанныеРегистра.Активность";
	#КонецОбласти

	#Область ЗачетВознагражденияОплатойКомиссионера
	ТекстЗапросаЗачетВознагражденияОплатойКомиссионера = 
	"// ЗачетВознагражденияОплатойКомиссионера
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомиссионера) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ЗаказКлиента КАК Заказ,
	|	ДанныеРегистра.ЗаказКлиента.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ЗаказКлиента.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|	
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Долг КАК Предоплата,
	|	ДанныеРегистра.ДолгУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ДолгРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ЗаказКлиента.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор)  В 
	|		(ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациями),
	|		ТИП(Документ.ОтчетКомиссионера))
	|	И ДанныеРегистра.ДолгРегл > 0 И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДанныеРегистра.Активность";
	#КонецОбласти

	ТекстыТаблиц = Новый Массив;
	ТекстыТаблиц.Добавить(ТекстЗапросаЗачетАвансаКлиента);
	ТекстыТаблиц.Добавить(ТекстЗапросаВосстановлениеАвансаКлиента);
	ТекстыТаблиц.Добавить(ТекстЗапросаЗачетВознагражденияОплатойКомиссионера);
	
	ТекстЗапроса = СтрСоединить(ТекстыТаблиц, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаРасчетыСПоставщикамиПоДокументам()

	#Область ЗачетАвансаПоставщику
	
	ТекстЗапросаЗачетАвансаПоставщику = 
	"// ЗачетАвансаПоставщику
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ЗаказПоставщику КАК Заказ,
	|
	|	ДанныеРегистра.ЗаказПоставщику.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ЗаказПоставщику.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ЗаказПоставщику.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ПредоплатаРегл > 0 И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДанныеРегистра.Активность
	|";
	#КонецОбласти

	#Область ПереносПретензииНаАвансы
	ТекстЗапросаПереносПретензииНаАвансы = 
	"// ПереносПретензииНаАвансы
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносПретензииНаАвансы) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ЗаказПоставщику КАК Заказ,
	|
	|	ДанныеРегистра.ЗаказПоставщику.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ЗаказПоставщику.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ЗаказПоставщику.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК ДанныеРегистра

	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В (ТИП(Документ.КорректировкаПриобретения),
	|			ТИП(Документ.ВозвратТоваровПоставщику))
	|	И (ТИПЗНАЧЕНИЯ(ДанныеРегистра.ЗаказПоставщику) <> ТИП(Документ.ВозвратТоваровПоставщику)
	|		 ИЛИ ДанныеРегистра.ЗаказПоставщику = НЕОПРЕДЕЛЕНО)
	|	И ДанныеРегистра.ПредоплатаРегл > 0 И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеРегистра.Активность";
	#КонецОбласти

	#Область ПереносПретензииНаРасчеты
	ТекстЗапросаПереносПретензииНаРасчеты = 
	"// ПереносПретензииНаРасчеты
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносПретензииНаРасчеты) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ЗаказПоставщику КАК Заказ,
	|
	|	ДанныеРегистра.ЗаказПоставщику.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ЗаказПоставщику.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ЗаказПоставщику.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) = ТИП(Документ.ВозвратТоваровПоставщику)
	|	И ДанныеРегистра.ДолгРегл > 0 И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеРегистра.Активность";
	#КонецОбласти

	#Область ЗачетВознагражденияОплатойКомитенту
	ТекстЗапросаЗачетВознагражденияОплатойКомитенту = 
	"// ЗачетВознагражденияОплатойКомитенту
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомитенту) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ЗаказПоставщику КАК Заказ,
	|
	|	ДанныеРегистра.ЗаказПоставщику.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ЗаказПоставщику.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Долг КАК Предоплата,
	|	ДанныеРегистра.ДолгУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ДолгРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ЗаказПоставщику.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) В 
	|		(ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациями),
	|		ТИП(Документ.ОтчетКомитенту))
	|	И ДанныеРегистра.ДолгРегл > 0 И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеРегистра.Активность";
	#КонецОбласти

	ТекстыТаблиц = Новый Массив;
	ТекстыТаблиц.Добавить(ТекстЗапросаЗачетАвансаПоставщику);
	ТекстыТаблиц.Добавить(ТекстЗапросаПереносПретензииНаАвансы);
	ТекстыТаблиц.Добавить(ТекстЗапросаПереносПретензииНаРасчеты);
	ТекстыТаблиц.Добавить(ТекстЗапросаЗачетВознагражденияОплатойКомитенту);
	
	ТекстЗапроса = СтрСоединить(ТекстыТаблиц, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаРасчетыСКлиентамиПоСрокам()

	#Область ЗачетАвансаКлиента
	ТекстЗапросаЗачетАвансаКлиента = 
	"// ЗачетАвансаКлиента, ЗачетВознагражденияОплатойКомиссионера
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ДокументРегистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) КАК ТипДокумента,
	|	ВЫБОР КОГДА ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) = ТИП(Документ.ОтчетКомиссионера)
	|		ТОГДА ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетВознагражденияАвансомКомиссионера)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)
	|	КОНЕЦ КАК ХозяйственнаяОперация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК Заказ,
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.ДокументРегистратор = ДокументыКОтражению.Регистратор
	|		И (ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация)
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаКлиента)";
	#КонецОбласти

	#Область ВосстановлениеАвансаКлиента
	ТекстЗапросаВосстановлениеАвансаКлиента = 
	"// ВосстановлениеАвансаКлиента
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ДокументРегистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВосстановлениеАвансаКлиента) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК Заказ,
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.ДокументРегистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) В (ТИП(Документ.ВозвратТоваровОтКлиента),
	|			ТИП(Документ.КорректировкаРеализации))
	|	И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеРегистра.ПредоплатаРегл <> 0";
	#КонецОбласти

	#Область ЗачетВознагражденияОплатойКомиссионера
	ТекстЗапросаЗачетВознагражденияОплатойКомиссионера = 
	"// ЗачетВознагражденияОплатойКомиссионера
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ДокументРегистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомиссионера) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК Заказ,
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Долг КАК Предоплата,
	|	ДанныеРегистра.ДолгУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ДолгРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.ДокументРегистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор)  В 
	|		(ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациями),
	|		ТИП(Документ.ОтчетКомиссионера))
	|	И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеРегистра.ДолгРегл > 0";
	#КонецОбласти

	ТекстыТаблиц = Новый Массив;
	ТекстыТаблиц.Добавить(ТекстЗапросаЗачетАвансаКлиента);
	ТекстыТаблиц.Добавить(ТекстЗапросаВосстановлениеАвансаКлиента);
	ТекстыТаблиц.Добавить(ТекстЗапросаЗачетВознагражденияОплатойКомиссионера);
	
	ТекстЗапроса = СтрСоединить(ТекстыТаблиц, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаРасчетыСПоставщикамиПоСрокам()

	#Область ЗачетАвансаПоставщику
	
	ТекстЗапросаЗачетАвансаПоставщику = 
	"// ЗачетАвансаПоставщику
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ДокументРегистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК Заказ,
	|
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.ДокументРегистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику)
	|";
	#КонецОбласти

	#Область ПереносПретензииНаАвансы
	ТекстЗапросаПереносПретензииНаАвансы = 
	"// ПереносПретензииНаАвансы
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ДокументРегистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносПретензииНаАвансы) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК Заказ,
	|
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.ДокументРегистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) В (ТИП(Документ.КорректировкаПриобретения),
	|			ТИП(Документ.ВозвратТоваровПоставщику))
	|	И (ТИПЗНАЧЕНИЯ(ДанныеРегистра.ОбъектРасчетов) <> ТИП(Документ.ВозвратТоваровПоставщику)
	|			ИЛИ ДанныеРегистра.ОбъектРасчетов = НЕОПРЕДЕЛЕНО)
	|	И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И ДанныеРегистра.Активность
	|	И ДанныеРегистра.ПредоплатаРегл > 0";
	#КонецОбласти

	#Область ПереносПретензииНаРасчеты
	ТекстЗапросаПереносПретензииНаРасчеты = 
	"// ПереносПретензииНаРасчеты
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ДокументРегистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносПретензииНаРасчеты) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|	ДанныеРегистра.ОбъектРасчетов КАК Заказ,
	|
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Предоплата КАК Предоплата,
	|	ДанныеРегистра.ПредоплатаУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ПредоплатаРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.ДокументРегистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) = ТИП(Документ.ВозвратТоваровПоставщику)
	|	И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДанныеРегистра.Активность
	|	И ДанныеРегистра.ДолгРегл > 0";
	#КонецОбласти

	#Область ЗачетВознагражденияОплатойКомитенту
	ТекстЗапросаЗачетВознагражденияОплатойКомитенту = 
	"// ЗачетВознагражденияОплатойКомитенту
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.ДокументРегистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) КАК ТипДокумента,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетВознагражденияОплатойКомитенту) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК Договор,
	|
	|	ДанныеРегистра.ОбъектРасчетов КАК Заказ,
	|
	|	ДанныеРегистра.ОбъектРасчетов.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ОбъектРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельностиКонтрагента,
	|
	|	ДанныеРегистра.Валюта КАК Валюта,
	|
	|	ДанныеРегистра.Долг КАК Предоплата,
	|	ДанныеРегистра.ДолгУпр КАК ПредоплатаУпр,
	|	ДанныеРегистра.ДолгРегл КАК ПредоплатаРегл,
	|
	|	ДанныеРегистра.ОбъектРасчетов.ГруппаФинансовогоУчета КАК ГФУРасчетов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК ДанныеРегистра
	|
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.ДокументРегистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.ДокументРегистратор) В 
	|		(ТИП(Документ.ОтчетПоКомиссииМеждуОрганизациями),
	|		ТИП(Документ.ОтчетКомитенту))
	|	И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	И ДанныеРегистра.Активность
	|	И ДанныеРегистра.ДолгРегл > 0";
	#КонецОбласти

	ТекстыТаблиц = Новый Массив;
	ТекстыТаблиц.Добавить(ТекстЗапросаЗачетАвансаПоставщику);
	ТекстыТаблиц.Добавить(ТекстЗапросаПереносПретензииНаАвансы);
	ТекстыТаблиц.Добавить(ТекстЗапросаПереносПретензииНаРасчеты);
	ТекстыТаблиц.Добавить(ТекстЗапросаЗачетВознагражденияОплатойКомитенту);
		
	ТекстЗапроса = СтрСоединить(ТекстыТаблиц, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении());
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаАмортизацияОС()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|
	|	ДанныеРегистра.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГФУВнеоборотныеАктивы,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.КорСтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов КАК КорСтатьяРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК КорГруппаФинансовогоУчета,
	|	
	|	ДанныеРегистра.Амортизация,
	|	ДанныеРегистра.АмортизацияРегл + ДанныеРегистра.АмортизацияЦФ КАК АмортизацияРегл,
	|
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.АмортизацияОС КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		НастройкиОпераций КАК НастройкиОпераций
	|	ПО
	|		ДанныеРегистра.ХозяйственнаяОперация = НастройкиОпераций.Операция
	|ГДЕ
	|	НастройкиОпераций.ИсточникДанных = ""АмортизацияОС""
	|	И ДанныеРегистра.Активность
	|	И ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И (ДанныеРегистра.Амортизация <> 0 ИЛИ ДанныеРегистра.АмортизацияРегл + ДанныеРегистра.АмортизацияЦФ <> 0)
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаАмортизацияНМА()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|
	|	ДанныеРегистра.НематериальныйАктив КАК НематериальныйАктив,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГФУВнеоборотныеАктивы,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.КорСтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов КАК КорСтатьяРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК КорГруппаФинансовогоУчета,
	|	
	|	ДанныеРегистра.Амортизация КАК Амортизация,
	|	ДанныеРегистра.АмортизацияРегл + ДанныеРегистра.АмортизацияЦФ КАК АмортизацияРегл,
	|
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.АмортизацияНМА КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		НастройкиОпераций КАК НастройкиОпераций
	|	ПО
	|		ДанныеРегистра.ХозяйственнаяОперация = НастройкиОпераций.Операция
	|ГДЕ
	|	НастройкиОпераций.ИсточникДанных = ""АмортизацияНМА""
	|	И ДанныеРегистра.Активность
	|	И ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И (ДанныеРегистра.Амортизация <> 0 ИЛИ ДанныеРегистра.АмортизацияРегл + ДанныеРегистра.АмортизацияЦФ <> 0)
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСтоимостьОС()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|
	|	ДанныеРегистра.ОсновноеСредство КАК ОсновноеСредство,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГФУВнеоборотныеАктивы,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.КорСтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов КАК КорСтатьяРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК КорГруппаФинансовогоУчета,
	|	ДанныеРегистра.КорКонтрагент КАК Контрагент,
	|	
	|	ДанныеРегистра.Стоимость КАК Стоимость,
	|	ДанныеРегистра.СтоимостьРегл + ДанныеРегистра.СтоимостьЦФ КАК СтоимостьРегл,
	|
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.СтоимостьОС КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		НастройкиОпераций КАК НастройкиОпераций
	|	ПО
	|		ДанныеРегистра.ХозяйственнаяОперация = НастройкиОпераций.Операция
	|ГДЕ
	|	НастройкиОпераций.ИсточникДанных = ""СтоимостьОС""
	|	И ДанныеРегистра.Активность
	|	И ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И (ДанныеРегистра.Стоимость <> 0 ИЛИ ДанныеРегистра.СтоимостьРегл + ДанныеРегистра.СтоимостьЦФ <> 0)
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаСтоимостьНМА()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|
	|	ДанныеРегистра.НематериальныйАктив КАК НематериальныйАктив,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГФУВнеоборотныеАктивы,
	|	ДанныеРегистра.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.КорСтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов КАК КорСтатьяРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК КорГруппаФинансовогоУчета,
	|	
	|	ДанныеРегистра.Стоимость КАК Стоимость,
	|	ДанныеРегистра.СтоимостьРегл + ДанныеРегистра.СтоимостьЦФ КАК СтоимостьРегл,
	|
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.СтоимостьНМА КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		НастройкиОпераций КАК НастройкиОпераций
	|	ПО
	|		ДанныеРегистра.ХозяйственнаяОперация = НастройкиОпераций.Операция
	|ГДЕ
	|	НастройкиОпераций.ИсточникДанных = ""СтоимостьНМА""
	|	И ДанныеРегистра.Активность
	|	И ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И (ДанныеРегистра.Стоимость <> 0 ИЛИ ДанныеРегистра.СтоимостьРегл + ДанныеРегистра.СтоимостьЦФ <> 0)
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаПрочиеРасходы()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.СтатьяРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
    |	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК КорГФУДоходовРасходов,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
	|	ДанныеРегистра.СтатьяРасходов КАК СтатьяРасходов,
	|	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
	|	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходовПодразделение,
	|
    |	ДанныеРегистра.КорСтатьяРасходов КАК КорСтатьяРасходов,
	|	ДанныеРегистра.КорПодразделение КАК КорПодразделение,
	|	
	|	ДанныеРегистра.Сумма КАК Сумма,
	|	ДанныеРегистра.СуммаБезНДС КАК СуммаБезНДС,
	|	ДанныеРегистра.Сумма - ДанныеРегистра.СуммаБезНДС КАК СуммаНДС,
	|	ДанныеРегистра.СуммаРегл КАК СуммаРегл,
	|	ДанныеРегистра.СуммаРеглБезНДС КАК СуммаРеглБезНДС,
	|	ДанныеРегистра.НДСРегл КАК СуммаНДСРегл,
	|	ДанныеРегистра.СуммаУпр КАК СуммаУпр,
	|	ДанныеРегистра.СуммаУпрБезНДС КАК СуммаУпрБезНДС, 
	|
	|   ВЫБОР
	|		КОГДА 
    |   		ДанныеРегистра.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
    |   			И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |   			И ДанныеРегистра.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
    |   			И ДанныеРегистра.КорПодразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РаспределениеРасходовНаПрочиеРасходы,
	|
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		НастройкиОпераций КАК НастройкиОпераций
	|	ПО
	|		ДанныеРегистра.ХозяйственнаяОперация = НастройкиОпераций.Операция
	|ГДЕ
	|	НастройкиОпераций.ИсточникДанных = ""ПрочиеРасходы""
	|	И ДанныеРегистра.Активность
	|	И ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И (ДанныеРегистра.Сумма <> 0 ИЛИ ДанныеРегистра.СуммаРегл <> 0)    
    |   И НЕ (
	|		ДанныеРегистра.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
    |   	И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |   	И ДанныеРегистра.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
    |   	И ДанныеРегистра.КорПодразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	)
	|          
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
    |   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРасходовНаПрочиеРасходы) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,   
	|
	|	ДанныеРегистра.Подразделение КАК Подразделение,
	|	ДанныеРегистра.СтатьяРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
    |	ДанныеРегистра.КорСтатьяРасходов.ГруппаФинансовогоУчета КАК КорГФУДоходовРасходов,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|
    |	ДанныеРегистра.СтатьяРасходов КАК СтатьяРасходов,
    |	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
    |	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходовПодразделение,
    |
    |	ДанныеРегистра.КорСтатьяРасходов КАК КорСтатьяРасходов,
	|	ДанныеРегистра.КорПодразделение КАК КорПодразделение,
    |
	|	СУММА(ДанныеРегистра.Сумма) КАК Сумма,
	|	СУММА(ДанныеРегистра.СуммаБезНДС) КАК СуммаБезНДС,
	|	СУММА(ДанныеРегистра.Сумма - ДанныеРегистра.СуммаБезНДС) КАК СуммаНДС,
	|	СУММА(ДанныеРегистра.СуммаРегл) КАК СуммаРегл,
	|	СУММА(ДанныеРегистра.СуммаРеглБезНДС) КАК СуммаРеглБезНДС,
	|	СУММА(ДанныеРегистра.НДСРегл) КАК СуммаНДСРегл,
	|	СУММА(ДанныеРегистра.СуммаУпр) КАК СуммаУпр,
	|	СУММА(ДанныеРегистра.СуммаУпрБезНДС) КАК СуммаУпрБезНДС, 
	|
	|   ВЫБОР
	|		КОГДА 
    |   		ДанныеРегистра.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
    |   			И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |   			И ДанныеРегистра.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
    |   			И ДанныеРегистра.КорПодразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РаспределениеРасходовНаПрочиеРасходы,
    |
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|ГДЕ
	|	ДанныеРегистра.Активность
    |   И ДанныеРегистра.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
    |   И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |   И ДанныеРегистра.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
    |   И ДанныеРегистра.КорПодразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
    |   И (ДанныеРегистра.Сумма <> 0 
	|		ИЛИ ДанныеРегистра.СуммаБезНДС <> 0 
	|		ИЛИ ДанныеРегистра.СуммаРегл <> 0 
	|		ИЛИ ДанныеРегистра.СуммаРеглБезНДС <> 0 
	|		ИЛИ ДанныеРегистра.НДСРегл <> 0
	|		ИЛИ ДанныеРегистра.СуммаУпр <> 0 
	|		ИЛИ ДанныеРегистра.СуммаУпрБезНДС <> 0 
	|	)
    |
    |СГРУППИРОВАТЬ ПО
    |	ДанныеРегистра.Период,
    |	ДанныеРегистра.Регистратор,
    |	ДанныеРегистра.Организация,
    |	ДанныеРегистра.Подразделение,
    |	ДанныеРегистра.СтатьяРасходов,
    |	ДанныеРегистра.НаправлениеДеятельности,
    |	ДанныеРегистра.АналитикаРасходов,
    |	ДанныеРегистра.КорСтатьяРасходов,
	|	ДанныеРегистра.КорПодразделение, 
	|   ВЫБОР
	|		КОГДА 
    |   		ДанныеРегистра.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
    |   			И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |   			И ДанныеРегистра.КорСтатьяРасходов <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
    |   			И ДанныеРегистра.КорПодразделение <> ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
    |	ДокументыКОтражению.УчетнаяПолитика
    |
	|";
	
	Возврат ТекстЗапроса;

КонецФункции


Функция ТекстЗапросаКорректировкиНДСПартий()
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Регистратор.Подразделение КАК Подразделение,
	|	ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры ССЫЛКА Справочник.КлючиАналитикиУчетаНоменклатуры
	|			ТОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	КОНЕЦ КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры ССЫЛКА Справочник.КлючиАналитикиУчетаНоменклатуры
	|			ТОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ТипНоменклатуры,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры ССЫЛКА Справочник.КлючиАналитикиУчетаНоменклатуры
	|			ТОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры.МестоХранения
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК Склад,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры ССЫЛКА Справочник.КлючиАналитикиУчетаНоменклатуры
	|			ТОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК ГФУНоменклатуры,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА ДанныеРегистра.АналитикаУчетаНоменклатуры.ГруппаФинансовогоУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка)
	|	КОНЕЦ КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.СтавкаНДС,
	|	ДанныеРегистра.НалоговоеНазначение,
	|	ДанныеРегистра.НалоговоеНазначениеПоФакту,
	|	ЕСТЬNULL(ДанныеРегистра.ВидЗапасов.Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) КАК Контрагент,
	|	ЕСТЬNULL(ДанныеРегистра.ВидЗапасов.Договор, ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)) КАК Договор,
	|	ДанныеРегистра.СтатьяРасходовСписания,
	|	ДанныеРегистра.АналитикаРасходов,
	|	ДанныеРегистра.ГруппаПродукции,
	|	ДанныеРегистра.РазделКорректировки,
	|	ДанныеРегистра.НДСРегл - ДанныеРегистра.НДСРеглПоФакту КАК СуммаКорректировки,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.КорректировкиНДСПартий КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|			И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|			И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДетализацияПартийТоваровДляНДС2_4()
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация, 
	|	ДанныеРегистра.Регистратор.Подразделение КАК Подразделение,
	|	ДанныеРегистра.Подразделение КАК ПодразделениеРасходов,
	|	ДанныеРегистра.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.КорНаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеРегистра.Номенклатура КАК Номенклатура,
	|	ДанныеРегистра.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Номенклатура КАК КорНоменклатура,	
	|	ДанныеРегистра.КорАналитикаУчетаНоменклатуры.МестоХранения КАК КорСклад,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.КорАналитикаУчетаНоменклатуры.МестоХранения) КАК ТипКорСклада,                   
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяРасходовАктивов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА ДанныеРегистра.СтатьяРасходовАктивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяРасходовАктивов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|			ТОГДА ДанныеРегистра.СтатьяРасходовАктивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяАктивов,
	|	ДанныеРегистра.Номенклатура.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяРасходовАктивов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА ДанныеРегистра.СтатьяРасходовАктивов.ГруппаФинансовогоУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка)
	|	КОНЕЦ КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ДанныеРегистра.КорНалоговоеНазначение КАК КорНалоговоеНазначение,
	|	ДанныеРегистра.АналитикаРасходов,
	|	ДанныеРегистра.НДС КАК СуммаКорректировкиРегл,
	|	ДанныеРегистра.НДСУпр КАК СуммаКорректировкиУпр,  
	|	ВЫБОР КОГДА 
	|		ДанныеРегистра.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|		И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|		И ((ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) И ДанныеРегистра.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|			ИЛИ (ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) И ДанныеРегистра.КорНалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
	|		)
	|		И ДанныеРегистра.СтатьяСписанияНДС = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)  
	|	ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключениеНДСВСтоимость,
	|	ВЫБОР КОГДА 
	|		ДанныеРегистра.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|		И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|       И (ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая) И ДанныеРегистра.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая))
	|	ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИсключениеНДСИзСтоимости,
	|
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДС2_4 КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|			И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|			И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И ДанныеРегистра.Активность   
	|	И (ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|		ИЛИ ДанныеРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|		ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|	)
	|	И (ДанныеРегистра.НДС <> 0 ИЛИ ДанныеРегистра.НДСУпр <> 0)
	|	И ДанныеРегистра.НалоговоеНазначение <> ДанныеРегистра.КорНалоговоеНазначение
	|   И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) 
	|   И (
	|		(
	|		ВЫБОР КОГДА 
	|			ДанныеРегистра.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|			И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|			И ((ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) И ДанныеРегистра.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|			ИЛИ (ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) И ДанныеРегистра.КорНалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
	|			)
	|			И ДанныеРегистра.СтатьяСписанияНДС = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)  
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|		) 
	|		ИЛИ (
	|		ВЫБОР КОГДА 
	|			ДанныеРегистра.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|			И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|       	И (ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая) И ДанныеРегистра.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая))
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|		)
	|   )
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДетализацияПартийТоваровДляНДС()
	
	ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.Регистратор) КАК ТипДокумента,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация, 
	|	ДанныеРегистра.Регистратор.Подразделение КАК Подразделение,
	|	ДанныеРегистра.Подразделение КАК ПодразделениеРасходов,
	|	ДанныеРегистра.АналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Назначение.НаправлениеДеятельности КАК КорНаправлениеДеятельности,
	|	ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ДанныеРегистра.АналитикаУчетаНоменклатуры.МестоХранения КАК Склад,            
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.АналитикаУчетаНоменклатуры.МестоХранения) КАК ТипСклада,                   
	|	ДанныеРегистра.КорАналитикаУчетаНоменклатуры.Номенклатура КАК КорНоменклатура,	
	|	ДанныеРегистра.КорАналитикаУчетаНоменклатуры.МестоХранения КАК КорСклад,
	|	ТИПЗНАЧЕНИЯ(ДанныеРегистра.КорАналитикаУчетаНоменклатуры.МестоХранения) КАК ТипКорСклада,                   
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяРасходовАктивов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА ДанныеРегистра.СтатьяРасходовАктивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяРасходовАктивов ССЫЛКА ПланВидовХарактеристик.СтатьиАктивовПассивов
	|			ТОГДА ДанныеРегистра.СтатьяРасходовАктивов
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ПустаяСсылка)
	|	КОНЕЦ КАК СтатьяАктивов,
	|	ДанныеРегистра.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
	|	ВЫБОР
	|		КОГДА ДанныеРегистра.СтатьяРасходовАктивов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов
	|			ТОГДА ДанныеРегистра.СтатьяРасходовАктивов.ГруппаФинансовогоУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ГруппыФинансовогоУчетаДоходовРасходов.ПустаяСсылка)
	|	КОНЕЦ КАК ГФУДоходовРасходов,
	|	ДанныеРегистра.НалоговоеНазначение КАК НалоговоеНазначение,
	|	ДанныеРегистра.КорНалоговоеНазначение КАК КорНалоговоеНазначение,
	|	ДанныеРегистра.АналитикаРасходов,
	|	ВЫРАЗИТЬ(ДанныеРегистра.АналитикаФинансовогоУчета КАК Справочник.ГруппыАналитическогоУчетаНоменклатуры) КАК ГруппаПродукции,
	|	ВЫРАЗИТЬ(ДанныеРегистра.КорАналитикаФинансовогоУчета КАК Справочник.ГруппыАналитическогоУчетаНоменклатуры) КАК КорГруппаПродукции,
	|	ДанныеРегистра.НДС КАК СуммаКорректировкиРегл,
	|	ДанныеРегистра.НДСУпр КАК СуммаКорректировкиУпр,  
	|	ВЫБОР КОГДА 
	|		ДанныеРегистра.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|		И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|		И ((ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) И ДанныеРегистра.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|			ИЛИ (ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) И ДанныеРегистра.КорНалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
	|		)
	|		И ДанныеРегистра.СтатьяСписанияНДС = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)  
	|	ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВключениеНДСВСтоимость,
	|	ВЫБОР КОГДА 
	|		ДанныеРегистра.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|		И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|       И (ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая) И ДанныеРегистра.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая))
	|	ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ИсключениеНДСИзСтоимости,
	|
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ДетализацияПартийТоваровДляНДС КАК ДанныеРегистра
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДокументыКОтражению КАК ДокументыКОтражению
	|		ПО ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|			И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|			И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И ДанныеРегистра.Активность   
	|	И (ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
	|		ИЛИ ДанныеРегистра.ТипЗаписи = ЗНАЧЕНИЕ(Перечисление.ТипыЗаписейПартий.ВозвратПрошлыхПериодов)
	|		ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
	|	)
	|	И (ДанныеРегистра.НДС <> 0 ИЛИ ДанныеРегистра.НДСУпр <> 0)
	|	И ДанныеРегистра.НалоговоеНазначение <> ДанныеРегистра.КорНалоговоеНазначение
	|   И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка) 
	|   И (
	|		(
	|		ВЫБОР КОГДА 
	|			ДанныеРегистра.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|			И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|			И ((ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) И ДанныеРегистра.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|			ИЛИ (ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) И ДанныеРегистра.КорНалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
	|			)
	|			И ДанныеРегистра.СтатьяСписанияНДС = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка)  
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|		) 
	|		ИЛИ (
	|		ВЫБОР КОГДА 
	|			ДанныеРегистра.НалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|			И ДанныеРегистра.КорНалоговоеНазначение <> ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.ПустаяСсылка)  
	|       	И (ДанныеРегистра.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая) И ДанныеРегистра.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая))
	|		ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|		)
	|   )
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНДСРеестрВыданныхНалоговыхДокументов()

	ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК ДоговорКонтрагента,
	|	
	|	ДанныеРегистра.СуммаНДС,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.НДСРеестрВыданныхНалоговыхДокументов КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаНДСРеестрПолученныхНалоговыхДокументов()

	ТекстЗапроса = " 
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
	|	ДанныеРегистра.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация КАК Организация,
	|
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
	|	ДанныеРегистра.АналитикаУчетаПоПартнерам.Договор КАК ДоговорКонтрагента,
	|	
	|	ДанныеРегистра.СуммаНДС,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.НДСРеестрПолученныхНалоговыхДокументов КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.АналитикаУчетаПоПартнерам.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПустаяСсылка)
	|	И ДанныеРегистра.Активность
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаПрочиеРасходыНезавершенногоПроизводства()

	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
    |   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеКосвенныхПроизводственныхРасходов) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
    |	ДанныеРегистра.Регистратор.Подразделение КАК ПодразделениеРегистратора,
	|
	|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК Характеристика,
	|	НЕОПРЕДЕЛЕНО КАК ТипНоменклатуры,
	|	НЕОПРЕДЕЛЕНО КАК Склад,
	|	НЕОПРЕДЕЛЕНО КАК СкладПодразделение,
    |	НЕОПРЕДЕЛЕНО КАК ТипЗапасов,
	|	НЕОПРЕДЕЛЕНО КАК ВидЗапасов,
    |
    |	ДанныеРегистра.СтатьяРасходов КАК СтатьяРасходов,
    |	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
    |	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходовПодразделение,
    |
	|	СУММА(ДанныеРегистра.Стоимость) КАК Стоимость,
	|	СУММА(ДанныеРегистра.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДанныеРегистра.Стоимость - ДанныеРегистра.СтоимостьБезНДС) КАК СуммаНДС,
	|	СУММА(ДанныеРегистра.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(ДанныеРегистра.СтоимостьРеглБезНДС) КАК СтоимостьРеглБезНДС,
	|	СУММА(ДанныеРегистра.НДСРегл) КАК СуммаНДСРегл,
	|	СУММА(ДанныеРегистра.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(ДанныеРегистра.СтоимостьУпрБезНДС) КАК СтоимостьУпрБезНДС,
    |
    |   ДанныеРегистра.РазделУчета КАК РазделУчета,
	|
    |	НЕОПРЕДЕЛЕНО КАК ГФУНоменклатуры,
    |	ДанныеРегистра.СтатьяРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|ГДЕ
	|	ДанныеРегистра.Активность
    |   И ДанныеРегистра.Регистратор ССЫЛКА Документ.РаспределениеПрочихЗатрат
    |   И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
    |   И (ДанныеРегистра.Стоимость <> 0 
	|		ИЛИ ДанныеРегистра.СтоимостьБезНДС <> 0 
	|		ИЛИ ДанныеРегистра.СтоимостьРегл <> 0 
	|		ИЛИ ДанныеРегистра.СтоимостьРеглБезНДС <> 0 
	|		ИЛИ ДанныеРегистра.НДСРегл <> 0
	|		ИЛИ ДанныеРегистра.СтоимостьУпр <> 0 
	|		ИЛИ ДанныеРегистра.СтоимостьУпрБезНДС <> 0 
	|	)
    |СГРУППИРОВАТЬ ПО
    |	ДанныеРегистра.Период,
    |	ДанныеРегистра.Регистратор,
    |	ДанныеРегистра.Организация,
    |	ДанныеРегистра.Подразделение,
    |	ДанныеРегистра.СтатьяРасходов,
    |	ДанныеРегистра.АналитикаРасходов,
    |   ДанныеРегистра.РазделУчета,
    |	ДокументыКОтражению.УчетнаяПолитика
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
    |   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииНематериальныеЗатраты) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
    |	ДанныеРегистра.Регистратор.Подразделение КАК ПодразделениеРегистратора,
    |
	|	АналитикаПродукции.Номенклатура КАК Номенклатура,
	|	АналитикаПродукции.Характеристика КАК Характеристика,
	|	АналитикаПродукции.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	АналитикаПродукции.МестоХранения КАК Склад,
	|	ВЫБОР
	|		КОГДА АналитикаПродукции.МестоХранения ССЫЛКА Справочник.Склады
	|			ТОГДА АналитикаПродукции.МестоХранения.Подразделение
	|		ИНАЧЕ АналитикаПродукции.МестоХранения
	|	КОНЕЦ КАК СкладПодразделение,
    |	ВидыЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ДанныеРегистра.ВидЗапасов КАК ВидЗапасов,
	|
    |	ДанныеРегистра.СтатьяРасходов КАК СтатьяРасходов,
    |	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходов,
    |	ДанныеРегистра.АналитикаРасходов КАК АналитикаРасходовПодразделение,
    |
	|	СУММА(ДанныеРегистра.Стоимость) КАК Стоимость,
	|	СУММА(ДанныеРегистра.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	|	СУММА(ДанныеРегистра.Стоимость - ДанныеРегистра.СтоимостьБезНДС) КАК СуммаНДС,
	|	СУММА(ДанныеРегистра.СтоимостьРегл) КАК СтоимостьРегл,
	|	СУММА(ДанныеРегистра.СтоимостьРеглБезНДС) КАК СтоимостьРеглБезНДС,
	|	СУММА(ДанныеРегистра.НДСРегл) КАК СуммаНДСРегл,
	|	СУММА(ДанныеРегистра.СтоимостьУпр) КАК СтоимостьУпр,
	|	СУММА(ДанныеРегистра.СтоимостьУпрБезНДС) КАК СтоимостьУпрБезНДС,
    |
    |   ДанныеРегистра.РазделУчета КАК РазделУчета,
	|
    |	АналитикаПродукции.Номенклатура.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
    |	ДанныеРегистра.СтатьяРасходов.ГруппаФинансовогоУчета КАК ГФУДоходовРасходов,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ВидыЗапасов КАК ВидыЗапасов
	|	ПО
	|		ДанныеРегистра.ВидЗапасов = ВидыЗапасов.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО
	|		ДанныеРегистра.АналитикаУчетаПродукции = АналитикаПродукции.КлючАналитики
	|ГДЕ
	|	ДанныеРегистра.Активность
    |   И (ДанныеРегистра.Регистратор ССЫЛКА Документ.ВыпускПродукции 
	|		ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|		ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа
	|		ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|	)
    |   И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
    |   И (ДанныеРегистра.Стоимость <> 0 
	|		ИЛИ ДанныеРегистра.СтоимостьБезНДС <> 0 
	|		ИЛИ ДанныеРегистра.СтоимостьРегл <> 0 
	|		ИЛИ ДанныеРегистра.СтоимостьРеглБезНДС <> 0 
	|		ИЛИ ДанныеРегистра.НДСРегл <> 0
	|		ИЛИ ДанныеРегистра.СтоимостьУпр <> 0 
	|		ИЛИ ДанныеРегистра.СтоимостьУпрБезНДС <> 0 
	|)
    |СГРУППИРОВАТЬ ПО
    |	ДанныеРегистра.Период,
    |	ДанныеРегистра.Регистратор,
    |	ДанныеРегистра.Организация,
    |	ДанныеРегистра.Подразделение,
    |   АналитикаПродукции.Номенклатура,
    |   АналитикаПродукции.Характеристика,
    |   АналитикаПродукции.МестоХранения,
	|	ВЫБОР
	|		КОГДА АналитикаПродукции.МестоХранения ССЫЛКА Справочник.Склады
	|			ТОГДА АналитикаПродукции.МестоХранения.Подразделение
	|		ИНАЧЕ АналитикаПродукции.МестоХранения
	|	КОНЕЦ,
    |	ВидыЗапасов.ТипЗапасов,
    |   ДанныеРегистра.ВидЗапасов,
    |	ДанныеРегистра.СтатьяРасходов,
    |	ДанныеРегистра.АналитикаРасходов,
    |   ДанныеРегистра.РазделУчета,
    |	ДокументыКОтражению.УчетнаяПолитика
	|";
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаТрудозатратыНезавершенногоПроизводства()

	ТекстЗапроса = "
	|
	|ВЫБРАТЬ
	|	ДанныеРегистра.Период КАК Период,
	|	ДанныеРегистра.Регистратор КАК Регистратор,
    |   ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыпускПродукцииСдельнаяЗаработнаяПлата) КАК ХозяйственнаяОперация,
	|	ДанныеРегистра.Организация КАК Организация,
	|	ДанныеРегистра.Подразделение КАК Подразделение,
    |
	|	АналитикаПродукции.Номенклатура КАК Номенклатура,
	|	АналитикаПродукции.Характеристика КАК Характеристика,
	|	АналитикаПродукции.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	АналитикаПродукции.МестоХранения КАК Склад,
	|	ВЫБОР
	|		КОГДА АналитикаПродукции.МестоХранения ССЫЛКА Справочник.Склады
	|			ТОГДА АналитикаПродукции.МестоХранения.Подразделение
	|		ИНАЧЕ АналитикаПродукции.МестоХранения
	|	КОНЕЦ КАК СкладПодразделение,
    |	ВидыЗапасов.ТипЗапасов КАК ТипЗапасов,
	|	ДанныеРегистра.КорВидЗапасовПродукции КАК ВидЗапасов,
    |
    |   ВЫБОР 
    |       КОГДА ДанныеРегистра.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) 
    |           ТОГДА ДанныеРегистра.СтатьяКалькуляцииБезЗаказа
    |       ИНАЧЕ ДанныеРегистра.СтатьяКалькуляции
    |	КОНЕЦ КАК СтатьяКалькуляции,
    |
    |   ДанныеРегистра.ВидРабот КАК ВидРабот,
	|
	|	СУММА(ДанныеРегистра.Стоимость) КАК Стоимость,
	|	СУММА(ДанныеРегистра.СтоимостьРегл) КАК СтоимостьРегл,
    |
    |   ДанныеРегистра.КорРазделУчета КАК КорРазделУчета,
	|
	|	АналитикаПродукции.Номенклатура.ГруппаФинансовогоУчета КАК ГФУНоменклатуры,
	|	ДокументыКОтражению.УчетнаяПолитика КАК УчетнаяПолитика
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ДанныеРегистра
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		ДокументыКОтражению КАК ДокументыКОтражению
	|	ПО
	|		ДанныеРегистра.Регистратор = ДокументыКОтражению.Регистратор
	|		И ДанныеРегистра.Организация = ДокументыКОтражению.Организация
	|		И НАЧАЛОПЕРИОДА(ДанныеРегистра.Период, ДЕНЬ) = ДокументыКОтражению.ДатаОтражения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.ВидыЗапасов КАК ВидыЗапасов
	|	ПО
	|		ДанныеРегистра.КорВидЗапасовПродукции = ВидыЗапасов.Ссылка
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.АналитикаУчетаНоменклатуры КАК АналитикаПродукции
	|	ПО
	|		ДанныеРегистра.КорАналитикаУчетаПродукции = АналитикаПродукции.КлючАналитики
	|ГДЕ
	|	ДанныеРегистра.Активность
    |   И (ДанныеРегистра.Регистратор ССЫЛКА Документ.ВыпускПродукции 
	|		ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.ОтчетДавальцу
	|		ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.ПроизводствоБезЗаказа
	|		ИЛИ ДанныеРегистра.Регистратор ССЫЛКА Документ.ЭтапПроизводства2_2
	|	)
    |   И ДанныеРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
    |   И (ДанныеРегистра.Стоимость <> 0 ИЛИ ДанныеРегистра.СтоимостьРегл <> 0)
    |СГРУППИРОВАТЬ ПО
    |	ДанныеРегистра.Период,
    |	ДанныеРегистра.Регистратор,
    |	ДанныеРегистра.Организация,
    |	ДанныеРегистра.Подразделение,
	|	АналитикаПродукции.Номенклатура,
	|	АналитикаПродукции.Характеристика,
    |   АналитикаПродукции.МестоХранения,
	|	ВЫБОР
	|		КОГДА АналитикаПродукции.МестоХранения ССЫЛКА Справочник.Склады
	|			ТОГДА АналитикаПродукции.МестоХранения.Подразделение
	|		ИНАЧЕ АналитикаПродукции.МестоХранения
	|	КОНЕЦ,
    |	ВидыЗапасов.ТипЗапасов,
    |   ДанныеРегистра.КорВидЗапасовПродукции,
    |   ВЫБОР 
    |       КОГДА ДанныеРегистра.СтатьяКалькуляции = ЗНАЧЕНИЕ(Справочник.СтатьиКалькуляции.ПустаяСсылка) 
    |           ТОГДА ДанныеРегистра.СтатьяКалькуляцииБезЗаказа
    |       ИНАЧЕ ДанныеРегистра.СтатьяКалькуляции
    |	КОНЕЦ,
    |   ДанныеРегистра.ВидРабот,
    |   ДанныеРегистра.КорРазделУчета,
    |	ДокументыКОтражению.УчетнаяПолитика
	|";
	
	Возврат ТекстЗапроса;

КонецФункции


#КонецОбласти

#Область Транслятор

Процедура ИнициализироватьТаблицуНастройкиОпераций(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиХозяйственныхОпераций.ХозяйственнаяОперация КАК Операция,
	|	НастройкиХозяйственныхОпераций.ИсточникДанных КАК ИсточникДанных
	|ПОМЕСТИТЬ НастройкиОпераций
	|ИЗ
	|	Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозяйственныхОпераций
	|ГДЕ
	|	НастройкиХозяйственныхОпераций.ИспользоватьВМеждународномУчете = ИСТИНА
	|	И НастройкиХозяйственныхОпераций.ЭтоГруппа = ЛОЖЬ
	|	И НастройкиХозяйственныхОпераций.ПометкаУдаления = ЛОЖЬ
	|	И НастройкиХозяйственныхОпераций.ИсточникДанных <> """"
	|";
	Запрос.Выполнить();
	
КонецПроцедуры

Функция ТаблицаУточненияСчетов()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПравилаОтражения.ШаблонПроводки КАК ШаблонПроводки,
	|	ПравилаУточненияСчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ПравилаУточненияСчетов.ВидДвижения КАК ВидДвижения,
	|	ПравилаУточненияСчетов.СчетУчета КАК СчетУчета
	|ИЗ
	|	РегистрСведений.ПравилаОтраженияВМеждународномУчете КАК ПравилаОтражения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПравилаУточненияСчетовВМеждународномУчете КАК ПравилаУточненияСчетов
	|		ПО ПравилаОтражения.ШаблонПроводки = ПравилаУточненияСчетов.ШаблонПроводки
	|";
	
	ТаблицаУточненияСчетов = Запрос.Выполнить().Выгрузить();
	ТаблицаУточненияСчетов.Индексы.Добавить("ШаблонПроводки, ГруппаФинансовогоУчета, ВидДвижения");

	Возврат ТаблицаУточненияСчетов;

КонецФункции


Функция НастройкиОтраженияВМеждународномУчете()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ШаблоныПроводок.Ссылка КАК ШаблонПроводки,
	|	ШаблоныПроводок.ЭтоГруппаШаблонов КАК ЭтоГруппаШаблонов,
	|	ШаблоныПроводок.Операция КАК Операция,
	|	ШаблоныПроводок.Операция.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ШаблоныПроводок.ВариантСовместногоПрименения КАК ВариантСовместногоПрименения,
	|	ШаблоныПроводок.СчетДебетаПоУмолчанию КАК СчетДебетаПоУмолчанию,
	|	ШаблоныПроводок.СчетКредитаПоУмолчанию КАК СчетКредитаПоУмолчанию,
	|	ШаблоныПроводок.ТипИсточникаУточненияСчетаДт КАК ИсточникУточненияСчетаДт,
	|	ШаблоныПроводок.ТипИсточникаУточненияСчетаКт КАК ИсточникУточненияСчетаКт,
	|	ШаблоныПроводок.ИсточникПодразделенияДт КАК ИсточникПодразделенияДт,
	|	ШаблоныПроводок.ИсточникПодразделенияКт КАК ИсточникПодразделенияКт,
	|	ШаблоныПроводок.ИсточникНаправленияДт КАК ИсточникНаправленияДт,
	|	ШаблоныПроводок.ИсточникНаправленияКт КАК ИсточникНаправленияКт,
	|	ШаблоныПроводок.ИсточникСуммыВВалютеДт КАК ИсточникСуммыВВалютеДт,
	|	ШаблоныПроводок.ИсточникСуммыВВалютеКт КАК ИсточникСуммыВВалютеКт,
	|	ШаблоныПроводок.ИсточникБалансовойСуммы КАК ИсточникБалансовойСуммы,
	|	ШаблоныПроводок.ИзменятьЗнакОперацииПриОтраженииВУчете КАК ИзменятьЗнакОперации,
	|	ШаблоныПроводок.РучноеУточнениеПроводки КАК РучноеУточнениеПроводки,
	|	ШаблоныПроводок.ДополнительныйОтбор КАК ДополнительныйОтбор,
	|	ШаблоныПроводок.УстановленДополнительныйОтбор КАК УстановленДополнительныйОтбор,
	|	ШаблоныПроводок.Игнорировать КАК Игнорировать,
	|	ШаблоныПроводок.ЗаполнениеСубконтоПоСоответствию КАК ЗаполнениеСубконтоПоСоответствию,
	|	ПравилаОтражения.УчетнаяПолитика КАК УчетнаяПолитика,
	|	ВЫБОР 
	|		КОГДА &НоваяАрхитектураРасчетов И НастройкиОпераций.ИсточникДанных = ""РасчетыСКлиентамиПоДокументам""
	|			ТОГДА ""РасчетыСКлиентамиПоСрокам""
	|		КОГДА &НоваяАрхитектураРасчетов И НастройкиОпераций.ИсточникДанных = ""РасчетыСПоставщикамиПоДокументам""
	|			ТОГДА ""РасчетыСПоставщикамиПоСрокам""
	|		ИНАЧЕ
	|	    	НастройкиОпераций.ИсточникДанных
	|	КОНЕЦ КАК ИсточникДанных,
	|	НастройкиОпераций.Приход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура) КАК ДвижениеНоменклатурыДт,
	|	НастройкиОпераций.Расход = ЗНАЧЕНИЕ(Перечисление.ТипыДанныхУчета.Номенклатура) КАК ДвижениеНоменклатурыКт,
	|	ШаблоныПроводок.Родитель КАК РодительскийШаблонПроводки,
	|	ШаблоныПроводок.Родитель.Родитель КАК РодительскийШаблонПроводки2,
	|	ШаблоныПроводок.Родитель.Родитель.ВариантСовместногоПрименения КАК ВариантСовместногоПримененияУровня2,
	|	ШаблоныПроводок.ИсточникКоличестваДт КАК ИсточникКоличестваДт,
	|	ШаблоныПроводок.ИсточникКоличестваКт КАК ИсточникКоличестваКт
	|
	|ИЗ 
	|	Справочник.ШаблоныПроводокДляМеждународногоУчета КАК ШаблоныПроводок
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ПравилаОтраженияВМеждународномУчете КАК ПравилаОтражения
	|	ПО
	|		ШаблоныПроводок.Ссылка = ПравилаОтражения.ШаблонПроводки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.НастройкиХозяйственныхОпераций КАК НастройкиОпераций
	|	ПО
	|		ШаблоныПроводок.Операция = НастройкиОпераций.Ссылка
	|ГДЕ
	|	НЕ ШаблоныПроводок.ПометкаУдаления
	|	И (НЕ ПравилаОтражения.УчетнаяПолитика ЕСТЬ NULL ИЛИ ШаблоныПроводок.ЭтоГруппаШаблонов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШаблоныПроводок.РеквизитДопУпорядочивания ИЕРАРХИЯ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиЗаполнения.Ссылка КАК ШаблонПроводки,
	|	НастройкиЗаполнения.ПоложениеСубконто КАК ПоложениеСубконто,
	|	НастройкиЗаполнения.ВидСубконто КАК ВидСубконто,
	|	НастройкиЗаполнения.ЗаполнятьИзИсточника КАК ЗаполнятьИзИсточника,
	|	НастройкиЗаполнения.УказанноеЗначение КАК УказанноеЗначение,
	|	НастройкиЗаполнения.Выражение КАК Выражение,
	|	НастройкиОпераций.ИсточникДанных КАК ИсточникДанных
	|ИЗ
	|	Справочник.ШаблоныПроводокДляМеждународногоУчета.НастройкиЗаполненияСубконто КАК НастройкиЗаполнения
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НастройкиХозяйственныхОпераций КАК НастройкиОпераций
	|	ПО НастройкиЗаполнения.Ссылка.Операция = НастройкиОпераций.Ссылка
	|ГДЕ
	|	НЕ НастройкиЗаполнения.Ссылка.ПометкаУдаления
	|";
	
	Запрос.УстановитьПараметр("НоваяАрхитектураРасчетов", Константы.НоваяАрхитектураВзаиморасчетов.Получить());
	Результаты = Запрос.ВыполнитьПакет();
	
	Настройки = Новый Структура;
	Настройки.Вставить("ШаблоныПроводок", Результаты[0].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией));
	Настройки.Вставить("СоответствиеСубконто", Результаты[1].Выгрузить());
	
	Возврат Настройки;
	
КонецФункции

Процедура ОтразитьДанныеРегистра(ИмяРегистра, ТекстЗапроса, ПараметрыОтражения, ТаблицаПроводок);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ПараметрыОтражения.МенеджерВременныхТаблиц;
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОперативногоУчета = Результат.Выгрузить();
	
	// Добавление ключевого поля
	ДанныеОперативногоУчета.Колонки.Добавить("КлючСтроки", Новый ОписаниеТипов("Число"));
	ДанныеОперативногоУчета.Индексы.Добавить("КлючСтроки");
	КлючСтроки = 1;
	Для каждого Строка Из ДанныеОперативногоУчета Цикл
		Строка.КлючСтроки = КлючСтроки;
		КлючСтроки = КлючСтроки + 1;
	КонецЦикла;
	
	ДанныеОперативногоУчета.Колонки.Добавить("Обработан", Новый ОписаниеТипов("Булево"));
	ДанныеОперативногоУчета.Колонки.Добавить("ГруппаВытеснения", Новый ОписаниеТипов("СправочникСсылка.ШаблоныПроводокДляМеждународногоУчета"));
	
	НеОтражаемыеХозяйственныеОперации = НеОтражаемыеХозяйственныеОперации(ДанныеОперативногоУчета, ТаблицаПроводок, ПараметрыОтражения.СтруктураПроводки);
	Для каждого НеОтражаемаяХозяйственнаяОперация Из НеОтражаемыеХозяйственныеОперации Цикл
		ДанныеОперативногоУчета.Удалить(НеОтражаемаяХозяйственнаяОперация);
	КонецЦикла;
	
	ПараметрыОтражения.Вставить("ИмяРегистра", ИмяРегистра);
	ПараметрыРегистра = МеждународныйУчетСерверПовтИсп.ПараметрыРегистра(ИмяРегистра);
	Если Не ПроверитьКорректностьПоказателей(Результат, ИмяРегистра, ПараметрыРегистра) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыОтражения.Вставить("ПараметрыРегистра", ПараметрыРегистра);
	
	Отбор = Новый Структура("ИсточникДанных", ИмяРегистра);
	ШаблоныРегистра = ПараметрыОтражения.НастройкиОтражения.ШаблоныПроводок.Строки.НайтиСтроки(Отбор);
	ПараметрыОтражения.Вставить("ШаблоныПроводок", ШаблоныРегистра);
	ПараметрыОтражения.Вставить("СоответствиеСубконто", ПараметрыОтражения.НастройкиОтражения.СоответствиеСубконто);
	ПараметрыОтражения.Вставить("ВариантСовместногоПрименения", Перечисления.ВариантыСовместногоПримененияШаблоновПроводок.Все);
	ПараметрыОтражения.Вставить("ДополнительныйОтборГруппы", Неопределено);
	
	СхемаКомпоновкиДанных = СхемаКомпоновкиДанныхОперативногоУчета(ДанныеОперативногоУчета);
	
	ОтразитьДанныеОперативногоУчетаРекурсивно(СхемаКомпоновкиДанных,
		ДанныеОперативногоУчета,
		ПараметрыОтражения,
		ТаблицаПроводок);
		
	ДанныеОперативногоУчета.Свернуть("Регистратор, ХозяйственнаяОперация, Организация", "Обработан");
	Для каждого Данные Из ДанныеОперативногоУчета Цикл
		Если Не Данные.Обработан Тогда
			Проводка = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтражения.СтруктураПроводки);
			ЗаполнитьЗначенияСвойств(Проводка, Данные);
			МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.ОтсутствуютПравилаОтраженияВУчете);
			ТекстОшибки = НСтр("ru='Для хозяйственной операции ""%ХозяйственнаяОперация%"" по регистру ""%ИмяРегистра%"" отсутствуют шаблоны проводок.';uk='Для господарської операції ""%ХозяйственнаяОперация%"" по регістру ""%ИмяРегистра%"" відсутні шаблони проводок.'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ХозяйственнаяОперация%", Данные.ХозяйственнаяОперация);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяРегистра%", ИмяРегистра);
			МеждународныйУчетПроведениеСервер.ДобавитьОшибкуПроводки(Проводка, ТекстОшибки);
			МеждународныйУчетПроведениеСервер.ДобавитьПроводкуВТаблицуПроводок(ТаблицаПроводок, Проводка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НеОтражаемыеХозяйственныеОперации(ДанныеОперативногоУчета, ТаблицаПроводок, СтруктураПроводки)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеОперативногоУчета.Период КАК Период,
	|	ДанныеОперативногоУчета.КлючСтроки КАК КлючСтроки,
	|	ДанныеОперативногоУчета.Организация КАК Организация,
	|	ДанныеОперативногоУчета.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДанныеОперативногоУчета.УчетнаяПолитика КАК УчетнаяПолитика
	|ПОМЕСТИТЬ ДанныеОперативногоУчета
	|ИЗ
	|	&ДанныеОперативногоУчета КАК ДанныеОперативногоУчета
	|ИНДЕКСИРОВАТЬ ПО
	|	ХозяйственнаяОперация,
	|	УчетнаяПолитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеОперативногоУчета.Период КАК Период,
	|	ДанныеОперативногоУчета.КлючСтроки КАК КлючСтроки,
	|	ДанныеОперативногоУчета.Организация КАК Организация,
	|	ДанныеОперативногоУчета.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ИСТИНА КАК ИспользоватьВМеждународномУчете
	|ИЗ
	|	ДанныеОперативногоУчета КАК ДанныеОперативногоУчета
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозопераций
	|	ПО
	|		ДанныеОперативногоУчета.ХозяйственнаяОперация = НастройкиХозопераций.ХозяйственнаяОперация
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		РегистрСведений.ХозяйственныеОперацииНеОтражаемыеВМеждународномУчете КАК НеОтражаемыеХозоперации
	|	ПО
	|		ДанныеОперативногоУчета.УчетнаяПолитика = НеОтражаемыеХозоперации.УчетнаяПолитика
	|		И НастройкиХозопераций.Ссылка = НеОтражаемыеХозоперации.Операция
	|ГДЕ
	|	 НастройкиХозОпераций.ИспользоватьВМеждународномУчете
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДанныеОперативногоУчета.Период КАК Период,
	|	ДанныеОперативногоУчета.КлючСтроки КАК КлючСтроки,
	|	ДанныеОперативногоУчета.Организация КАК Организация,
	|	ДанныеОперативногоУчета.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	НастройкиХозОпераций.ИспользоватьВМеждународномУчете КАК ИспользоватьВМеждународномУчете
	|ИЗ
	|	ДанныеОперативногоУчета КАК ДанныеОперативногоУчета
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Справочник.НастройкиХозяйственныхОпераций КАК НастройкиХозОпераций
	|	ПО
	|		ДанныеОперативногоУчета.ХозяйственнаяОперация = НастройкиХозопераций.ХозяйственнаяОперация
	|ГДЕ
	|	НЕ НастройкиХозОпераций.ИспользоватьВМеждународномУчете
	|";
	
	Запрос.УстановитьПараметр("ДанныеОперативногоУчета", ДанныеОперативногоУчета);
	ВыборкаНеОтражаемыеХозоперации = Запрос.Выполнить().Выбрать();
	НеОтражаемыеХозяйственныеОперации = Новый Массив;
	Пока ВыборкаНеОтражаемыеХозоперации.Следующий() Цикл
		ЗаписьРегистра = ДанныеОперативногоУчета.Найти(ВыборкаНеОтражаемыеХозоперации.КлючСтроки, "КлючСтроки");
		НеОтражаемыеХозяйственныеОперации.Добавить(ЗаписьРегистра);
		Проводка = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПроводки);
		Проводка.Регистратор = ЗаписьРегистра.Регистратор;
		ЗаполнитьЗначенияСвойств(Проводка, ВыборкаНеОтражаемыеХозоперации);
		МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.ОтраженоВУчете);
		ТекстОшибки = НСтр("ru='Хозяйственная операция ""%ХозяйственнаяОперация%"" игнорируется учетной политикой.';uk='Господарська операція ""%ХозяйственнаяОперация%"" ігнорується обліковою політикою.'");
		Если НЕ ВыборкаНеОтражаемыеХозОперации.ИспользоватьВМеждународномУчете Тогда
			ТекстОшибки = НСтр("ru='Хозяйственная операция ""%ХозяйственнаяОперация%"" не используется в международном учете.';uk='Господарська операція ""%ХозяйственнаяОперация%"" не використовується в міжнародному обліку.'");
		КонецЕсли;
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ХозяйственнаяОперация%", ВыборкаНеОтражаемыеХозоперации.ХозяйственнаяОперация);
		МеждународныйУчетПроведениеСервер.ДобавитьОшибкуПроводки(Проводка, ТекстОшибки);
		МеждународныйУчетПроведениеСервер.ДобавитьПроводкуВТаблицуПроводок(ТаблицаПроводок, Проводка);
	КонецЦикла;
	
	Возврат НеОтражаемыеХозяйственныеОперации;

КонецФункции

Функция СхемаКомпоновкиДанныхОперативногоУчета(ДанныеОперативногоУчета)

	СхемаКомпоновкиДанных = ФинансоваяОтчетностьСервер.НоваяСхемаНаборОбъект("ДанныеОперативногоУчета");
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("ДанныеОперативногоУчета");
	
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
	НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
	
	Для Каждого Колонка Из ДанныеОперативногоУчета.Колонки Цикл
		ИмяПоля = Колонка.Имя;
		НовоеПоле = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПоле.Поле = ИмяПоля;
		НовоеПоле.ПутьКДанным = ИмяПоля;
		НовоеПоле.ТипЗначения = Колонка.ТипЗначения;
	КонецЦикла;
	
	Возврат СхемаКомпоновкиДанных;

КонецФункции

Процедура ОтразитьДанныеОперативногоУчетаРекурсивно(СхемаКомпоновкиДанных, ДанныеОперативногоУчета, ПараметрыОтражения, ТаблицаПроводок)

	ШаблоныПроводок = ПараметрыОтражения.ШаблоныПроводок;
	СоответствиеСубконто = ПараметрыОтражения.СоответствиеСубконто;
	ВариантСовместногоПрименения = ПараметрыОтражения.ВариантСовместногоПрименения;
	ДополнительныйОтборГруппы = ПараметрыОтражения.ДополнительныйОтборГруппы;
	СтруктураПроводки = ПараметрыОтражения.СтруктураПроводки;
	
	Вытеснение = Перечисления.ВариантыСовместногоПримененияШаблоновПроводок.Вытеснение;
	МассивВытесненныхСтрок = Новый Массив;
	Для каждого ШаблонПроводки Из ШаблоныПроводок Цикл
		
		Если ШаблонПроводки.ЭтоГруппаШаблонов Тогда
			Если ШаблонПроводки.УстановленДополнительныйОтбор Тогда
				ДополнительныйОтбор = Новый НастройкиКомпоновкиДанных;
				НастройкиОтбора = ШаблонПроводки.ДополнительныйОтбор.Получить();
				ФинансоваяОтчетностьСервер.СкопироватьОтбор(НастройкиОтбора.Отбор, ДополнительныйОтбор.Отбор); 
				Если ДополнительныйОтборГруппы <> Неопределено Тогда
					ФинансоваяОтчетностьСервер.СкопироватьОтбор(ДополнительныйОтборГруппы.Отбор, ДополнительныйОтбор.Отбор); 
				КонецЕсли;
			КонецЕсли;
			ПараметрыОтраженияГруппы = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыОтражения);
			ПараметрыОтраженияГруппы.Вставить("ШаблоныПроводок", ШаблонПроводки.Строки);
			ПараметрыОтраженияГруппы.Вставить("ВариантСовместногоПрименения", ШаблонПроводки.ВариантСовместногоПрименения);
			ПараметрыОтраженияГруппы.Вставить("ДополнительныйОтборГруппы", ДополнительныйОтбор);
			ПараметрыОтраженияГруппы.Вставить("СтруктураПроводки", СтруктураПроводки);
			
			ОтразитьДанныеОперативногоУчетаРекурсивно(
				СхемаКомпоновкиДанных, 
				ДанныеОперативногоУчета, 
				ПараметрыОтраженияГруппы, 
				ТаблицаПроводок);
		Иначе
			
			Настройки = Новый НастройкиКомпоновкиДанных;
			НоваяГруппировка = Настройки.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
			НоваяГруппировка.Выбор.Элементы.Добавить(Тип("АвтоВыбранноеПолеКомпоновкиДанных"));
			НоваяГруппировка.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			
			ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, "КлючСтроки");
			
			ТаблицаУточненияСчетов  = ПараметрыОтражения.ТаблицаУточненияСчетов;
			ВалютыУчета             = ПараметрыОтражения.ВалютыУчета;
			
			Показатели              = ПараметрыОтражения.ПараметрыРегистра.Показатели;
			ПоказателиВВалюте       = ПараметрыОтражения.ПараметрыРегистра.ПоказателиВВалюте;
			ПоказателиКоличества    = ПараметрыОтражения.ПараметрыРегистра.ПоказателиКоличества;
			ИсточникиУточненияСчета = ПараметрыОтражения.ПараметрыРегистра.ИсточникиУточненияСчета;
			ИсточникиПодразделений  = ПараметрыОтражения.ПараметрыРегистра.ИсточникиПодразделений;
			ИсточникиНаправлений    = ПараметрыОтражения.ПараметрыРегистра.ИсточникиНаправлений;
			ИсточникиСубконто       = ПараметрыОтражения.ПараметрыРегистра.ИсточникиСубконто;
			
			ЗаполнениеСубконтоПоСоответствию = ШаблонПроводки.ЗаполнениеСубконтоПоСоответствию;
			Если ЗаполнениеСубконтоПоСоответствию Тогда
				ИсточникиСубконто = УстановитьЗаполнениеСубконтоПоСоответствиюПользователя(
										СхемаКомпоновкиДанных, 
										Настройки, 
										ШаблонПроводки, 
										СоответствиеСубконто);
			КонецЕсли;
			
			УстановитьОтборДанныхПоШаблонуПроводки(
				СхемаКомпоновкиДанных, 
				Настройки, 
				ШаблонПроводки, 
				ДополнительныйОтборГруппы,
				ВариантСовместногоПрименения);
				
			ВнешниеНаборы = Новый Структура;
			ВнешниеНаборы.Вставить("ДанныеОперативногоУчета", ДанныеОперативногоУчета);
			
			Попытка
				Результат = ФинансоваяОтчетностьСервер.ВыгрузитьРезультатСКД(СхемаКомпоновкиДанных, Настройки, ВнешниеНаборы);
			Исключение
				ТекстСообщения = Символы.ПС + НСтр("ru='Не удалось получить данные для отражения хозяйственной операции ""%ХозОперация%""
|по шаблону проводки ""%ШаблонПроводки%""
|по причине'
|;uk='Не вдалося дані для відображення господарської операції  ""%ХозОперация%""
|за шаблоном проводки ""%ШаблонПроводки%""
|через'") + ":" + Символы.ПС + Символы.Таб + "%Причина%";
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ХозОперация%", ШаблонПроводки.ХозяйственнаяОперация);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ШаблонПроводки%", ШаблонПроводки.ШаблонПроводки);
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				ТекстСообщения = ТекстСообщения + Символы.ПС
					+ НСтр("ru='Возможно в шаблоне проводки установлены некорректные настройки дополнительного отбора или заполнения субконто.';uk='Можливо в шаблоні проводки встановлені некоректні настройки додаткового відбору або заповнення субконто.'");
				ВызватьИсключение ТекстСообщения;
			КонецПопытки;
			
			Для каждого Строка Из Результат Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("КлючСтроки", Строка.КлючСтроки);
				Данные = ДанныеОперативногоУчета.НайтиСтроки(Отбор)[0];
				
				Данные.Обработан = Истина;
				
				Если ШаблонПроводки.Игнорировать Тогда
					Продолжить;
				КонецЕсли;
				
				Если ВариантСовместногоПрименения = Вытеснение Тогда
					Данные.ГруппаВытеснения = ШаблонПроводки.РодительскийШаблонПроводки;
				КонецЕсли;
				
				Если ШаблонПроводки.Уровень() = 2
					И ШаблонПроводки.ВариантСовместногоПримененияУровня2 = Вытеснение Тогда
					МассивВытесненныхСтрок.Добавить(Данные);
				КонецЕсли;
				
				Проводка = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПроводки);
				ЗаполнитьЗначенияСвойств(Проводка, Данные, "Период, Регистратор, Организация");
				
				Если ШаблонПроводки.РучноеУточнениеПроводки Тогда
					МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.КОтражениюВУчетеВручную);
				КонецЕсли;
				
				Проводка.ШаблонПроводки = ШаблонПроводки.ШаблонПроводки;
				
				ИсточникБалансовойСуммы = ШаблонПроводки.ИсточникБалансовойСуммы;
				Если Не ЗначениеЗаполнено(ИсточникБалансовойСуммы) Тогда
					МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.ОтсутствуютПравилаОтраженияВУчете);
					ТекстОшибки = НСтр("ru='Не выбран источник балансовой суммы.';uk='Не вибрано джерело балансової суми.'");
					МеждународныйУчетПроведениеСервер.ДобавитьОшибкуПроводки(Проводка, ТекстОшибки);
				Иначе
					Ресурсы = Показатели.Получить(ИсточникБалансовойСуммы).Ресурсы;
					
					ФункциональнаяСумма = ФункциональнаяСумма(Данные, ШаблонПроводки, Ресурсы, ВалютыУчета); 
					Проводка.Сумма = ФункциональнаяСумма.Сумма;
					Проводка.ВалютаХраненияСуммыФункциональной = ФункциональнаяСумма.Валюта;
					
					СуммаПредставления = БалансоваяСумма(Данные, ШаблонПроводки, Ресурсы, ВалютыУчета, ВалютыУчета.ВалютаПредставления);
					Проводка.СуммаПредставления = СуммаПредставления.Сумма;
					Проводка.ВалютаХраненияСуммыПредставления = СуммаПредставления.Валюта;
					Если СуммаПредставления.Сумма = 0 Тогда
						Проводка.СуммаПредставления = ФункциональнаяСумма.Сумма;
						Проводка.ВалютаХраненияСуммыПредставления = ФункциональнаяСумма.Валюта;
					КонецЕсли;
				КонецЕсли;
					
				Проводка.СчетДт = СчетУчета(Данные, ШаблонПроводки, ТаблицаУточненияСчетов, ИсточникиУточненияСчета, "Дт");
				Проводка.СчетКт = СчетУчета(Данные, ШаблонПроводки, ТаблицаУточненияСчетов, ИсточникиУточненияСчета, "Кт");
				
				СвойстваСчетаДт = МеждународныйУчетСерверПовтИсп.СвойстваСчета(Проводка.СчетДт);
				Если СвойстваСчетаДт.Валютный Тогда
					ИсточникСуммыВВалютеДт = ШаблонПроводки.ИсточникСуммыВВалютеДт;
					Если Не ЗначениеЗаполнено(ИсточникСуммыВВалютеДт) Тогда
						МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.ОтсутствуютПравилаОтраженияВУчете);
						ТекстОшибки = НСтр("ru='Не выбран источник валютной суммы Дт.';uk='Не вибрано джерело валютної суми Дт.'");
						МеждународныйУчетПроведениеСервер.ДобавитьОшибкуПроводки(Проводка, ТекстОшибки);
					Иначе
						ИсточникВалютыДт = ПоказателиВВалюте.Получить(ИсточникСуммыВВалютеДт).ИсточникВалюты;
						Проводка.ВалютаДт = Данные[ИсточникВалютыДт];
						Проводка.ВалютнаяСуммаДт = СуммаВВалюте(Данные, ШаблонПроводки, Ресурсы, ИсточникВалютыДт);
					КонецЕсли;
				Иначе
					Проводка.ВалютаДт = Справочники.Валюты.ПустаяСсылка();
					Проводка.ВалютнаяСуммаДт = 0;
				КонецЕсли;
				
				СвойстваСчетаКт = МеждународныйУчетСерверПовтИсп.СвойстваСчета(Проводка.СчетКт);
				Если СвойстваСчетаКт.Валютный Тогда
					ИсточникСуммыВВалютеКт = ШаблонПроводки.ИсточникСуммыВВалютеКт;
					Если Не ЗначениеЗаполнено(ИсточникСуммыВВалютеКт) Тогда
						МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.ОтсутствуютПравилаОтраженияВУчете);
						ТекстОшибки = НСтр("ru='Не выбран источник валютной суммы Кт.';uk='Не вибрано джерело валютної суми Кт.'");
						МеждународныйУчетПроведениеСервер.ДобавитьОшибкуПроводки(Проводка, ТекстОшибки);
					Иначе
						ИсточникВалютыКт = ПоказателиВВалюте.Получить(ИсточникСуммыВВалютеКт).ИсточникВалюты;
						Проводка.ВалютаКт = Данные[ИсточникВалютыКт];
						Проводка.ВалютнаяСуммаКт = СуммаВВалюте(Данные, ШаблонПроводки, Ресурсы, ИсточникВалютыКт);
					КонецЕсли;
				Иначе
					Проводка.ВалютаКт = Справочники.Валюты.ПустаяСсылка();
					Проводка.ВалютнаяСуммаКт = 0;
				КонецЕсли;
				
				Если СвойстваСчетаДт.УчетПоПодразделениям Тогда
					Проводка.ПодразделениеДт = ЗначениеИзмерения(Данные, ИсточникиПодразделений, ШаблонПроводки.ИсточникПодразделенияДт);
				КонецЕсли;
				Если СвойстваСчетаКт.УчетПоПодразделениям Тогда
					Проводка.ПодразделениеКт = ЗначениеИзмерения(Данные, ИсточникиПодразделений, ШаблонПроводки.ИсточникПодразделенияКт);
				КонецЕсли;
				
				Если СвойстваСчетаДт.УчетПоНаправлениямДеятельности Тогда
					Проводка.НаправлениеДеятельностиДт = ЗначениеИзмерения(Данные, ИсточникиНаправлений, ШаблонПроводки.ИсточникНаправленияДт);
				КонецЕсли;
				Если СвойстваСчетаКт.УчетПоНаправлениямДеятельности Тогда
					Проводка.НаправлениеДеятельностиКт = ЗначениеИзмерения(Данные, ИсточникиНаправлений, ШаблонПроводки.ИсточникНаправленияКт);
				КонецЕсли;
				
				СвойстваСчетаДт = МеждународныйУчетСерверПовтИсп.СвойстваСчета(Проводка.СчетДт);
				Если СвойстваСчетаДт.Количественный И ЗначениеЗаполнено(ШаблонПроводки.ИсточникКоличестваДт) Тогда
					КоличествоДт = ЗначениеИзмерения(Данные, ПоказателиКоличества, ШаблонПроводки.ИсточникКоличестваДт);
					Проводка.КоличествоДт = ?(ШаблонПроводки.ИзменятьЗнакОперации, -КоличествоДт, КоличествоДт);
				КонецЕсли;
				
				СвойстваСчетаКт = МеждународныйУчетСерверПовтИсп.СвойстваСчета(Проводка.СчетКт);
				Если СвойстваСчетаКт.Количественный И ЗначениеЗаполнено(ШаблонПроводки.ИсточникКоличестваКт) Тогда
					КоличествоКт = ЗначениеИзмерения(Данные, ПоказателиКоличества, ШаблонПроводки.ИсточникКоличестваКт);
					Проводка.КоличествоКт = ?(ШаблонПроводки.ИзменятьЗнакОперации, -КоличествоКт, КоличествоКт);
				КонецЕсли;
				
				Проводка.Вставить("ДанныеШаблонаПроводки", ШаблонПроводки);
				
				ДанныеЗаполненияСубконто = Новый Структура;
				ДанныеЗаполненияСубконто.Вставить("Проводка", Проводка);
				ДанныеЗаполненияСубконто.Вставить("Данные", Данные);
				ДанныеЗаполненияСубконто.Вставить("ИсточникиСубконто", ИсточникиСубконто);
				ДанныеЗаполненияСубконто.Вставить("СвойстваСчетаДт", СвойстваСчетаДт);
				ДанныеЗаполненияСубконто.Вставить("СвойстваСчетаКт", СвойстваСчетаКт);
				ДанныеЗаполненияСубконто.Вставить("ИмяРегистра", ПараметрыОтражения.ИмяРегистра);
				ДанныеЗаполненияСубконто.Вставить("СинонимРегистра", ШаблонПроводки.Операция.ПредставлениеИсточникаДанных);
				Если ЗаполнениеСубконтоПоСоответствию Тогда
					ДанныеЗаполненияСубконто.Данные = Строка;
				КонецЕсли;
				ЗаполнитьСубконто("Дт", ДанныеЗаполненияСубконто);
				ЗаполнитьСубконто("Кт", ДанныеЗаполненияСубконто);
				
				ПроверитьЗаполнениеПроводки(Проводка, ШаблонПроводки, ПараметрыОтражения.ПараметрыРегистра);
				
				МеждународныйУчетПроведениеСервер.ДобавитьПроводкуВТаблицуПроводок(ТаблицаПроводок, Проводка);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Для каждого ВытесненнаяСтрока Из МассивВытесненныхСтрок Цикл
		ВытесненнаяСтрока.ГруппаВытеснения = ШаблоныПроводок.Родитель.Родитель.ШаблонПроводки
	КонецЦикла;

КонецПроцедуры

Функция УстановитьЗаполнениеСубконтоПоСоответствиюПользователя(СхемаКомпоновкиДанных, Настройки, ШаблонПроводки, СоответствиеСубконто)
	
	СхемаКомпоновкиДанных.ВычисляемыеПоля.Очистить();
	
	Отбор = Новый Структура;
	Отбор.Вставить("ШаблонПроводки", ШаблонПроводки.ШаблонПроводки);
	Отбор.Вставить("ПоложениеСубконто");
	
	ПоложенияСубконто = Новый Массив;
	ПоложенияСубконто.Добавить("Дт");
	ПоложенияСубконто.Добавить("Кт");
	
	ИсточникиСубконто = Новый Структура;
	ИсточникиСубконто.Вставить("СубконтоДт", Новый Массив);
	ИсточникиСубконто.Вставить("СубконтоКт", Новый Массив);
	Для каждого ПоложениеСубконто Из ПоложенияСубконто Цикл
		Отбор.ПоложениеСубконто = ПоложениеСубконто;
		НастройкиЗаполнения = СоответствиеСубконто.НайтиСтроки(Отбор);
		
		НомерНастройки = 1;
		ПоляИсточника = ИсточникиСубконто["Субконто"+ПоложениеСубконто]; // Массив -
		Для Каждого Настройка Из НастройкиЗаполнения Цикл
			ПутьКДанным = "СубконтоМеждународный" + ПоложениеСубконто + "_Н" + НомерНастройки;
			Выражение = МеждународныйУчетПроведениеСервер.ВыражениеЗаполненияСубконтоПоНастройке(СхемаКомпоновкиДанных, Настройка);
			
			ФинансоваяОтчетностьСервер.НовоеВычисляемоеПоле(СхемаКомпоновкиДанных, ПутьКДанным, Выражение); 
			ФинансоваяОтчетностьСервер.НовоеПолеВыбора(Настройки, ПутьКДанным);
			
			ПоляИсточника.Добавить(ПутьКДанным);
			НомерНастройки = НомерНастройки + 1;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ИсточникиСубконто;
	
КонецФункции

Процедура УстановитьОтборДанныхПоШаблонуПроводки(СхемаКомпоновкиДанных, Настройки, ШаблонПроводки, ДополнительныйОтборГруппы, ВариантСовместногоПрименения)
	
	Если ЗначениеЗаполнено(ШаблонПроводки.ХозяйственнаяОперация) Тогда
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "ХозяйственнаяОперация", ШаблонПроводки.ХозяйственнаяОперация);	
	КонецЕсли;
	КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Настройки, "УчетнаяПолитика", ШаблонПроводки.УчетнаяПолитика);
	
	Если ДополнительныйОтборГруппы <> Неопределено Тогда
		ФинансоваяОтчетностьСервер.СкопироватьОтбор(ДополнительныйОтборГруппы.Отбор, Настройки.Отбор);
	КонецЕсли;
	
	Если ШаблонПроводки.УстановленДополнительныйОтбор Тогда
		НастройкиОтбора = ШаблонПроводки.ДополнительныйОтбор.Получить();
		ФинансоваяОтчетностьСервер.СкопироватьОтбор(НастройкиОтбора.Отбор, Настройки.Отбор);
	КонецЕсли;
	
	Уровень = ШаблонПроводки.Уровень();
	
	Если Уровень = 1 И ВариантСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияШаблоновПроводок.Вытеснение Тогда
		ГруппаЭлементовОтбораИли = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаЭлементовОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбораИли,
			"Обработан",
			Ложь,
			ВидСравненияКомпоновкиДанных.Равно);
		КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбораИли,
			"ГруппаВытеснения",
			ШаблонПроводки.РодительскийШаблонПроводки,
			ВидСравненияКомпоновкиДанных.НеРавно);
	КонецЕсли;
	
	Если Уровень = 2 Тогда
		Если ВариантСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияШаблоновПроводок.Все Тогда
			ГруппаЭлементовОтбораИли = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаЭлементовОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбораИли,
				"Обработан",
				Ложь,
				ВидСравненияКомпоновкиДанных.Равно);
			КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбораИли,
				"ГруппаВытеснения",
				ШаблонПроводки.РодительскийШаблонПроводки2,
				ВидСравненияКомпоновкиДанных.НеРавно);
		Иначе
			ГруппаЭлементовОтбораИли = Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаЭлементовОтбораИли.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
			КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбораИли,
				"Обработан",
				Ложь,
				ВидСравненияКомпоновкиДанных.Равно);
			ГруппаЭлементовОтбораИ = ГруппаЭлементовОтбораИли.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ГруппаЭлементовОтбораИ.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
			КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбораИ,
				"ГруппаВытеснения",
				ШаблонПроводки.РодительскийШаблонПроводки,
				ВидСравненияКомпоновкиДанных.НеРавно);
			КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(ГруппаЭлементовОтбораИ,
				"ГруппаВытеснения",
				ШаблонПроводки.РодительскийШаблонПроводки2,
				ВидСравненияКомпоновкиДанных.НеРавно);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


// Описание
// 
// Параметры:
// 	РезультатЗапроса - РезультатЗапроса, Неопределено - Описание
// 	ИмяРегистра - Строка -
// 	ПараметрыРегистра - см. МеждународныйУчетСерверПовтИсп.ПараметрыРегистра
// Возвращаемое значение:
// 	Булево - Описание
Функция ПроверитьКорректностьПоказателей(РезультатЗапроса, ИмяРегистра, ПараметрыРегистра)

	Показатели				= ПараметрыРегистра.Показатели; // см. МеждународныйУчетСерверПовтИсп.Показатели
	ПоказателиВВалюте		= ПараметрыРегистра.ПоказателиВВалюте;

	КолонкиРезультата = РезультатЗапроса.Колонки;
	МассивОшибок = Новый Массив;
	Для каждого Показатель Из Показатели Цикл
		МассивРесурсов = Показатель.Значение.Ресурсы; // см. ОписаниеРесурсов
		Для Каждого Ресурс Из МассивРесурсов Цикл
			ИмяРесурса = Ресурс.Имя;
			Если КолонкиРезультата.Найти(ИмяРесурса) = Неопределено Тогда
				ТекстОшибки = НСтр("ru='Не найден ресурс ""%ИмяРесурса%"" показателя ""%Показатель%"".';uk='Не знайдено ресурс ""%ИмяРесурса%"" показника ""%Показатель%"".'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяРесурса%", ИмяРесурса);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Показатель%", Показатель.Ключ);
				МассивОшибок.Добавить(ТекстОшибки);
			КонецЕсли;
			ИсточникВалюты = Ресурс.ИсточникВалюты;
			Если ИсточникВалюты <> "ВалютаУпр" И ИсточникВалюты <> "ВалютаРегл"
				И КолонкиРезультата.Найти(ИсточникВалюты) = Неопределено Тогда
				ТекстОшибки = НСтр("ru='Не найден источник валюты ""%ИсточникВалюты%"" показателя ""%Показатель%"".';uk='Не знайдено джерело валюти ""%ИсточникВалюты%"" показника ""%Показатель%"".'");
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИсточникВалюты%", ИсточникВалюты);
				ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Показатель%", Показатель.Ключ);
				МассивОшибок.Добавить(ТекстОшибки);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для каждого Показатель Из ПоказателиВВалюте Цикл
		ИсточникВалюты = Показатель.Значение.ИсточникВалюты;
		Если ИсточникВалюты <> "ВалютаУпр" И ИсточникВалюты <> "ВалютаРегл"
			И КолонкиРезультата.Найти(ИсточникВалюты) = Неопределено Тогда
			ТекстОшибки = НСтр("ru='Не найден источник валюты ""%ИсточникВалюты%"" показателя в валюте ""%Показатель%"".';uk='Не знайдено джерело валюти ""%ИсточникВалюты%"" показника у валюті ""%Показатель%"".'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИсточникВалюты%", ИсточникВалюты);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Показатель%", Показатель.Ключ);
			МассивОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОшибок.Количество() > 0 Тогда
		ТекстОшибки = НСтр("ru='Обнаружены ошибки показателей регистра ""%ИмяРегистра%"":';uk='Виявлені помилки показників регістра ""%ИмяРегистра%"":'");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ИмяРегистра%", ИмяРегистра);
		Для каждого Ошибка Из МассивОшибок Цикл
			ТекстОшибки = ТекстОшибки + Символы.ПС + Ошибка;
		КонецЦикла;
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Возврат Истина;

КонецФункции

Функция СчетУчета(Данные, ШаблонПроводки, ТаблицаУточненияСчетов, ИсточникиУточненияСчета, ВидДвижения)

	Попытка
		Если ВидДвижения = "Дт" Тогда
			ИсточникУточненияСчетаШаблонаПроводки = ШаблонПроводки.ИсточникУточненияСчетаДт;
			ВидДвижения = Перечисления.ВидыДвиженийБухгалтерии.Дебет;
			СчетПоУмолчанию = ШаблонПроводки.СчетДебетаПоУмолчанию;
		ИначеЕсли ВидДвижения = "Кт" Тогда
			ИсточникУточненияСчетаШаблонаПроводки = ШаблонПроводки.ИсточникУточненияСчетаКт;
			ВидДвижения = Перечисления.ВидыДвиженийБухгалтерии.Кредит;
			СчетПоУмолчанию = ШаблонПроводки.СчетКредитаПоУмолчанию;
		КонецЕсли;
		
		СчетУчета = СчетПоУмолчанию;
		Если ЗначениеЗаполнено(ИсточникУточненияСчетаШаблонаПроводки) Тогда
			ИсточникУточненияСчета = ИсточникиУточненияСчета.Получить(ИсточникУточненияСчетаШаблонаПроводки);
			ГруппаФинансовогоУчета = Данные[ИсточникУточненияСчета.ИмяПоля];
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("ГруппаФинансовогоУчета", ГруппаФинансовогоУчета);
			ПараметрыОтбора.Вставить("ШаблонПроводки", ШаблонПроводки.ШаблонПроводки);
			ПараметрыОтбора.Вставить("ВидДвижения", ВидДвижения);
			МассивНайденныхСтрок = ТаблицаУточненияСчетов.НайтиСтроки(ПараметрыОтбора);
			Если МассивНайденныхСтрок.Количество() > 0 Тогда
				СчетУчета = МассивНайденныхСтрок[0].СчетУчета;
			КонецЕсли;
		КонецЕсли;
	
	Исключение
		ТекстСообщения = Символы.ПС + НСтр("ru='При формировании проводки для хозяйственной операции ""%ХозОперация%""
|по шаблону ""%ШаблонПроводки%""
|не удалось получить уточнение счета ""%ВидСчета%""
|по причине'
|;uk='При формуванні проводки для господарської операції ""%ХозОперация%""
|за шаблоном ""%ШаблонПроводки%""
|не вдалося отримати уточнення рахунку ""%ВидСчета%""
|з причини'") + ":" + Символы.ПС + Символы.Таб + "%Причина%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ХозОперация%", ШаблонПроводки.ХозяйственнаяОперация);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ШаблонПроводки%", ШаблонПроводки.ШаблонПроводки);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ВидСчета%", ВидДвижения);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ТекстСообщения = ТекстСообщения + Символы.ПС
			+ НСтр("ru='Возможно в шаблоне проводки установлены некорректные настройки уточнения счета.';uk='Можливо в шаблоні проводки встановлені некоректні настройки уточнення рахунку.'");
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;

	Возврат СчетУчета;
	
КонецФункции

// Параметры:
// 	Данные - СтрокаТаблицыЗначений - 
// 	ШаблонПроводки - СтрокаТаблицыЗначений - 
// 	РесурсыРегистра - см. ОписаниеРесурсов
// 	ВалютыУчета - Структура Из КлючИЗначение -:
// 	 *ВалютаУпр - СправочникСсылка.Валюты - 
// 	 *ВалютаРегл - СправочникСсылка.Валюты - 
// Возвращаемое значение:
// 	Структура - Описание
Функция ФункциональнаяСумма(Данные, ШаблонПроводки, РесурсыРегистра, ВалютыУчета) Экспорт
	
	Сумма = 0;
	ИмяРесурсаУпр = "";
	ИмяРесурсаРегл = "";
	ОбаРесурсаНайдены = Ложь;
	
	// найдем ресурсы содержащие суммы в валюте упр. и регл.
	Для каждого Ресурс Из РесурсыРегистра Цикл
		Если Ресурс.ИсточникВалюты = "ВалютаУпр" Тогда
			ИмяРесурсаУпр = Ресурс.Имя;
		ИначеЕсли Ресурс.ИсточникВалюты = "ВалютаРегл" Тогда
			ИмяРесурсаРегл = Ресурс.Имя;
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяРесурсаУпр) И ЗначениеЗаполнено(ИмяРесурсаРегл) Тогда
			Если ВалютыУчета.УчетВФункциональнойВалютеУпр Тогда
				Сумма = Данные[ИмяРесурсаУпр];
				ВалютаРесурса = ВалютыУчета.ВалютаУпр;
			Иначе
				Сумма = Данные[ИмяРесурсаРегл];
				ВалютаРесурса = ВалютыУчета.ВалютаРегл;
			КонецЕсли;
			ОбаРесурсаНайдены = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ОбаРесурсаНайдены Тогда
		Если ЗначениеЗаполнено(ИмяРесурсаУпр) Тогда
			Сумма = Данные[ИмяРесурсаУпр];
			ВалютаРесурса = ВалютыУчета.ВалютаУпр;
		ИначеЕсли ЗначениеЗаполнено(ИмяРесурсаРегл) Тогда
			Сумма = Данные[ИмяРесурсаРегл];
			ВалютаРесурса = ВалютыУчета.ВалютаРегл;
		КонецЕсли;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Сумма", ?(ШаблонПроводки.ИзменятьЗнакОперации, -Сумма, Сумма));
	Результат.Вставить("Валюта", ВалютаРесурса);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
// 	Данные - СтрокаТаблицыЗначений - 
// 	ШаблонПроводки - СтрокаТаблицыЗначений - 
// 	РесурсыРегистра - см. ОписаниеРесурсов
// 	ВалютыУчета - Структура Из КлючИЗначение -:
// 	 *ВалютаУпр - СправочникСсылка.Валюты - 
// 	 *ВалютаРегл - СправочникСсылка.Валюты - 
// 	Валюта - СправочникСсылка.Валюты -
// Возвращаемое значение:
// 	Структура - Описание
Функция БалансоваяСумма(Данные, ШаблонПроводки, РесурсыРегистра, ВалютыУчета, Валюта)

	Сумма = 0;
	ИмяРесурсаУпр = "";
	ИмяРесурсаРегл = "";
	РесурсВВалютеНайден = Ложь;
	
	Для каждого Ресурс Из РесурсыРегистра Цикл
		Если Ресурс.ИсточникВалюты = "ВалютаУпр" Тогда
			ИмяРесурсаУпр = Ресурс.Имя;
			ВалютаРесурса = ВалютыУчета.ВалютаУпр;
		ИначеЕсли Ресурс.ИсточникВалюты = "ВалютаРегл" Тогда
			ИмяРесурсаРегл = Ресурс.Имя;
			ВалютаРесурса = ВалютыУчета.ВалютаРегл;
		Иначе
			ВалютаРесурса = Данные[Ресурс.ИсточникВалюты];
		КонецЕсли;
		Если ВалютаРесурса = Валюта Тогда
			Сумма = Данные[Ресурс.Имя];
			РесурсВВалютеНайден = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не РесурсВВалютеНайден Тогда
		Если ВалютыУчета.УчетВФункциональнойВалютеУпр И ЗначениеЗаполнено(ИмяРесурсаУпр)Тогда
			Сумма = Данные[ИмяРесурсаУпр];
			ВалютаРесурса = ВалютыУчета.ВалютаУпр;
		ИначеЕсли ЗначениеЗаполнено(ИмяРесурсаРегл)Тогда
			Сумма = Данные[ИмяРесурсаРегл];
			ВалютаРесурса = ВалютыУчета.ВалютаРегл;
		КонецЕсли;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Сумма", ?(ШаблонПроводки.ИзменятьЗнакОперации, -Сумма, Сумма));
	Результат.Вставить("Валюта", ВалютаРесурса);
	
	Возврат Результат;
	
КонецФункции

// Параметры:
// 	Данные - СтрокаТаблицыЗначений - 
// 	ШаблонПроводки - СтрокаТаблицыЗначений - 
// 	РесурсыРегистра - см. ОписаниеРесурсов
// 	ИсточникВалюты - Строка - 
// Возвращаемое значение:
// 	Число - Описание
Функция СуммаВВалюте(Данные, ШаблонПроводки, РесурсыРегистра, ИсточникВалюты)

	Сумма = 0;
	Для каждого Ресурс Из РесурсыРегистра Цикл
		Если Ресурс.ИсточникВалюты = ИсточникВалюты Тогда
			Сумма = Данные[Ресурс.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ?(ШаблонПроводки.ИзменятьЗнакОперации, -Сумма, Сумма);

КонецФункции

Функция ЗначениеИзмерения(Данные, ИсточникиИзмерения, ИсточникИзмеренияВШаблонеПроводки)

	ИсточникИзмерения = ИсточникиИзмерения.Получить(ИсточникИзмеренияВШаблонеПроводки);
	Если ИсточникИзмерения <> Неопределено Тогда
		Результат = Данные[ИсточникИзмерения];
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьСубконто(ВидДвижения, Параметры)
	
	ИмяРегистра = Параметры.ИмяРегистра;
	Данные = Параметры.Данные;
	Проводка = Параметры.Проводка;
	ИсточникиСубконто = Параметры.ИсточникиСубконто;
	СвойстваСчета = Параметры["СвойстваСчета" + ВидДвижения];
	ЗаполнениеСубконтоПоСоответствию = Проводка.ДанныеШаблонаПроводки.ЗаполнениеСубконтоПоСоответствию;
	
	Счет = Проводка["Счет" + ВидДвижения];
	ПоляИсточникаСубконто = ИсточникиСубконто["Субконто" + ВидДвижения];
	ДвижениеНоменклатуры = Проводка.ДанныеШаблонаПроводки["ДвижениеНоменклатуры"+ВидДвижения];
	
	ТипыЗаполненныхПолей = Новый Соответствие;
	ТипыДоступныхПолей = Новый Соответствие;
	Для каждого ПолеИсточникаСубконто Из ПоляИсточникаСубконто Цикл
		Значение = Данные[ПолеИсточникаСубконто];
		Если Значение <> Неопределено Тогда
			ТипыЗаполненныхПолей.Вставить(ПолеИсточникаСубконто, ТипЗнч(Значение));
		Иначе
			МассивТипов = МеждународныйУчетСерверПовтИсп.ТипыАтрибутаРегистра(ИмяРегистра, ПолеИсточникаСубконто);
			ТипыДоступныхПолей.Вставить(ПолеИсточникаСубконто, МассивТипов);
		КонецЕсли;
	КонецЦикла;
	
	// Субконто с типом Контрагент на номенклатурных счетах заполняем контрагентом из вида запасов.
	Если НЕ ЗаполнениеСубконтоПоСоответствию Тогда
		Если (ИмяРегистра = "ВыручкаИСебестоимостьПродаж" ИЛИ ИмяРегистра = "Закупки"
			ИЛИ ИмяРегистра = "ДвиженияНоменклатураДоходыРасходы" ИЛИ ИмяРегистра = "ДвиженияНоменклатураНоменклатура") Тогда
			Если ДвижениеНоменклатуры Тогда// подменить значение поля "Контрагент"
				Если ТипыЗаполненныхПолей["Хранитель"] <> Неопределено И ЗначениеЗаполнено(Данные.Хранитель) Тогда
					Если ТипыЗаполненныхПолей["Поставщик"] <> Неопределено Тогда
						ТипыЗаполненныхПолей.Удалить("Поставщик");
					КонецЕсли;
					Если ТипыЗаполненныхПолей["Контрагент"] <> Неопределено Тогда
						ТипыЗаполненныхПолей.Удалить("Контрагент");
					КонецЕсли;
					
				ИначеЕсли ТипыЗаполненныхПолей["Поставщик"] <> Неопределено И ЗначениеЗаполнено(Данные.Поставщик) Тогда
					
					Если ТипыЗаполненныхПолей["Хранитель"] <> Неопределено Тогда
						ТипыЗаполненныхПолей.Удалить("Хранитель");
					КонецЕсли;
					Если ТипыЗаполненныхПолей["Контрагент"] <> Неопределено Тогда
						ТипыЗаполненныхПолей.Удалить("Контрагент");
					КонецЕсли;
					
				КонецЕсли;
			Иначе// удалить поле "Поставщик"
				Если ТипыЗаполненныхПолей["Поставщик"] <> Неопределено Тогда
					ТипыЗаполненныхПолей.Удалить("Поставщик");
				КонецЕсли;
				Если ТипыЗаполненныхПолей["Хранитель"] <> Неопределено Тогда
					ТипыЗаполненныхПолей.Удалить("Хранитель");
				КонецЕсли;
			КонецЕсли;// ДвижениеНоменклатуры = Истина
		КонецЕсли;// ИмяРегистра = "ВыручкаИСебестоимостьПродаж" ИЛИ ИмяРегистра = "Закупки"
	КонецЕсли;
	
	Для К = 1 По СвойстваСчета.КоличествоСубконто Цикл
		ВидСубконто = СвойстваСчета["ВидСубконто" + К];
		Проводка["ВидСубконто" + ВидДвижения + К] = ВидСубконто;
		ТипСубконто = СвойстваСчета["ВидСубконто" + К + "ТипЗначения"];
		ТипНайден = Ложь;
		Для каждого ТипПоля Из ТипыЗаполненныхПолей Цикл
			Если ТипСубконто.СодержитТип(ТипПоля.Значение) Тогда
				Проводка["Субконто" + ВидДвижения + К] = ?(
					ЗначениеЗаполнено(Данные[ТипПоля.Ключ]),
					Данные[ТипПоля.Ключ],
					ТипСубконто.ПривестиЗначение(Неопределено));
				ТипНайден = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Не ТипНайден Тогда
			Для каждого ТипПоля Из ТипыДоступныхПолей Цикл
				Для каждого Тип Из ТипПоля.Значение Цикл
					Если ТипСубконто.СодержитТип(Тип) Тогда
						Проводка["Субконто" + ВидДвижения + К] = ?(
							ЗначениеЗаполнено(Данные[ТипПоля.Ключ]),
							Данные[ТипПоля.Ключ],
							ТипСубконто.ПривестиЗначение(Неопределено));
						ТипНайден = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если ТипНайден Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Не ТипНайден И ОбщегоНазначения.РежимОтладки() Тогда
			ТекстОшибки = НСтр("ru='Не удалось заполнить субконто %ВидСубконто% для счета %Счет%. 
| В регистре %Регистр% не найдены значения с типом %ТипСубконто%'
|;uk='Не вдалося заповнити субконто %ВидСубконто% для рахунку %Счет%.
| У регістрі %Регистр% не знайдені значення з типом %ТипСубконто%'");
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ВидСубконто%", ВидСубконто);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Счет%", Счет);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ТипСубконто%", 	ТипСубконто);
			ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Регистр%", 				Параметры.СинонимРегистра);
			МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.ОтсутствуютПравилаОтраженияВУчете);
			МеждународныйУчетПроведениеСервер.ДобавитьОшибкуПроводки(Проводка, ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеПроводки(Проводка, ШаблонПроводки, ПараметрыРегистра)

	Если Не ЗначениеЗаполнено(Проводка.СчетДт) Тогда
		МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.ОтсутствуютПравилаОтраженияВУчете);
		ТекстОшибки = НСтр("ru='Не удалось заполнить счет Дт.';uk='Не вдалося заповнити рахунок Дт.'");
		МеждународныйУчетПроведениеСервер.ДобавитьОшибкуПроводки(Проводка, ТекстОшибки);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Проводка.СчетКт) Тогда
		МеждународныйУчетПроведениеСервер.ЗаполнитьСтатусПроводки(Проводка, Перечисления.СтатусыОтраженияВМеждународномУчете.ОтсутствуютПравилаОтраженияВУчете);
		ТекстОшибки = НСтр("ru='Не удалось заполнить счет Кт.';uk='Не вдалося заповнити рахунок Кт.'");
		МеждународныйУчетПроведениеСервер.ДобавитьОшибкуПроводки(Проводка, ТекстОшибки);
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#Область РегистрацияКОтражению

Функция ТаблицаОтражениеДокументовВМеждународномУчете(Документ)

	НаборЗаписей = РегистрыСведений.ОтражениеДокументовВМеждународномУчете.СоздатьНаборЗаписей();
	ИсходнаяТаблица = НаборЗаписей.ВыгрузитьКолонки("Период, Организация, ДатаОтражения");
	ИсходнаяТаблица.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
	
	ТекстыЗапросов = ТекстыЗапросовПоРегистрам();
	Для каждого КлючИЗначение Из ТекстыЗапросов Цикл
		ИмяРегистра = КлючИЗначение.Ключ;
		ДобавитьНаборЗаписейВТаблицу(ИсходнаяТаблица, Документ, ИмяРегистра);
	КонецЦикла;
	
	ИсходнаяТаблица.ЗаполнитьЗначения(Документ.Дата, "Период");
	ИсходнаяТаблица.Свернуть("Период, Организация, ДатаОтражения, ХозяйственнаяОперация");
	
	Возврат ИсходнаяТаблица;
	
КонецФункции

Процедура ДобавитьНаборЗаписейВТаблицу(ТаблицаНаборовЗаписей, Документ, ИмяРегистра)
	
	Если ТипЗнч(Документ.Движения) = Тип("Структура")
		И НЕ Документ.Движения.Свойство(ИмяРегистра) Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Документ.Движения) = Тип("КоллекцияДвижений")
		И Документ.Движения.Найти(ИмяРегистра) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	
	НаборЗаписей = Документ.Движения[ИмяРегистра];
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеРегистра = НаборЗаписей.Метаданные();
	ЕстьХозяйственнаяОперация = МетаданныеРегистра.Реквизиты.Найти("ХозяйственнаяОперация") <> Неопределено;
	ЕстьНастройкаХозяйственнойОперации = МетаданныеРегистра.Реквизиты.Найти("НастройкаХозяйственнойОперации") <> Неопределено;
	ЕстьАналитикаУчетаПоПартнерам = МетаданныеРегистра.Измерения.Найти("Организация") = Неопределено 
								  И МетаданныеРегистра.Измерения.Найти("АналитикаУчетаПоПартнерам") <> Неопределено;
	
	Для каждого Запись Из НаборЗаписей Цикл
		Если ЕстьХозяйственнаяОперация И НЕ ЗначениеЗаполнено(Запись.ХозяйственнаяОперация) Тогда
			Продолжить;
		КонецЕсли;         
		Если ЕстьНастройкаХозяйственнойОперации И НЕ ЗначениеЗаполнено(Запись.НастройкаХозяйственнойОперации) Тогда
			Продолжить;
		КонецЕсли;
		НоваяЗапись = ТаблицаНаборовЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Запись);
		НоваяЗапись.ДатаОтражения = Запись.Период;
		Если ЕстьАналитикаУчетаПоПартнерам Тогда
			НоваяЗапись.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.АналитикаУчетаПоПартнерам, "Организация");
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Возвращаемое значение:
// 	Массив Из Структура - Описание:
// 	 *Имя - Строка -
//
Функция ОписаниеРесурсов() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Новый Структура("Имя"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти
