#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА Операция.РабочийЦентр ССЫЛКА Справочник.РабочиеЦентры
		|			ТОГДА Операция.РабочийЦентр.Участок
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПроизводственныеУчастки.ПустаяСсылка)
		|	КОНЕЦ КАК Участок,
		|	Операция.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Операция.Описание КАК Описание
		|ИЗ
		|	Справочник.ТехнологическиеОперации КАК Операция
		|ГДЕ
		|	Операция.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Запись.Операция);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		
		Участок = Результат.Участок;
		
		Элементы.Участок.Видимость = ЗначениеЗаполнено(Участок);
		
		ЕдиницаИзмеренияПредставление = УправлениеПроизводствомКлиентСервер.ПредставлениеЕдиницыИзмеренияОперации(
			Результат.ЕдиницаИзмерения,
			,
			Истина);
		
		Элементы.ОперацияОписание.Видимость = ЗначениеЗаполнено(Результат.Описание);
		
	КонецЕсли;
	
	ОжидаетНазначения = 0;
	
	Если Запись.Запланировано + Запись.ТребуетПовторения > Запись.Создано Тогда
		ОжидаетНазначения = Запись.Запланировано + Запись.ТребуетПовторения - Запись.Создано;
	КонецЕсли;
	
	Файлы = Новый Массив;
	
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Запись.Операция, Файлы);
	
	Элементы.ПрисоединенныеФайлы.Видимость = Файлы.Количество()>0;
	Элементы.ПрисоединенныеФайлы.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
												НСтр("ru='Дополнительные материалы (%1)';uk='Додаткові матеріали (%1)'"),
												Файлы.Количество());
	
КонецПроцедуры

#КонецОбласти