
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УПН_ДоговорПоНедвижимости") Тогда
		
		Если ДанныеЗаполнения.СтатусДокумента <> Перечисления.УПН_СтатусыДокументовПоСделке.Подписано
				Или Не ДанныеЗаполнения.Проведен Тогда
			ВызватьИсключение("Документ ""Покупка доли"" можно вводить только на основании проведенного документа в статусе ""Подписано""");
		КонецЕсли;
		
		Организация              = ДанныеЗаполнения.Организация;
		Партнер                  = ДанныеЗаполнения.Партнер;
		Контрагент               = ДанныеЗаполнения.Контрагент;
		Договор                  = ДанныеЗаполнения.Договор;
		СуммаДокумента           = ДанныеЗаполнения.СуммаДоговора;
		Валюта                   = ДанныеЗаполнения.Валюта;
		ГруппаФинансовогоУчета   = ДанныеЗаполнения.Договор.ГруппаФинансовогоУчета;
		Подразделение            = ДанныеЗаполнения.Договор.Подразделение;
		Ответственный            = ДанныеЗаполнения.Ответственный;
		НаправлениеДеятельности  = ДанныеЗаполнения.НаправлениеДеятельности;
		ДокументОснование        = ДанныеЗаполнения.Ссылка;
		ОбъектСтроительства      = ПолучитьОбъектСтроительства(ДанныеЗаполнения.Договор);
		
		Если НЕ ЗначениеЗаполнено(ОбъектСтроительства) И ДанныеЗаполнения.ОбъектыНедвижимости.Количество() Тогда
			ОбъектСтроительства      = ПолучитьОбъектСтроительства(ДанныеЗаполнения.ОбъектыНедвижимости.Получить(0).ОбъектНедвижимости.ОбъектЭксплуатации);
		КонецЕсли;
		
		ПокупкаПоДоговоруНедвижимости = Истина;
		
		// Заполнение НазначениеЦелевыхСредств и ДвиженияЦелевыхСредств
		Если ДанныеЗаполнения.Договор.ДополнительныеРеквизиты.Количество()>0 Тогда
			Инд = 0;
			Пока Инд < ДанныеЗаполнения.Договор.ДополнительныеРеквизиты.Количество() Цикл
				Если ТипЗнч(ДанныеЗаполнения.Договор.ДополнительныеРеквизиты[Инд].Значение )= Тип("СправочникСсылка.ЦелевыеСредства") Тогда
			       НазначениеЦелевыхСредств = ДанныеЗаполнения.Договор.ДополнительныеРеквизиты[Инд].Значение;
				КонецЕсли;
				Если ТипЗнч(ДанныеЗаполнения.Договор.ДополнительныеРеквизиты[Инд].Значение )= Тип("ПеречислениеСсылка.ДвиженияЦелевыхСредств") Тогда
			       ДвиженияЦелевыхСредств   = ДанныеЗаполнения.Договор.ДополнительныеРеквизиты[Инд].Значение;
			   КонецЕсли;
			   Инд = Инд +1;
			КонецЦикла;
		КонецЕсли;
		
		Если ДанныеЗаполнения.ОбъектыНедвижимости.Количество()>=1 Тогда
			ОбъектЭксплуатации = ДанныеЗаполнения.ОбъектыНедвижимости[0].ОбъектНедвижимости.ОбъектЭксплуатации;
		КонецЕсли;
		
	КонецЕсли;  	
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры  

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		НаправлениеДеятельности = ОбъектЭксплуатации.НаправлениеДеятельности;
	КонецЕсли;
	
	Если РежимЗаписи =  РежимЗаписиДокумента.Проведение Тогда
		
		Если ЗначениеЗаполнено(ДокументОснование) и ПроверитьНаНаличиеСуществующегоДокумента(Ссылка,ДокументОснование) Тогда
			
			ТекстСообщения = НСтр("ru = 'Для этого Договора существует документ ""Покупка Доли""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат
			
		КонецЕсли;
		
	КонецЕсли;

	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИнициализироватьДокумент();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.УСОERP_ПокупкаДоли.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ВзаиморасчетыСервер.ОтразитьРасчетыСКлиентами(ДополнительныеСвойства, Движения, Отказ);
	
	РеглУчетПроведениеСервер.ЗарегистрироватьКОтражению(ЭтотОбъект, ДополнительныеСвойства, Движения, Отказ);
	
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ПроведениеСерверУТ.СформироватьЗаписиРегистровЗаданий(ЭтотОбъект);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	СчетУчета = Справочники.УСОERP_ПредопределенныеЭлементы.СчетУчетаРасчетовПоЦелевомуФинансированию.Значение;
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("Организация") Тогда
		Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Или Не ДанныеЗаполнения.Свойство("Валюта") Тогда
		Валюта  = ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

Функция ПолучитьОбъектСтроительства(Договор)
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ОбъектыЭксплуатации") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СМ_ОбъектыСтроительства.Ссылка КАК ОбъектСтроительства
		|ИЗ
		|	Справочник.СМ_ОбъектыСтроительства КАК СМ_ОбъектыСтроительства
		|ГДЕ
		|	СМ_ОбъектыСтроительства.ОбъектСтроительства = &Договор
		|	И НЕ СМ_ОбъектыСтроительства.ПометкаУдаления";		
		
	Иначе   		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_ДополнительныеПараметрыПоДоговору.ОбъектСтроительства КАК ОбъектСтроительства
		|ИЗ
		|	РегистрСведений.УСОERP_ДополнительныеПараметрыПоДоговору КАК УСОERP_ДополнительныеПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Договор = &Договор";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Договор", Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат  Выборка.ОбъектСтроительства;
	Иначе
		Возврат Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

Функция ПроверитьНаНаличиеСуществующегоДокумента(Ссылка, ДокументОснование) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_ПокупкаДоли.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УСОERP_ПокупкаДоли КАК УСОERP_ПокупкаДоли
	|ГДЕ
	|	УСОERP_ПокупкаДоли.ПометкаУдаления = ЛОЖЬ
	|	И УСОERP_ПокупкаДоли.Проведен = ИСТИНА
	|	И УСОERP_ПокупкаДоли.ДокументОснование = &ДокументОснование
	|	И УСОERP_ПокупкаДоли.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции;

#КонецОбласти

#КонецОбласти

#КонецЕсли
