
#Область ОписаниеПеременных

&НаКлиенте
Перем ФормаДлительнойОперации;

&НаКлиенте
Перем ПараметрыОбработчика;

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	Элементы.СтраницаРезультат.Видимость = Ложь;
	Элементы.Страница_Smeta_ru.Видимость = Ложь;
	ЗаполнитьНастройкиПользователяПоУмолчанию(ЭтаФорма);
	ЗаполнитьМетаданныеХранилище();
КонецПроцедуры

Процедура ЗаполнитьМетаданныеХранилище()
	ТабСмета = Новый СписокЗначений;
	Для Каждого Реквизит Из Метаданные.Документы.СМ_ЛокальнаяСмета.Реквизиты Цикл
		  Элементы.СоответствияСметаИмяРеквизита.СписокВыбора.Добавить(Реквизит.Имя,Реквизит.Представление());
		  ТабСмета.Добавить(Реквизит.Имя,Реквизит.Представление());
	КонецЦикла;

	ТабПоз = Новый СписокЗначений;
	Для Каждого Реквизит Из Метаданные.Документы.СМ_ПозицияЛокальнойСметы.Реквизиты Цикл
		Элементы.СоответствияПозицииИмяРеквизита.СписокВыбора.Добавить(Реквизит.Имя,Реквизит.Представление());
		ТабПоз.Добавить(Реквизит.Имя,Реквизит.Представление());
	КонецЦикла;
    Структура = Новый Структура("ЛокальнаяСмета,Позиция",ТабСмета,ТабПоз);
	АдресХранилищаМетаданных = ПоместитьВоВременноеХранилище(Структура, ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры

// Процедура заполняет реквизиты объекта данными из настроек пользователя (значениями по умолчанию).
//
// Параметры:
//     Форма - Контекст формы обработки.
//
Процедура ЗаполнитьНастройкиПользователяПоУмолчанию(Форма)
	Форма.ТекСтройка = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОсновнаяСтройка");
	Форма.Организация = СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(Форма.ТекСтройка,"ОсновнаяОрганизация");	
	Форма.Район = СМ_СметаВызовСервера.ПолучитьНастройкуПользователяПообъектно(Форма.ТекСтройка,"ОсновнойРайон");	
	Форма.СметноНормативнаяБаза = Справочники.СМ_СметноНормативныеБазы.ПолучитьПоРайону(Форма.Район);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьEXCEL(Команда)
	
	ПолноеИмяФайла 							= "";
	Элементы.СтраницаРезультат.Видимость 	= Ложь;
	Элементы.Страница_Smeta_ru.Видимость 	= Ложь;
	Интерактивно 							= Истина;
	
	// *******************************************************
	// Синхронный вызов
	//Если ПодключитьРасширениеРаботыСФайлами() Тогда
	//	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ФайловыеФункции") Тогда
	//		МодульФайловыеФункцииСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйКлиент");
	//		ПутьКФайлу = МодульФайловыеФункцииСлужебныйКлиент.КаталогВыгрузки();
	//	Иначе
	//		ПутьКФайлу = "";
	//	КонецЕсли;
	//	ПолучитьПутьКФайлуНачалоВыбора(РежимДиалогаВыбораФайла.Открытие, ПутьКФайлу, "");
	//	ВыбранныйФайл = ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлу);
	//	РасширениеФайла = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ВыбранныйФайл.Расширение);
	//	Если ЗначениеЗаполнено(ВыбранныйФайл.Имя) Тогда
	//		ПолноеИмяФайла = ВыбранныйФайл.ПолноеИмя;
	//		Интерактивно = Ложь;
	//	Иначе
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	//АдресВременногоХранилища = "";
	//Оповещение = Новый ОписаниеОповещения("ПриОкончаниеПомещенияФайла", ЭтотОбъект);
	//НачатьПомещениеФайла(Оповещение, АдресВременногоХранилища, ПолноеИмяФайла, Интерактивно);
	
	// *******************************************************
	// Замена на асинхронный вызов
	ОповещениеПодключения = Новый ОписаниеОповещения("ВыполнитьПослеПодключенияРасширенияРаботыСФайлами", ЭтотОбъект);
	НачатьПодключениеРасширенияРаботыСФайлами(ОповещениеПодключения); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеПодключенияРасширенияРаботыСФайлами(Подключено, ДополнительныеПараметры) Экспорт
	
	Если Подключено Тогда
		Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ФайловыеФункции") Тогда
			МодульФайловыеФункцииСлужебныйКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("РаботаСФайламиСлужебныйКлиент");
			ПутьКФайлу = МодульФайловыеФункцииСлужебныйКлиент.КаталогВыгрузки();
		Иначе
			ПутьКФайлу = "";
		КонецЕсли;
		ПолучитьПутьКФайлуНачалоВыбора(РежимДиалогаВыбораФайла.Открытие, ПутьКФайлу, "");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПутьКФайлуНачалоВыбора(РежимДиалога, ПутьКФайлу, ИмяФайла = "")
	
	ДиалогВыбораФайла 								= Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.Фильтр                      	= НСтр("ru='Excel файл (*.xls)|*.xls|Книга Excel 2007 (*.xlsx)|*.xlsx|Текстовый документ c разделителями (*.csv)|*.csv|Табличный документ (*.mxl)|*.mxl'");
	ДиалогВыбораФайла.Заголовок                   	= Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     	= Ложь;
	ДиалогВыбораФайла.Расширение                  	= "xlsx";
	ДиалогВыбораФайла.ИндексФильтра               	= 0;
	ДиалогВыбораФайла.ПолноеИмяФайла              	= ИмяФайла;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла 	= Ложь;
	
	// *******************************************************
	// Синхронный вызов
	//Если ДиалогВыбораФайла.Выбрать() Тогда
	//	ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	//КонецЕсли;
	
	// *******************************************************
	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
	ДиалогВыбораФайла.Показать(ОповещениеВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			ПутьКФайлу = ТекЭлемент;
		КонецЦикла;
		
		ВыбранныйФайл 	= ОбщегоНазначенияКлиентСервер.РазложитьПолноеИмяФайла(ПутьКФайлу);
		РасширениеФайла = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ВыбранныйФайл.Расширение);
		Если ЗначениеЗаполнено(ВыбранныйФайл.Имя) Тогда
			ПолноеИмяФайла = ВыбранныйФайл.ПолноеИмя;
			Интерактивно = Ложь;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	АдресВременногоХранилища 	= "";
	Оповещение 					= Новый ОписаниеОповещения("ПриОкончаниеПомещенияФайла", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение, АдресВременногоХранилища, ПолноеИмяФайла, Интерактивно);
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайлами

&НаКлиенте
Процедура ПриОкончаниеПомещенияФайла(Результат, АдресВременногоХранилища, ИмяФайла, Параметр) Экспорт
	
	Если Результат = Истина Тогда
		СоответствияПозиции.Очистить();
		СоответствияСмета.Очистить();

		Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(
		ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла));
		Если Расширение = "csv" ИЛИ Расширение = "xlsx" ИЛИ Расширение = "mxl" ИЛИ Расширение = "xls" Тогда
			
			Если Расширение = "xls" 
				ИЛИ Расширение = "xlsx"Тогда
				Smeta_ru = ПроверитьSmeta_ru(ИмяФайла);
				Если Smeta_ru Тогда
					Элементы.Страница_Smeta_ru.Видимость = Истина;
					Объект.СметнаяПрограмма = ПредопределенноеЗначение("Справочник.СМ_СметныеПрограммы.СметаРу");
					
					Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.Страница_Smeta_ru;
					АдресФайла = ИмяФайла;
					Возврат;
				КонецЕсли;
			КонецЕсли;

			
			ФоновоеЗадание = Ложь;
			ЗагрузитьФайлСДаннымиВТабличныйДокументНаСервере(АдресВременногоХранилища, Расширение, ФоновоеЗадание);
			Если ФоновоеЗадание Тогда
				ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
				ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
				ПараметрыОбработчика.МаксимальныйИнтервал = 5;
				ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ФоновоеЗаданиеИдентификатор);
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(,НСтр("ru ='Не получилось загрузить данные из этого файла. Убедитесь в корректности данных в файле.'"));        
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьSmeta_ru(ИмяФайла)
	Smeta_ru = Ложь;
	Попытка
		КнигаЭксель = ПолучитьCOMОбъект(ИмяФайла);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка. Невозможно открыть лист книги Excel.'"));
		Возврат Smeta_ru;
	КонецПопытки;
	ЧислоКолонок = КнигаЭксель.Sheets.Count;
	Если ЧислоКолонок=1 ИЛИ ЧислоКолонок < 4 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЛистЭксель = КнигаЭксель.Sheets.Item(ЧислоКолонок-3);
	RowCount = 1; // Кол-во строк
	ColumnCount = ЛистЭксель.UsedRange.Columns.Count; // Кол-во колонок
	
	ДиапазонДанных = ЛистЭксель.Range(ЛистЭксель.Cells(1, 1), ЛистЭксель.Cells(RowCount, ColumnCount));

	Данные = ДиапазонДанных.Value.Выгрузить();
	
	Если Данные.Количество()>9 Тогда
		Попытка
			Smeta_ru = (СтрНайти(Врег(Данные[8][0]),Врег("Smeta.RU"))>0 И Данные[0][0] = 0);
		Исключение
			Smeta_ru = Ложь;
		КонецПопытки;
	КонецЕсли;
	
	Если Smeta_ru Тогда
		// лист позиций
		ЛистЭксель = КнигаЭксель.Sheets.Item(ЧислоКолонок-3);
		RowCount = ЛистЭксель.UsedRange.Rows.Count; // Кол-во строк
		ColumnCount = ЛистЭксель.UsedRange.Columns.Count; // Кол-во колонок
		ДиапазонДанных = ЛистЭксель.Range(ЛистЭксель.Cells(12, 1), ЛистЭксель.Cells(RowCount, ColumnCount));
		Данные = ДиапазонДанных.Value.Выгрузить();
		ЗаполнитьТаблицуСмет(Данные,RowCount,ColumnCount);
	КонецЕсли;
	
	Возврат Smeta_ru;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуСмет(Данные,ВсегоСтрок,ВсегоКолонок)
	
	ТаблицаСмет.Очистить();
	ТЗ =  Новый ТаблицаЗначений;
	
	Для Счетчик = 1 По ВсегоКолонок Цикл
		ТЗ.Колонки.Добавить("Колонка"+Счетчик, Новый ОписаниеТипов("Строка"));
	КонецЦикла;
	
	Для Счетчик = 1 По ВсегоСтрок Цикл
		НоваяСтрока = ТЗ.Добавить();
	КонецЦикла;
	
	Для Счетчик = 0 По ВсегоКолонок-1 Цикл
		ТЗ.ЗагрузитьКолонку(Данные[Счетчик], Счетчик);
	КонецЦикла;

	Для Каждого Док Из ТЗ Цикл
		Если ПустаяСтрока(Док.Колонка6) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Док.Колонка1 = "3" Тогда // смета
			Продолжить;
		КонецЕсли;
		
		НовСмета = ТаблицаСмет.Добавить();
		НовСмета.ИДНомерСметы = СокрЛП(Док.Колонка4);
		НовСмета.Наименование = СокрЛП(Док.Колонка7);
		НовСмета.Пометка = ?(Док.Колонка2 = "1",Истина,Ложь);

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьЗагрузкуSmeta_ru(Команда)
	
	АдресВременногоХранилища = "";
	Оповещение = Новый ОписаниеОповещения("ПриОкончаниеПомещенияФайла_ПродолжитьЗагрузкуSmeta_ru", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение, АдресВременногоХранилища, АдресФайла, Ложь);

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОкончаниеПомещенияФайла_ПродолжитьЗагрузкуSmeta_ru(Результат, АдресВременногоХранилища, ИмяФайла, Параметр) Экспорт
	ФоновоеЗадание = Ложь;
	
	ОбработатьЛимЗатраты = Ложь;
	СтруктураПозиций = Неопределено;
	СтруктураРесурсов = Неопределено;
	СтруктураЛимЗатрат = Неопределено;
	
	#Если Не ВебКлиент Тогда
		Если Не НаСервере Тогда
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
			ДвоичныеДанные = ПолучитьИЗВременногоХранилища(АдресВременногоХранилища);
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			Попытка
				КнигаЭксель = ПолучитьCOMОбъект(ИмяВременногоФайла);
			Исключение
				ТекстОшибки = НСтр("ru='Ошибка. Невозможно открыть лист книги Excel.'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				Возврат;
			КонецПопытки;
			ЧислоКолонок = КнигаЭксель.Sheets.Count;
			// лист позиций
			ЛистЭксель = КнигаЭксель.Sheets.Item(ЧислоКолонок-3);
			RowCount = ЛистЭксель.UsedRange.Rows.Count; // Кол-во строк
			ColumnCount = ЛистЭксель.UsedRange.Columns.Count; // Кол-во колонок
			ДиапазонДанных = ЛистЭксель.Range(ЛистЭксель.Cells(12, 1), ЛистЭксель.Cells(RowCount, ColumnCount));
			МассивПозиций = ДиапазонДанных.Value.Выгрузить();
			СтруктураПозиций = Новый Структура("RowCount,ColumnCount,МассивПозиций",RowCount,ColumnCount,МассивПозиций);
			
			// лист ресурсов
			ЛистЭксель = КнигаЭксель.Sheets.Item(ЧислоКолонок-1);
			RowCount = ЛистЭксель.UsedRange.Rows.Count; // Кол-во строк
			ColumnCount = ЛистЭксель.UsedRange.Columns.Count; // Кол-во колонок
			ДиапазонДанных = ЛистЭксель.Range(ЛистЭксель.Cells(1, 1), ЛистЭксель.Cells(RowCount, ColumnCount));
			МассивРесурсов = ДиапазонДанных.Value.Выгрузить();
			СтруктураРесурсов = Новый Структура("RowCount,ColumnCount,МассивРесурсов",RowCount,ColumnCount,МассивРесурсов);
			
			Если ОбработатьЛимЗатраты Тогда
				// лист лимитированных затрат
				ЛистЭксель = КнигаЭксель.Sheets.Item(ЧислоКолонок-2);
				RowCount = ЛистЭксель.UsedRange.Rows.Count; // Кол-во строк
				ColumnCount = ЛистЭксель.UsedRange.Columns.Count; // Кол-во колонок
				ДиапазонДанных = ЛистЭксель.Range(ЛистЭксель.Cells(12, 1), ЛистЭксель.Cells(RowCount, ColumnCount));
				МассивЛимЗатрат = ДиапазонДанных.Value.Выгрузить();
				СтруктураЛимЗатрат = Новый Структура("RowCount,ColumnCount,МассивРесурсов",RowCount,ColumnCount,МассивЛимЗатрат);
			КонецЕсли;
		КонецЕсли;
	#КонецЕсли
	ЗагрузитьФайлСДаннымиSmeta_ru(АдресВременногоХранилища, Расширение,ОбработатьЛимЗатраты,СтруктураПозиций,СтруктураРесурсов,СтруктураЛимЗатрат,ФоновоеЗадание);
	Если ФоновоеЗадание Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаИзФайлаНаКлиенте", 1, Истина);
		ПараметрыОбработчика.МаксимальныйИнтервал = 5;
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ФоновоеЗаданиеИдентификатор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлСДаннымиSmeta_ru(АдресВременногоХранилища, Расширение,ОбработатьЛимЗатраты,СтруктураПозиций,СтруктураРесурсов,СтруктураЛимЗатрат,ФоновоеЗадание = Ложь)
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(АдресВременногоХранилища);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);

	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Организация",Организация);
	ДанныеЗаполнения.Вставить("Район",Район);
	ДанныеЗаполнения.Вставить("СметноНормативнаяБаза",СметноНормативнаяБаза);
	ДанныеЗаполнения.Вставить("ТекСтройка",ТекСтройка);
	ДанныеЗаполнения.Вставить("СоздаватьНовыеЭлементы",СоздаватьНовыеЭлементы);
	ДанныеЗаполнения.Вставить("ОбновлятьПоНормативнойБазе",ОбновлятьПоНормативнойБазе);
	ДанныеЗаполнения.Вставить("СметнаяПрограмма",Объект.СметнаяПрограмма);
	ДанныеЗаполнения.Вставить("ФормаСметы",ФормаСметы);
	ДанныеЗаполнения.Вставить("Заказчик",Заказчик);
	
	ДанныеЗаполнения.Вставить("ОбработатьЛимЗатраты",ОбработатьЛимЗатраты);
	ДанныеЗаполнения.Вставить("СтруктураПозиций",СтруктураПозиций);
	ДанныеЗаполнения.Вставить("СтруктураРесурсов",СтруктураРесурсов);
	ДанныеЗаполнения.Вставить("СтруктураЛимЗатрат",СтруктураЛимЗатрат);
	ДанныеЗаполнения.Вставить("ТаблицаСмет",ТаблицаСмет.Выгрузить());
	
	ПараметрыВызоваСервера = Новый Структура();
	ПараметрыВызоваСервера.Вставить("ИмяВременногоФайла", ИмяВременногоФайла);
	ПараметрыВызоваСервера.Вставить("ВидЗагрузки", Справочники.СМ_СметныеПрограммы.СметаРу);
	ПараметрыВызоваСервера.Вставить("ДанныеЗаполнения", ДанныеЗаполнения);
	
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Обработки.СМ_ЗагрузкаEXCEL.ЗагрузитьФайлВТаблицуПоВиду",
	ПараметрыВызоваСервера, 
	НСтр("ru = 'Подсистема ЗагрузкаДанныхИзФайла: Выполнение серверного метода загрузка данных из файла'"));
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
		ОбработатьРезультатПоВиду(ФоновоеЗаданиеАдресХранилища);
	Иначе
		ФоновоеЗадание = Истина;
		ФоновоеЗаданиеИдентификатор  = РезультатФоновогоЗадания.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаИзФайлаНаКлиенте()
	Результат = ФоновоеЗаданиеЗагрузкаИзФайлаПолучитьРезультат();
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ФоновоеЗаданиеИдентификатор Тогда
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		ОбработатьРезультатПоВиду(ФоновоеЗаданиеАдресХранилища);
		Оповестить("ОбновитьДеревоСмет");
	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаИзФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗагрузкаИзФайлаПолучитьРезультат()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ОбработатьРезультатПоВиду(ФоновоеЗаданиеАдресХранилища)
	ТаблицаРезультата = ПолучитьИЗВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
	Для Каждого Док Из ТаблицаРезультата Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Сформирован документ: %1'"), Строка(Док.Ссылка)),Док.Ссылка);
	КонецЦикла;
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.Параметры;
	Элементы.Страница_Smeta_ru.Видимость = Ложь;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлСДаннымиВТабличныйДокументНаСервере(АдресВременногоХранилища, Расширение, ФоновоеЗадание = Ложь)
	ИмяВременногоФайла=ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(АдресВременногоХранилища);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ОчисткаШаблонСДанными();

	ПараметрыВызоваСервера = Новый Структура();
	ПараметрыВызоваСервера.Вставить("Расширение", Расширение);
	ПараметрыВызоваСервера.Вставить("ШаблонСДанными", ШаблонСДанными);
	ПараметрыВызоваСервера.Вставить("ИмяВременногоФайла", ИмяВременногоФайла);
	
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Обработки.СМ_ЗагрузкаEXCEL.ЗагрузитьФайлВТаблицу",
	ПараметрыВызоваСервера, 
	НСтр("ru = 'Подсистема ЗагрузкаДанныхИзФайла: Выполнение серверного метода загрузка данных из файла'"));
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
		СтруктураХранилище = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		ШаблонСДанными = СтруктураХранилище.ШаблонСДанными;
		ОбработатьРезультат(СтруктураХранилище.СоответствияРеквизитов);
		Элементы.СтраницаРезультат.Видимость = Истина;
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.СтраницаРезультат;
	Иначе
		ФоновоеЗадание = Истина;
		ФоновоеЗаданиеИдентификатор  = РезультатФоновогоЗадания.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультат(СоответствияРеквизитов)
	Структура = ПолучитьИзВременногоХранилища(АдресХранилищаМетаданных);
	РеквизитыСметы = Структура.ЛокальнаяСмета;
	РеквизитыПозиции = Структура.Позиция;
	СоответствияПозиции.Очистить();
	Для Каждого Соответствие Из СоответствияРеквизитов Цикл
		Если  Соответствие.Ключ = "Шапка" Тогда
			СтруктураРеквизитов = Соответствие.Значение;
			Для Каждого ЭлСтрукт Из СтруктураРеквизитов Цикл
				Если ЭлСтрукт.Ключ = "НачалоШапки" Тогда
					Продолжить;
				КонецЕсли;
				Если ЭлСтрукт.Ключ = "КонецШапки" Тогда
					НачальнаяСтрока = ЭлСтрукт.Значение+1; 
					Продолжить;
				КонецЕсли;

				НовСтрока = СоответствияПозиции.Добавить();
				НовСтрока.Обрабатывать = Истина;
				НовСтрока.НомерКолонки = ЭлСтрукт.Значение.Колонка;
				НовСтрока.Смещение = ЭлСтрукт.Значение.Смещение;
				НовСтрока.НазваниеКолонки = ЭлСтрукт.Значение.ИмяКолонки;
				НайденРеквизит = РеквизитыПозиции.НайтиПоЗначению(ЭлСтрукт.Ключ);
				Если Не НайденРеквизит = Неопределено Тогда
					НовСтрока.ИмяРеквизита = НайденРеквизит.Значение;
				КонецЕсли;
			КонецЦикла;
		Иначе
			НовСтрока = СоответствияСмета.Добавить();
			НовСтрока.Обрабатывать = Истина;
			НовСтрока.НомерКолонки = Соответствие.Значение.Колонка;
			НовСтрока.НомСтроки = Число(Соответствие.Значение.Строка);
			НовСтрока.НазваниеКолонки = Соответствие.Значение.ИмяКолонки;
			НайденРеквизит = РеквизитыСметы.НайтиПоЗначению(Соответствие.Ключ);
			Если Не НайденРеквизит = Неопределено Тогда
				НовСтрока.ИмяРеквизита = НайденРеквизит.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	СоответствияСмета.Сортировать("НомСтроки Возр");
КонецПроцедуры

&НаСервере
Процедура ОчисткаШаблонСДанными()
	ШаблонСДанными.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте()
	Результат = ФоновоеЗаданиеЗагрузкаФайлаПолучитьРезультат();
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ФоновоеЗаданиеИдентификатор Тогда
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		СтруктураХранилище = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		ШаблонСДанными = СтруктураХранилище.ШаблонСДанными;
		ОбработатьРезультат(СтруктураХранилище.СоответствияРеквизитов);
		Элементы.СтраницаРезультат.Видимость = Истина;
		Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы.СтраницаРезультат;
	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", ПараметрыОбработчика.ТекущийИнтервал, Истина);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеЗагрузкаФайлаПолучитьРезультат()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ОпределитьШапку(Команда)
	РазобратьШапку();
КонецПроцедуры

&НаСервере
Функция РазобратьШапку()
	ВыделеннаяОбласть = Элементы.Результат.ТекущаяОбласть;
	Соответствия = Новый Соответствие;
	Строки = ВыделеннаяОбласть.Низ;
	Колонки = ВыделеннаяОбласть.Право;
	
	Структура = Новый Структура;
	Структура.Вставить("НачалоШапки",ВыделеннаяОбласть.Верх);

	Для кол = ВыделеннаяОбласть.Лево По Колонки Цикл
		смещ = 0;
		Для стр = ВыделеннаяОбласть.Верх По Строки Цикл
			Смещать = Ложь;
			ТекстЯчейки = ШаблонСДанными.область(стр, кол, стр, кол).Текст;
			Если ЗначениеЗаполнено(ТекстЯчейки) Тогда
				Если Обработки.СМ_ЗагрузкаEXCEL.СтрокуВЧисло(ТекстЯчейки)>0 Тогда
					Прервать;
				КонецЕсли;
				Смещать = Истина;
				Координаты = Новый Структура("Колонка,Смещение,ИмяКолонки",кол,смещ,ТекстЯчейки);
				Если Найти(Врег(СтрЗаменить(ТекстЯчейки," ","")),"П/П")>0 Тогда
					Ключ = "НомерВПределахСметы";
				ИначеЕсли Найти(Врег(ТекстЯчейки),"ШИФР")>0
					ИЛИ Найти(Врег(ТекстЯчейки),"ОБОСНОВАНИЕ")>0 Тогда
					Ключ = "ШифрРасценки";
				ИначеЕсли Найти(Врег(СтрЗаменить(ТекстЯчейки," ","")),"НАИМЕНОВАНИЕРАБОТ")>0 Тогда
					Ключ = "Наименование";
				ИначеЕсли Найти(Врег(СтрЗаменить(ТекстЯчейки," ","")),"ЕДИНИЦАИЗМЕРЕНИЯ")>0
					ИЛИ Найти(ТекстЯчейки,"ед. изм.")>0 Тогда
					Ключ = "ЕдиницаИзмерения";	
				ИначеЕсли Найти(Врег(СтрЗаменить(ТекстЯчейки," ","")),"КОЛИЧЕСТВО")>0
					ИЛИ Найти(ТекстЯчейки,"Кол-во")>0 Тогда
					Ключ = "ОбъемРабот";	
				Иначе
					Ключ = "Неизвестно_"+Строка(стр)+"_"+Строка(кол);
				КонецЕсли;
				Структура.Вставить(Ключ,Координаты);
			КонецЕсли;
			Если Смещать Тогда
				смещ = смещ+1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Структура.Вставить("КонецШапки",ВыделеннаяОбласть.Низ);
	Соответствия.Вставить("Шапка",Структура);
	
	Если Не Соответствия.Получить("Шапка").Свойство("ШифрРасценки") Тогда
		Координаты = Новый Структура("Колонка,Смещение,ИмяКолонки",0,0,"Не найдено");
		Соответствия.Получить("Шапка").Вставить("ШифрРасценки",Координаты)
	КонецЕсли;
	Если Не Соответствия.Получить("Шапка").Свойство("Наименование") Тогда
		Координаты = Новый Структура("Колонка,Смещение,ИмяКолонки",0,0,"Не найдено");
		Соответствия.Получить("Шапка").Вставить("Наименование",Координаты)
	КонецЕсли;
	Если Не Соответствия.Получить("Шапка").Свойство("ЕдиницаИзмерения") Тогда
		Координаты = Новый Структура("Колонка,Смещение,ИмяКолонки",0,0,"Не найдено");
		Соответствия.Получить("Шапка").Вставить("ЕдиницаИзмерения",Координаты)
	КонецЕсли;
	Если Не Соответствия.Получить("Шапка").Свойство("ОбъемРабот") Тогда
		Координаты = Новый Структура("Колонка,Смещение,ИмяКолонки",0,0,"Не найдено");
		Соответствия.Получить("Шапка").Вставить("ОбъемРабот",Координаты)
	КонецЕсли;

	ОбработатьРезультат(Соответствия);
КонецФункции

&НаКлиенте
Процедура СформироватьДокументы(Команда)
	
	ЛокальнаяСмета = СоздатьСмету();
	СоздатьРазделыПозиции(ЛокальнаяСмета);
	Если ОбновлятьПоНормативнойБазе Тогда
		СМ_СметаКлиент.ОбновитьЗагружаемыеПозицииПоНормативнойБазе(СписокПозицийОбновления.ВыгрузитьЗначения(), , Ложь);
	КонецЕсли;
	
	СтруктураПараметров = ПолучитьПараметрыСметы(ЛокальнаяСмета);
	Оповестить("ОбновитьДеревоСмет",СтруктураПараметров);

КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыСметы(ЛокальнаяСмета)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Стройка",ЛокальнаяСмета.Стройка);
	СтруктураПараметров.Вставить("Смета",ЛокальнаяСмета);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура СоздатьРазделыПозиции(ЛокальнаяСмета)
	
	ТЗ = ДанныеФормыВЗначение(ЭтаФорма.СоответствияПозиции,Тип("ТаблицаЗначений")); 
	Строки = ШаблонСДанными.ВысотаТаблицы;
	КолонкаНаименования = ТЗ.Найти("Наименование","ИмяРеквизита");
	Если КолонкаНаименования = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ПрефиксыПрограммы = Неопределено;
	Если Не Объект.СметнаяПрограмма.Пустая() Тогда
		ПрефиксыПрограммы = СМ_АРПС_ОбменВызовСервера.ПолучитьПрефиксы(Объект.СметнаяПрограмма);
	КонецЕсли;

	ВерхнийРаздел = Неопределено;
	Для стр = Число(НачальнаяСтрока) По Строки Цикл
		ТекстЯчейки = СокрЛП(ШаблонСДанными.область(стр, КолонкаНаименования.НомерКолонки, стр, КолонкаНаименования.НомерКолонки).Текст);
		Если Найти(ВРег(ТекстЯчейки),"ПОДРАЗДЕЛ")>0 Тогда
			Раздел = СоздатьРаздел(ЛокальнаяСмета,ВерхнийРаздел,ТекстЯчейки,Истина);
		ИначеЕсли Найти(ВРег(ТекстЯчейки),"РАЗДЕЛ")>0 Тогда
			ВерхнийРаздел = Неопределено;
			Раздел = СоздатьРаздел(ЛокальнаяСмета,ВерхнийРаздел,ТекстЯчейки);
		Иначе
			ТекстНомер = СокрЛП(ШаблонСДанными.область(стр, 1, стр, 1).Текст);
			Если Не ЗначениеЗаполнено(ТекстНомер) Тогда
				Продолжить;
			КонецЕсли;
			СоздатьПозицию(ЛокальнаяСмета,Раздел,стр,ПрефиксыПрограммы);
		КонецЕсли;
	КонецЦикла;
	Документы.СМ_ЛокальнаяСмета.Перерасчет(ЛокальнаяСмета, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПозицию(ЛокальнаяСмета,Раздел,СтрокаТаб,ПрефиксыПрограммы)
	//  Создание нового документа "ПозицияЛС"
	НовДок					= СМ_СметаВызовСервера.СоздатьНовуюПозицию();
	НовДок.Дата				= ТекущаяДатаСеанса();
	НовДок.ИДРодителя 	    = Раздел;
	НовДок.ИДСметы 			= ЛокальнаяСмета;
	НовДок.СпособСоздания	= Перечисления.СМ_ИсточникиДобавленияПозиций.Загружена;
	НовДок.ИсточникСоздания = Объект.СметнаяПрограмма.Наименование + "#Excel";
	
	Для Каждого стр Из СоответствияПозиции Цикл
		Если Не стр.Обрабатывать ИЛИ Не ЗначениеЗаполнено(стр.ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		ТекстЯчейки = СокрЛП(ШаблонСДанными.область(СтрокаТаб+стр.Смещение, стр.НомерКолонки, СтрокаТаб+стр.Смещение, стр.НомерКолонки).Текст);
		
		Если ТекстЯчейки = "" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Найти(стр.ИмяРеквизита,"ШифрРасценки")>0 Тогда
			ЗначениеРеквизита 	= ТекстЯчейки;
		ИначеЕсли Найти(стр.ИмяРеквизита,"Наименование")>0 Тогда
			ЗначениеРеквизита 	= ТекстЯчейки;
		ИначеЕсли Найти(стр.ИмяРеквизита,"НомерВПределахСметы")>0 Тогда
			ЗначениеРеквизита 	= Число(ТекстЯчейки);
		ИначеЕсли Найти(стр.ИмяРеквизита,"ЕдиницаИзмерения")>0 Тогда
			ЗначениеРеквизита = Справочники.СМ_ЕдиницыИзмеренияСмета.НайтиПоНаименованию(ТекстЯчейки);
			Если (Не ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда
				ЗначениеРеквизита = СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСтроке(ТекстЯчейки);
			КонецЕсли;
			НовДок.Измеритель				= ТекстЯчейки;
		Иначе
			ЗначениеРеквизита 	= ТекстЯчейки;
		КонецЕсли;
		НовДок[стр.ИмяРеквизита] = ЗначениеРеквизита;
	КонецЦикла;
	
	НужнаяСтрока = Неопределено;
	Если ПрефиксыПрограммы<>Неопределено И ПрефиксыПрограммы.Количество()>0 Тогда
		НужнаяСтрока = СМ_АРПС_ОбменВызовСервера.НайтиСтрокуПоПрефиксу(НовДок.ШифрРасценки,ПрефиксыПрограммы);
		Если НЕ НужнаяСтрока = Неопределено Тогда
			НовДок.ШифрРасценки = НужнаяСтрока.ШифрБезПрефикса;
			НовДок.Определитель = НужнаяСтрока.Определитель;
			НовДок.ТипНормативныхСборников = НужнаяСтрока.ТНС; 
		КонецЕсли;
	КонецЕсли;
	
	Если НужнаяСтрока = Неопределено Тогда
		НовДок.ТипНормативныхСборников = СМ_СметаЗагрузкаВызовСервера.ОпределитьТипНормСборникаПоШифру(НовДок.ШифрРасценки);
	КонецЕсли;
	
	НовДок.Расчет 			= Истина;
	НовДок.РегиональнаяБаза = СметноНормативнаяБаза;
	НовДок.Записать();
	Если ОбновлятьПоНормативнойБазе Тогда
		СписокПозицийОбновления.Добавить(НовДок.Ссылка);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СоздатьРаздел(ЛокальнаяСмета,ВерхнийРаздел,Наименование,Подраздел = Ложь)
	////  Поиск / создание элемента справочника "Разделы".
	//ТекСпрРаздел = Справочники.СМ_РазделыЛокальнойСметы.НайтиПоНаименованию(Наименование,Истина);
	//Если ТекСпрРаздел = Справочники.СМ_РазделыЛокальнойСметы.ПустаяСсылка() Тогда
	//	ТекСпрРаздел 				= Справочники.СМ_РазделыЛокальнойСметы.СоздатьЭлемент();	
	//	ТекСпрРаздел.Наименование 	= Наименование;
	//	ТекСпрРаздел.Записать();
	//КонецЕсли;
	
	//  Создание нового документа "Раздел ЛС". 
	НовДок							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
	НовДок.НаименованиеДляПечати 	= Наименование;
	НовДок.Дата						= ТекущаяДатаСеанса();
	//НовДок.Раздел 					= ТекСпрРаздел.Ссылка; 
	НовДок.ИДРодителя   			= ?(Подраздел,ВерхнийРаздел,ЛокальнаяСмета);
	НовДок.ИДСметы      			= ЛокальнаяСмета;
	НовДок.Расчет					= Истина;
	НовДок.Записать();

	Если Не Подраздел Тогда
		ВерхнийРаздел = НовДок.Ссылка;
	КонецЕсли;
	Возврат НовДок.Ссылка;
КонецФункции

&НаСервере
Функция СоздатьСмету()
	ТабДок = ШаблонСДанными;
	
	ЛокальнаяСмета = Документы.СМ_ЛокальнаяСмета.СоздатьДокумент();
	ЛокальнаяСмета.Дата = ТекущаяДатаСеанса();
	ЛокальнаяСмета.Автор = Пользователи.ТекущийПользователь();
	СМ_СметаВызовСервера.ЗаполнитьНастройкиПользователяПоУмолчанию(ЛокальнаяСмета);
	ЛокальнаяСмета.Валюта = Справочники.Валюты.НайтиПоКоду("643");
	
	Для Каждого стр Из СоответствияСмета Цикл
		Если Не стр.Обрабатывать ИЛИ Не ЗначениеЗаполнено(стр.ИмяРеквизита) Тогда
			Продолжить;
		КонецЕсли;
		ТекстЯчейки = СокрЛП(ТабДок.область(стр.НомСтроки, стр.НомерКолонки, стр.НомСтроки, стр.НомерКолонки).Текст);
		
		Если Найти(стр.ИмяРеквизита,"Заказчик")>0 Тогда
			ЗначениеРеквизита 	= ПолучитьСоздатьКонтрагента(ТекстЯчейки,1);
		ИначеЕсли Найти(стр.ИмяРеквизита,"Подрядчик")>0 Тогда
			ЗначениеРеквизита 	= ПолучитьСоздатьКонтрагента(ТекстЯчейки,2);
		ИначеЕсли Найти(стр.ИмяРеквизита,"Основание")>0 Тогда
			ЗначениеРеквизита 	= ТекстЯчейки;
		ИначеЕсли Найти(стр.ИмяРеквизита,"Договор")>0 Тогда
			Если ЗначениеЗаполнено(ЛокальнаяСмета.Заказчик) Тогда
				ЗначениеРеквизита = ПолучитьСоздатьДоговор(ЛокальнаяСмета.Заказчик, ТекстЯчейки);	
			КонецЕсли;
		ИначеЕсли Найти(стр.ИмяРеквизита,"Наименование")>0 Тогда
			Часть1 = ТекстЯчейки;
			Часть2 = СокрЛП(ТабДок.область(стр.НомСтроки+1, стр.НомерКолонки, стр.НомСтроки+1, стр.НомерКолонки).Текст);
			ТекстНаименование = ТекстЯчейки + ?(ЗначениеЗаполнено(Часть2)," "+Часть2,"");
			ЗначениеРеквизита 	= ТекстНаименование;
		Иначе
			ЗначениеРеквизита 	= ТекстЯчейки;
		КонецЕсли;
		
		ЛокальнаяСмета[стр.ИмяРеквизита] = ЗначениеРеквизита;
	КонецЦикла;
	НомерСметы = "";
	НомерПозиция = Найти(ЛокальнаяСмета.Наименование,"№");
	Если НомерПозиция>0 Тогда
		СтрокаПоиска = СокрЛП(Сред(ЛокальнаяСмета.Наименование,НомерПозиция+1));
		НайтиПробел = Найти(СтрокаПоиска," ");
		НомерСметы = Сред(СтрокаПоиска,1,НайтиПробел-1);
	КонецЕсли;
	ЛокальнаяСмета.НомерСметы = НомерСметы;
	ЛокальнаяСмета.Организация = Организация;
	ЛокальнаяСмета.Район = Район;
	ЛокальнаяСмета.Стройка = ТекСтройка;
	ЛокальнаяСмета.Записать();
	Возврат ЛокальнаяСмета.Ссылка;
КонецФункции

Функция ПолучитьСоздатьКонтрагента(НаименованиеКонтрагента,ТипКонтрагента);
	
	НаименованиеКонтрагента = СокрЛП(НаименованиеКонтрагента);
	Если НЕ ЗначениеЗаполнено(НаименованиеКонтрагента) Тогда
		Если ТипКонтрагента = 1 Тогда
			НаименованиеКонтрагента	= НСтр("ru='Основной заказчик'");			
		ИначеЕсли ТипКонтрагента = 2 Тогда
			НаименованиеКонтрагента	= НСтр("ru='Основной подрядчик'");
		КонецЕсли;
	КонецЕсли;
	
	ТекКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(НаименованиеКонтрагента,Истина);
	Если ТекКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		Если СоздаватьНовыеЭлементы Тогда
			НовыйОбъект 				= Справочники.Контрагенты.СоздатьЭлемент();
			НовыйОбъект.Наименование 	= НаименованиеКонтрагента;
			НовыйОбъект.Записать();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый контрагент: %1, %2'"), НовыйОбъект.Код, НовыйОбъект.Наименование));
			Возврат НовыйОбъект.Ссылка;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден контрагент: %1'"), НаименованиеКонтрагента));
		КонецЕсли;
	Иначе
		Возврат ТекКонтрагент;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСоздатьДоговор(Контрагент,НаименованиеДоговора);
	
	НаименованиеДоговора = СокрЛП(НаименованиеДоговора);
	Если НЕ ЗначениеЗаполнено(НаименованиеДоговора) Тогда
		НаименованиеДоговора = НСтр("ru='Основной договор'");			
	КонецЕсли;
	
	ТекДоговор = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(НаименованиеДоговора,Истина,Контрагент);
	Если ТекДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		Если СоздаватьНовыеЭлементы Тогда
			НовыйОбъект 				= Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			НовыйОбъект.Наименование 	= НаименованиеДоговора;
			НовыйОбъект.Контрагент		= Контрагент;
			НовыйОбъект.Записать();
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый договор: %1, %2'"), НовыйОбъект.Код, НовыйОбъект.Наименование));
			Возврат НовыйОбъект.Ссылка;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден договор: %1'"), НаименованиеДоговора));
		КонецЕсли;
	Иначе
		Возврат ТекДоговор;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоответствияПозицииОбрабатыватьПриИзменении(Элемент)
	Если Элементы.СоответствияПозиции.ТекущиеДанные.Обрабатывать Тогда
		Смещение = 1;
	Иначе
		Смещение = -1;
	КонецЕсли;
	СместитьКолонкиКлиент(Смещение,Элементы.СоответствияПозиции.ТекущиеДанные.НомерКолонки,Элементы.СоответствияПозиции.ТекущиеДанные.НазваниеКолонки,Элементы.СоответствияПозиции.ТекущиеДанные.Смещение);
КонецПроцедуры

&НаКлиенте
Процедура СместитьКолонкиКлиент(Смещение,НомерКолонки,ПропускаемаяСтрока,СравнениеСмещения)
	 Отбор = Новый Структура("НомерКолонки,Обрабатывать",НомерКолонки,Истина);
	 МассивСтрок = СоответствияПозиции.НайтиСтроки(Отбор);
	 Для Каждого Строка Из МассивСтрок Цикл
		 Если Строка.НазваниеКолонки = ПропускаемаяСтрока ИЛИ Число(СравнениеСмещения) > Число(Строка.Смещение) Тогда
			 Продолжить;
		КонецЕсли;
		 Строка.Смещение = Строка(Число(Строка.Смещение)+Смещение);
	 КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ФормаСметы = 1;
	Если СметнаяКомпонента = Неопределено Тогда
		Элементы.ОбновлятьПоНормативнойБазе.Видимость = Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ИмяФайла) Тогда
		АдресВременногоХранилища = "";
		Оповещение = Новый ОписаниеОповещения("ПриОкончаниеПомещенияФайла", ЭтотОбъект);
		НачатьПомещениеФайла(Оповещение, АдресВременногоХранилища, Параметры.ИмяФайла, Ложь);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
