
#Область РасчетСметы

Процедура ВыполнитьРасчетТекущейОбъектнойСметы(Ссылка)
	
	Если Не Ссылка.ПометкаУдаления Тогда  // ранее было Ссылка.Проведен.. sudav
		СМ_СметаРасчетВызовСервера.РассчитатьЛимитированныеЗатраты(Ссылка);
	Иначе
		СМ_СметаВызовСервера.УдалитьДвижения(Ссылка);
	КонецЕсли;
	
КонецПроцедуры

// Основная процедура расчета объектной сметы, выполняет пересчет сметы.
//
// Параметры:
//   Объект - ДокументОбъект.СМ_ОбъектнаяСмета или ДокументСсылка.СМ_ОбъектнаяСмета.
//   СметыУжеРассчитаны - Истина - подчиненные сметы уже рассчитаны и их пересчет не требуется, 
//  					  Ложь - требуется пересчет подчиненных смет.
Процедура Перерасчет(Объект, СметыУжеРассчитаны = Ложь) Экспорт
	
	ВыполнитьРасчетТекущейОбъектнойСметы(Объект);
		
КонецПроцедуры

Процедура ПерерасчетПодчиненныхСмет(Объект) Экспорт
	
	Для Каждого СтрСмет Из Объект.ЛокальныеСметы Цикл
		Если СтрСмет.ЛокальнаяСмета.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Документы.СМ_ЛокальнаяСмета.Перерасчет(СтрСмет.ЛокальнаяСмета,,Ложь);
	КонецЦикла;
		
КонецПроцедуры

Процедура ПерерасчетВключаяПодчиненныеСметы(Объект) Экспорт
	
	Для Каждого СтрСмет Из Объект.ЛокальныеСметы Цикл
		Если СтрСмет.ЛокальнаяСмета.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Документы.СМ_ЛокальнаяСмета.Перерасчет(СтрСмет.ЛокальнаяСмета,,Ложь);
	КонецЦикла;
	Перерасчет(Объект,Истина);	
КонецПроцедуры

#КонецОбласти

#Область Печать

// Процедура для БСП Печать, добавляет список печатных форм.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - таблица в которую добавляются строки, 
//									   описывающие команды печати документа СМ_ОбъектнаяСмета.
//									   Подробнее в подсистеме "Печать".
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт   
		
	// Основная форма
	КомандаПечати 									= КомандыПечати.Добавить();
	КомандаПечати.менеджерПечати 					= "Документ.СМ_ОбъектнаяСмета";
	КомандаПечати.Идентификатор 					= "ПФ_MXL_МакетОС";
	КомандаПечати.Представление 					= НСтр("ru = 'Объектная смета'");
	КомандаПечати.ЗаголовокФормы					= НСтр("ru = 'Печать объектной сметы'");
	КомандаПечати.ПроверкаПроведенияПередПечатью 	= Истина;
	
	КомандаПечати 									= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 					= "Документ.СМ_ОбъектнаяСмета";
	КомандаПечати.Идентификатор 					= "ПФ_MXL_СМ_КЗ_МакетОС";
	КомандаПечати.Представление 					= НСтр("ru = 'Объектная смета (Казахстан)'");
	КомандаПечати.ЗаголовокФормы					= НСтр("ru = 'Печать объектной сметы (Казахстан)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью 	= Истина;
	КомандаПечати.ФункциональныеОпции				= "СМ_КЗ_МетодикаРСНБКазахстан";
	
	// форма4
	КомандаПечати 									= КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати 					= "Документ.СМ_ОбъектнаяСмета";
	КомандаПечати.Идентификатор	 					= "ПФ_MXL_Макет_Форма4";
	КомандаПечати.Представление 					= НСтр("ru = 'Форма №4'");
	КомандаПечати.ЗаголовокФормы					= НСтр("ru = 'Печать форма №4'");
	КомандаПечати.ПроверкаПроведенияПередПечатью 	= Истина;

КонецПроцедуры

// Формирует печатные формы.
// ПАРАМЕТРЫ:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                          представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьВызовСервера.ПечатьОбъектнойСметы(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПредставлениеОбъекта

// ДокторСофт
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
     СтандартнаяОбработка = Ложь;
     Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Объектная смета №%1 %2'"), Строка(Данные.НомерСметы) ,Строка(Данные.Наименование));
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	 
     СтандартнаяОбработка = Ложь;

     Поля.Добавить("НомерСметы");
	 Поля.Добавить("Наименование");
	 
КонецПроцедуры
// ДокторСофт

#КонецОбласти
