
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("Ключ", КлючЗаписиРегистра(ПараметрКоманды));
	ПараметрыЗаписи.Вставить("ЗначенияЗаполнения", Новый Структура("КонечнаяТочка", ПараметрКоманды));
	
	ОткрытьФорму("РегистрСведений.НастройкиТранспортаОбменаСообщениями.ФормаЗаписи",
		ПараметрыЗаписи, ПараметрыВыполненияКоманды.Источник);
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция КлючЗаписиРегистра(КонечнаяТочка)
	
	Возврат РегистрыСведений.НастройкиТранспортаОбменаСообщениями.СоздатьКлючЗаписи(
		Новый Структура("КонечнаяТочка", КонечнаяТочка));
	
КонецФункции

#КонецОбласти
