
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	//
	//ОткрытьФорму("Отчет.УСОERP_АктОПриемкеВыполненныхРаботКС2.ФормаОбъекта",
	//,
	//ПараметрыВыполненияКоманды.Источник,
	//ПараметрыВыполненияКоманды.Уникальность,
	//ПараметрыВыполненияКоманды.Окно);  
	
	УСОERP_ЗащищенныеФункцииКлиент.ОткрытьФормуЗащищенногоОбъекта("УСОERP_ДанныеСЛК.УСОERP_АктОПриемкеВыполненныхРаботКС2",,
	             ПараметрыФормы,
	             ПараметрыВыполненияКоманды.Источник,
	             ПараметрыВыполненияКоманды.Уникальность,
	             ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти