
#Область СлужебныеПроцедурыИФункции

// Формирует табличный документ отчета (используется для печати из форм списков и элементов).
//
// Параметры:
//     Период - строка с представлением периода, если заполнена выводится сводная шапка.
//     Смета - ссылка на один из документов "ЛокальнаяСмета", "ОбъектнаяСмета", "СводнаяСмета".
//     ЛимЗатратаНДС - ссылка на Лимитированную затрату, которая представляет собой НДС.
//     ЛимЗатраты - таблица с лим затратами для вывода в отчет.
//
// Возвращаемое значение:
//     ТабличныйДокумент - результат формирования отчета с заданными параметрами.
//
Процедура ПолучитьЗаполненныйОтчет(Период,ДокументРезультат, Смета, ЛимЗатратаНДС, ЛимЗатраты = Неопределено) Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	СписокЛимЗатрат = Новый СписокЗначений;
	Если ЛимЗатраты <> Неопределено Тогда
		Если ТипЗнч(ЛимЗатраты) = Тип("Массив") Тогда
			СписокЛимЗатрат.ЗагрузитьЗначения(ЛимЗатраты);
		ИначеЕсли ТипЗнч(ЛимЗатраты) = Тип("СписокЗначений") Тогда
			СписокЛимЗатрат = ЛимЗатраты;
		КонецЕсли;
	КонецЕсли;
	
	
	ИП3 = Справочники.СМ_ИтогиПоГлавам.НайтиПоРеквизиту("Идентификатор","ИП3");
	ИП4 = Справочники.СМ_ИтогиПоГлавам.НайтиПоРеквизиту("Идентификатор","ИП4");
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(Смета) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СМ_АктВыполненныхРабот.Ссылка КАК АктВыполненныхРабот
		               |ИЗ
		               |	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
		               |ГДЕ
		               |	СМ_АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ
		               |	И СМ_АктВыполненныхРабот.ЛокальнаяСмета = &Смета";
	ИначеЕсли ТипЗнч(Смета) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	СМ_АктВыполненныхРабот.Ссылка КАК АктВыполненныхРабот
		               |ИЗ
		               |	Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
		               |		ПО СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета = СМ_АктВыполненныхРабот.ЛокальнаяСмета
		               |ГДЕ
		               |	СМ_ОбъектнаяСметаЛокальныеСметы.Расчет = ИСТИНА
		               |	И СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка = &Смета
		               |	И СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ
		               |	И СМ_АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ";
	ИначеЕсли ТипЗнч(Смета) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		Запрос.Текст =  "ВЫБРАТЬ
		                |	СМ_АктВыполненныхРабот.Ссылка КАК АктВыполненныхРабот
		                |ИЗ
		                |	Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
		                |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
		                |			ПО СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета = СМ_АктВыполненныхРабот.ЛокальнаяСмета
		                |		ПО СМ_СводнаяСметаСметы.Смета = СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка
		                |ГДЕ
		                |	СМ_СводнаяСметаСметы.Ссылка = &Смета
		                |	И СМ_ОбъектнаяСметаЛокальныеСметы.Расчет = ИСТИНА
		                |	И СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ
		                |	И СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка.ПометкаУдаления = ЛОЖЬ
		                |	И СМ_АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                |	СМ_АктВыполненныхРабот.Ссылка
		                |ИЗ
		                |	Документ.СМ_СводнаяСмета.Сметы КАК СМ_СводнаяСметаСметы
		                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
		                |		ПО СМ_СводнаяСметаСметы.Смета = СМ_АктВыполненныхРабот.ЛокальнаяСмета
		                |ГДЕ
		                |	СМ_СводнаяСметаСметы.Ссылка = &Смета
		                |	И СМ_СводнаяСметаСметы.Смета.ПометкаУдаления = ЛОЖЬ
		                |	И СМ_АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ";
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Неправильный формат передаваемого параметра'"));
		Возврат;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Смета",Смета);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СписокАктов = Новый СписокЗначений;
	СписокАктов.ЗагрузитьЗначения(РезультатЗапроса.ВыгрузитьКолонку("АктВыполненныхРабот"));
	
	//  выводим результат 
	СхемаКомпоновкиДанных = ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    Настройки = ЭтотОбъект.КомпоновщикНастроек.Настройки;// СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокЛимЗатрат",СписокЛимЗатрат);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СписокАктов",СписокАктов);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИП3",ИП3);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ИП4",ИП4);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЛимЗатратаНДС",ЛимЗатратаНДС);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Заказчик",Смета.Заказчик);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Подрядчик",Смета.Подрядчик);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Объект",Смета.Стройка);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаСоставления",ТекущаяДатаСеанса());
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодС",Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодПо",Период.ДатаОкончания);

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	// Инициализируем макет компоновки используя схему компоновки данных 
	// и созданные ранее настройки и данные расшифровки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	
	ДокументРезультат.Очистить();

	// Выводим результат в табличный документ.
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	
	ПроцессорВывода.НачатьВывод();
	
	Параметры = Новый Структура;
	
	ПередВыводомМакета(ДокументРезультат, МакетКомпоновки, Параметры);


	Пока Истина Цикл
		
		ЭлементВывода = ПроцессорКомпоновки.Следующий();
		Если ЭлементВывода = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Отказ = Ложь;
		
		ПередВыводомЭлементаМакета(ДокументРезультат, МакетКомпоновки, ЭлементВывода, Параметры, Отказ);
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		ПроцессорВывода.ВывестиЭлемент(ЭлементВывода);
		
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();	
	
	
	ДокументРезультат.НижнийКолонтитул.Выводить = Истина;
	ДокументРезультат.НижнийКолонтитул.Шрифт = Новый Шрифт(ДокументРезультат.НижнийКолонтитул.Шрифт, , , , Истина);
	ДокументРезультат.НижнийКолонтитул.ТекстВЦентре = НСтр("ru='Стр. [&НомерСтраницы] из [&СтраницВсего]'");
	Если Не Параметры.ОбластьШапкиОтчета = Неопределено Тогда
		ОбластьШапкиПовтор = ДокументРезультат.Область(Параметры.ОбластьШапкиОтчета.Низ, ,Параметры.ОбластьШапкиОтчета.Низ) ;
		ДокументРезультат.ПовторятьПриПечатиСтроки = ОбластьШапкиПовтор;
	КонецЕсли;
	ДокументРезультат.АвтоМасштаб = Истина;
КонецПроцедуры

Процедура ПередВыводомМакета(Результат, МакетКомпоновки, Параметры)
	
	НачатьПоискОбластиШапкиОтчета(МакетКомпоновки, Параметры);
	
КонецПроцедуры

Процедура ПередВыводомЭлементаМакета(Результат, МакетКомпоновки, ЭлементВывода, Параметры, Отказ)
	
	НайтиОбластьШапкиОтчета(Результат, ЭлементВывода, Параметры);
	
КонецПроцедуры

// Вызывается в обработчике "ПередВыводомМакета"
//
Процедура НачатьПоискОбластиШапкиОтчета(МакетКомпоновки, ПараметрыОтчета)

	ПараметрыОтчета.Вставить("МакетШапки", ПолучитьМакетШапки(МакетКомпоновки.Тело));
	
КонецПроцедуры


// Возвращает имя макета шапки отчета
//
Функция ПолучитьМакетШапки(ТелоМакетаКомпоновки)

	КоличествоЭлементовТела = ТелоМакетаКомпоновки.Количество();
	Для ИндексЭлемента = 0 По КоличествоЭлементовТела - 1 Цикл
		
		ЭлементТела = ТелоМакетаКомпоновки[ИндексЭлемента];
		Если ТипЗнч(ЭлементТела) = Тип("ТаблицаМакетаКомпоновкиДанных")
			И Не ПустаяСтрока(ЭлементТела.МакетШапки) Тогда
			
			Возврат ЭлементТела.МакетШапки;
			
		ИначеЕсли ТипЗнч(ЭлементТела) = Тип("ГруппировкаМакетаКомпоновкиДанных") И ИндексЭлемента > 0
			И ТипЗнч(ТелоМакетаКомпоновки[ИндексЭлемента - 1]) = Тип("МакетОбластиМакетаКомпоновкиДанных") 
			И Не ПустаяСтрока(ТелоМакетаКомпоновки[ИндексЭлемента - 1].Макет) Тогда
			
			Возврат ТелоМакетаКомпоновки[ИндексЭлемента - 1].Макет;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается в обработчике "ПередВыводомЭлементаМакета"
//
Процедура НайтиОбластьШапкиОтчета(Результат, ЭлементВывода, ПараметрыОтчета)
	
	Если Не ПараметрыОтчета.Свойство("ОбластьШапкиОтчета") Тогда
		Если ПустаяСтрока(ПараметрыОтчета.МакетШапки) Тогда
			ПараметрыОтчета.Вставить("ОбластьШапкиОтчета");
		ИначеЕсли Не ПараметрыОтчета.Свойство("НомерСтрокиШапкиНачало") И ЭлементВывода.Макет = ПараметрыОтчета.МакетШапки Тогда
			ПараметрыОтчета.Вставить("НомерСтрокиШапкиНачало", Результат.ВысотаТаблицы + 1);
		ИначеЕсли ПараметрыОтчета.Свойство("НомерСтрокиШапкиНачало") Тогда
			ПараметрыОтчета.Вставить("НомерСтрокиШапкиКонец", Результат.ВысотаТаблицы);
			ПараметрыОтчета.Вставить("ОбластьШапкиОтчета", Результат.Область(ПараметрыОтчета.НомерСтрокиШапкиНачало, , ПараметрыОтчета.НомерСтрокиШапкиКонец));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти