
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериодаОбъект",Дата(2018,01,01));
	//КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериодаОбъект",Дата(2022,01,01));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ГруппаДоход",Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("1Д"));
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ГруппаРасход",Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("1В"));
	
	СпОрганизаций= Новый СписокЗначений;
	Попытка
		СпОрганизаций.Добавить(Справочники.Организации.НайтиПоКоду("000000058"));
	Исключение
	
	КонецПопытки;
	Попытка
		СпОрганизаций.Добавить(Справочники.Организации.НайтиПоКоду("000000080"));
		
	
	Исключение
	
	КонецПопытки;
	
	Попытка
		СпОрганизаций.Добавить(Справочники.Организации.НайтиПоКоду("000000086"));
	
	Исключение
	
	КонецПопытки;

	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СпОрганизаций",СпОрганизаций);
	
	ОтображатьВсеСтатьи= Ложь;
	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ОтображатьОборотыПоФинансовойДеятельности") Тогда
		ОтображатьВсеСтатьи= Истина;
	КонецЕсли;
	////КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти("НеВыводитьФинДеятельность"
	//ТекПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НеВыводитьФинДеятельность"));
	//Сообщить("Тек параметр = "+ ТекПараметр.Использование );
	//
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОтображатьВсеСтатьи",ОтображатьВсеСтатьи);
КонецПроцедуры
