
&НаКлиенте
Процедура ОК(Команда)
	мРезультат = Новый Структура("ПробегПоОдометру, ПробегПоGPS", ПробегПоОдометру, ПробегПоGPS);
	Закрыть(мРезультат);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		АвтоТест = Истина;
		Возврат;
	КонецЕсли;

	Если Параметры.Свойство("ТолькоПросмотр") И Параметры.ТолькоПросмотр = Истина Тогда
		ТолькоПросмотр = Истина;
		Элементы.ФормаОК.Доступность = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("флМоточасы") И Параметры.флМоточасы = Истина Тогда
		Элементы.ПробегПоОдометру.Заголовок = "Наработка по счетчику:";
		Элементы.ПробегПоGPS.Заголовок      = "Наработка по GPS:";
		Элементы.ПробегПоОдометру.Подсказка = "Наработка по счетчику моточасов, ч";
		Элементы.ПробегПоGPS.Подсказка      = "Наработка по датчику GPS, ч";
		Заголовок = "Ввод наработки по моточасам";
	КонецЕсли;
	
	Если Параметры.Свойство("ПробегПоОдометру") Тогда
		ПробегПоОдометру = Параметры.ПробегПоОдометру;
	КонецЕсли;
	Если Параметры.Свойство("ПробегПоОдометру") Тогда
		ПробегПоGPS = Параметры.ПробегПоGPS;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если АвтоТест тогда
		Возврат;
	КонецЕсли;
	
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект), "Непосредственное открытие для данного объекта запрещено!", 10);
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(ДополнительныеПараметры) Экспорт
	Зарезервировано = Истина;
КонецПроцедуры


