Процедура ВыполнитьДвижения(Объект, ВидДвижения)
	
   //Направление= Справочники.Направления.ПустаяСсылка();
		
	НоваяСтрока					= Добавить();
	НоваяСтрока.ВидДвижения 	= ВидДвижения;
	НоваяСтрока.Период 			= Объект.Дата;
	НоваяСтрока.Подразделение 	= Объект.Подразделение;
	НоваяСтрока.СтатьяДвиженияДенежныхСредств 	= Объект.СтатьяДвиженияДенежныхСредств;
	НоваяСтрока.ВидОплаты 	= Объект.ВидОплаты;        
	
	Если ТипЗнч(Объект)= Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		НоваяСтрока.Направление = 	Объект.СчетНаОплатуПоставщика.Направление;
	КонецЕсли;                                         

	
	НоваяСтрока.Сумма 			= Объект.СуммаДокумента;

	Записывать = Истина;
	
КонецПроцедуры

Процедура ВыполнитьПриход(Объект) Экспорт
	
	ВыполнитьДвижения(Объект, ВидДвиженияНакопления.Приход);
	
КонецПроцедуры

Функция НадоСписыватьЛимиты(Объект) Экспорт
	
	ДатаНачалаИспользования = Константы.Лимиты_ДатаНачалаИспользования.Получить();
	Если Не ЗначениеЗаполнено(ДатаНачалаИспользования) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Объект.Дата<ДатаНачалаИспользования Тогда
		Возврат Ложь;
	КонецЕсли;
	
	МетаданныеОбъекта = Объект.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти("СчетНаОплатуПоставщика")<>Неопределено
		И Объект.СчетНаОплатуПоставщика.ВидОперации=Перечисления.ВидыОперацийСчетНаОплатуПоставщику.Транзит
		И Объект.Дата>=Дата(2016, 10, 18) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ВыполнитьРасход(Объект) Экспорт
		
	ВыполнитьДвижения(Объект, ВидДвиженияНакопления.Расход);
	
КонецПроцедуры