////////////////////////////////////////////////////////////////////////////////
// Подсистема "Расчет имущественных налогов".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает необходимость уплаты авансов по налогу на имущество.
//
// Параметры:
// 	Организации - СправочникСсылка.Организации - Организация, для которой необходимо выполнить проверку.
// 	Период - Дата - Дата закрытия месяца.
//
// Возвращаемое значение:
// 	Результат - Булево - Признак необходимости уплаты аванса.
//
Функция УплачиваютсяАвансыПоНалогуНаИмущество(Организации, Период) Экспорт
	
	УплачиваютсяАвансы = Ложь;
	
	Запрос = Новый Запрос;         
	
	Запрос.УстановитьПараметр("Организации", Организации);
	Запрос.УстановитьПараметр("Период", Период);
	
	Запрос.Текст =                                     
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.НалоговыйОрган КАК НалоговыйОрган
	|ПОМЕСТИТЬ ВТ_НалоговыеОрганы
	|ИЗ
	|	(ВЫБРАТЬ
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация КАК Организация,
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган КАК НалоговыйОрган
	|	ИЗ
	|		РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
	|				КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Период, ГОД, -1), ГОД),
	|				Организация В (&Организации)
	|					И ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация,
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган
	|	ИЗ
	|		РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
	|				КОНЕЦПЕРИОДА(&Период, КВАРТАЛ),
	|				Организация В (&Организации)
	|					И ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)) КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация,
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.НалоговыйОрган
	|	ИЗ
	|		РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам
	|	ГДЕ
	|		СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Организация В (&Организации)
	|		И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.ПостановкаНаУчетВНалоговомОргане = ЗНАЧЕНИЕ(Перечисление.ПостановкаНаУчетВНалоговомОргане.ВДругомНалоговомОргане)
	|		И СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, ГОД) И КОНЕЦПЕРИОДА(&Период, КВАРТАЛ)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Организации.Ссылка,
	|		Организации.РегистрацияВНалоговомОргане
	|	ИЗ
	|		Справочник.Организации КАК Организации
	|	ГДЕ
	|		Организации.Ссылка В (&Организации)) КАК ВложенныйЗапрос
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	НалоговыйОрган
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Организация КАК Организация,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы КАК УплачиваютсяАвансы
	|ПОМЕСТИТЬ ВТ_УплачиваютсяАвансыПоОрганизации
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(
	|			&Период,
	|			Организация В (&Организации)
	|				И РегистрацияВНалоговомОргане = ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				И Налог = ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.Организация КАК Организация,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	ПорядокУплатыНалоговНаМестахСрезПоследних.УплачиваютсяАвансы КАК УплачиваютсяАвансы
	|ПОМЕСТИТЬ ВТ_УплачиваютсяАвансыПоИФНС
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНалоговНаМестах.СрезПоследних(
	|			&Период,
	|			Организация В (&Организации)
	|				И РегистрацияВНалоговомОргане <> ЗНАЧЕНИЕ(Справочник.РегистрацииВНалоговомОргане.ПустаяСсылка)
	|				И Налог = ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество)) КАК ПорядокУплатыНалоговНаМестахСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	РегистрацияВНалоговомОргане
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВЫБОР
	|			КОГДА ВТ_УплачиваютсяАвансыПоИФНС.УплачиваютсяАвансы ЕСТЬ NULL 
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_УплачиваютсяАвансыПоОрганизации.УплачиваютсяАвансы ЕСТЬ NULL 
	|							ТОГДА ЛОЖЬ
	|						ИНАЧЕ ВТ_УплачиваютсяАвансыПоОрганизации.УплачиваютсяАвансы
	|					КОНЕЦ
	|			ИНАЧЕ ВТ_УплачиваютсяАвансыПоИФНС.УплачиваютсяАвансы
	|		КОНЕЦ), ЛОЖЬ) КАК УплачиваютсяАвансы
	|ИЗ
	|	ВТ_НалоговыеОрганы КАК ВТ_НалоговыеОрганы
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ВТ_УплачиваютсяАвансыПоОрганизации КАК ВТ_УплачиваютсяАвансыПоОрганизации
	|		ПО 
	|			ВТ_НалоговыеОрганы.Организация = ВТ_УплачиваютсяАвансыПоОрганизации.Организация
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			ВТ_УплачиваютсяАвансыПоИФНС КАК ВТ_УплачиваютсяАвансыПоИФНС
	|		ПО 
	|			ВТ_НалоговыеОрганы.Организация = ВТ_УплачиваютсяАвансыПоИФНС.Организация
	|			И ВТ_НалоговыеОрганы.НалоговыйОрган = ВТ_УплачиваютсяАвансыПоИФНС.РегистрацияВНалоговомОргане";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Пока Выборка.Следующий() Цикл
			УплачиваютсяАвансы = Выборка.УплачиваютсяАвансы;
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат УплачиваютсяАвансы;
	
КонецФункции

// Возвращает таблицы выполнения регламентных операций расчета имущественных налогов.
//
// Параметры:
//  ТаблицаРеквизиты - ТаблицаЗначений - Реквизиты документа.
//  Отказ			 - Булево	 - Флаг отказа проведения.
//  СписокОшибок	 - Массив	 - Ошибки, которые обнаружены при расчете налога.
// 
// Возвращаемое значение:
//  СтруктураТаблиц - Структура - Таблицы расчета налога:
//  Ключи:
//  ТаблицаСправкиРасчета - ТаблицаЗначений - Справка-расчет налога.
//  ТаблицаРасходыПоНалогу - ТаблицаЗначений - Отражение расходов по налогу.
//
Функция ПодготовитьТаблицыРасчетНалога(ТаблицаРеквизиты, Отказ, СписокОшибок = Неопределено) Экспорт
	
	СтруктураТаблиц = Новый Структура();
	СтруктураТаблиц.Вставить("ТаблицаСправкиРасчета");
	СтруктураТаблиц.Вставить("ТаблицаРасходыПоНалогу");
	СтруктураТаблиц.Вставить("ТаблицаРасходыНаПлатон");
	
	Параметры = ПодготовитьПараметрыРасчетНалога(ТаблицаРеквизиты);
	Если Параметры.Реквизиты.Количество() = 0 Тогда
		Возврат СтруктураТаблиц;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
	ТаблицыРасчетНалога = ТаблицыРасчетНалога(Реквизиты);
	
	Результат = РасходыПоНалогу(
					Реквизиты, 
					ТаблицыРасчетНалога.СправкаРасчет, 
					ТаблицыРасчетНалога.РасходыНаПлатон, 
					СписокОшибок,
					Отказ);
	
	СтруктураТаблиц.Вставить("ТаблицаСправкиРасчета",      ТаблицыРасчетНалога.СправкаРасчет);
	СтруктураТаблиц.Вставить("ТаблицаРасходыПоНалогу",     Результат.ПрочиеРасходы);
	СтруктураТаблиц.Вставить("ТаблицаПрочиеАктивыПассивы", Результат.ПрочиеАктивыПассивы);
	СтруктураТаблиц.Вставить("ТаблицаДвиженияДоходыРасходыПрочиеАктивыПассивы", Результат.ДвиженияДоходыРасходыПрочиеАктивыПассивы);
	СтруктураТаблиц.Вставить("ТаблицаРасходыНаПлатон",     ТаблицыРасчетНалога.РасходыНаПлатон);
	
	Возврат СтруктураТаблиц;

КонецФункции

// Формирует движения регистров по данным расчета налога.
//
Процедура СформироватьДвиженияРасчетНалога(ТаблицыНачислениеНалога, ТаблицаРеквизитов, Движения, Отказ) Экспорт

	Параметры = ПодготовитьПараметрыДвиженийРасчетНалога(ТаблицаРеквизитов);
	Если Параметры.Реквизиты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = Параметры.Реквизиты[0];
	
	РасчетИмущественныхНалогов.ДополнитьПараметрыДвиженийСправкаРасчет(Параметры, Реквизиты, ТаблицыНачислениеНалога.ТаблицаСправкиРасчета);
	
	// Данные для справки-расчета
	ЗакрытиеМесяца.ЗаписьВоВспомогательныеРегистрыСведений(
		Движения, 
		Параметры.СправкаРасчет, 
		Параметры.Реквизиты, 
		Реквизиты.ИмяРегистраРасчетНалогов);
		
	Если ТаблицыНачислениеНалога.ТаблицаРасходыПоНалогу.Количество() <> 0 Тогда
		Движения.ПрочиеРасходы.Записывать = Истина;
		Движения.ПрочиеРасходы.Загрузить(ТаблицыНачислениеНалога.ТаблицаРасходыПоНалогу);
	КонецЕсли;
	
	Если ТаблицыНачислениеНалога.ТаблицаПрочиеАктивыПассивы.Количество() <> 0 Тогда
		Движения.ПрочиеАктивыПассивы.Записывать = Истина;
		Движения.ПрочиеАктивыПассивы.Загрузить(ТаблицыНачислениеНалога.ТаблицаПрочиеАктивыПассивы);
	КонецЕсли;
	
	Если ТаблицыНачислениеНалога.ТаблицаДвиженияДоходыРасходыПрочиеАктивыПассивы.Количество() <> 0 Тогда
		Движения.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Записывать = Истина;
		Движения.ДвиженияДоходыРасходыПрочиеАктивыПассивы.Загрузить(ТаблицыНачислениеНалога.ТаблицаДвиженияДоходыРасходыПрочиеАктивыПассивы);
	КонецЕсли;

КонецПроцедуры

// Определяет расходы на Платон.
//
// Параметры:
//  Организация						 - СправочникСсылка.Организации -  Организация, для которой выполняется расчет транспортного налога.
//  ПериодРасчета					 - Дата - Дата закрытия месяца.
//  ТаблицаРасчетТранспортногоНалога - ТаблицаЗначений - Содержит расчет транспортного налога.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Содержит расходы на Платон.
//
Функция ПолучитьРасходыНаПлатон(Организация, ПериодРасчета, ТаблицаРасчетТранспортногоНалога) Экспорт

	ТаблицаРасходыНаПлатон = СформироватьТаблицуРасходовНаПлатон(Организация, ПериодРасчета, ТаблицаРасчетТранспортногоНалога);

	УчестьРасходыНаПлатонВРасчетеТранспортногоНалога(ПериодРасчета, ТаблицаРасходыНаПлатон, ТаблицаРасчетТранспортногоНалога);
	
	Возврат ТаблицаРасходыНаПлатон;
	
КонецФункции
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РасчетНалогаНаИмущество

Процедура СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(МенеджерВременныхТаблиц, СписокОрганизаций, Период, Налог) Экспорт

	РасчетИмущественныхНалогов.СоздатьНалоговыеОрганыСУстановленнойУплатойАвансов(
		МенеджерВременныхТаблиц, СписокОрганизаций, Период, Налог);
	
КонецПроцедуры
 
Процедура ДополнитьПараметрыРасчетаНалогаНаИмущество(Организация, ПериодРасчета, ДополнительныеПараметрыРасчета, ПараметрыРасчета) Экспорт

	Если ДополнительныеПараметрыРасчета <> Неопределено Тогда
		ПараметрыРасчета.МенеджерВременныхТаблиц = ДополнительныеПараметрыРасчета;
		ПараметрыРасчета.Вставить("РасчетПоФактическойСтоимости", Истина);
	Иначе
		ПараметрыРасчета.Вставить("РасчетПоФактическойСтоимости", Ложь);
	КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьПараметрыЗапросаПриРасчетеНалогаЗаПериод(Период, Запрос) Экспорт

	Запрос.УстановитьПараметр("ИспользуетсяУправлениеВНА_2_4", ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(ДобавитьМесяц(Период, -1)));
	Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Период));
	Запрос.УстановитьПараметр("НачалоПредыдущегоМесяца", ДобавитьМесяц(Период, -1));
	Запрос.УстановитьПараметр("КонецПредыдущегоМесяца", Период-1);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаКоэффициентыЕНВД_ПоОС(СписокЗапросов) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СпособыОтраженияРасходов.ОсновноеСредство КАК ОсновноеСредство,
	|	КоэффициентыЕНВД.НеЕНВД КАК НеЕНВД,
	|	КоэффициентыЕНВД.Распределение КАК Распределение
	|ПОМЕСТИТЬ КоэффициентыЕНВД_ПоОС
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						СписокОС.ОсновноеСредство
	|					ИЗ
	|						СписокОС)) КАК СпособыОтраженияРасходов
	|		ЛЕВОЕ СОЕДИНЕНИЕ КоэффициентыЕНВД КАК КоэффициентыЕНВД
	|		ПО СпособыОтраженияРасходов.ОсновноеСредство = КоэффициентыЕНВД.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура СоздатьВТКоэффициентыЕНВД(ПараметрыРасчета) Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпособыОтраженияРасходовПоАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	СпособыОтраженияРасходовПоАмортизации.СтатьяРасходов КАК СтатьяРасходов,
	|	СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходовЗаданДокументом КАК СпособОтраженияРасходовЗаданДокументом,
	|	СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов КАК СпособОтраженияРасходов
	|ПОМЕСТИТЬ СпособыОтраженияРасходовПоАмортизации
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&Период, Организация = &Организация) КАК СпособыОтраженияРасходовПоАмортизации
	|ГДЕ
	|	НЕ &ИспользуетсяУправлениеВНА_2_4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорядокУчетаОСБУ.ОсновноеСредство,
	|	ПорядокУчетаОСБУ.СтатьяРасходов,
	|	ПорядокУчетаОСБУ.СпособОтраженияРасходов <> ЗНАЧЕНИЕ(Документ.ИзменениеПараметровОС2_4.ПустаяСсылка),
	|	ПорядокУчетаОСБУ.СпособОтраженияРасходов
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(&Период, Организация = &Организация) КАК ПорядокУчетаОСБУ
	|ГДЕ
	|	&ИспользуетсяУправлениеВНА_2_4
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпособыОтраженияРасходовПоАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	ВЫБОР
	|		КОГДА СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходовЗаданДокументом
	|			ТОГДА ЕСТЬNULL(СпособыОтраженияРасходовПоАмортизацииТаблица.СтатьяРасходов, СпособыОтраженияРасходовПоАмортизацииТаблица24.СтатьяРасходов)
	|		ИНАЧЕ СпособыОтраженияРасходовПоАмортизации.СтатьяРасходов
	|	КОНЕЦ КАК СтатьяРасходов,
	|	ВЫБОР
	|		КОГДА СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходовЗаданДокументом
	|			ТОГДА ЕСТЬNULL(СпособыОтраженияРасходовПоАмортизацииТаблица.Коэффициент, СпособыОтраженияРасходовПоАмортизацииТаблица24.Коэффициент)
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_ВыборкаКоэффициентов
	|ИЗ
	|	СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС.ОтражениеАмортизационныхРасходов КАК СпособыОтраженияРасходовПоАмортизацииТаблица
	|		ПО СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизацииТаблица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС2_4.Амортизация КАК СпособыОтраженияРасходовПоАмортизацииТаблица24
	|		ПО СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизацииТаблица24.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпособыОтраженияРасходовПоАмортизации.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ЕСТЬNULL(СпособыОтраженияРасходовПоАмортизацииТаблица.Коэффициент, СпособыОтраженияРасходовПоАмортизацииТаблица24.Коэффициент)) КАК СуммаКоэффициентов
	|ПОМЕСТИТЬ ВТ_ВыборкаСуммыКоэффициентов
	|ИЗ
	|	СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС.ОтражениеАмортизационныхРасходов КАК СпособыОтраженияРасходовПоАмортизацииТаблица
	|		ПО СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизацииТаблица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС2_4.Амортизация КАК СпособыОтраженияРасходовПоАмортизацииТаблица24
	|		ПО СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходов = СпособыОтраженияРасходовПоАмортизацииТаблица24.Ссылка
	|ГДЕ
	|	СпособыОтраженияРасходовПоАмортизации.СпособОтраженияРасходовЗаданДокументом
	|
	|СГРУППИРОВАТЬ ПО
	|	СпособыОтраженияРасходовПоАмортизации.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыборкаКоэффициентов.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиРасходов.ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.ОсновнаяСистемаНалогообложения)
	|				ТОГДА ВыборкаКоэффициентов.Коэффициент / ЕСТЬNULL(ВыборкаСуммыКоэффициентов.СуммаКоэффициентов, 1)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НеЕНВД,
	|	СУММА(ВЫБОР
	|			КОГДА СтатьиРасходов.ВидДеятельностиДляНалоговогоУчетаЗатрат = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиДляНалоговогоУчетаЗатрат.РаспределяемыеЗатраты)
	|				ТОГДА ВыборкаКоэффициентов.Коэффициент / ЕСТЬNULL(ВыборкаСуммыКоэффициентов.СуммаКоэффициентов, 1)
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Распределение
	|ПОМЕСТИТЬ КоэффициентыЕНВД
	|ИЗ
	|	ВТ_ВыборкаКоэффициентов КАК ВыборкаКоэффициентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.СтатьиРасходов КАК СтатьиРасходов
	|		ПО ВыборкаКоэффициентов.СтатьяРасходов = СтатьиРасходов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыборкаСуммыКоэффициентов КАК ВыборкаСуммыКоэффициентов
	|		ПО ВыборкаКоэффициентов.ОсновноеСредство = ВыборкаСуммыКоэффициентов.ОсновноеСредство
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыборкаКоэффициентов.ОсновноеСредство
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", ПараметрыРасчета.ПериодРасчета);
	Запрос.УстановитьПараметр("Организация", ПараметрыРасчета.Организация);
	Запрос.УстановитьПараметр("ИспользуетсяУправлениеВНА_2_4", ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(ПараметрыРасчета.ПериодРасчета));
	Запрос.Выполнить();
	
КонецПроцедуры
 
Процедура СоздатьВТДвижимоеИмуществоПринятоеКУчетуПосле2013(ПараметрыРасчета) Экспорт

	Если ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(ПараметрыРасчета.ПериодРасчета) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПервоначальныеСведенияОС.ОсновноеСредство КАК ОС
		|ПОМЕСТИТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013
		|ИЗ
		|	РегистрСведений.ПервоначальныеСведенияОС КАК ПервоначальныеСведенияОС
		|ГДЕ
		|	ПервоначальныеСведенияОС.Активность
		|	И ПервоначальныеСведенияОС.Период <= &КонецПериодаОтчета
		|	И ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ >= ДАТАВРЕМЯ(2013, 1, 1)
		|	И ПервоначальныеСведенияОС.Организация В
		|			(ВЫБРАТЬ
		|				Организации.Ссылка КАК Ссылка
		|			ИЗ
		|				Справочник.Организации КАК Организации
		|			ГДЕ
		|				(Организации.Ссылка = &ГоловнаяОрганизация
		|					ИЛИ Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация))
		|	И НЕ ПервоначальныеСведенияОС.ОсновноеСредство.ГруппаОС В (
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ОбъектыПриродопользования))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПервоначальныеСведенияОС.ОсновноеСредство
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(ПервоначальныеСведенияОС.ДатаВводаВЭксплуатациюБУ) >= ДАТАВРЕМЯ(2013, 1, 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОС";
		
	Иначе	
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОС
		|ПОМЕСТИТЬ ВТДвижимоеИмуществоПринятоеКУчетуПосле2013
		|ИЗ
		|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
		|ГДЕ
		|	СостоянияОСОрганизаций.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
		|	И СостоянияОСОрганизаций.Период <= &КонецПериодаОтчета
		|	И СостоянияОСОрганизаций.Организация В
		|			(ВЫБРАТЬ
		|				Организации.Ссылка КАК Ссылка
		|			ИЗ
		|				Справочник.Организации КАК Организации
		|			ГДЕ
		|				(Организации.Ссылка = &ГоловнаяОрганизация
		|					ИЛИ Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация))
		|	И НЕ СостоянияОСОрганизаций.ОсновноеСредство.ГруппаОС В (
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Здания), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.Сооружения), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.МноголетниеНасаждения), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ПрочееИмуществоТребующееГосударственнойРегистрации), 
		|				ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ОбъектыПриродопользования))
		|
		|СГРУППИРОВАТЬ ПО
		|	СостоянияОСОрганизаций.ОсновноеСредство
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(СостоянияОСОрганизаций.Период) >= ДАТАВРЕМЯ(2013, 1, 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОС";
		
	КонецЕсли; 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ПараметрыРасчета.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("КонецПериодаОтчета", КонецГода(ПараметрыРасчета.ПериодРасчета));
	
	ГоловнаяОрганизация = ПараметрыРасчета.Организация.ГоловнаяОрганизация;
	Если Не ЗначениеЗаполнено(ГоловнаяОрганизация) Тогда
		ГоловнаяОрганизация = ПараметрыРасчета.Организация;
	КонецЕсли;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	
	Запрос.Выполнить();
	
КонецПроцедуры
 
Процедура ДобавитьТекстЗапросаНеСнятыеСУчетаОС(ПараметрыРасчета, СписокЗапросов) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СостоянияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СостоянияОС.ОсновноеСредство.ГруппаОС КАК ГруппаОС,
	|	СостоянияОС.ОсновноеСредство.НедвижимоеИмущество КАК НедвижимоеИмущество
	|ПОМЕСТИТЬ ВТ_НеСнятыеСУчетаОС
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|			//ОТБОР_ОС//
	|	) КАК СостоянияОС
	|ГДЕ
	|	СостоянияОС.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	Если ПараметрыРасчета.РасчетПоФактическойСтоимости Тогда
		ТекстОтбораОС = "И ОсновноеСредство В
		|					(ВЫБРАТЬ
		|						ВТ_РазницаВСтоимостиОС.ОбъектУчета
		|					ИЗ
		|						ВТ_РазницаВСтоимостиОС КАК ВТ_РазницаВСтоимостиОС
		|					ГДЕ
		|						ВТ_РазницаВСтоимостиОС.СтоимостьРегл > 0)";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "//ОТБОР_ОС//", ТекстОтбораОС);
	КонецЕсли; 
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры
 
Процедура ДобавитьТекстЗапросаСписокОС(СписокЗапросов) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПервоначальныеСведенияОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОС.ПорядокПогашенияСтоимости КАК ПорядокПогашенияСтоимости
	|ПОМЕСТИТЬ СписокОС
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|						СписокРазрешенныхОС.ОсновноеСредство
	|					ИЗ
	|						СписокРазрешенныхОС КАК СписокРазрешенныхОС)) КАК ПервоначальныеСведенияОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПервоначальныеСведенияОС.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокРазрешенныхОС";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры
 
Процедура ДобавитьТекстЗапросаСчетаБухгалтерскогоУчета(СписокЗапросов) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетУчета,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК СчетНачисленияАмортизации
	|ПОМЕСТИТЬ ВТ_СчетаБухгалтерскогоУчета
	|ИЗ
	|	СписокОС КАК СписокОС
	|ГДЕ
	|	&ИспользуетсяУправлениеВНА_2_4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетНачисленияАмортизации
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС.СрезПоследних(
	|			&КонецПериода,
	|			НЕ Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|				И Организация = &Организация
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						СписокОС.ОсновноеСредство
	|					ИЗ
	|						СписокОС)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
	|ГДЕ
	|	НЕ &ИспользуетсяУправлениеВНА_2_4
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.ОсновноеСредство,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетУчета,
	|	СчетаБухгалтерскогоУчетаОССрезПоследних.СчетАмортизации
	|ИЗ
	|	РегистрСведений.ПараметрыЦелевогоФинансированияОС.СрезПоследних(
	|			&КонецПериода,
	|			НЕ Регистратор ССЫЛКА Документ.ВводОстатковВнеоборотныхАктивов2_4
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						СписокОС.ОсновноеСредство
	|					ИЗ
	|						СписокОС)) КАК СчетаБухгалтерскогоУчетаОССрезПоследних
	|ГДЕ
	|	НЕ &ИспользуетсяУправлениеВНА_2_4
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры
 
Процедура ДобавитьТекстЗапросаСтоимостьИАмортизация(Период, ПараметрыРасчета, СписокЗапросов) Экспорт

	Если ВнеоборотныеАктивы.ИспользуетсяУправлениеВНА_2_4(ДобавитьМесяц(Период, -1)) Тогда
		
		Если Месяц(ПараметрыРасчета.мДатаКонцаПериодаОтчета) + 1 = Месяц(Период) 
			И НЕ ПараметрыРасчета.РасчетПоФактическойСтоимости Тогда
			
			// Это расчет в выбранном месяце, в нем еще не выполнен расчет стоимости поступивших ОС
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СтоимостьОС.СтоимостьБУ КАК СтоимостьРегл,
			|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
			|ПОМЕСТИТЬ СписокОС_РасчетПоПредварительнойСтоимости
			|ИЗ
			|	Документ.ПринятиеКУчетуОС2_4 КАК ПринятиеКУчетуОС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПринятиеКУчетуОС2_4.ОС КАК СтоимостьОС
			|		ПО (СтоимостьОС.Ссылка = ПринятиеКУчетуОС.Ссылка)
			|ГДЕ
			|	ПринятиеКУчетуОС.Организация = &Организация
			|	И ПринятиеКУчетуОС.Проведен
			|	И ПринятиеКУчетуОС.ОтражатьВРеглУчете
			|	И ПринятиеКУчетуОС.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
			|	И СтоимостьОС.ОсновноеСредство В
			|			(ВЫБРАТЬ
			|				СписокОС.ОсновноеСредство
			|			ИЗ
			|				СписокОС КАК СписокОС)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			// Уменьшение стоимости исходного ОС при разукомплектации.
			|ВЫБРАТЬ
			|	-СтоимостьОС.СтоимостьБУ КАК СтоимостьРегл,
			|	РазукомплектацияОС.ОсновноеСредство КАК ОсновноеСредство
			|ИЗ
			|	Документ.РазукомплектацияОС КАК РазукомплектацияОС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК СтоимостьОС
			|		ПО СтоимостьОС.Ссылка = РазукомплектацияОС.Ссылка
			|ГДЕ
			|	РазукомплектацияОС.Организация = &Организация
			|	И РазукомплектацияОС.Проведен
			|	И РазукомплектацияОС.ОтражатьВРеглУчете
			|	И РазукомплектацияОС.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
			|	И СтоимостьОС.СтоимостьБУ <> 0
			|	И РазукомплектацияОС.ОсновноеСредство В
			|			(ВЫБРАТЬ
			|				СписокОС.ОсновноеСредство
			|			ИЗ
			|				СписокОС)
			|	
			|ОБЪЕДИНИТЬ ВСЕ
			|
			// Стоимости новых ОС при разукомплектации.
			|ВЫБРАТЬ
			|	СтоимостьОС.СтоимостьБУ КАК СтоимостьРегл,
			|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
			|ИЗ
			|	Документ.РазукомплектацияОС КАК РазукомплектацияОС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК СтоимостьОС
			|		ПО СтоимостьОС.Ссылка = РазукомплектацияОС.Ссылка
			|ГДЕ
			|	РазукомплектацияОС.Организация = &Организация
			|	И РазукомплектацияОС.Проведен
			|	И РазукомплектацияОС.ОтражатьВРеглУчете
			|	И РазукомплектацияОС.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
			|	И СтоимостьОС.СтоимостьБУ <> 0
			|	И СтоимостьОС.ОсновноеСредство В
			|			(ВЫБРАТЬ
			|				СписокОС.ОсновноеСредство
			|			ИЗ
			|				СписокОС)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	СтоимостьОС.СтоимостьБУ,
			|	СтоимостьОС.ОсновноеСредство
			|ИЗ
			|	Документ.МодернизацияОС2_4 КАК МодернизацияОС2_4
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.МодернизацияОС2_4.ОС КАК СтоимостьОС
			|		ПО (СтоимостьОС.Ссылка = МодернизацияОС2_4.Ссылка)
			|ГДЕ
			|	МодернизацияОС2_4.Организация = &Организация
			|	И МодернизацияОС2_4.Проведен
			|	И МодернизацияОС2_4.ОтражатьВРеглУчете
			|	И МодернизацияОС2_4.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
			|	И СтоимостьОС.ОсновноеСредство В
			|			(ВЫБРАТЬ
			|				СписокОС.ОсновноеСредство
			|			ИЗ
			|				СписокОС)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СписокОС.ОсновноеСредство КАК ОсновноеСредство,
			|	СУММА(СписокОС.СтоимостьРегл) КАК СтоимостьРегл
			|ПОМЕСТИТЬ ВТ_ПредварительнаяСтоимостьОС
			|ИЗ
			|	(ВЫБРАТЬ
			|		СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
			|		СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток КАК СтоимостьРегл
			|	ИЗ
			|		РегистрНакопления.СтоимостьОС.Остатки(
			|				&НачалоПредыдущегоМесяца,
			|				Организация = &Организация
			|					И ОсновноеСредство В
			|						(ВЫБРАТЬ
			|							СписокОС.ОсновноеСредство
			|						ИЗ
			|							СписокОС_РасчетПоПредварительнойСтоимости КАК СписокОС)) КАК СтоимостьОС
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
			|		(СтоимостьОС.СтоимостьРегл + СтоимостьОС.СтоимостьЦФ)
			|			* ВЫБОР КОГДА СтоимостьОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|				ТОГДА 1
			|					ИНАЧЕ -1
			|				КОНЕЦ КАК СтоимостьРегл
			|	ИЗ
			|		РегистрНакопления.СтоимостьОС КАК СтоимостьОС
			|	ГДЕ
			|		СтоимостьОС.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
			|		И СтоимостьОС.Организация = &Организация
			|		И СтоимостьОС.Регистратор ССЫЛКА Документ.СписаниеОС2_4
			|		И СтоимостьОС.ОсновноеСредство В
			|						(ВЫБРАТЬ
			|							СписокОС.ОсновноеСредство
			|						ИЗ
			|							СписокОС_РасчетПоПредварительнойСтоимости КАК СписокОС)
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		СтоимостьОС.ОсновноеСредство,
			|		СтоимостьОС.СтоимостьРегл
			|	ИЗ
			|		СписокОС_РасчетПоПредварительнойСтоимости КАК СтоимостьОС) КАК СписокОС
			|
			|СГРУППИРОВАТЬ ПО
			|	СписокОС.ОсновноеСредство
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток) КАК СтоимостьРегл,
			|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
			|ПОМЕСТИТЬ ВТ_СтоимостьОС
			|ИЗ
			|	РегистрНакопления.СтоимостьОС.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС КАК СписокОС)) КАК СтоимостьОС
			|
			|СГРУППИРОВАТЬ ПО
			|	СтоимостьОС.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ПредварительнаяСтоимостьОС.СтоимостьРегл, СтоимостьОС.СтоимостьРегл) КАК СуммаОстатокДт,
			|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
			|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
			|ИЗ
			|	ВТ_СтоимостьОС КАК СтоимостьОС
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПредварительнаяСтоимостьОС КАК ПредварительнаяСтоимостьОС
			|		ПО (ПредварительнаяСтоимостьОС.ОсновноеСредство = СтоимостьОС.ОсновноеСредство)
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СтоимостьОС.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток КАК СтоимостьРегл,
			|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство
			|ПОМЕСТИТЬ ВТ_СтоимостьОСНаНачалоМесяца
			|ИЗ
			|	РегистрНакопления.СтоимостьОС.Остатки(
			|			&НачалоПредыдущегоМесяца,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС)) КАК СтоимостьОС
			|ИНДЕКСИРОВАТЬ ПО
			|	ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(АмортизацияОС.СуммаОстатокДт) КАК СуммаОстатокДт,
			|	СУММА(АмортизацияОС.СуммаОстатокКт) КАК СуммаОстатокКт,
			|	АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство
			|ПОМЕСТИТЬ ВТ_АмортизацияОС_НаНачалоМесяца
			|ИЗ
			|	(ВЫБРАТЬ
			|		-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокДт,
			|		-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокКт,
			|		АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство
			|	ИЗ
			|		РегистрНакопления.АмортизацияОС.Остатки(
			|				&Период,
			|				Организация = &Организация
			|					И ОсновноеСредство В
			|						(ВЫБРАТЬ
			|							СписокОС.ОсновноеСредство
			|						ИЗ
			|							СписокОС)) КАК АмортизацияОС
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ВЫБОР
			|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|				ТОГДА -1
			|			ИНАЧЕ 1
			|		КОНЕЦ * (АмортизацияОС.АмортизацияРегл + АмортизацияОС.АмортизацияЦФ),
			|		ВЫБОР
			|			КОГДА АмортизацияОС.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|				ТОГДА -1
			|			ИНАЧЕ 1
			|		КОНЕЦ * (АмортизацияОС.АмортизацияРегл + АмортизацияОС.АмортизацияЦФ),
			|		АмортизацияОС.ОсновноеСредство
			|	ИЗ
			|		РегистрНакопления.АмортизацияОС КАК АмортизацияОС
			|	ГДЕ
			|		АмортизацияОС.Период МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
			|		И АмортизацияОС.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РазукомплектацияОС)) КАК АмортизацияОС
			|
			|СГРУППИРОВАТЬ ПО
			|	АмортизацияОС.ОсновноеСредство
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	АмортизацияОС.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РазукомплектацияОС.ОсновноеСредство КАК ОсновноеСредствоИсходное,
			|	ТаблицаОС.ОсновноеСредство КАК ОсновноеСредство,
			|	ВЫБОР
			|		КОГДА ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) <> 0
			|			ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(АмортизацияОС.СуммаОстатокКт, 0) * ТаблицаОС.СтоимостьБУ / ЕСТЬNULL(СтоимостьОС.СтоимостьРегл, 0) КАК ЧИСЛО (15, 2))
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Амортизация
			|ПОМЕСТИТЬ ВтВыделениеАмортизации
			|ИЗ
			|	Документ.РазукомплектацияОС КАК РазукомплектацияОС
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РазукомплектацияОС.ОС КАК ТаблицаОС
			|			ПО ТаблицаОС.Ссылка = РазукомплектацияОС.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтоимостьОСНаНачалоМесяца КАК СтоимостьОС
			|		ПО СтоимостьОС.ОсновноеСредство = РазукомплектацияОС.ОсновноеСредство
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АмортизацияОС_НаНачалоМесяца КАК АмортизацияОС
			|		ПО АмортизацияОС.ОсновноеСредство = РазукомплектацияОС.ОсновноеСредство
			|ГДЕ
			|	РазукомплектацияОС.Организация = &Организация
			|	И РазукомплектацияОС.Проведен
			|	И РазукомплектацияОС.ОтражатьВРеглУчете
			|	И РазукомплектацияОС.Дата МЕЖДУ &НачалоПредыдущегоМесяца И &КонецПредыдущегоМесяца
			|	И ТаблицаОС.СтоимостьБУ <> 0
			|	И ТаблицаОС.ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(АмортизацияОС.СуммаОстатокДт) КАК СуммаОстатокДт,
			|	СУММА(АмортизацияОС.СуммаОстатокКт) КАК СуммаОстатокКт,
			|	АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
			|ПОМЕСТИТЬ ВТ_АмортизацияОС
			|ИЗ
			|	(ВЫБРАТЬ
			|		АмортизацияОС.СуммаОстатокДт КАК СуммаОстатокДт,
			|		АмортизацияОС.СуммаОстатокКт КАК СуммаОстатокКт,
			|		АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство
			|	ИЗ
			|		ВТ_АмортизацияОС_НаНачалоМесяца КАК АмортизацияОС
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			// Уменьшение амортизации исходного ОС при разукомплектации.
			|	ВЫБРАТЬ
			|		-АмортизацияОС.Амортизация,
			|		-АмортизацияОС.Амортизация,
			|		АмортизацияОС.ОсновноеСредствоИсходное
			|	ИЗ
			|		ВтВыделениеАмортизации КАК АмортизацияОС
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			// Увеличение амортизации новых ОС при разукомплектации.
			|	ВЫБРАТЬ
			|		АмортизацияОС.Амортизация,
			|		АмортизацияОС.Амортизация,
			|		АмортизацияОС.ОсновноеСредство
			|	ИЗ
			|		ВтВыделениеАмортизации КАК АмортизацияОС) КАК АмортизацияОС
			|
			|СГРУППИРОВАТЬ ПО
			|	АмортизацияОС.ОсновноеСредство
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОсновноеСредство";
			
		Иначе
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	СтоимостьОС.СтоимостьРеглОстаток + СтоимостьОС.СтоимостьЦФОстаток  КАК СуммаОстатокДт,
			|	СтоимостьОС.ОсновноеСредство КАК ОсновноеСредство,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
			|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
			|ИЗ
			|	РегистрНакопления.СтоимостьОС.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС)) КАК СтоимостьОС
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	СтоимостьОС.ОсновноеСредство
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокДт,
			|	-(АмортизацияОС.АмортизацияРеглОстаток + АмортизацияОС.АмортизацияЦФОстаток) КАК СуммаОстатокКт,
			|	АмортизацияОС.ОсновноеСредство КАК ОсновноеСредство,
			|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка) КАК Счет
			|ПОМЕСТИТЬ ВТ_АмортизацияОС
			|ИЗ
			|	РегистрНакопления.АмортизацияОС.Остатки(
			|			&Период,
			|			Организация = &Организация
			|				И ОсновноеСредство В
			|					(ВЫБРАТЬ
			|						СписокОС.ОсновноеСредство
			|					ИЗ
			|						СписокОС)) КАК АмортизацияОС
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ОсновноеСредство";
		
		КонецЕсли; 
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ПервоначальнаяСтоимостьОС.СуммаОстатокДт,
		|	ПервоначальнаяСтоимостьОС.Субконто1 КАК ОсновноеСредство,
		|	ПервоначальнаяСтоимостьОС.Счет
		|ПОМЕСТИТЬ ВТ_ПервоначальнаяСтоимостьОС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ_СчетаБухгалтерскогоУчета.СчетУчета
		|				ИЗ
		|					ВТ_СчетаБухгалтерскогоУчета),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация) КАК ПервоначальнаяСтоимостьОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	АмортизацияОС.СуммаОстатокДт,
		|	АмортизацияОС.СуммаОстатокКт,
		|	АмортизацияОС.Субконто1 КАК ОсновноеСредство,
		|	АмортизацияОС.Счет
		|ПОМЕСТИТЬ ВТ_АмортизацияОС
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			&Период,
		|			Счет В
		|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|					ВТ_СчетаБухгалтерскогоУчета.СчетНачисленияАмортизации
		|				ИЗ
		|					ВТ_СчетаБухгалтерскогоУчета),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства),
		|			Организация = &Организация) КАК АмортизацияОС
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	КонецЕсли; 
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаИсторияРегистрацийВНалоговомОргане(СписокЗапросов) Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияРегистрацийВНалоговомОргане.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ПОМЕСТИТЬ ВТ_ИсторияРегистрацийВНалоговомОргане
	|ИЗ
	|	РегистрСведений.ИсторияРегистрацийВНалоговомОргане.СрезПоследних(&КонецПериода, СтруктурнаяЕдиница = &Организация) КАК ИсторияРегистрацийВНалоговомОргане";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
КонецПроцедуры
 
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПодготовитьПараметрыРасчетНалога(ТаблицаРеквизиты)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"						// <Дата>
	+ "Организация,"				// <СправочникСсылка.Организации>
	+ "Регистратор,"				// <ДокументСсылка.*>
	+ "ВидНалога,"					// <Перечисление.ВидыИмущественныхНалогов>
	+ "Содержание,"					// <Строка, 150>
	+ "ИмяРегистраРасчетНалогов"	// <Строка, 0>
	;
	
	Параметры.Вставить("Реквизиты", 
		УправлениеВнеоборотнымиАктивамиПереопределяемый.ПараметрыПроведения(ТаблицаРеквизиты, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция ПодготовитьПараметрыДвиженийРасчетНалога(ТаблицаРеквизитов)
	
	Параметры = Новый Структура;
	
	// Подготовка таблицы Параметры.Реквизиты
	
	СписокОбязательныхКолонок = ""
	+ "Период,"						// <Дата>
	+ "Организация,"				// <СправочникСсылка.Организации>
	+ "Регистратор,"				// <ДокументСсылка.*>
	+ "ВидНалога,"					// <ПеречислениеСсылка.ВидыИмущественныхНалогов>
	+ "ИмяРегистраРасчетНалогов"	// <Строка, 0>
	;
	
	Параметры.Вставить("Реквизиты", 
		УправлениеВнеоборотнымиАктивамиПереопределяемый.ПараметрыПроведения(ТаблицаРеквизитов, СписокОбязательныхКолонок));
	
	Возврат Параметры;
	
КонецФункции

Функция РасходыПоНалогу(Реквизиты, СправкаРасчет, РасходыНаПлатон, СписокОшибок, Отказ)
	
	ТекстЗапроса =
	//0. СправкаРасчет
	"ВЫБРАТЬ
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.ИФНС КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.СуммаНалогаКУплате КАК СуммаРегл,
	|	СправкаРасчет.СуммаНалогаКУплате * &КоэффициентПересчетаВУпр КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаНалогаКУплате * &КоэффициентПересчетаВУпр КАК Сумма,
	|	ВЫБОР КОГДА &УправленческийУчетОрганизаций
	|		ТОГДА СправкаРасчет.СуммаНалогаКУплате * &КоэффициентПересчетаВУпр
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаУпр
	|ПОМЕСТИТЬ СправкаРасчет
	|ИЗ
	|	&СправкаРасчет КАК СправкаРасчет
	|ГДЕ
	|	СправкаРасчет.СуммаНалогаКУплате <> 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	//1. РасходыНаПлатон
	|ВЫБРАТЬ
	|	РасходыНаПлатон.ОсновноеСредство КАК ОсновноеСредство,
	|	РасходыНаПлатон.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасходыНаПлатон.Подразделение КАК Подразделение,
	|	РасходыНаПлатон.СтатьяРасходов КАК СтатьяРасходов,
	|	РасходыНаПлатон.АналитикаРасходов КАК АналитикаРасходов,
	|
	|	ВЫБОР 
	|		КОГДА &Период >= &ДатаПрекращенияДействияЛьготПлатон
	|			ТОГДА РасходыНаПлатон.СуммаРегл
	|		КОГДА РасходыНаПлатон.СуммаРегл > РасходыНаПлатон.СуммаНалога
	|			ТОГДА РасходыНаПлатон.СуммаРегл - РасходыНаПлатон.СуммаНалога 
	|		ИНАЧЕ 0 
	|	КОНЕЦ КАК СуммаНУ,
	|
	|	ВЫБОР 
	|		КОГДА &Период >= &ДатаПрекращенияДействияЛьготПлатон
	|			ТОГДА 0
	|		КОГДА РасходыНаПлатон.СуммаРегл > РасходыНаПлатон.СуммаНалога
	|			ТОГДА РасходыНаПлатон.СуммаНалога 
	|		ИНАЧЕ РасходыНаПлатон.СуммаРегл 
	|	КОНЕЦ КАК ПостояннаяРазница,
	|
	|	-РасходыНаПлатон.СуммаРегл КАК ВременнаяРазница
	|
	|ПОМЕСТИТЬ РасходыНаПлатон
	|ИЗ
	|	&РасходыНаПлатон КАК РасходыНаПлатон
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	//2. СпособыОтраженияРасходов
	|ВЫБРАТЬ
	|	СпособыОтраженияРасходов.ОсновноеСредство КАК ОсновноеСредство,
	|	СпособыОтраженияРасходов.СтатьяРасходов КАК СтатьяРасходов,
	|	СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом КАК СпособОтраженияРасходовЗаданДокументом,
	|	СпособыОтраженияРасходов.СпособОтраженияРасходов КАК СпособОтраженияРасходов,
	|	СпособыОтраженияРасходов.АналитикаРасходов КАК АналитикаРасходов
	|ПОМЕСТИТЬ СпособыОтраженияРасходов
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоИмущественнымНалогам.СрезПоследних(
	|		&Период, 
	|		ОсновноеСредство В (
	|			ВЫБРАТЬ 
	|				СправкаРасчет.ОсновноеСредство 
	|			ИЗ 
	|				СправкаРасчет КАК СправкаРасчет)
	|		И Организация = &Организация
	|		И ВидНалога = &ВидНалога) КАК СпособыОтраженияРасходов
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	СпособОтраженияРасходов
	|;
	|
	//3. МестонахождениеОС
	|ВЫБРАТЬ
	|	МестонахождениеОС.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОС.Местонахождение КАК Подразделение
	|ПОМЕСТИТЬ МестонахождениеОС
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(
	|		&Период, 
	|		ОсновноеСредство В (
	|			ВЫБРАТЬ 
	|				СправкаРасчет.ОсновноеСредство 
	|			ИЗ 
	|				СправкаРасчет КАК СправкаРасчет)
	|		И Организация = &Организация) КАК МестонахождениеОС
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	//4. РасходыБезРаспределения
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ВЫБОР КОГДА НЕ ЕСТЬNULL(СпособыОтраженияРасходов.СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) ТОГДА
	|		СправкаРасчет.СуммаРегл
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	0 КАК ВременнаяРазница,
	|	МестонахождениеОС.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СтатьяРасходов, НЕОПРЕДЕЛЕНО) КАК СтатьяРасходов,
	|	ЕСТЬNULL(СпособыОтраженияРасходов.АналитикаРасходов, НЕОПРЕДЕЛЕНО) КАК АналитикаРасходов,
	|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|	ПО
	|		СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		МестонахождениеОС КАК МестонахождениеОС
	|	ПО
	|		СправкаРасчет.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|	ПО
	|		СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|ГДЕ
	|	НЕ ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	РасходыНаПлатон.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	РасходыНаПлатон.ОсновноеСредство КАК ОсновноеСредство,
	|	НЕОПРЕДЕЛЕНО КАК РегистрацияВНалоговомОргане,
	|	0 КАК СуммаРегл,
	|	0 КАК Сумма,
	|	0 КАК СуммаБезНДС,
	|	0 КАК СуммаУпр,
	|	ВЫБОР КОГДА НЕ ВЫРАЗИТЬ(РасходыНаПлатон.СтатьяРасходов КАК ПланВидовХарактеристик.СтатьиРасходов).ПринятиеКНалоговомуУчету ТОГДА
	|		РасходыНаПлатон.ПостояннаяРазница + РасходыНаПлатон.СуммаНУ
	|	ИНАЧЕ
	|		РасходыНаПлатон.ПостояннаяРазница
	|	КОНЕЦ КАК ПостояннаяРазница,
	|	РасходыНаПлатон.ВременнаяРазница КАК ВременнаяРазница,
	|	РасходыНаПлатон.Подразделение КАК Подразделение,
	|	РасходыНаПлатон.СтатьяРасходов КАК СтатьяРасходов,
	|	РасходыНаПлатон.АналитикаРасходов КАК АналитикаРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РаспределениеРБП)
	|ИЗ
	|	РасходыНаПлатон КАК РасходыНаПлатон
	|;
	|
	//5. РасходыСРаспределением
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	МестонахождениеОС.Подразделение КАК Местонахождение,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ИзменениеПараметровОС.ОтражениеАмортизационныхРасходов.(
	|		Ссылка КАК Ссылка,
	|		Подразделение КАК Подразделение,
	|		НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СтатьяРасходовНалог КАК СтатьяРасходов,
	|		АналитикаРасходовНалог КАК АналитикаРасходов,
	|		ЕСТЬNULL(СтатьяРасходовНалог.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеПараметровОС КАК ИзменениеПараметровОС
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ИзменениеПараметровОС.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО СправкаРасчет.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ИзменениеПараметровОС.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	МестонахождениеОС.Подразделение КАК Местонахождение,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ДокументСпособ.ОтражениеРасходов.(
	|		Ссылка КАК Ссылка,
	|		Подразделение КАК Подразделение,
	|		НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СтатьяРасходов КАК СтатьяРасходов,
	|		АналитикаРасходов КАК АналитикаРасходов,
	|		ЕСТЬNULL(СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияЗемельныхУчастков КАК ДокументСпособ
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ДокументСпособ.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО СправкаРасчет.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ДокументСпособ.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	МестонахождениеОС.Подразделение КАК Местонахождение,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ДокументСпособ.ОтражениеРасходов.(
	|		Ссылка КАК Ссылка,
	|		Подразделение КАК Подразделение,
	|		НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СтатьяРасходов КАК СтатьяРасходов,
	|		АналитикаРасходов КАК АналитикаРасходов,
	|		ЕСТЬNULL(СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияТранспортныхСредств КАК ДокументСпособ
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ДокументСпособ.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО СправкаРасчет.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ДокументСпособ.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	МестонахождениеОС.Подразделение КАК Местонахождение,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ДокументСпособ.ОтражениеРасходов.(
	|		Ссылка КАК Ссылка,
	|		Подразделение КАК Подразделение,
	|		НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СтатьяРасходов КАК СтатьяРасходов,
	|		АналитикаРасходов КАК АналитикаРасходов,
	|		ЕСТЬNULL(СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество КАК ДокументСпособ
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ДокументСпособ.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО СправкаРасчет.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ДокументСпособ.Ссылка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период КАК Период,
	|	&Организация КАК Организация,
	|	ОсновныеСредства.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	МестонахождениеОС.Подразделение КАК Местонахождение,
	|	СправкаРасчет.ОсновноеСредство КАК ОсновноеСредство,
	|	СправкаРасчет.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане,
	|	СправкаРасчет.Сумма КАК Сумма,
	|	СправкаРасчет.СуммаРегл КАК СуммаРегл,
	|	СправкаРасчет.СуммаБезНДС КАК СуммаБезНДС,
	|	СправкаРасчет.СуммаУпр КАК СуммаУпр,
	|	ДокументСпособ.ОтражениеРасходов.(
	|		Ссылка КАК Ссылка,
	|		Подразделение КАК Подразделение,
	|		НаправлениеДеятельности КАК НаправлениеДеятельности,
	|		СтатьяРасходов КАК СтатьяРасходов,
	|		АналитикаРасходов КАК АналитикаРасходов,
	|		ЕСТЬNULL(СтатьяРасходов.ПринятиеКНалоговомуУчету, ИСТИНА) КАК ПринятиеКНалоговомуУчету,
	|		Коэффициент КАК Коэффициент
	|	) КАК ТаблицаРаспределения,
	|	&ХозяйственнаяОперация
	|ИЗ
	|	СправкаРасчет КАК СправкаРасчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходов КАК СпособыОтраженияРасходов
	|		ПО СправкаРасчет.ОсновноеСредство = СпособыОтраженияРасходов.ОсновноеСредство
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеСпособаОтраженияИмущественныхНалогов КАК ДокументСпособ
	|		ПО СпособыОтраженияРасходов.СпособОтраженияРасходов = ДокументСпособ.Ссылка
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОсновныеСредства
	|		ПО СправкаРасчет.ОсновноеСредство = ОсновныеСредства.Ссылка
	|	
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОС КАК МестонахождениеОС
	|		ПО СправкаРасчет.ОсновноеСредство = МестонахождениеОС.ОсновноеСредство
	|	
	|ГДЕ
	|	ЕСТЬNULL(СпособыОтраженияРасходов.СпособОтраженияРасходовЗаданДокументом, ЛОЖЬ)
	|	И НЕ ДокументСпособ.Ссылка ЕСТЬ NULL";
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();

	КоэффициентПересчетаВУпр = РаботаСКурсамиВалютУТ.ПолучитьКоэффициентПересчетаИзВалютыВВалюту(
												ВалютаРегл, ВалютаУпр, Реквизиты.Период);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СправкаРасчет",   СправкаРасчет);
	Запрос.УстановитьПараметр("РасходыНаПлатон", РасходыНаПлатон);
	Запрос.УстановитьПараметр("Период",          Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",     Реквизиты.Организация);
	Запрос.УстановитьПараметр("ВидНалога",       Реквизиты.ВидНалога);
	Запрос.УстановитьПараметр("КоэффициентПересчетаВУпр", КоэффициентПересчетаВУпр);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация", Перечисления.ХозяйственныеОперации.НачислениеИмущественныхНалогов);
	Запрос.УстановитьПараметр("ДатаПрекращенияДействияЛьготПлатон", ВнеоборотныеАктивыЛокализация.ДатаПрекращенияДействияЛьготПлатон());
	
	Запрос.УстановитьПараметр("УправленческийУчетОрганизаций",
		УниверсальныеМеханизмыПартийИСебестоимостиПовтИсп.УправленческийУчетОрганизаций(НачалоМесяца(Реквизиты.Период)));
		
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаРасходыБезРаспределения = Результат[Результат.ВГраница()-1].Выбрать();
	ВыборкаРасходыСРаспределением = Результат[Результат.ВГраница()].Выбрать();
	
	ТаблицаРасходовПоНалогу = ТаблицаРасходовПоНалогу(
		Реквизиты.ВидНалога, 
		ВыборкаРасходыБезРаспределения,
		ВыборкаРасходыСРаспределением,
		Отказ,
		СписокОшибок);
	
	Возврат ТаблицаРасходовПоНалогу;
	
КонецФункции

Функция ТаблицаРасходовПоНалогу(ВидНалога, ВыборкаРасходыБезРаспределения, ВыборкаРасходыСРаспределением, Отказ, СписокОшибок = Неопределено) Экспорт

	ПрочиеРасходы = РегистрыНакопления.ПрочиеРасходы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ПрочиеАктивыПассивы = РегистрыНакопления.ПрочиеАктивыПассивы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	ДвиженияДоходыРасходыПрочиеАктивыПассивы = РегистрыНакопления.ДвиженияДоходыРасходыПрочиеАктивыПассивы.СоздатьНаборЗаписей().ВыгрузитьКолонки();
	
	СтатьяАктивовПассивов = ПланыВидовХарактеристик.СтатьиАктивовПассивов.Налоги;
	АналитикаАктивовПассивов = Неопределено;
	Если ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог Тогда
		АналитикаАктивовПассивов = Перечисления.ТипыНалогов.ЗемельныйНалог;
	ИначеЕсли ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество Тогда
		АналитикаАктивовПассивов = Перечисления.ТипыНалогов.НалогНаИмущество;
	ИначеЕсли ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		АналитикаАктивовПассивов = Перечисления.ТипыНалогов.ТранспортныйНалог;
	КонецЕсли;
	
	Пока ВыборкаРасходыБезРаспределения.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаРасходыБезРаспределения.СтатьяРасходов) Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								НСтр("ru = 'Для основного средства ""%1"" не установлен способ отражения расходов по налогам.';
									|en = 'Method of recording tax expenses is not set for the ""%1"" fixed asset.'"),
								ВыборкаРасходыБезРаспределения.ОсновноеСредство);
								
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения, 
				ВыборкаРасходыБезРаспределения.ОсновноеСредство,,, 
				Отказ);
				
			ВнеоборотныеАктивыСлужебный.ДобавитьОписаниеОшибки(
				ТекстСообщения, 
				ВыборкаРасходыБезРаспределения.ОсновноеСредство,
				ВыборкаРасходыБезРаспределения.Организация,
				СписокОшибок);
				
		КонецЕсли;
		
		Запись = ПрочиеРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыБезРаспределения);
		
		Если ВыборкаРасходыБезРаспределения.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РаспределениеРБП Тогда
			Запись = ПрочиеРасходы.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыБезРаспределения);
			Запись.ВидДвижения = ВидДвиженияНакопления.Расход;
			Запись.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.РасходыНаПлатон;
			Запись.АналитикаРасходов = Неопределено;
			Запись.ПостояннаяРазница = 0;
		КонецЕсли;
		
		Запись = ПрочиеАктивыПассивы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыБезРаспределения);
		Запись.Статья = СтатьяАктивовПассивов;
		Запись.Аналитика = АналитикаАктивовПассивов;
		
		Запись = ДвиженияДоходыРасходыПрочиеАктивыПассивы.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыБезРаспределения, "Период, ХозяйственнаяОперация, Организация, Сумма, СуммаРегл, СуммаУпр");
		
		Запись.Статья = СтатьяАктивовПассивов;
		Запись.АналитикаАктивовПассивов = АналитикаАктивовПассивов;
		Запись.Подразделение = ВыборкаРасходыБезРаспределения.Подразделение;
		Запись.НаправлениеДеятельности = ВыборкаРасходыБезРаспределения.НаправлениеДеятельности;
		
		Запись.КорСтатья = ВыборкаРасходыБезРаспределения.СтатьяРасходов;
		Запись.КорАналитикаРасходов = ВыборкаРасходыБезРаспределения.АналитикаРасходов;
		Запись.КорПодразделение = ВыборкаРасходыБезРаспределения.Подразделение;
		Запись.КорНаправлениеДеятельности = ВыборкаРасходыБезРаспределения.НаправлениеДеятельности;
		
	КонецЦикла;
	
	Если ВыборкаРасходыСРаспределением <> Неопределено Тогда
		
		Пока ВыборкаРасходыСРаспределением.Следующий() Цикл
			
			ТаблицаРаспределения = ВыборкаРасходыСРаспределением.ТаблицаРаспределения.Выгрузить();
			
			Если ТаблицаРаспределения.Количество() = 0 Тогда
				
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru = 'Для основного средства ""%1"" не установлен способ отражения расходов по налогам.';
										|en = 'Method of recording tax expenses is not set for the ""%1"" fixed asset.'"),
									ВыборкаРасходыСРаспределением.ОсновноеСредство);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения, 
					ВыборкаРасходыСРаспределением.ОсновноеСредство,,, 
					Отказ);
					
				ВнеоборотныеАктивыСлужебный.ДобавитьОписаниеОшибки(
					ТекстСообщения, 
					ВыборкаРасходыСРаспределением.ОсновноеСредство, 
					ВыборкаРасходыСРаспределением.Организация,
					СписокОшибок);
					
			КонецЕсли;
		
			Коэффициенты = ТаблицаРаспределения.ВыгрузитьКолонку("Коэффициент");
			Суммы = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ВыборкаРасходыСРаспределением.Сумма, Коэффициенты);
			СуммыРегл = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ВыборкаРасходыСРаспределением.СуммаРегл, Коэффициенты);
			СуммыБезНДС = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ВыборкаРасходыСРаспределением.СуммаБезНДС, Коэффициенты);
			СуммыУпр = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(ВыборкаРасходыСРаспределением.СуммаУпр, Коэффициенты);
			
			Если Суммы = Неопределено И СуммыРегл = Неопределено И СуммыБезНДС = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Индекс = 0 По ТаблицаРаспределения.Количество()-1 Цикл
				
				ПравилоОтражения = ТаблицаРаспределения[Индекс];
				
				Если Не ЗначениеЗаполнено(ПравилоОтражения.Подразделение)
					И Не ЗначениеЗаполнено(ВыборкаРасходыСРаспределением.Местонахождение) Тогда
					
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
										НСтр("ru = 'Для основного средства ""%1"" не удалось определить подразделение, на которое будут отнесены расходы.
                                              |Необходимо либо явно указать подразделение, на которое будут отнесены расходы.
                                              |Либо проверить, что основное средство принято к учету. 
                                              |Способ отражения расходов задан в документе %2.';
                                              |en = 'Cannot determine department to which other expenses will be allocated for the ""%1"" fixed asset.
                                              |Clearly specify the department to which expenses will be allocated
                                              |or check whether fixed asset is recognized. 
                                              |Expense record method is specified in the %2 document.'"),
										ВыборкаРасходыСРаспределением.ОсновноеСредство,
										ПравилоОтражения.Ссылка);
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
						ТекстСообщения, 
						ПравилоОтражения.Ссылка,,, 
						Отказ);
							
					ВнеоборотныеАктивыСлужебный.ДобавитьОписаниеОшибки(
						ТекстСообщения, 
						ПравилоОтражения.Ссылка,
						ВыборкаРасходыСРаспределением.Организация,
						СписокОшибок);
						
				КонецЕсли;
				
				// ПрочиеРасходы
				Запись = ПрочиеРасходы.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыСРаспределением, "Период, Организация, РегистрацияВНалоговомОргане");
				ЗаполнитьЗначенияСвойств(Запись, ПравилоОтражения, "СтатьяРасходов, АналитикаРасходов");
				
				Запись.Подразделение = 
					?(ЗначениеЗаполнено(ПравилоОтражения.Подразделение), 
							ПравилоОтражения.Подразделение, 
							ВыборкаРасходыСРаспределением.Местонахождение);
							
				Запись.НаправлениеДеятельности = 
					?(ЗначениеЗаполнено(ПравилоОтражения.НаправлениеДеятельности), 
							ПравилоОтражения.НаправлениеДеятельности, 
							ВыборкаРасходыСРаспределением.НаправлениеДеятельности);
							
				Запись.Сумма = ?(Суммы = Неопределено, 0, Суммы[Индекс]);
				Запись.СуммаРегл = ?(СуммыРегл = Неопределено, 0, СуммыРегл[Индекс]);
				Запись.СуммаБезНДС = ?(СуммыБезНДС = Неопределено, 0, СуммыБезНДС[Индекс]);
				Запись.СуммаУпр = ?(СуммыУпр = Неопределено, 0, СуммыУпр[Индекс]);
				Если НЕ ПравилоОтражения.ПринятиеКНалоговомуУчету Тогда
					Запись.ПостояннаяРазница = Запись.СуммаРегл; 
				КонецЕсли;
				
				// ДвиженияДоходыРасходыПрочиеАктивыПассивы
				Запись = ДвиженияДоходыРасходыПрочиеАктивыПассивы.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыСРаспределением, "Период, ХозяйственнаяОперация, Организация");
				
				Запись.Статья = СтатьяАктивовПассивов;
				Запись.АналитикаАктивовПассивов = АналитикаАктивовПассивов;
				
				Запись.Подразделение = 
					?(ЗначениеЗаполнено(ПравилоОтражения.Подразделение), 
							ПравилоОтражения.Подразделение, 
							ВыборкаРасходыСРаспределением.Местонахождение);
				
				Запись.НаправлениеДеятельности = 
					?(ЗначениеЗаполнено(ПравилоОтражения.НаправлениеДеятельности), 
							ПравилоОтражения.НаправлениеДеятельности, 
							ВыборкаРасходыСРаспределением.НаправлениеДеятельности);
			
				Запись.КорСтатья = ПравилоОтражения.СтатьяРасходов;
				Запись.КорАналитикаРасходов = ПравилоОтражения.АналитикаРасходов;
				
				Запись.КорПодразделение = 
					?(ЗначениеЗаполнено(ПравилоОтражения.Подразделение), 
							ПравилоОтражения.Подразделение, 
							ВыборкаРасходыСРаспределением.Местонахождение);
				
				Запись.КорНаправлениеДеятельности = 
					?(ЗначениеЗаполнено(ПравилоОтражения.НаправлениеДеятельности), 
							ПравилоОтражения.НаправлениеДеятельности, 
							ВыборкаРасходыСРаспределением.НаправлениеДеятельности);
				
				Запись.Сумма = ?(Суммы = Неопределено, 0, Суммы[Индекс]);
				Запись.СуммаРегл = ?(СуммыРегл = Неопределено, 0, СуммыРегл[Индекс]);
				
				// ПрочиеАктивыПассивы
				Запись = ПрочиеАктивыПассивы.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, ВыборкаРасходыСРаспределением);
				Запись.Статья = СтатьяАктивовПассивов;
				Запись.Аналитика = АналитикаАктивовПассивов;
				
				Запись.Подразделение = 
					?(ЗначениеЗаполнено(ПравилоОтражения.Подразделение), 
							ПравилоОтражения.Подразделение, 
							ВыборкаРасходыСРаспределением.Местонахождение);
				
				Запись.НаправлениеДеятельности = 
					?(ЗначениеЗаполнено(ПравилоОтражения.НаправлениеДеятельности), 
							ПравилоОтражения.НаправлениеДеятельности, 
							ВыборкаРасходыСРаспределением.НаправлениеДеятельности);
							
				Запись.Сумма = ?(Суммы = Неопределено, 0, Суммы[Индекс]);
							
			КонецЦикла;
					
		КонецЦикла;
	
	КонецЕсли; 
	
	КолонкиГруппировки = "Период, ВидДвижения, Организация, Подразделение, НаправлениеДеятельности, СтатьяРасходов, АналитикаРасходов, РегистрацияВНалоговомОргане, ХозяйственнаяОперация";
	КолонкиСуммирования = "Сумма, СуммаБезНДС, СуммаУпр, СуммаРегл, ПостояннаяРазница, ВременнаяРазница";
	ПрочиеРасходы.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
	ПрочиеАктивыПассивы.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");
	КолонкиГруппировки = "ВидДвижения, Период, Организация, Подразделение, НаправлениеДеятельности, Статья, Аналитика";
	КолонкиСуммирования = "Сумма";
	ПрочиеАктивыПассивы.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
	КолонкиГруппировки = "Период, ХозяйственнаяОперация, Организация, 
		|Подразделение, Статья, АналитикаРасходов, АналитикаДоходов, АналитикаАктивовПассивов, НаправлениеДеятельности,
		|КорПодразделение, КорСтатья, КорАналитикаРасходов, КорАналитикаДоходов, КорАналитикаАктивовПассивов, КорНаправлениеДеятельности";
	КолонкиСуммирования = "Сумма, СуммаРегл, СуммаУпр";
	ДвиженияДоходыРасходыПрочиеАктивыПассивы.Свернуть(КолонкиГруппировки, КолонкиСуммирования);
	
	Результат = Новый Структура;
	Результат.Вставить("ПрочиеРасходы",       ПрочиеРасходы);
	Результат.Вставить("ПрочиеАктивыПассивы", ПрочиеАктивыПассивы);
	Результат.Вставить("ДвиженияДоходыРасходыПрочиеАктивыПассивы", ДвиженияДоходыРасходыПрочиеАктивыПассивы);
	
	Возврат Результат;

КонецФункции

Функция ТаблицыРасчетНалога(Реквизиты)
	
	СправкаРасчет = ПустаяСправкаРасчет(Реквизиты.ИмяРегистраРасчетНалогов);
	РасходыНаПлатон = ПустаяТаблицаРасходыНаПлатон();
	
	Если Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.НалогНаИмущество Тогда
		
		РасчетПоНалогу = РасчетИмущественныхНалогов.ПолучитьРасчетПоНалогуНаИмущество(Реквизиты.Организация, Реквизиты.Период);
		
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ТранспортныйНалог Тогда
		
		РасчетыПоНалогу = РасчетИмущественныхНалогов.ПолучитьРасчетПоТранспортномуНалогу(Реквизиты.Организация, Реквизиты.Период);
		РасчетПоНалогу = РасчетыПоНалогу.Налог;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РасчетыПоНалогу.Платон, РасходыНаПлатон);
		
	ИначеЕсли Реквизиты.ВидНалога = Перечисления.ВидыИмущественныхНалогов.ЗемельныйНалог Тогда
		
		РасчетПоНалогу = РасчетИмущественныхНалогов.ПолучитьРасчетПоЗемельномуНалогу(Реквизиты.Организация, Реквизиты.Период);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(РасчетПоНалогу, СправкаРасчет);
	
	ТаблицыРасчетНалога = Новый Структура;
	ТаблицыРасчетНалога.Вставить("СправкаРасчет", СправкаРасчет);
	ТаблицыРасчетНалога.Вставить("РасходыНаПлатон", РасходыНаПлатон);
	
	Возврат ТаблицыРасчетНалога;
	
КонецФункции

Функция ПустаяТаблицаРасходыНаПлатон() Экспорт

	РасходыНаПлатон = Новый ТаблицаЗначений;
	
	РасходыНаПлатон.Колонки.Добавить("ОтчетОператора", Новый ОписаниеТипов("ДокументСсылка.ОтчетОператораСистемыПлатон"));
	РасходыНаПлатон.Колонки.Добавить("ОсновноеСредство", Новый ОписаниеТипов("СправочникСсылка.ОбъектыЭксплуатации"));
	РасходыНаПлатон.Колонки.Добавить("СтатьяРасходов", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	РасходыНаПлатон.Колонки.Добавить("АналитикаРасходов", Метаданные.ПланыВидовХарактеристик.СтатьиРасходов.Тип);
	РасходыНаПлатон.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	РасходыНаПлатон.Колонки.Добавить("НаправлениеДеятельности", Новый ОписаниеТипов("СправочникСсылка.НаправленияДеятельности"));
	РасходыНаПлатон.Колонки.Добавить("СуммаРегл", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	РасходыНаПлатон.Колонки.Добавить("СуммаНалога", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	РасходыНаПлатон.Колонки.Добавить("База", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат РасходыНаПлатон;

КонецФункции

Функция ПустаяСправкаРасчет(ИмяРегистраСведений) Экспорт

	СправкаРасчет = РасчетИмущественныхНалогов.ПустаяСправкаРасчет(ИмяРегистраСведений);

	Если ИмяРегистраСведений = "РасчетТранспортногоНалога" Тогда
		СправкаРасчет.Колонки.Добавить("УплачиваютсяАвансы", Новый ОписаниеТипов("Булево"));
	КонецЕсли; 
	
	Возврат СправкаРасчет;
	
КонецФункции

Функция СформироватьТаблицуРасходовНаПлатон(Организация, ПериодРасчета, ТаблицаРасчетТранспортногоНалога)
	
	ГодовойРасчет = КонецКвартала(ПериодРасчета) = КонецГода(ПериодРасчета);
	ДатаКонцаПериодаОтчета = КонецКвартала(ПериодРасчета);
	
	СтруктураПоиска = Новый Структура("УплачиваютсяАвансы", Ложь);
	СписокОСБезАвансов = ТаблицаРасчетТранспортногоНалога.Скопировать(СтруктураПоиска).ВыгрузитьКолонку("ОсновноеСредство");
	УплачиваютсяАвансы = СписокОСБезАвансов.Количество() = 0;
	
	СписокЗапросов = Новый Массив;
	
	Если ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов") Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(РасчетыСПоставщиками.Период, КВАРТАЛ) КАК Период,
		|	ВЫБОР
		|		КОГДА РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
		|			ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
		|		ИНАЧЕ РасчетыСПоставщиками.ДокументРегистратор
		|	КОНЕЦ КАК ОтчетОператора,
		|	СУММА(РасчетыСПоставщиками.ДолгРегл) КАК СуммаПлатежа,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСПоставщиками.Период МЕЖДУ &НачалоКвартала И &КонецКвартала
		|				ТОГДА РасчетыСПоставщиками.ДолгРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПлатежаЗаКвартал
		|ПОМЕСТИТЬ ФактическиеПлатежи
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщиками
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОператораСистемыПлатон КАК ОтчетОператораСистемыПлатон
		|		ПО ОтчетОператораСистемыПлатон.Ссылка = РасчетыСПоставщиками.РасчетныйДокумент
		|			ИЛИ ОтчетОператораСистемыПлатон.Ссылка = РасчетыСПоставщиками.ДокументРегистратор
		|ГДЕ
		|	РасчетыСПоставщиками.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (ОтчетОператораСистемыПлатон.Дата < &ДатаПрекращенияДействияЛьготПлатон
		|		ИЛИ &ПериодРасчета < &ДатаПрекращенияДействияЛьготПлатон)
		|	И РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация = &Организация
		|	И РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|	И РасчетыСПоставщиками.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗачетАвансаПоставщику),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПогашениеЗадолженностиПоставщику))
		|	И РасчетыСПоставщиками.Активность
		|	И (РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
		|			ИЛИ РасчетыСПоставщиками.ДокументРегистратор ССЫЛКА Документ.ОтчетОператораСистемыПлатон)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(РасчетыСПоставщиками.Период, КВАРТАЛ),
		|	ВЫБОР
		|		КОГДА РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
		|			ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
		|		ИНАЧЕ РасчетыСПоставщиками.ДокументРегистратор
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетыСПоставщиками.ДолгРегл) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОтчетОператора";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(РасчетыСПоставщиками.Период, КВАРТАЛ) КАК Период,
		|	ВЫБОР
		|		КОГДА РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
		|			ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
		|		ИНАЧЕ РасчетыСПоставщиками.Регистратор
		|	КОНЕЦ КАК ОтчетОператора,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РасчетыСПоставщиками.ДолгРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА РасчетыСПоставщиками.ПредоплатаРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПлатежа,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСПоставщиками.Период < &НачалоКвартала 
		|					ИЛИ РасчетыСПоставщиками.Период > &КонецКвартала
		|				ТОГДА 0
		|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РасчетыСПоставщиками.ДолгРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА РасчетыСПоставщиками.ПредоплатаРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК СуммаПлатежаЗаКвартал
		|ПОМЕСТИТЬ ФактическиеПлатежи
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщиками
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОператораСистемыПлатон КАК ОтчетОператораСистемыПлатон
		|		ПО ОтчетОператораСистемыПлатон.Ссылка = РасчетыСПоставщиками.РасчетныйДокумент
		|			ИЛИ ОтчетОператораСистемыПлатон.Ссылка = РасчетыСПоставщиками.Регистратор
		|ГДЕ
		|	РасчетыСПоставщиками.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И (ОтчетОператораСистемыПлатон.Дата < &ДатаПрекращенияДействияЛьготПлатон
		|		ИЛИ &ПериодРасчета < &ДатаПрекращенияДействияЛьготПлатон)
		|	И РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация = &Организация
		|	И РасчетыСПоставщиками.ХозяйственнаяОперация В (
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика), 
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику),
		|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности))
		|	И РасчетыСПоставщиками.Активность
		|	И (РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
		|			ИЛИ РасчетыСПоставщиками.Регистратор ССЫЛКА Документ.ОтчетОператораСистемыПлатон)
		|
		|СГРУППИРОВАТЬ ПО
		|	НАЧАЛОПЕРИОДА(РасчетыСПоставщиками.Период, КВАРТАЛ),
		|	ВЫБОР
		|		КОГДА РасчетыСПоставщиками.РасчетныйДокумент ССЫЛКА Документ.ОтчетОператораСистемыПлатон
		|			ТОГДА РасчетыСПоставщиками.РасчетныйДокумент
		|		ИНАЧЕ РасчетыСПоставщиками.Регистратор
		|	КОНЕЦ
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РасчетыСПоставщиками.ДолгРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ + ВЫБОР
		|			КОГДА РасчетыСПоставщиками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА РасчетыСПоставщиками.ПредоплатаРегл
		|			ИНАЧЕ 0
		|		КОНЕЦ) > 0
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОтчетОператора";
		
		СписокЗапросов.Добавить(ТекстЗапроса);
		
	КонецЕсли; 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	РасчетТранспортногоНалога.ПериодРасчета КАК Период,
	|	РасчетТранспортногоНалога.ОсновноеСредство КАК ОсновноеСредство,
	|	СУММА(РасчетТранспортногоНалога.СуммаПлатыОператоруСистемыПлатон) КАК СуммаПлатежа
	|ИЗ
	|	РегистрСведений.РасчетТранспортногоНалога КАК РасчетТранспортногоНалога
	|ГДЕ
	|	РасчетТранспортногоНалога.ПериодРасчета >= &НачалоПериода
	|	И РасчетТранспортногоНалога.ПериодРасчета < &НачалоКвартала
	|	И РасчетТранспортногоНалога.Организация = &Организация
	|	И РасчетТранспортногоНалога.Активность
	|	И &ГодовойРасчет
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетТранспортногоНалога.ПериодРасчета,
	|	РасчетТранспортногоНалога.ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ФактическиеПлатежи.Период                 КАК Период,
	|	ФактическиеПлатежи.ОтчетОператора         КАК ОтчетОператора,
	|	ФактическиеПлатежи.СуммаПлатежа           КАК СуммаПлатежа,
	|	ФактическиеПлатежи.СуммаПлатежаЗаКвартал  КАК СуммаПлатежаЗаКвартал
	|ИЗ
	|	ФактическиеПлатежи КАК ФактическиеПлатежи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Операция.Ссылка                           КАК ОтчетОператора,
	|	РасходыНаПлатон.ОсновноеСредство          КАК ОсновноеСредство,
	|	РасходыНаПлатон.Подразделение             КАК Подразделение,
	|	РасходыНаПлатон.СтатьяРасходов            КАК СтатьяРасходов,
	|	РасходыНаПлатон.АналитикаРасходов         КАК АналитикаРасходов,
	|	РасходыНаПлатон.НаправлениеДеятельности   КАК НаправлениеДеятельности,
	|	0                                         КАК СуммаРегл,
	|	РасходыНаПлатон.Сумма                     КАК База,
	|	ВЫБОР 
	|		КОГДА РасходыНаПлатон.ОсновноеСредство В (&СписокОСБезАвансов)
	|			ТОГДА ЛОЖЬ 
	|		ИНАЧЕ ИСТИНА 
	|	КОНЕЦ КАК УплачиваютсяАвансы
	|ИЗ
	|	Документ.ОтчетОператораСистемыПлатон КАК Операция
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетОператораСистемыПлатон.ОС КАК РасходыНаПлатон
	|		ПО РасходыНаПлатон.Ссылка = Операция.Ссылка
	|ГДЕ
	|	Операция.Проведен
	|	И Операция.Ссылка В
	|			(ВЫБРАТЬ
	|				ФактическиеПлатежи.ОтчетОператора
	|			ИЗ
	|				ФактическиеПлатежи КАК ФактическиеПлатежи)";
	
	СписокЗапросов.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = СтрСоединить(СписокЗапросов, ОбщегоНазначения.РазделительПакетаЗапросов());
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация",    Организация);
	Запрос.УстановитьПараметр("СледующийМесяц", ДатаКонцаПериодаОтчета + 1);
	Запрос.УстановитьПараметр("ПериодРасчета",  ПериодРасчета);
	Запрос.УстановитьПараметр("ГодовойРасчет",  ГодовойРасчет);
	Запрос.УстановитьПараметр("НачалоКвартала", НачалоКвартала(ПериодРасчета));
	Запрос.УстановитьПараметр("КонецКвартала",  КонецКвартала(ПериодРасчета));
	Запрос.УстановитьПараметр("НачалоПериода",  ?(НЕ УплачиваютсяАвансы И ГодовойРасчет, НачалоГода(ПериодРасчета), НачалоКвартала(ПериодРасчета)));
	Запрос.УстановитьПараметр("КонецПериода",   ?(НЕ УплачиваютсяАвансы И ГодовойРасчет, КонецГода(ПериодРасчета), КонецКвартала(ПериодРасчета)));
	Запрос.УстановитьПараметр("ДатаПрекращенияДействияЛьготПлатон", ВнеоборотныеАктивыЛокализация.ДатаПрекращенияДействияЛьготПлатон());
	Запрос.УстановитьПараметр("СписокОСБезАвансов", СписокОСБезАвансов);
	
	Результат = Запрос.ВыполнитьПакет();

	ТаблицаРасходыНаПлатон = ПустаяТаблицаРасходыНаПлатон();
	
	Если Не Результат[Результат.ВГраница()].Пустой() Тогда
		
		ТаблицаРасходыНаПлатон.Колонки.Добавить("УплачиваютсяАвансы", Новый ОписаниеТипов("Булево"));
		
		ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Результат[Результат.ВГраница()].Выгрузить(), ТаблицаРасходыНаПлатон);
		ТаблицаРасходыНаПлатон.Индексы.Добавить("ОтчетОператора");
		ТаблицаРасходыНаПлатон.Индексы.Добавить("ОсновноеСредство");
		
		УчтенныеПлатежи = Результат[Результат.ВГраница() - 2].Выгрузить();
		УчтенныеПлатежи.Индексы.Добавить("ОсновноеСредство");
		
		// 1. Распределение платежа по ОС.
		ВыборкаПлатежи = Результат[Результат.ВГраница()-1].Выбрать();
		Пока ВыборкаПлатежи.Следующий() Цикл
			
			СтруктураПоиска = Новый Структура("ОтчетОператора");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаПлатежи);
			СписокСтрок = ТаблицаРасходыНаПлатон.НайтиСтроки(СтруктураПоиска);
			КоэффициентыОплаты = Новый Массив;
			Для каждого Расход Из СписокСтрок Цикл
				КоэффициентыОплаты.Добавить(Расход.База);
			КонецЦикла;
			
			РаспределениеПлатежа = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
										ВыборкаПлатежи.СуммаПлатежа, КоэффициентыОплаты);
										
			РаспределениеПлатежаЗаКвартал = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
										ВыборкаПлатежи.СуммаПлатежаЗаКвартал, КоэффициентыОплаты);
										
			СтрокиКУдалению = Новый Массив;
			Для Сч = 0 По КоэффициентыОплаты.ВГраница() Цикл
				Расход = СписокСтрок[Сч];
				
				Если Расход.УплачиваютсяАвансы Тогда
					Расход.СуммаРегл = ?(РаспределениеПлатежаЗаКвартал <> Неопределено, РаспределениеПлатежаЗаКвартал[Сч], 0);
				Иначе
					Расход.СуммаРегл = РаспределениеПлатежа[Сч];
				КонецЕсли; 
				
				// Нужно уменьшить сумму оплат на суммы, которые были учтены при авансовых платежах по налогу.
				Если ГодовойРасчет Тогда
					СтруктураПоиска = Новый Структура("ОсновноеСредство", Расход.ОсновноеСредство);
					СписокСтрокУчтенныхПлатежей = УчтенныеПлатежи.НайтиСтроки(СтруктураПоиска);
					Для каждого СтрокаУчтенныеПлатежи Из СписокСтрокУчтенныхПлатежей Цикл
						Если НачалоКвартала(СтрокаУчтенныеПлатежи.Период) = ВыборкаПлатежи.Период
							И СтрокаУчтенныеПлатежи.СуммаПлатежа > 0 Тогда
							СуммаПлатежа = Мин(Расход.СуммаРегл, СтрокаУчтенныеПлатежи.СуммаПлатежа);
							Расход.СуммаРегл = Расход.СуммаРегл - СуммаПлатежа;
							СтрокаУчтенныеПлатежи.СуммаПлатежа = СтрокаУчтенныеПлатежи.СуммаПлатежа - СуммаПлатежа;
						КонецЕсли; 
					КонецЦикла; 
				КонецЕсли; 
				
				Если Расход.СуммаРегл = 0 Тогда
					СтрокиКУдалению.Добавить(Расход);
				КонецЕсли;
			КонецЦикла;
			
			Для каждого Расход Из СтрокиКУдалению Цикл
				ТаблицаРасходыНаПлатон.Удалить(Расход);
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаРасходыНаПлатон;
	
КонецФункции

Процедура УчестьРасходыНаПлатонВРасчетеТранспортногоНалога(ПериодРасчета, ТаблицаРасходыНаПлатон, ТаблицаРасчетТранспортногоНалога)
	
	Если ПериодРасчета >= ВнеоборотныеАктивыЛокализация.ДатаПрекращенияДействияЛьготПлатон() Тогда
		Возврат;
	КонецЕсли; 
	
	ГодовойРасчет = КонецКвартала(ПериодРасчета) = КонецГода(ПериодРасчета);
	
	ТаблицаРасчетТранспортногоНалога.Индексы.Добавить("ЗарегистрированоВРеестреСистемыПлатон");
		
	СтруктураПоиска = Новый Структура("ЗарегистрированоВРеестреСистемыПлатон", Истина);
	СтрокиРасчетаНалога = ТаблицаРасчетТранспортногоНалога.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого СтрокаРасчетаНалога Из СтрокиРасчетаНалога Цикл
		
		СуммаНалогаКУплате = СтрокаРасчетаНалога.СуммаНалогаКУплате - СтрокаРасчетаНалога.СуммаНалоговогоВычета;
		
		Если СуммаНалогаКУплате = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Уменьшение суммы налога.
		Если ТаблицаРасходыНаПлатон.Количество() <> 0 Тогда
			
			СтруктураПоиска = Новый Структура("ОсновноеСредство");
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаРасчетаНалога);
			СписокСтрок = ТаблицаРасходыНаПлатон.НайтиСтроки(СтруктураПоиска);
			КоэффициентыОплаты = Новый Массив;
			Для каждого Расход Из СписокСтрок Цикл
				КоэффициентыОплаты.Добавить(Расход.СуммаРегл);
				СтрокаРасчетаНалога.СуммаПлатыОператоруСистемыПлатон = 
				СтрокаРасчетаНалога.СуммаПлатыОператоруСистемыПлатон + Расход.СуммаРегл;
			КонецЦикла;
			
			РаспределениеНалога = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(
			СуммаНалогаКУплате, КоэффициентыОплаты);
			
			Для Сч = 0 По КоэффициентыОплаты.ВГраница() Цикл
				
				Расход = СписокСтрок[Сч];
				Расход.СуммаНалога = РаспределениеНалога[Сч];
				
				Если Расход.СуммаНалога > Расход.СуммаРегл Тогда
					СтрокаРасчетаНалога.СуммаНалоговогоВычета = СтрокаРасчетаНалога.СуммаНалоговогоВычета + Расход.СуммаРегл;
				Иначе
					СтрокаРасчетаНалога.СуммаНалоговогоВычета = СтрокаРасчетаНалога.СуммаНалоговогоВычета + Расход.СуммаНалога;
				КонецЕсли; 
				
			КонецЦикла;
			
		КонецЕсли; 
		
		Если ГодовойРасчет Тогда
			СтрокаРасчетаНалога.СуммаНалогаКУплате = СтрокаРасчетаНалога.СуммаНалогаКУплате - СтрокаРасчетаНалога.СуммаНалоговогоВычета;
		Иначе
			СтрокаРасчетаНалога["СуммаАвансовыхПлатежей" + Формат(ПериодРасчета, "ДФ='q''Кв'''")] = 0;
			СтрокаРасчетаНалога.СуммаНалогаКУплате = 0;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#Область ЗаданияКЗакрытиюМесяца

// Формирует задание к расчету налога на имущество, на основании измененных данных.
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка	 - Ссылка на документ.
//  ДанныеТаблиц	 - Структура		 - Содержит список таблиц в которых произошли изменения.
//
Процедура СформироватьЗаданиеКРасчетуНалогаНаИмущество(ДокументСсылка, ДанныеТаблиц) Экспорт

	ТипОбъекта = ТипЗнч(ДокументСсылка);
	
	ЕстьОсновныеСредства = (ТипОбъекта <> Тип("ДокументСсылка.РегламентнаяОперация")
							И ДокументСсылка <> Неопределено);
								
	ПроверитьЧтоОСПринятоКУчету = (ТипОбъекта = Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов")
									ИЛИ ТипОбъекта = Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов2_4")
									ИЛИ ТипОбъекта = Тип("ДокументСсылка.ПринятиеКУчетуОС")
									ИЛИ ТипОбъекта = Тип("ДокументСсылка.РегистрацияТранспортныхСредств"));
									
	ПринятиеКУчетуЗаданоДокументом = (ТипОбъекта = Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов")
										ИЛИ ТипОбъекта = Тип("ДокументСсылка.ВводОстатковВнеоборотныхАктивов2_4")
										ИЛИ ТипОбъекта = Тип("ДокументСсылка.ПринятиеКУчетуОС"));
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить("ИзменениеПараметровОС");
	СписокТаблиц.Добавить("ИзменениеСпособаОтраженияИмущественныхНалогов_НалогНаИмущество");
	СписокТаблиц.Добавить("МестонахождениеОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("ПервоначальныеСведенияОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("РегламентнаяОперацияРасчетНалогаНаИмущество");
	СписокТаблиц.Добавить("РегистрацияПорядкаНалогообложенияПоНалогуНаИмущество");
	СписокТаблиц.Добавить("СостоянияОСОрганизаций");
	СписокТаблиц.Добавить("СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокТаблиц.Добавить("СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам");
	СписокТаблиц.Добавить("СчетаБухгалтерскогоУчетаОС");
	СписокТаблиц.Добавить("СтавкиНалогаНаИмущество");
	СписокТаблиц.Добавить("ПорядокУплатыНалоговНаМестах");
	
	// Версия 2.4
	СписокТаблиц.Добавить("СтоимостьОС");
	СписокТаблиц.Добавить("АмортизацияОС");
	СписокТаблиц.Добавить("МестонахождениеОС");
	СписокТаблиц.Добавить("ПервоначальныеСведенияОС");
	СписокТаблиц.Добавить("ПорядокУчетаОСБУ");
	
	СписокДопПолей = "ОтражатьВРеглУчете" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	СписокПолейТаблиц = Новый Структура;
	ТаблицыВидНалога = Новый Массив;
	ТаблицыВидНалога.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокПолейТаблиц.Вставить("ВидНалога", ТаблицыВидНалога);
	
	ТекстОбъединенияДанных = ВнеоборотныеАктивы.СформироватьТекстОбъединенияДанныхДляФормированияЗадания(
									СписокТаблиц, ДанныеТаблиц, СписокДопПолей, СписокПолейТаблиц);
	
	Если ТекстОбъединенияДанных = "" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков22.Дата, МЕСЯЦ, 1)
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков24.Дата, МЕСЯЦ, 1)
	|				КОГДА ИзмененныеДанные.ИмяТаблицы = ""ПорядокУчетаОСБУ""
	|						И ИзмененныеДанные.Период < &ДатаНачалаУчета24
	|					ТОГДА &ДатаНачалаУчета24
	|				ИНАЧЕ ИзмененныеДанные.Период 
	|			КОНЕЦ) КАК Период,
	|	ИзмененныеДанные.Организация       КАК Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ          КАК Документ
	|ПОМЕСТИТЬ ИзмененныеДанные
	|ИЗ
	|	(" + ТекстОбъединенияДанных + ") КАК ИзмененныеДанные
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов КАК ВводОстатков22
	|	ПО ВводОстатков22.Ссылка = ИзмененныеДанные.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов2_4 КАК ВводОстатков24
	|	ПО ВводОстатков24.Ссылка = ИзмененныеДанные.Документ
	|
	|ГДЕ
	|	ИзмененныеДанные.ОтражатьВРеглУчете
	|	И ИзмененныеДанные.ВидНалога В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.НалогНаИмущество),
	|		НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|	" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	Если ЕстьОсновныеСредства Тогда
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство
		|ПОМЕСТИТЬ СписокОС
		|ИЗ
		|	ИзмененныеДанные КАК ИзмененныеДанные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыЭксплуатации КАК ОбъектыЭксплуатации
		|		ПО (ОбъектыЭксплуатации.Ссылка = ИзмененныеДанные.ОсновноеСредство)
		|ГДЕ
		|	(ИзмененныеДанные.Период < ДАТАВРЕМЯ(2019, 1, 1)
		|		ИЛИ ОбъектыЭксплуатации.НедвижимоеИмущество)
		|	И НЕ ОбъектыЭксплуатации.ГруппаОС В (
		|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ЗемельныеУчастки), 
		|						ЗНАЧЕНИЕ(Перечисление.ГруппыОС.ОбъектыПриродопользования))
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
		
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
	"ВЫБРАТЬ
	|	ИзмененныеДанные.Организация КАК Организация,
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика КАК УчетнаяПолитика,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаОрганизаций.Период > ИзмененныеДанные.Период
	|				И УчетнаяПолитикаОрганизаций.Период > &ДатаНачалаВеденияРеглУчета
	|			ТОГДА УчетнаяПолитикаОрганизаций.Период
	|		КОГДА &ДатаНачалаВеденияРеглУчета > ИзмененныеДанные.Период
	|			ТОГДА &ДатаНачалаВеденияРеглУчета
	|		ИНАЧЕ ИзмененныеДанные.Период
	|	КОНЕЦ КАК Начало
	|ПОМЕСТИТЬ УчетнаяПолитикаОрганизаций
	|ИЗ
	|	ИзмененныеДанные КАК ИзмененныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО (УчетнаяПолитикаОрганизаций.Организация = ИзмененныеДанные.Организация)
	|			И (УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|				ИЛИ ИзмененныеДанные.Период >= ДАТАВРЕМЯ(2015, 1, 1))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК СледующаяУчетнаяПолитикаОрганизаций
	|		ПО (СледующаяУчетнаяПолитикаОрганизаций.Организация = УчетнаяПолитикаОрганизаций.Организация)
	|			И (СледующаяУчетнаяПолитикаОрганизаций.Период > УчетнаяПолитикаОрганизаций.Период)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаОрганизаций.Период > ИзмененныеДанные.Период
	|				И УчетнаяПолитикаОрганизаций.Период > &ДатаНачалаВеденияРеглУчета
	|			ТОГДА УчетнаяПолитикаОрганизаций.Период
	|		КОГДА &ДатаНачалаВеденияРеглУчета > ИзмененныеДанные.Период
	|			ТОГДА &ДатаНачалаВеденияРеглУчета
	|		ИНАЧЕ ИзмененныеДанные.Период
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(ЕСТЬNULL(МИНИМУМ(СледующаяУчетнаяПолитикаОрганизаций.Период), ДАТАВРЕМЯ(1, 1, 1)) > МИНИМУМ(ИзмененныеДанные.Период)
	|			И ЕСТЬNULL(МИНИМУМ(СледующаяУчетнаяПолитикаОрганизаций.Период), ДАТАВРЕМЯ(1, 1, 1)) > &ДатаНачалаВеденияРеглУчета
	|		ИЛИ ЕСТЬNULL(МИНИМУМ(СледующаяУчетнаяПолитикаОрганизаций.Период), ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация";
	
	Если ПроверитьЧтоОСПринятоКУчету Тогда
		
		Если ПринятиеКУчетуЗаданоДокументом Тогда
			
			Если ДанныеТаблиц.МенеджерВременныхТаблиц.Таблицы.Найти("СостоянияОСОрганизаций") <> Неопределено Тогда
			
				ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
					"ВЫБРАТЬ
					|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
					|	МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
					|							КОГДА ПринятыеКУчету.Период > УчетнаяПолитикаОрганизаций.Начало 
					|								ТОГДА ПринятыеКУчету.Период 
					|							ИНАЧЕ 
					|								УчетнаяПолитикаОрганизаций.Начало 
					|						КОНЕЦ, КВАРТАЛ)) КАК Период
					|ПОМЕСТИТЬ ПериодЗадания
					|ИЗ
					|	УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СостоянияОСОрганизаций КАК ПринятыеКУчету
					|		ПО (ПринятыеКУчету.Организация = УчетнаяПолитикаОрганизаций.Организация)
					|			И (ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
					|ГДЕ
					|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
					|	
					|СГРУППИРОВАТЬ ПО
					|	УчетнаяПолитикаОрганизаций.Организация
					|	
					|ИНДЕКСИРОВАТЬ ПО
					|	Организация";
					
			Иначе
					
				ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
					"ВЫБРАТЬ
					|	УчетнаяПолитикаОрганизаций.Организация КАК Организация,
					|	МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
					|							КОГДА ПринятыеКУчету.Период > УчетнаяПолитикаОрганизаций.Начало 
					|								ТОГДА ПринятыеКУчету.Период 
					|							ИНАЧЕ 
					|								УчетнаяПолитикаОрганизаций.Начало 
					|						КОНЕЦ, КВАРТАЛ)) КАК Период
					|ПОМЕСТИТЬ ПериодЗадания
					|ИЗ
					|	УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИзмененныеДанные КАК ИзмененныеДанные
					|		ПО ИзмененныеДанные.Организация = УчетнаяПолитикаОрганизаций.Организация
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК ПринятыеКУчету
					|		ПО (ПринятыеКУчету.Организация = УчетнаяПолитикаОрганизаций.Организация)
					|			И (ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
					|			И (ПринятыеКУчету.Регистратор = ИзмененныеДанные.Документ)
					|			И (ПринятыеКУчету.Активность)
					|ГДЕ
					|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
					|	
					|СГРУППИРОВАТЬ ПО
					|	УчетнаяПолитикаОрганизаций.Организация
					|	
					|ИНДЕКСИРОВАТЬ ПО
					|	Организация";

			КонецЕсли;		
		Иначе
		
			ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
				"ВЫБРАТЬ
				|	ВложенныйЗапрос.Организация,
				|	МИНИМУМ(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ)) КАК Период
				|ПОМЕСТИТЬ ПериодЗадания
				|ИЗ
				|	(ВЫБРАТЬ
				|		УчетнаяПолитикаОрганизаций.Организация КАК Организация,
				|		МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
				|								КОГДА ПринятыеКУчету.Период > УчетнаяПолитикаОрганизаций.Начало 
				|									ТОГДА ПринятыеКУчету.Период 
				|								ИНАЧЕ 
				|									УчетнаяПолитикаОрганизаций.Начало 
				|							КОНЕЦ, КВАРТАЛ)) КАК Период
				|	ИЗ
				|		УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК ПринятыеКУчету
				|			ПО (ПринятыеКУчету.Организация = УчетнаяПолитикаОрганизаций.Организация)
				|				И (ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияОСОрганизаций КАК СледующееСостояниеОС
				|			ПО (СледующееСостояниеОС.Организация = ПринятыеКУчету.Организация)
				|				И (СледующееСостояниеОС.ОсновноеСредство = ПринятыеКУчету.ОсновноеСредство)
				|				И (СледующееСостояниеОС.Период > ПринятыеКУчету.Период)
				|				И (СледующееСостояниеОС.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету))
				|	ГДЕ
				|		УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
				|		" + ?(ЕстьОсновныеСредства, "И ПринятыеКУчету.ОсновноеСредство В
				|				(ВЫБРАТЬ
				|					СписокОС.ОсновноеСредство
				|				ИЗ
				|					СписокОС КАК СписокОС)", "") + "
				|	
				|	СГРУППИРОВАТЬ ПО
				|		УчетнаяПолитикаОрганизаций.Организация
				|	
				|	ИМЕЮЩИЕ
				|		(МИНИМУМ(СледующееСостояниеОС.Период) >= МИНИМУМ(УчетнаяПолитикаОрганизаций.Начало)
				|			ИЛИ ЕСТЬNULL(МИНИМУМ(СледующееСостояниеОС.Период), ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))
				|	
				|	ОБЪЕДИНИТЬ ВСЕ
				|	
				|	ВЫБРАТЬ
				|		УчетнаяПолитикаОрганизаций.Организация,
				|		МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
				|								КОГДА СтавкиНалога.Период > УчетнаяПолитикаОрганизаций.Начало 
				|									ТОГДА СтавкиНалога.Период 
				|								ИНАЧЕ 
				|									УчетнаяПолитикаОрганизаций.Начало 
				|							КОНЕЦ, КВАРТАЛ))
				|	ИЗ
				|		УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
				|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалога
				|			ПО (СтавкиНалога.Организация = УчетнаяПолитикаОрганизаций.Организация)
				|				И (СтавкиНалога.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
				|				И (СтавкиНалога.Период >= УчетнаяПолитикаОрганизаций.Начало)
				|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СледующееСтавкиНалога
				|			ПО (СледующееСтавкиНалога.Организация = СтавкиНалога.Организация)
				|				И (СледующееСтавкиНалога.ОсновноеСредство = СтавкиНалога.ОсновноеСредство)
				|				И (СледующееСтавкиНалога.Период > СтавкиНалога.Период)
				|				И (СледующееСтавкиНалога.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
				|	" + ?(ЕстьОсновныеСредства, "ГДЕ
				|		СтавкиНалога.ОсновноеСредство В
				|				(ВЫБРАТЬ
				|					СписокОС.ОсновноеСредство
				|				ИЗ
				|					СписокОС КАК СписокОС)", "") + "
				|	
				|	СГРУППИРОВАТЬ ПО
				|		УчетнаяПолитикаОрганизаций.Организация
				|	
				|	ИМЕЮЩИЕ
				|		(МИНИМУМ(СледующееСтавкиНалога.Период) >= МИНИМУМ(УчетнаяПолитикаОрганизаций.Начало)
				|			ИЛИ ЕСТЬNULL(МИНИМУМ(СледующееСтавкиНалога.Период), ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))) КАК ВложенныйЗапрос
				|
				|СГРУППИРОВАТЬ ПО
				|	ВложенныйЗапрос.Организация
				|
				|ИНДЕКСИРОВАТЬ ПО
				|	Организация";
			
		КонецЕсли;
		
	Иначе

		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ
			|	ВложенныйЗапрос.Организация,
			|	МИНИМУМ(НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ)) КАК Период
			|ПОМЕСТИТЬ ПериодЗадания
			|ИЗ
			|	(ВЫБРАТЬ
			|		УчетнаяПолитикаОрганизаций.Организация КАК Организация,
			|		МИНИМУМ(КОНЕЦПЕРИОДА(УчетнаяПолитикаОрганизаций.Начало, КВАРТАЛ)) КАК Период
			|	ИЗ
			|		УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
			|	ГДЕ
			|		УчетнаяПолитикаОрганизаций.УчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		УчетнаяПолитикаОрганизаций.Организация
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		УчетнаяПолитикаОрганизаций.Организация,
			|		МИНИМУМ(КОНЕЦПЕРИОДА(ВЫБОР 
			|								КОГДА СтавкиНалога.Период > УчетнаяПолитикаОрганизаций.Начало 
			|									ТОГДА СтавкиНалога.Период 
			|								ИНАЧЕ 
			|									УчетнаяПолитикаОрганизаций.Начало 
			|							КОНЕЦ, КВАРТАЛ))
			|	ИЗ
			|		УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СтавкиНалога
			|			ПО (СтавкиНалога.Организация = УчетнаяПолитикаОрганизаций.Организация)
			|				И (СтавкиНалога.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
			|				И (СтавкиНалога.Период >= УчетнаяПолитикаОрганизаций.Начало)
			|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам КАК СледующееСтавкиНалога
			|			ПО (СледующееСтавкиНалога.Организация = СтавкиНалога.Организация)
			|				И (СледующееСтавкиНалога.ОсновноеСредство = СтавкиНалога.ОсновноеСредство)
			|				И (СледующееСтавкиНалога.Период > СтавкиНалога.Период)
			|				И (СледующееСтавкиНалога.НалоговаяБаза <> ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость))
			|	" + ?(ЕстьОсновныеСредства, "ГДЕ
			|		СтавкиНалога.ОсновноеСредство В
			|				(ВЫБРАТЬ
			|					СписокОС.ОсновноеСредство
			|				ИЗ
			|					СписокОС КАК СписокОС)", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		УчетнаяПолитикаОрганизаций.Организация
			|	
			|	ИМЕЮЩИЕ
			|		(МИНИМУМ(СледующееСтавкиНалога.Период) >= МИНИМУМ(УчетнаяПолитикаОрганизаций.Начало)
			|			ИЛИ ЕСТЬNULL(МИНИМУМ(СледующееСтавкиНалога.Период), ДАТАВРЕМЯ(1, 1, 1)) = ДАТАВРЕМЯ(1, 1, 1))) КАК ВложенныйЗапрос
			|
			|СГРУППИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	ВложенныйЗапрос.Организация";
			
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
	"ВЫБРАТЬ
	|	ИзмененныеДанные.Организация,
	|	ИзмененныеДанные.Документ,
	|	&Операция КАК Операция,
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ), МЕСЯЦ)) КАК Месяц
	|ИЗ
	|	ИзмененныеДанные КАК ИзмененныеДанные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодЗадания КАК ПериодЗадания
	|		ПО (ПериодЗадания.Организация = ИзмененныеДанные.Организация)
	|
	|	" + ?(ЕстьОсновныеСредства, "ГДЕ
	|		ИзмененныеДанные.ОсновноеСредство В
	|				(ВЫБРАТЬ
	|					СписокОС.ОсновноеСредство
	|				ИЗ
	|					СписокОС КАК СписокОС)", "") + "
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	ИзмененныеДанные.Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ПериодЗадания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИзмененныеДанные";
	
	Если ЕстьОсновныеСредства Тогда
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
		"УНИЧТОЖИТЬ СписокОС";
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаВеденияРеглУчета", Константы.ДатаНачалаВеденияРеглУчета.Получить());
	Запрос.УстановитьПараметр("ДатаНачалаУчета24", ВнеоборотныеАктивыЛокализация.ДатаНачалаУчетаВнеоборотныхАктивов2_4());
	Запрос.УстановитьПараметр("Операция", Перечисления.ОперацииЗакрытияМесяца.РасчетНалогаНаИмущество);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписиРегистраПоДаннымВыборки(РезультатЗапроса.Выбрать());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Формирует задание к расчету транспортного налога, на основании измененных данных.
//
// Параметры:
//  ДокументСсылка		 - ДокументСсылка	 - Ссылка на документ.
//  ДанныеТаблиц		 - Структура		 - Содержит список таблиц в которых произошли изменения.
//  ЕстьОсновныеСредства - Булево			 - Истина, если измененные данные содержат информацию об основных средствах.
//
Процедура СформироватьЗаданиеКРасчетуТранспортногоНалога(ДокументСсылка, ДанныеТаблиц, ЕстьОсновныеСредства = Неопределено) Экспорт

	ТипОбъекта = ТипЗнч(ДокументСсылка);
	
	ЕстьОсновныеСредства = (ТипОбъекта <> Тип("ДокументСсылка.РегламентнаяОперация")
							И ДокументСсылка <> Неопределено
							ИЛИ ЕстьОсновныеСредства <> Неопределено И ЕстьОсновныеСредства);
	
	ПроверитьЧтоОСЗарегистрировано = 
		(ТипОбъекта <> Тип("ДокументСсылка.ОтменаРегистрацииТранспортныхСредств")
			И ТипОбъекта <> Тип("ДокументСсылка.РегистрацияТранспортныхСредств"));
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить("ИзменениеПараметровОС");
	СписокТаблиц.Добавить("ИзменениеСпособаОтраженияИмущественныхНалогов_ТранспортныйНалог");
	СписокТаблиц.Добавить("МестонахождениеОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("ПорядокУплатыНалоговНаМестах");
	СписокТаблиц.Добавить("РегламентнаяОперацияРасчетТранспортногоНалога");
	СписокТаблиц.Добавить("РегистрацияТранспортныхСредств");
	СписокТаблиц.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокТаблиц.Добавить("РасходыНаПлатон");
	СписокТаблиц.Добавить("РасчетыСПоставщикамиПоДокументам_ЗаданияКРасчетуТранспортногоНалога");
	
	// Версия 2.4
	СписокТаблиц.Добавить("МестонахождениеОС");
	
	СписокДопПолей = "ОтражатьВРеглУчете" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	СписокПолейТаблиц = Новый Структура;
	ТаблицыВидНалога = Новый Массив;
	ТаблицыВидНалога.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокПолейТаблиц.Вставить("ВидНалога", ТаблицыВидНалога);
	
	ТекстОбъединенияДанных = ВнеоборотныеАктивы.СформироватьТекстОбъединенияДанныхДляФормированияЗадания(
									СписокТаблиц, ДанныеТаблиц, СписокДопПолей, СписокПолейТаблиц);
	
	Если ТекстОбъединенияДанных = "" Тогда
		Возврат;
	КонецЕсли;
	
	// Условия формирования задания:
	// - если с начала квартала были зарегистрированы транспортные средства (дата задания - наименьшая дата регистрации)
	// - или если на начало квартала есть зарегистрированные транспортные средства (дата задания - начало квартала).
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков22.Дата, МЕСЯЦ, 1)
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков24.Дата, МЕСЯЦ, 1)
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.РегистрацияТранспортныхСредств)
	|					ТОГДА РегистрацияТранспортныхСредств.Дата
	|				ИНАЧЕ ИзмененныеДанные.Период 
	|			КОНЕЦ)   КАК Период,
	|	ИзмененныеДанные.Организация       КАК Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ          КАК Документ
	|ПОМЕСТИТЬ ИзмененныеДанные
	|ИЗ
	|	(" + ТекстОбъединенияДанных + ") КАК ИзмененныеДанные
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов КАК ВводОстатков22
	|	ПО ВводОстатков22.Ссылка = ИзмененныеДанные.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов2_4 КАК ВводОстатков24
	|	ПО ВводОстатков24.Ссылка = ИзмененныеДанные.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|	ПО РегистрацияТранспортныхСредств.Ссылка = ИзмененныеДанные.Документ
	|ГДЕ
	|	ИзмененныеДанные.ОтражатьВРеглУчете
	|	И ВЫРАЗИТЬ(ИзмененныеДанные.Организация КАК Справочник.Организации).ЮридическоеФизическоеЛицо <> ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|	И ИзмененныеДанные.ВидНалога В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.ТранспортныйНалог),
	|		НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|	" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	Если ПроверитьЧтоОСЗарегистрировано Тогда
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РегистрацияТранспортныхСредствПоследние.Организация КАК Организация
			|ПОМЕСТИТЬ РегистрацияТранспортныхСредствНаНачало
			|ИЗ
			|	(ВЫБРАТЬ
			|		РегистрацияТранспортныхСредств.Организация КАК Организация,
			|		РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
			|		МАКСИМУМ(РегистрацияТранспортныхСредств.Период) КАК Период
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
			|			ПО (РегистрацияТранспортныхСредств.Организация = ИзмененныеДанные.Организация)
			|				И (РегистрацияТранспортныхСредств.Период < НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ))
			|				" + ?(ЕстьОсновныеСредства, "И РегистрацияТранспортныхСредств.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		РегистрацияТранспортныхСредств.Организация,
			|		РегистрацияТранспортныхСредств.ОсновноеСредство
			|	) КАК РегистрацияТранспортныхСредствПоследние
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
			|		ПО (РегистрацияТранспортныхСредств.Организация = РегистрацияТранспортныхСредствПоследние.Организация)
			|			И (РегистрацияТранспортныхСредств.ОсновноеСредство = РегистрацияТранспортныхСредствПоследние.ОсновноеСредство)
			|			И (РегистрацияТранспортныхСредств.Период = РегистрацияТранспортныхСредствПоследние.Период)
			|ГДЕ
			|	РегистрацияТранспортныхСредств.ВключатьВНалоговуюБазу
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияТранспортныхСредствПоследние.Организация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РегистрацияТранспортныхСредств.Организация,
			|	МИНИМУМ(РегистрацияТранспортныхСредств.Период) КАК Период
			|ПОМЕСТИТЬ ПериодЗадания
			|ИЗ
			|	(ВЫБРАТЬ
			|		ИзмененныеДанные.Организация КАК Организация,
			|		МИНИМУМ(НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, МЕСЯЦ)) КАК Период
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрацияТранспортныхСредствНаНачало КАК РегистрацияТранспортныхСредствНаНачало
			|			ПО (РегистрацияТранспортныхСредствНаНачало.Организация = ИзмененныеДанные.Организация)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзмененныеДанные.Организация
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ИзмененныеДанные.Организация,
			|		МИНИМУМ(НАЧАЛОПЕРИОДА(РегистрацияТранспортныхСредств.Период, МЕСЯЦ))
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
			|			ПО (РегистрацияТранспортныхСредств.Организация = ИзмененныеДанные.Организация)
			|				И (РегистрацияТранспортныхСредств.Период >= НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ))
			|				И (РегистрацияТранспортныхСредств.ВключатьВНалоговуюБазу)
			|				" + ?(ЕстьОсновныеСредства, "И РегистрацияТранспортныхСредств.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзмененныеДанные.Организация) КАК РегистрацияТранспортныхСредств
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияТранспортныхСредств.Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ,
			|	&Операция КАК Операция,
			|	МИНИМУМ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ), МЕСЯЦ)) КАК Месяц
			|ИЗ
			|	ИзмененныеДанные КАК ИзмененныеДанные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодЗадания КАК ПериодЗадания
			|		ПО (ПериодЗадания.Организация = ИзмененныеДанные.Организация)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ПериодЗадания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ИзмененныеДанные";
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ,
			|	&Операция КАК Операция,
			|	МИНИМУМ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ), МЕСЯЦ)) КАК Месяц
			|ИЗ
			|	ИзмененныеДанные КАК ИзмененныеДанные
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ИзмененныеДанные";

	КонецЕсли; 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаВеденияРеглУчета", Константы.ДатаНачалаВеденияРеглУчета.Получить());
	Запрос.УстановитьПараметр("Операция", Перечисления.ОперацииЗакрытияМесяца.РасчетТранспортногоНалога);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписиРегистраПоДаннымВыборки(РезультатЗапроса.Выбрать());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Формирует задание к расчету земельного налога, на основании измененных данных.
//
// Параметры:
//  ДокументСсылка	 - ДокументСсылка	 - Ссылка на документ.
//  ДанныеТаблиц	 - Структура		 - Содержит список таблиц в которых произошли изменения.
//
Процедура СформироватьЗаданиеКРасчетуЗемельногоНалога(ДокументСсылка, ДанныеТаблиц) Экспорт
	
	ТипОбъекта = ТипЗнч(ДокументСсылка);
	
	ЕстьОсновныеСредства = (ТипОбъекта <> Тип("ДокументСсылка.РегламентнаяОперация")
							И ДокументСсылка <> Неопределено);
	
	ПроверитьЧтоОСЗарегистрировано = 
		(ТипОбъекта <> Тип("ДокументСсылка.ОтменаРегистрацииЗемельныхУчастков")
			И ТипОбъекта <> Тип("ДокументСсылка.РегистрацияЗемельныхУчастков"));
	
	СписокТаблиц = Новый Массив;
	СписокТаблиц.Добавить("ИзменениеПараметровОС");
	СписокТаблиц.Добавить("ИзменениеСпособаОтраженияИмущественныхНалогов_ЗемельныйНалог");
	СписокТаблиц.Добавить("МестонахождениеОСБухгалтерскийУчет");
	СписокТаблиц.Добавить("ПорядокУплатыНалоговНаМестах");
	СписокТаблиц.Добавить("РегистрацияЗемельныхУчастков");
	СписокТаблиц.Добавить("РегламентнаяОперацияРасчетЗемельногоНалога");
	СписокТаблиц.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокТаблиц.Добавить("СтавкиНалогаНаИмущество");
	СписокТаблиц.Добавить("СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам");
	
	// Версия 2.4
	СписокТаблиц.Добавить("МестонахождениеОС");
	
	СписокДопПолей = "ОтражатьВРеглУчете" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	СписокПолейТаблиц = Новый Структура;
	ТаблицыВидНалога = Новый Массив;
	ТаблицыВидНалога.Добавить("СпособыОтраженияРасходовПоИмущественнымНалогам");
	СписокПолейТаблиц.Вставить("ВидНалога", ТаблицыВидНалога);
	
	ТекстОбъединенияДанных = ВнеоборотныеАктивы.СформироватьТекстОбъединенияДанныхДляФормированияЗадания(
									СписокТаблиц, ДанныеТаблиц, СписокДопПолей, СписокПолейТаблиц);
	
	Если ТекстОбъединенияДанных = "" Тогда
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	МИНИМУМ(ВЫБОР 
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков22.Дата, МЕСЯЦ, 1)
	|				КОГДА ТИПЗНАЧЕНИЯ(ИзмененныеДанные.Документ) = ТИП(Документ.ВводОстатковВнеоборотныхАктивов2_4)
	|					ТОГДА ДОБАВИТЬКДАТЕ(ВводОстатков24.Дата, МЕСЯЦ, 1)
	|				ИНАЧЕ ИзмененныеДанные.Период 
	|			КОНЕЦ)   КАК Период,
	|	ИзмененныеДанные.Организация       КАК Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство КАК ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ          КАК Документ
	|ПОМЕСТИТЬ ИзмененныеДанные
	|ИЗ
	|	(" + ТекстОбъединенияДанных + ") КАК ИзмененныеДанные
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов КАК ВводОстатков22
	|	ПО ВводОстатков22.Ссылка = ИзмененныеДанные.Документ
	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВводОстатковВнеоборотныхАктивов2_4 КАК ВводОстатков24
	|	ПО ВводОстатков24.Ссылка = ИзмененныеДанные.Документ
	|
	|ГДЕ
	|	ИзмененныеДанные.ОтражатьВРеглУчете
	|	И ИзмененныеДанные.ВидНалога В (
	|		ЗНАЧЕНИЕ(Перечисление.ВидыИмущественныхНалогов.ЗемельныйНалог),
	|		НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененныеДанные.Организация,
	|	" + ?(ЕстьОсновныеСредства, "ИзмененныеДанные.ОсновноеСредство,", "") + "
	|	ИзмененныеДанные.Документ
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|	" + ?(ЕстьОсновныеСредства, ",ОсновноеСредство", "");
	
	Если ПроверитьЧтоОСЗарегистрировано Тогда
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	РегистрацияЗемельныхУчастковПоследние.Организация КАК Организация
			|ПОМЕСТИТЬ РегистрацияЗемельныхУчастковНаНачало
			|ИЗ
			|	(ВЫБРАТЬ
			|		РегистрацияЗемельныхУчастков.Организация КАК Организация,
			|		РегистрацияЗемельныхУчастков.ОсновноеСредство КАК ОсновноеСредство,
			|		МАКСИМУМ(РегистрацияЗемельныхУчастков.Период) КАК Период
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
			|			ПО (РегистрацияЗемельныхУчастков.Организация = ИзмененныеДанные.Организация)
			|				И (РегистрацияЗемельныхУчастков.Период < НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ))
			|				" + ?(ЕстьОсновныеСредства, "И РегистрацияЗемельныхУчастков.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		РегистрацияЗемельныхУчастков.Организация,
			|		РегистрацияЗемельныхУчастков.ОсновноеСредство
			|	) КАК РегистрацияЗемельныхУчастковПоследние
			|
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
			|		ПО (РегистрацияЗемельныхУчастков.Организация = РегистрацияЗемельныхУчастковПоследние.Организация)
			|			И (РегистрацияЗемельныхУчастков.ОсновноеСредство = РегистрацияЗемельныхУчастковПоследние.ОсновноеСредство)
			|			И (РегистрацияЗемельныхУчастков.Период = РегистрацияЗемельныхУчастковПоследние.Период)
			|ГДЕ
			|	РегистрацияЗемельныхУчастков.ВключатьВНалоговуюБазу
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияЗемельныхУчастковПоследние.Организация
			|
			|ИНДЕКСИРОВАТЬ ПО
			|	Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РегистрацияЗемельныхУчастков.Организация,
			|	МИНИМУМ(РегистрацияЗемельныхУчастков.Период) КАК Период
			|ПОМЕСТИТЬ ПериодЗадания
			|ИЗ
			|	(ВЫБРАТЬ
			|		ИзмененныеДанные.Организация КАК Организация,
			|		МИНИМУМ(НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, МЕСЯЦ)) КАК Период
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрацияЗемельныхУчастковНаНачало КАК РегистрацияЗемельныхУчастковНаНачало
			|			ПО (РегистрацияЗемельныхУчастковНаНачало.Организация = ИзмененныеДанные.Организация)
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзмененныеДанные.Организация
			|	
			|	ОБЪЕДИНИТЬ ВСЕ
			|	
			|	ВЫБРАТЬ
			|		ИзмененныеДанные.Организация,
			|		МИНИМУМ(НАЧАЛОПЕРИОДА(РегистрацияЗемельныхУчастков.Период, МЕСЯЦ))
			|	ИЗ
			|		ИзмененныеДанные КАК ИзмененныеДанные
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РегистрацияЗемельныхУчастков КАК РегистрацияЗемельныхУчастков
			|			ПО (РегистрацияЗемельныхУчастков.Организация = ИзмененныеДанные.Организация)
			|				И (РегистрацияЗемельныхУчастков.Период >= НАЧАЛОПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ))
			|				И (РегистрацияЗемельныхУчастков.ВключатьВНалоговуюБазу)
			|				" + ?(ЕстьОсновныеСредства, "И РегистрацияЗемельныхУчастков.ОсновноеСредство = ИзмененныеДанные.ОсновноеСредство", "") + "
			|	
			|	СГРУППИРОВАТЬ ПО
			|		ИзмененныеДанные.Организация) КАК РегистрацияЗемельныхУчастков
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияЗемельныхУчастков.Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ,
			|	&Операция КАК Операция,
			|	МИНИМУМ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ПериодЗадания.Период, КВАРТАЛ), МЕСЯЦ)) КАК Месяц
			|ИЗ
			|	ИзмененныеДанные КАК ИзмененныеДанные
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПериодЗадания КАК ПериодЗадания
			|		ПО (ПериодЗадания.Организация = ИзмененныеДанные.Организация)
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ПериодЗадания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ИзмененныеДанные";
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияУТ.РазделительЗапросовПакета() +
			"ВЫБРАТЬ
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ,
			|	&Операция КАК Операция,
			|	МИНИМУМ(НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ИзмененныеДанные.Период, КВАРТАЛ), МЕСЯЦ)) КАК Месяц
			|ИЗ
			|	ИзмененныеДанные КАК ИзмененныеДанные
			|
			|СГРУППИРОВАТЬ ПО
			|	ИзмененныеДанные.Организация,
			|	ИзмененныеДанные.Документ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|УНИЧТОЖИТЬ ИзмененныеДанные";
			
	КонецЕсли; 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ДатаНачалаВеденияРеглУчета", Константы.ДатаНачалаВеденияРеглУчета.Получить());
	Запрос.УстановитьПараметр("Операция", Перечисления.ОперацииЗакрытияМесяца.РасчетЗемельногоНалога);
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РегистрыСведений.ЗаданияКЗакрытиюМесяца.СоздатьЗаписиРегистраПоДаннымВыборки(РезультатЗапроса.Выбрать());
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Определяет необходимость расчета налога на имущество в указанном периоде.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация для которой требуется определить необходимость расчета налога на имущество.
//  Период		 - Дата - Период в котором нужно проверить необходимость расчета.
// 
// Возвращаемое значение:
//  Булево - Истина, если требуется расчет налога на имущество.
//
Функция ТребуетсяРасчетНалогаНаИмущество(Организация, Период) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Т.Организация КАК Ссылка,
	|	ВЫБОР
	|		КОГДА СпрУчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОСНО
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК Т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеПолитикиОрганизаций КАК СпрУчетнаяПолитика
	|		ПО Т.УчетнаяПолитика = СпрУчетнаяПолитика.Ссылка
	|			И (СпрУчетнаяПолитика.СистемаНалогообложения = ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.Общая)
	|				ИЛИ &НачалоПериода >= ДАТАВРЕМЯ(2015, 1, 1))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(
	|			&НачалоПериода,
	|			Организация В
	|				(ВЫБРАТЬ
	|					Организации.Ссылка
	|				ИЗ
	|					Организации
	|				ГДЕ
	|					Организации.ОСНО)) КАК ПринятыеКУчету
	|ГДЕ
	|	ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ.СрезПоследних(
	|			&НачалоПериода,
	|			Организация В
	|				(ВЫБРАТЬ
	|					Организации.Ссылка
	|				ИЗ
	|					Организации
	|				ГДЕ
	|					Организации.ОСНО)) КАК ПринятыеКУчету
	|ГДЕ
	|	ПринятыеКУчету.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ПринятоКУчету)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	1
	|ИЗ
	|	РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.СрезПоследних(
	|			&НачалоПериода,
	|			Организация В
	|				(ВЫБРАТЬ
	|					Организации.Ссылка
	|				ИЗ
	|					Организации)) КАК СтавкиНалога
	|ГДЕ
	|	СтавкиНалога.НалоговаяБаза = ЗНАЧЕНИЕ(Перечисление.НалоговаяБазаПоНалогуНаИмущество.КадастроваяСтоимость)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НЕ Результат.Пустой();

КонецФункции

// Определяет необходимость расчета земельного налога в указанном периоде.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация для которой требуется определить необходимость расчета земельного налога.
//  Период		 - Дата - Период в котором нужно проверить необходимость расчета.
// 
// Возвращаемое значение:
//  Булево - Истина, если требуется расчет земельного налога.
//
Функция ТребуетсяРасчетЗемельногоНалога(Организация, Период) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД), СЕКУНДА, -1),
	|			Организация = &Организация
	|				И ВключатьВНалоговуюБазу) КАК Регистрация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	РегистрСведений.РегистрацияЗемельныхУчастков КАК Регистрация
	|ГДЕ
	|	Регистрация.ВключатьВНалоговуюБазу
	|	И Регистрация.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД) И &ОкончаниеПериода
	|	И Регистрация.Организация = &Организация";

	Если Месяц(Период) <> 12 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГОД", "КВАРТАЛ");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НЕ Результат.Пустой();
		
КонецФункции

// Определяет необходимость расчета транспортного налога в указанном периоде.
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - Организация для которой требуется определить необходимость расчета транспортного налога.
//  Период		 - Дата - Период в котором нужно проверить необходимость расчета.
// 
// Возвращаемое значение:
//  Булево - Истина, если требуется расчет транспортного налога.
//
Функция ТребуетсяРасчетТранспортногоНалога(Организация, Период) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = &Организация
	|	И Организации.ЮридическоеФизическоеЛицо <> ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Поле1
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств.СрезПоследних(
	|			ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД), СЕКУНДА, -1),
	|			Организация В
	|					(ВЫБРАТЬ
	|						Организации.Ссылка
	|					ИЗ
	|						Организации)
	|				И ВключатьВНалоговуюБазу) КАК РегистрацияТC
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТC
	|ГДЕ
	|	РегистрацияТC.ВключатьВНалоговуюБазу
	|	И РегистрацияТC.Период МЕЖДУ НАЧАЛОПЕРИОДА(&НачалоПериода, ГОД) И &ОкончаниеПериода
	|	И РегистрацияТC.Организация В
	|			(ВЫБРАТЬ
	|				Организации.Ссылка
	|			ИЗ
	|				Организации)";
	
	Если Месяц(Период) <> 12 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ГОД", "КВАРТАЛ");
	КонецЕсли;
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НЕ Результат.Пустой();

КонецФункции

Процедура ПолучитьСостоянияОСОрганизацийДляФормированияЗаданийКЗакрытиюМесяца(ДанныеТаблиц, Регистратор) Экспорт

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	СостоянияОСОрганизаций.Период КАК Период,
	|	СостоянияОСОрганизаций.Организация КАК Организация,
	|	СостоянияОСОрганизаций.Состояние КАК Состояние
	|ПОМЕСТИТЬ СостоянияОСОрганизаций
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	|ГДЕ
	|	СостоянияОСОрганизаций.Регистратор = &Регистратор
	|	И СостоянияОСОрганизаций.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПорядокУчетаОСБУ.Период,
	|	ПорядокУчетаОСБУ.Организация,
	|	ПорядокУчетаОСБУ.Состояние
	|ИЗ
	|	РегистрСведений.ПорядокУчетаОСБУ КАК ПорядокУчетаОСБУ
	|ГДЕ
	|	ПорядокУчетаОСБУ.Регистратор = &Регистратор
	|	И ПорядокУчетаОСБУ.Активность";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = ДанныеТаблиц.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
