#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
		
			// Создание запроса инициализации движений и заполенение его параметров
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДополнительныеСвойства);
	
		// Текст запроса, формирующего таблицы движений
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапросаОбъектыСтроительства(),"ТаблицаУСОERP_ДенежныеСредстваПоОбъектамСтроительстваФакт");
	
		Запрос.Текст = "";
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		Запрос.Текст = Запрос.Текст + ТекстЗапроса.Значение;
	КонецЦикла;
	
	////////////////////////////////////////////////////////////////////////////
	// Выполним запрос
	
	Результат = Запрос.ВыполнитьПакет();
	
	////////////////////////////////////////////////////////////////////////////
	// Поместим результаты запроса в дополнительные свойства
	
	Для Каждого ТекстЗапроса из ТекстыЗапроса Цикл
		
		ИмяТаблицы = ТекстЗапроса.Представление;
		
		Если Не ПустаяСтрока(ИмяТаблицы) Тогда
			
			Индекс = ТекстыЗапроса.Индекс(ТекстЗапроса);
			ДополнительныеСвойства.ТаблицыДляДвижений.Вставить(ИмяТаблицы, Результат[Индекс].Выгрузить());
			
		КонецЕсли;
		
	КонецЦикла;


КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, СтруктураДополнительныеСвойства)
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительства.Дата КАК Период,
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительства.Ссылка,
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительства.Организация
	|ИЗ
	|	Документ.УСОERP_ВводОстатковДСПоОбъектамСтроительства КАК УСОERP_ВводОстатковДСПоОбъектамСтроительства
	|ГДЕ
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительства.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",              	Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",         	Реквизиты.Организация);
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДокументСсылка.Валюта,ДокументСсылка.Дата);
	КурсДокумента = СтруктураКурса.Курс/СтруктураКурса.Кратность;
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчета.Получить(),ДокументСсылка.Дата);
	КурсРегл      = СтруктураКурса.Курс/СтруктураКурса.Кратность;
    Курс = КурсДокумента/КурсРегл;
	СтруктураКурса =  РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчета.Получить(),ДокументСсылка.Дата);
	КурсУпрУчета      = СтруктураКурса.Курс/СтруктураКурса.Кратность;
	КурсУпр = КурсДокумента/КурсУпрУчета;
	Запрос.УстановитьПараметр("Курс",Курс);
	Запрос.УстановитьПараметр("КурсУпр",КурсУпр);

	
КонецПроцедуры

Функция ТекстЗапросаОбъектыСтроительства()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата КАК Период,
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Организация КАК Организация,
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.ОбъектСтроительства КАК ОбъектСтроительства,
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВЫБОР
	|		КОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.ОбъектСтроительства.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.СтатьяДвиженияДенежныхСредств.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата >= ЕСТЬNULL(ВложенныйЗапрос.НачалоСтроительства, ДАТАВРЕМЯ(2999, 1, 1))
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата <= ЕСТЬNULL(ВложенныйЗапрос.ОкончаниеСтроительства, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА 0
	|		ИНАЧЕ УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Сумма
	|	КОНЕЦ * &КурсУпр КАК Сумма,
	|	ВЫБОР
	|		КОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.ОбъектСтроительства.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.СтатьяДвиженияДенежныхСредств.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата >= ЕСТЬNULL(ВложенныйЗапрос.НачалоСтроительства, ДАТАВРЕМЯ(2999, 1, 1))
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата <= ЕСТЬNULL(ВложенныйЗапрос.ОкончаниеСтроительства, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА 0
	|		ИНАЧЕ УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Сумма
	|	КОНЕЦ КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.ОбъектСтроительства.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.СтатьяДвиженияДенежныхСредств.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата >= ЕСТЬNULL(ВложенныйЗапрос.НачалоСтроительства, ДАТАВРЕМЯ(2999, 1, 1))
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата <= ЕСТЬNULL(ВложенныйЗапрос.ОкончаниеСтроительства, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА 0
	|		ИНАЧЕ УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Сумма * &Курс
	|	КОНЕЦ КАК СуммаРегл,
	|	ВЫБОР
	|		КОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.ОбъектСтроительства.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.СтатьяДвиженияДенежныхСредств.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата >= ЕСТЬNULL(ВложенныйЗапрос.НачалоСтроительства, ДАТАВРЕМЯ(2999, 1, 1))
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата <= ЕСТЬNULL(ВложенныйЗапрос.ОкончаниеСтроительства, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ * &КурсУпр КАК Сумма214,
	|	ВЫБОР
	|		КОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.ОбъектСтроительства.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.СтатьяДвиженияДенежныхСредств.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата >= ЕСТЬNULL(ВложенныйЗапрос.НачалоСтроительства, ДАТАВРЕМЯ(2999, 1, 1))
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата <= ЕСТЬNULL(ВложенныйЗапрос.ОкончаниеСтроительства, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Сумма
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма214Вал,
	|	ВЫБОР
	|		КОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.ОбъектСтроительства.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.СтатьяДвиженияДенежныхСредств.УСОERP_214ФЗ
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата >= ЕСТЬNULL(ВложенныйЗапрос.НачалоСтроительства, ДАТАВРЕМЯ(2999, 1, 1))
	|				И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Дата <= ЕСТЬNULL(ВложенныйЗапрос.ОкончаниеСтроительства, ДАТАВРЕМЯ(1, 1, 1))
	|			ТОГДА УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Сумма * &Курс
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма214Регл
	|ИЗ
	|	Документ.УСОERP_ВводОстатковДСПоОбъектамСтроительства.ОбъектыСтроительства КАК УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			УСОERP_СценарииПланированияПроектовСтроительства.Владелец КАК Владелец,
	|			УСОERP_СценарииПланированияПроектовСтроительства.Организация КАК Организация,
	|			УСОERP_СценарииПланированияПроектовСтроительства.НачалоСтроительства КАК НачалоСтроительства,
	|			УСОERP_СценарииПланированияПроектовСтроительства.ОкончаниеСтроительства КАК ОкончаниеСтроительства
	|		ИЗ
	|			Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
	|		ГДЕ
	|			УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий)
	|			И НЕ УСОERP_СценарииПланированияПроектовСтроительства.ПометкаУдаления
	|			И УСОERP_СценарииПланированияПроектовСтроительства.НомерВерсии = 0) КАК ВложенныйЗапрос
	|		ПО УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.ОбъектСтроительства = ВложенныйЗапрос.Владелец
	|			И УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка.Организация = ВложенныйЗапрос.Организация
	|ГДЕ
	|	УСОERP_ВводОстатковДСПоОбъектамСтроительстваОбъектыСтроительства.Ссылка = &Ссылка	
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|";  
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

#Область Отчеты
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	
КонецПроцедуры

#КонецОбласти


#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПолучателейПечатныхФорм(СтруктураДанныхОбъектаПечати) Экспорт
		
КонецПроцедуры

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт

	МассивДоступныхПечатныхФорм = Новый Массив;
		
	Возврат МассивДоступныхПечатныхФорм

КонецФункции

#КонецОбласти 

#КонецОбласти


#КонецЕсли