ВЫБРАТЬ
	Т.Номенклатура КАК Номенклатура,
	Т.Ссылка КАК Документ,
	Т.Ссылка.Дата КАК Дата,
	СУММА(Т.Количество) КАК Количество,
	СУММА(ВЫБОР
			КОГДА Т.Ссылка.СуммаВключаетНДС
				ТОГДА Т.Сумма - Т.СуммаНДС
			ИНАЧЕ Т.Сумма
		КОНЕЦ) КАК СуммаБезНДС,
	СУММА(ВЫБОР
			КОГДА Т.Ссылка.СуммаВключаетНДС
				ТОГДА Т.Сумма
			ИНАЧЕ Т.Сумма + Т.СуммаНДС
		КОНЕЦ) КАК СуммаСНДС
ПОМЕСТИТЬ ВТ_СтрокиПТУ
ИЗ
	Документ.ПоступлениеТоваровУслуг.Товары КАК Т
ГДЕ
	Т.Ссылка.Проведен
	И Т.Номенклатура В (&Номенклатура)
	И Т.Ссылка.Склад.Подразделение = &ПодразделениеЗакупки
	И Т.Ссылка.Дата <= &НаДату

СГРУППИРОВАТЬ ПО
	Т.Номенклатура,
	Т.Ссылка,
	Т.Ссылка.Дата
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Стр.Номенклатура КАК Номенклатура,
	МАКСИМУМ(Стр.Дата) КАК Дата
ПОМЕСТИТЬ ВТ_Последние
ИЗ
	ВТ_СтрокиПТУ КАК Стр
ГДЕ
	Стр.Количество > 0

СГРУППИРОВАТЬ ПО
	Стр.Номенклатура
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Стр.Номенклатура КАК Номенклатура,
	МАКСИМУМ(Стр.Документ) КАК Документ,
	СУММА(Стр.Количество) КАК Количество,
	СУММА(Стр.СуммаБезНДС) КАК СуммаБезНДС,
	СУММА(Стр.СуммаСНДС) КАК СуммаСНДС
ИЗ
	ВТ_СтрокиПТУ КАК Стр
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Последние КАК Посл
		ПО Стр.Номенклатура = Посл.Номенклатура
			И Стр.Дата = Посл.Дата
ГДЕ
	Стр.Количество > 0

СГРУППИРОВАТЬ ПО
	Стр.Номенклатура
