ВЫБРАТЬ
	Компл.Ссылка КАК СС,
	Компл.НомерСтроки КАК НомерСтроки,
	Компл.Этап КАК Этап,
	Компл.НоменклатураСС КАК НоменклатураСС,
	Компл.ОбщееНазвание КАК ОбщееНазвание,
	Компл.Количество КАК Количество,
	Компл.ЕдиницаСС КАК ЕдиницаСС,
	Компл.Единица КАК Единица,
	Компл.КоличествоСС_Оригинал КАК КоличествоСС_Оригинал,
	Компл.ЕдиницаСС_Оригинал КАК ЕдиницаСС_Оригинал,
	Компл.Сумма КАК Сумма,
	Компл.ДобавленоВручную КАК ДобавленоВручную
ПОМЕСТИТЬ ВТ_Позиции
ИЗ
	Справочник.СтруктураСебестоимости.Комплектующие КАК Компл
ГДЕ
	Компл.Ссылка = &СС
ИНДЕКСИРОВАТЬ ПО
	ОбщееНазвание
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Ном.ОбщееНазваниеНоменклатуры КАК ОбщееНазвание,
	Ном.Ссылка КАК Номенклатура
ПОМЕСТИТЬ ВТ_КарточкиОН
ИЗ
	Справочник.Номенклатура КАК Ном
ГДЕ
	НЕ Ном.ПометкаУдаления
	И НЕ Ном.ЭтоГруппа
	И Ном.ОбщееНазваниеНоменклатуры В
			(ВЫБРАТЬ РАЗЛИЧНЫЕ
				Поз.ОбщееНазвание
			ИЗ
				ВТ_Позиции КАК Поз
			ГДЕ
				Поз.ОбщееНазвание <> ЗНАЧЕНИЕ(Справочник.ОбщиеНазванияНоменклатуры.ПустаяСсылка))
ИНДЕКСИРОВАТЬ ПО
	ОбщееНазвание,
	Номенклатура
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Скл.Ссылка КАК Склад,
	Скл.Подразделение КАК Дом
ПОМЕСТИТЬ ВТ_СкладыДомов
ИЗ
	Справочник.Склады КАК Скл
ГДЕ
	Скл.Подразделение.Родитель = &ПодразделениеОбъекта
	И Скл.Подразделение <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
ИНДЕКСИРОВАТЬ ПО
	Склад
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ПС.Ссылка КАК Счет
ПОМЕСТИТЬ ВТ_СчетаЗапасов
ИЗ
	ПланСчетов.Хозрасчетный КАК ПС
ГДЕ
	ПС.Код В ("20", "22", "28")
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	ВЫРАЗИТЬ(Обор.Субконто1 КАК Справочник.Номенклатура) КАК Номенклатура,
	СклД.Дом КАК Дом,
	СУММА(Обор.КоличествоОборотКт) КАК Количество,
	СУММА(Обор.СуммаОборотКт) КАК Сумма
ПОМЕСТИТЬ ВТ_СписаноНаДома
ИЗ
	РегистрБухгалтерии.Хозрасчетный.Обороты(
			,
			,
			,
			Счет В ИЕРАРХИИ
				(ВЫБРАТЬ
					СЗ.Счет
				ИЗ
					ВТ_СчетаЗапасов КАК СЗ),
			&ВидыСубконто,
			,
			НЕ КорСчет В ИЕРАРХИИ
					(ВЫБРАТЬ
						СЗ.Счет
					ИЗ
						ВТ_СчетаЗапасов КАК СЗ),
			) КАК Обор
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СкладыДомов КАК СклД
		ПО Обор.Субконто2 = СклД.Склад
ГДЕ
	(Обор.КоличествоОборотКт <> 0
			ИЛИ Обор.СуммаОборотКт <> 0)
СГРУППИРОВАТЬ ПО
	ВЫРАЗИТЬ(Обор.Субконто1 КАК Справочник.Номенклатура),
	СклД.Дом
ИНДЕКСИРОВАТЬ ПО
	Номенклатура
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	КарОН.ОбщееНазвание КАК ОбщееНазвание,
	КарОН.Номенклатура КАК Номенклатура,
	СУММА(Спис.Количество) КАК Количество,
	СУММА(Спис.Сумма) КАК Сумма,
	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Спис.Дом) КАК ДомовСФактом
ПОМЕСТИТЬ ВТ_ФактКарточекОН
ИЗ
	ВТ_КарточкиОН КАК КарОН
		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СписаноНаДома КАК Спис
		ПО КарОН.Номенклатура = Спис.Номенклатура
СГРУППИРОВАТЬ ПО
	КарОН.ОбщееНазвание,
	КарОН.Номенклатура
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	КарОН.ОбщееНазвание КАК ОбщееНазвание,
	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КарОН.Номенклатура) КАК КарточекОН,
	МАКСИМУМ(КарОН.Номенклатура) КАК ЕдинственнаяКарточка
ПОМЕСТИТЬ ВТ_ИтогОН
ИЗ
	ВТ_КарточкиОН КАК КарОН
СГРУППИРОВАТЬ ПО
	КарОН.ОбщееНазвание
ИНДЕКСИРОВАТЬ ПО
	ОбщееНазвание
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Факт.ОбщееНазвание КАК ОбщееНазвание,
	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Факт.Номенклатура) КАК КарточекСФактом,
	МАКСИМУМ(Факт.Номенклатура) КАК КарточкаФакта
ПОМЕСТИТЬ ВТ_ИтогФактаОН
ИЗ
	ВТ_ФактКарточекОН КАК Факт
СГРУППИРОВАТЬ ПО
	Факт.ОбщееНазвание
ИНДЕКСИРОВАТЬ ПО
	ОбщееНазвание
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Поз.ОбщееНазвание КАК ОбщееНазвание,
	КОЛИЧЕСТВО(Поз.НомерСтроки) КАК НенулевыхПозицийОН
ПОМЕСТИТЬ ВТ_ПозицийОН
ИЗ
	ВТ_Позиции КАК Поз
ГДЕ
	Поз.Количество <> 0
СГРУППИРОВАТЬ ПО
	Поз.ОбщееНазвание
ИНДЕКСИРОВАТЬ ПО
	ОбщееНазвание
;

////////////////////////////////////////////////////////////////////////////////
ВЫБРАТЬ
	Поз.НомерСтроки КАК НомерСтроки,
	Поз.Этап КАК Этап,
	Поз.НоменклатураСС КАК НоменклатураСС,
	Поз.ОбщееНазвание КАК ОбщееНазвание,
	Поз.Количество КАК Количество,
	Поз.ЕдиницаСС КАК ЕдиницаСС,
	Поз.Единица КАК Единица,
	Поз.КоличествоСС_Оригинал КАК КоличествоСС_Оригинал,
	Поз.ЕдиницаСС_Оригинал КАК ЕдиницаСС_Оригинал,
	Поз.Сумма КАК Сумма,
	ЕСТЬNULL(ИтогОН.КарточекОН, 0) КАК КарточекОН,
	ИтогОН.ЕдинственнаяКарточка КАК ЕдинственнаяКарточка,
	ЕСТЬNULL(ИтогФакта.КарточекСФактом, 0) КАК КарточекСФактом,
	ИтогФакта.КарточкаФакта КАК КарточкаФакта,
	ЕСТЬNULL(ПозОН.НенулевыхПозицийОН, 0) КАК НенулевыхПозицийОН
ИЗ
	ВТ_Позиции КАК Поз
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогОН КАК ИтогОН
		ПО Поз.ОбщееНазвание = ИтогОН.ОбщееНазвание
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИтогФактаОН КАК ИтогФакта
		ПО Поз.ОбщееНазвание = ИтогФакта.ОбщееНазвание
		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицийОН КАК ПозОН
		ПО Поз.ОбщееНазвание = ПозОН.ОбщееНазвание
УПОРЯДОЧИТЬ ПО
	НомерСтроки
