
//	ЭлементыДеревоЗначений	- ДеревоЗначений 	- дерево значений на форме, с отбираемыми элементами, для операций.
//	Действие				- СписокЗначений	- состоящий из имен команд, которые определяют запуск операции над объектом.

//	(!) Разделение, объектов для операции, по типам документов.
//	Пример! При переносе раздела с вложенными позициями, в ту же локальную смету, необходимо обработать только раздел.
//			Т.к. позиции остаются принадлежать, той же локальной смете и тому же родителю.
//	Пример! При перерасчете документа, необходимо получить все "ЛокальнаяСмета".
//	Пример! Часто необходимо получить, отмеченные элементы, только с типом значения "ДокументСсылка.СМ_ПозицияЛокальнойСметы".

//	Параметры.
//	ПринадлежатОднойСводнойСмете, ПринадлежатОднойОбъектнойСмете, ПринадлежатОднойЛокальнойСмете, ПринадлежатОдномуРазделу
//	* Пример! После выборки отмеченных элементов, проверяем массив с "ЛокальныеСметы" и если он состоит из одной локальной сметы, значит отмеченные принадлежат одной локальной смете.

//	Действие.
//	Команда, добавлена на форме, имя, которой состоит из параметров:
//		1. "ТипОбластиОбработки"
//		2. "ТипОбрабатываемогоДокумента"
//		3. "ИндексГруппы"
//		4. "ПорядковыйНомер"
//		5. "НаименованиеОперации"
//	Имя команды раскладываем в массив, таким образом получаем параметры.
//	* Процедура команды, работает по принципу:
//			1. Проверили возможность выполнения данной команды (проверка соблюдения условий).
//			   (!) при проверке, получаем "ОбъектыДляОперации".
//			2. Выполняем обработку команды, в конструкции "Если", в случае успешного завершения, можем выполнить дополнительные действия.
//			3. Сообщаем о завершение операции, над выбранными объектами.

#Область СобытияФормы

//	При создании формы на сервере заполняем поле Действие возможными командами.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Заполнить параметры обработки.
	УстановитьПараметрыНаСервере(Параметры.ТекущийДокумент);
	
	// (!) ДЛЯ ПРОГРАММИСТА (что бы во время разработки, были видны элементы, а во время запуска - не видны).
	Элементы.ГруппаЛегендаДеревоЗначений.Видимость			= Ложь;
	Элементы.ГруппаРесурсыИнформационноеСообщение.Видимость	= Ложь;
	
	//
	СписокЗапрещенныхДействийСПривязаннымиПозициями = "РАСЦЕНКИ_Копировать,РАСЦЕНКИ_ПереместитьВРаздел";
	
КонецПроцедуры //Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоУмолчаниюДействие = ?(ЗначениеЗаполнено(Параметры.ПоУмолчаниюДействие), Параметры.ПоУмолчаниюДействие, "Перенести");
	//	ПоУмолчаниюДействие
	ДокументПриИзмененииНаКлиенте(Параметры.ТекущийДокумент, ПоУмолчаниюДействие);
	
	//	Документ
	Если ЗначениеЗаполнено(Параметры.ТекущийДокумент) Тогда
		
		//
		Если ТипЗнч(Параметры.ТекущийДокумент) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
			ПоказатьПредупреждение(, НСтр("ru='В стадии разработки!';"));
			Отказ	= Истина;
			Возврат;
		КонецЕсли;
	
		//
		// Если ТипЗнч(Параметры.ТекущийДокумент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
		//	И Параметры.ЕстьАктыВыполненныхРабот Тогда
		//	ПоказатьПредупреждение(, НСтр("ru='Обработка запрещена! По локальной смете, имеются акты выполненных работ.';"));
		//	Отказ	= Истина;
		//	Возврат;
		// КонецЕсли;
	
		//	Выполнить событие, после изменения выбранного документа.
		ДокументОбработкаВыбора(Элементы.Документ, Параметры.ТекущийДокумент, Ложь,ПоУмолчаниюДействие);
	
	КонецЕсли;
	
	//	ТекущийЭлемент
	Если ЗначениеЗаполнено(Параметры.ТекущийДокумент)
		И ЗначениеЗаполнено(Параметры.ТекущийЭлемент) Тогда
		
		//	развернуть ветки дерева значений
		СтрокаДерева = Новый Структура("ТекущийЭлемент, ОткрытыеЭлементы",Параметры.ТекущийЭлемент,Новый Структура("СписокРазвернутых", Новый СписокЗначений));
		СМ_СметныйСоставКлиент.ВосстановитьТекущийЭлемент(Элементы.ЭлементыДеревоЗначений, ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЭлементыДеревоЗначений, СтрокаДерева);
		
		//	отметить текущий элемент
		Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.Пометка = Истина;
		
		//	отметить вложенные элементы
		УстановитьСнятьПометкаРебенокНаКлиенте(Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.ПолучитьЭлементы(), Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Источник = "AddIn.Base" Тогда
		Если Событие = "SelectRasc"+ИдФормы Тогда
			
			//
			КомандаРесурсыЗаменитьПлюсМинусИзВБНаКлиенте(Данные);
			
			//
			ИдФормы = ИдФормы + 1;

		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//	Применить отбор.
	Если ИмяСобытия = "ОбновлениеНастроекОтбора" Тогда
		
		КомандаИмя			= ПолучитьКомандаИмяНаКлиенте(Действие);
		ПараметрыКоманды	= ПолучитьПараметрыКомандыНаКлиенте(Команды[КомандаИмя]);
	
		//	отмечаем элементы, по отбору
		УстановитьСнятьПометкаОтборНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), Источник, Параметр);
		
		ОтобратьОтмеченныеЭлементыНаКлиенте();
		//	заполняем табличные части
		ЗаполнитьТабличныеЧастиНаКлиенте(ПараметрыКоманды);
		
	КонецЕсли;
	
	//	Применить настройки.
	Если ИмяСобытия = "НастройкиСохранение" Тогда
		
		Для Каждого КлючИЗначение Из Параметр Цикл
			Если Параметры.Свойство(КлючИЗначение.Ключ) Тогда
				Параметры[КлючИЗначение.Ключ]	 = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если Параметр.Свойство("АвтоматическиОбновлятьТабличнуюЧасть") Тогда
			Если Параметр.АвтоматическиОбновлятьТабличнуюЧасть Тогда
				
				ЗаполнитьТабличныеЧастиНаКлиенте();
				
				ОтобразитьИнформационноеСообщениеНаКлиенте(Ложь);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

&НаКлиенте
Процедура ПриЗакрытии()
	
	СписокДействий = Новый Массив;
	// Судариков: без этого не работает.
	СписокДействий.Добавить("ПеренумероватьДерево");
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СписокДействий"	, СписокДействий);
	СтруктураПараметров.Вставить("НовыйОбъект"		, Неопределено);
	СтруктураПараметров.Вставить("Смета"			, ЭтаФорма.Документ);
	
	Оповестить("ОбновитьДеревоСметы", СтруктураПараметров); 
	
КонецПроцедуры //Процедура ПриЗакрытии()

#КонецОбласти //#Область СобытияФормы

#Область СобытияЭлементовФормы

// При выборе Акта, Сметы обновляем дерево.

&НаКлиенте
Процедура ДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ПоУмолчаниюДействие = "")
	
	ТекстПредупреждения	= НСтр("ru = 'Ошибка! Проверка условия доступности обработки выбора.'");
	
	Если НЕ СМ_ДоступнаОбработкаДокументаНаСервере(ВыбранноеЗначение, ТекстПредупреждения) тогда
		ПоказатьПредупреждение(, ТекстПредупреждения);
		СтандартнаяОбработка	= Ложь;
		Возврат;
	КонецЕсли;
	
	//	Обновить параметры расчета.
	Если НЕ ТипЗнч(ВыбранноеЗначение) = Тип("Тип")
		И ЗначениеЗаполнено(ВыбранноеЗначение) тогда	
		
		//	Установить параметры обработки.
		УстановитьПараметрыНаСервере(ВыбранноеЗначение);
		
		//	Скрыть/отобразить элементы формы.
		ДокументПриИзмененииНаКлиенте(ВыбранноеЗначение,ПоУмолчаниюДействие);
		
		//	Заполнить дерево значений.
		ДеревоЗначенийОбновитьНаКлиенте(Новый Структура("Документ", ВыбранноеЗначение));
		
		//	Создать сводные таблицы значений, по табличным частям документов.
		СоздатьЗаполнитьТаблицыЗначенийНаСервере(ВыбранноеЗначение);
		
		//	Добавить строки в отобранные "Ресурсы", "Поправки", "Начисления", "Индексы", "Свойства".
		ЗаполнитьТабличныеЧастиНаКлиенте(ВыбранноеЗначение);
		
		//	Установить тип выбранного документа.
		Элементы.Документ.Заголовок	= ПолучитьЭлементыДокументЗаголовок(ВыбранноеЗначение);
		
		//	Установить выбранное значение, на случай, если выполняем процедуру не как событие.
		Если НЕ СтандартнаяОбработка Тогда
			Документ	= ВыбранноеЗначение;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //Процедура ДокументОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

&НаКлиенте
Процедура ДокументОчистка(Элемент, СтандартнаяОбработка)
	
	КомандаИмя				= ПолучитьКомандаИмяНаКлиенте(Действие);
	Если ПустаяСтрока(КомандаИмя) Тогда
		Возврат;
	КонецЕсли;
	ПараметрыКоманды		= ПолучитьПараметрыКомандыНаКлиенте(Команды[КомандаИмя]);
	
	//	очистить дерево значений
	ЭлементыДеревоЗначений.ПолучитьЭлементы().Очистить();
	
	//	очистить табличные части
	ТабличнаяЧастьРесурсы.Очистить();
	ТабличнаяЧастьПоправки.Очистить();
	ТабличнаяЧастьНачисления.Очистить();
	ТабличнаяЧастьИндексы.Очистить();
	
	//	вывести/скрыть сообщение о пустой табличной части
	РесурсыОтобразитьПустуюТаблицуНаКлиенте();	
	ПоправкиОтобразитьПустуюТаблицуНаКлиенте(ПараметрыКоманды);
	НачисленияОтобразитьПустуюТаблицуНаКлиенте();
	ИндексыОтобразитьПустуюТаблицуНаКлиенте();
	СвойстваОтобразитьПустуюТаблицуНаКлиенте();
	
	//	очистить параметры
	
КонецПроцедуры //Процедура ДокументОчистка(Элемент, СтандартнаяОбработка)


&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	КомандаИмя	= ПолучитьКомандаИмяНаКлиенте(Действие);	
	ПараметрыКоманды	= ПолучитьПараметрыКомандыНаКлиенте(Новый Структура("Имя", КомандаИмя));
	//	Видимость/доступность элементов на форме
	УстановитьВидимостьДоступностьЭлементовНаКлиенте(ПараметрыКоманды);
	
	ОтобратьОтмеченныеЭлементыНаКлиенте();
КонецПроцедуры //Процедура ДействиеПриИзменении(Элемент)

&НаКлиенте
Процедура СОбнулениемПриИзменении(Элемент)
	
	//
	Для Каждого Строка Из ТабличнаяЧастьРесурсы Цикл
		
		//
		Строка.Модифицированность	= 	СОбнулением
										ИЛИ НЕ (Строка.ЦенаБазисная = Строка.СтараяЦенаБазисная)
										ИЛИ НЕ (Строка.ЦенаБазиснаяЗМ = Строка.СтараяЦенаБазиснаяЗМ)
										ИЛИ НЕ (Строка.ЦенаТекущая = Строка.СтараяЦенаТекущая)
										ИЛИ НЕ (Строка.ЦенаТекущаяЗМ = Строка.СтараяЦенаТекущаяЗМ);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбластьОбработкиПриИзменении(Элемент)
	
	//
	ОтобразитьИнформационноеСообщениеНаКлиенте(Ложь);
	
	//	Отображение элементов на форме, в зависимости от выбранной области обработки.
	ДокументПриИзмененииНаКлиенте(Документ);
	
	//	Заполнить табличную часть.
	ЗаполнитьТабличныеЧастиНаКлиенте();
	
КонецПроцедуры //Процедура  ОбластьОбработкиПриИзменении(Элемент)

//	ДЕРЕВО ЗНАЧЕНИЙ

#Область ДеревоЗначений

&НаКлиенте
Процедура ЭлементыДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
		
	ПараметрыОткрытия		= Новый Структура();
	ТекущийДокумент			= Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.Элемент;

	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") тогда
		
		// Если Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.СтатусРедактирования = 2 Тогда
		//	Возврат;
		// КонецЕсли;
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") тогда
			
			ДокументФорма		= "Документ.СМ_ПозицияЛокальнойСметы.ФормаОбъекта";
			ПараметрыОткрытия	= Новый Структура("Ключ, ПозицияАкта, Акт", ТекущийДокумент, Истина, Документ);
			ПараметрыОткрытия.Вставить("ЕстьАкт",Истина);
			ПараметрыОткрытия.Вставить("СтатусРедактирования",Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.СтатусРедактирования);
			
		Иначе
			
			ДокументФорма		= "Документ.СМ_ПозицияЛокальнойСметы.ФормаОбъекта";
			ПараметрыОткрытия	= Новый Структура("Ключ", ТекущийДокумент);
			ПараметрыОткрытия.Вставить("ЕстьАкт",Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.СтатусРедактирования>0);
			ПараметрыОткрытия.Вставить("СтатусРедактирования",Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.СтатусРедактирования);
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") тогда
		
		ДокументФорма		= "Документ.СМ_РазделЛокальнойСметы.ФормаОбъекта";
		ПараметрыОткрытия	= Новый Структура("Ключ", ТекущийДокумент);
		
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") тогда
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") тогда
		
			ДокументФорма		= "Документ.СМ_АктВыполненныхРабот.ФормаОбъекта";
			ПараметрыОткрытия	= Новый Структура("Ключ", Документ);
			
		Иначе
		
			ДокументФорма		= "Документ.СМ_ЛокальнаяСмета.ФормаОбъекта";
			ПараметрыОткрытия	= Новый Структура("Ключ", ТекущийДокумент);
		
		КонецЕсли;
	
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") тогда
		
		ДокументФорма		= "Документ.СМ_ОбъектнаяСмета.ФормаОбъекта";
		ПараметрыОткрытия	= Новый Структура("Ключ", ТекущийДокумент);
		
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_СводнаяСмета") тогда
		
		ДокументФорма		= "Документ.СМ_СводнаяСмета.ФормаОбъекта";
		ПараметрыОткрытия	= Новый Структура("Ключ", ТекущийДокумент);
		
	КонецЕсли;	
	
	//
	Если ПараметрыОткрытия.Количество() тогда
		ОткрытьФорму(ДокументФорма, ПараметрыОткрытия, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Ошибка открытия, формы документа!'"));	
	КонецЕсли;
	
КонецПроцедуры //Процедура ЭлементыДеревоЗначенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

&НаКлиенте
Процедура ЭлементыДеревоЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	//
	тест = "тест";
	
	Отказ	= Истина;
	
КонецПроцедуры //Процедура ЭлементыДеревоЗначенийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

&НаКлиенте
Процедура ЭлементыДеревоЗначенийПередУдалением(Элемент, Отказ)
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Новый Структура("Имя", "Удаление"), Элемент.ВыделенныеСтроки) тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаУдалитьНаСервере(Параметры["Операция"]) Тогда
		
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

	КонецЕсли;
	
КонецПроцедуры //Процедура ЭлементыДеревоЗначенийПередУдалением(Элемент, Отказ)

&НаКлиенте
Процедура ЭлементыДеревоЗначенийНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	//
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		Выполнение	= Ложь;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыДеревоЗначенийПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	//
	СтандартнаяОбработка	= Ложь;
	
	//
	СтрокаДереваПриемник	= ЭлементыДеревоЗначений.НайтиПоИдентификатору(Строка);
			
	//
	Если ПараметрыПеретаскивания["Действие"] = ДействиеПеретаскивания.Перемещение Тогда
		
		//	проверка
		Если НЕ СМ_ДоступнаОбработкаНаКлиенте(Новый Структура("Имя", "Перетаскивание"),, ПараметрыПеретаскивания.Значение) тогда
			Возврат;
		КонецЕсли;

		ПараметрыКоманды	= Новый Структура();
		ПараметрыКоманды.Вставить("ТекущаяСмета"		, Документ);
		ПараметрыКоманды.Вставить("КомандаИмя"			, "Перетаскивание");
		
		//	выполнить команду "перенести"
		КомандаРасценкиПеренестиОповещениеНаКлиенте(СтрокаДереваПриемник.Элемент, ПараметрыКоманды);

	ИначеЕсли ПараметрыПеретаскивания["Действие"] = ДействиеПеретаскивания.Копирование Тогда
	
	КонецЕсли;
	
КонецПроцедуры //Процедура ЭлементыДеревоЗначенийПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)

&НаКлиенте
Процедура ЭлементыДеревоЗначенийПометкаПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.ЭлементыДеревоЗначений.ТекущиеДанные;
	КомандаИмя			= ПолучитьКомандаИмяНаКлиенте(Действие);
	ПараметрыКоманды	= ПолучитьПараметрыКомандыНаКлиенте(Команды[КомандаИмя]);
	
	//	Создаем симуляцию обычного флажка (три состояния - нужны, для отображения выделения не полной ветки дерева).
	ТекущиеДанные.Пометка	= ?(ТекущиеДанные.Пометка = 2, 0, ?(ТекущиеДанные.Пометка = 0, 1, ТекущиеДанные.Пометка));
	
	//	Отмечаем вложенные элементы и добавляем их в отбор строк, для табличных частей.
	УстановитьСнятьПометкаНаКлиенте(ТекущиеДанные, ТекущиеДанные.Пометка);
	
	//	Формируем списки обрабатываемых элементов, в некоторых случаях необходимо дополнительно обрабатывать не отмеченные элементы.
	ОтобратьОтмеченныеЭлементыНаКлиенте();
	
	//	Заполнить табличные части (сводные).
	ОтобразитьТабличныеЧастиНаКлиенте();
	
КонецПроцедуры //Процедура ЭлементыДеревоЗначенийПометкаПриИзменении(Элемент)

#КонецОбласти //#Область ДеревоЗначений/#Область СобытияЭлементовФормы

//	ТАБЛИЧНЫЕ ЧАСТИ

&НаКлиенте
Процедура ДекорацияСообщениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	//
	СтандартнаяОбработка	= Ложь;
	
	//
	ЗаполнитьТабличныеЧастиНаКлиенте();
	
	//
	РесурсыОтобразитьПустуюТаблицуНаКлиенте();
	
	//
	ОтобразитьИнформационноеСообщениеНаКлиенте(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНастройкиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	//
	СтандартнаяОбработка	= Ложь;
	
	//
	ОткрытьФорму("ВнешняяОбработка.СМ_ГрупповаяОбработкаПозиций.Форма.Настройки", Новый Структура("АвтоматическиОбновлятьТабличнуюЧасть", Параметры.АвтоматическиОбновлятьТабличнуюЧасть));
	
КонецПроцедуры

#Область Ресурсы

&НаКлиенте
Процедура тзРесурсыЦенаБазиснаяПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзРесурсы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ЦенаБазисная = ТекущиеДанные.ЦенаБазиснаяСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзРесурсыЦенаБазиснаяЗМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзРесурсы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ЦенаЗМБазисная = ТекущиеДанные.ЦенаЗМБазиснаяСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзРесурсыЦенаТекущаяПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзРесурсы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ЦенаТекущая = ТекущиеДанные.ЦенаТекущаяСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзРесурсыЦенаТекущаяЗМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзРесурсы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ЦенаТекущаяЗМ = ТекущиеДанные.ЦенаТекущаяЗМСтарая);
	
КонецПроцедуры

#КонецОбласти //#Область Ресурсы/#Область СобытияЭлементовФормы

#Область Поправки

&НаКлиенте
Процедура тзПоправкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.тзПоправки.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.ЭтоНоваяСтрока = НоваяСтрока;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиПрименитьПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.Применить = ТекущиеДанные.ПрименитьСтарая);
	ТекущиеДанные.ПрименитьЧисло		= ?(НЕ (ТекущиеДанные.Применить = ТекущиеДанные.ПрименитьСтарая),
											?(ТекущиеДанные.Применить, 1, -1),
											0);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиКоэффПЗПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффПЗ = ТекущиеДанные.КоэффПЗСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиКоэффОЗПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффОЗ = ТекущиеДанные.КоэффОЗСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиКоэффЭМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффЭМ = ТекущиеДанные.КоэффЭМСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиКоэффЗМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффЗМ = ТекущиеДанные.КоэффЗМСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиКоэффСМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффСМ = ТекущиеДанные.КоэффСМСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиКоэффТРПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффТР = ТекущиеДанные.КоэффТРСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиКоэффТМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффТМ = ТекущиеДанные.КоэффТМСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиВариантРасчетаПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ВариантРасчета = ТекущиеДанные.ВариантРасчетаСтарая);

КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиДобавПЗПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ДобавПЗ = ТекущиеДанные.ДобавПЗСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиДобавОЗПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ДобавОЗ = ТекущиеДанные.ДобавОЗСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиДобавЭМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ДобавЭМ = ТекущиеДанные.ДобавЭМСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиДобавЗМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ДобавЗМ = ТекущиеДанные.ДобавЗМСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиДобавСМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ДобавСМ = ТекущиеДанные.ДобавСМСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиДобавТРПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ДобавТР = ТекущиеДанные.ДобавТРСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзПоправкиДобавТМПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзПоправки.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.ДобавТМ = ТекущиеДанные.ДобавТМСтарая);
	
КонецПроцедуры

#КонецОбласти //#Область Поправки/#Область СобытияЭлементовФормы

#Область Индексы

&НаКлиенте
Процедура тзИндексыКоэффОборудПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзИндексы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффОборуд = ТекущиеДанные.КоэффОборудСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзИндексыКоэффПолнСтоимРаботПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзИндексы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффПолнСтоимРабот = ТекущиеДанные.КоэффПолнСтоимРаботСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзИндексыКоэффОснЗарплатыПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзИндексы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффОснЗарплаты = ТекущиеДанные.КоэффОснЗарплатыСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзИндексыКоэффСтоимЭксплМашинПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзИндексы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффСтоимЭксплМашин = ТекущиеДанные.КоэффСтоимЭксплМашинСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзИндексыКоэффСтоимЗарплатеМашинПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзИндексы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффСтоимЗарплатеМашин = ТекущиеДанные.КоэффСтоимЗарплатеМашинСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзИндексыКоэффСтоимМатериаловПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзИндексы.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.КоэффСтоимМатериалов = ТекущиеДанные.КоэффСтоимМатериаловСтарая);
	
КонецПроцедуры

#КонецОбласти //#Область Индексы

#Область Начисления

&НаКлиенте
Процедура тзНачисленияЗначениеПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзНачисления.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.Значение = ТекущиеДанные.ЗначениеСтарая);
	
КонецПроцедуры

&НаКлиенте
Процедура тзНачисленияФормулаПриИзменении(Элемент)
	
	//
	ТекущиеДанные		= Элементы.тзНачисления.ТекущиеДанные;
	
	//
	ТекущиеДанные.Пометка				= Истина;
	ТекущиеДанные.Модифицированность	= НЕ (ТекущиеДанные.Формула = ТекущиеДанные.ФормулаСтарая);
	
КонецПроцедуры

#КонецОбласти //#Область Начисления/#Область СобытияЭлементовФормы

#Область Свойства

&НаКлиенте
Процедура тзСвойстваТипЗначенияПриИзменении(Элемент)
	
	//
	ТекущиеДанные	= Элементы.тзСвойства.ТекущиеДанные;
	
	//
	Элементы.тзСвойстваЗначение.ОграничениеТипа = ТекущиеДанные.ТипЗначения;
	
КонецПроцедуры

#КонецОбласти //#Область Свойства

#КонецОбласти //#Область СобытияЭлементовФормы

#Область КомандыФормы

// Инициализируем выполнение команды.
//
&НаКлиенте
Процедура ВыполнитьКоманду(Команда)
	
	//	Получить имя команды, по выбранному действию.
	КомандаИмя	= ПолучитьКомандаИмяНаКлиенте(Действие);
	
	//	Получить команду.
	Команда		= Команды[КомандаИмя];
	
	//	Выполнить событие нажатия команды.
	Выполнить(Команда.Действие+"(Команды[""" + Команда.Имя + """], Истина)");
	
КонецПроцедуры //Процедура ВыполнитьКоманду(Команда)

&НаКлиенте
Процедура ДеревоЗначенийОбновить(Команда)
	
	//
	ДокументОбработкаВыбора(Элементы.Документ, Документ, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	//
	ОткрытьФорму("Обработка.СМ_ГрупповаяОбработкаПозиций.Форма.Настройки", Новый Структура("АвтоматическиОбновлятьТабличнуюЧасть", Параметры.АвтоматическиОбновлятьТабличнуюЧасть));
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтбор(Команда)
	
	ОткрытьФорму("Обработка.СМ_ГрупповаяОбработкаПозиций.Форма.ФормаНастроекОтбора",,ЭтаФорма);
	//ОткрытьФорму("ВнешняяОбработка.СМ_ГрупповаяОбработкаПозиций1.Форма.ФормаНастроекОтбора",,ЭтаФорма);
	
КонецПроцедуры

//	Команды отсортированы, в зависимости, от типа выбранного объекта.

#Область АктВыполненныхРабот

#Область РАСЦЕНКИ

//	Изменение процентования расценок на клиенте.
&НаКлиенте
Процедура РАСЦЕНКИ_АКТ_Процентовать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаПроцентоватьОповещениеНаКлиенте", ЭтотОбъект, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЧисла(ОписаниеОповещения, 0, НСтр("ru='Введите новый процент'"), 3, 0);
	
КонецПроцедуры //Процедура РАСЦЕНКИ_АКТ_Процентовать(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_АКТ_УстановитьОбъем(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	
	Оповещение = Новый ОписаниеОповещения("КомандаУстановитьОбъемОповещениеНаКлиенте", ЭтотОбъект, Новый Структура("ТипОбъекта, КомандаИмя", "АктВыполненныхРабот", Команда.Имя));
	
	//
	ПоказатьВводЧисла(Оповещение, 0, НСтр("ru='Введите объем'"), 12, 5);

КонецПроцедуры //Процедура РАСЦЕНКИ_АКТ_УстановитьОбъем(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_АКТ_УстановитьОбъемОбнулить(Команда, ВыполнитьКоманду = Ложь)
	
	// устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаУстановитьОбъемАктВыполненныхРаботНаСервере(Документ, 0) Тогда		
	
		// обновить дерево значений на форме
		ДеревоЗначенийОбновитьНаКлиенте();
		
		//
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		
		// сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура РАСЦЕНКИ_АКТ_УстановитьОбъемОбнулить(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_АКТ_НеИзменятьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	// Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
	//	Возврат;
	// КонецЕсли;
	
		//	установить значение	
	Если КомандаУстановитьНеИзменятьЦеныАктВыполненныхРаботНаСервере(Документ) Тогда
	
		//	снять отметки дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
			
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура РАСЦЕНКИ_АКТ_ИзменятьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
		//	установить значение	
	Если КомандаУстановитьНеИзменятьЦеныАктВыполненныхРаботНаСервере(Документ,Ложь) Тогда
	
		//	снять отметки дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
			
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура  РАСЦЕНКИ_АКТ_СтатусРесурсаАкт(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьСтатусРесурсаАктРасценка", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЗначения(ОписаниеОповещения, ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.ПустаяСсылка"), НСтр("ru='Выберите новый статус ресурса'")); 
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ИзменитьОпределители(Команда)  


#КонецОбласти //#Область РАСЦЕНКИ/#Область АктВыполненныхРабот/#Область КомандыФормы

#Область РЕСУРСЫ

&НаКлиенте
Процедура РЕСУРСЫ_АКТ_Заменить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	переменные процедуры
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ОбрабатываемыеРесурсы			= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ПараметрыОповещения 			= РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета, "Ресурсы");
	ПараметрыОткрытия				= РесурсыЗаменитьПолучитьПараметрыПоискаНаКлиенте(ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета);
	ОписаниеОповещения				= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);

	//
	ОткрытьФорму(	"Справочник.СМ_Ресурсы.Форма.ФормаВыбора",
					ПараметрыОткрытия,,,,,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры //Процедура РЕСУРСЫ_АКТ_Заменить(Команда, ВыполнитьКоманду = Ложь)

&НаКлиенте
Процедура РЕСУРСЫ_АКТ_РедактироватьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
		
	// подготовим таблицу
	Если КомандаРесурсыРедактироватьЦеныАктНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление цен в акте выполнено успешно!'"));
		
	КонецЕсли;
	
КонецПроцедуры //Процедура РЕСУРСЫ_АКТ_РедактироватьЦены(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_АКТ_Удалить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	
	Если КомандаРесурсыУдалитьАктВыполненныхРаботНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РЕСУРСЫ_АКТ_Удалить(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_АКТ_НеИзменятьЦену(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	// Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
	//	Возврат;
	// КонецЕсли;
	
	//	
	Если КомандаРесурсыАктНеИзменятьЦены() Тогда
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(Документ);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура РЕСУРСЫ_АКТ_ИзменятьЦену(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	//	
	Если КомандаРесурсыАктНеИзменятьЦены(Ложь) Тогда
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(Документ);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура РЕСУРСЫ_АКТ_СтатусРесурсаАкт(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьСтатусРесурсаАктТЧНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЗначения(ОписаниеОповещения, ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.ПустаяСсылка"), НСтр("ru='Выберите новый статус ресурса'")); 
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ИзменитьОпределители(Команда)  

#КонецОбласти //#Область РЕСУРСЫ/#Область АктВыполненныхРабот/#Область КомандыФормы

#Область ИНДЕКСЫ

&НаКлиенте
Процедура ИНДЕКСЫ_АКТ_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
		
	//
	Если КомандаИндексыРедактироватьНаСервере(Ложь) Тогда
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление индексов в позициях выполнено успешно!'"));
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИНДЕКСЫ_АКТ_Очистить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;

	//
	Если КомандаИндексыОчиститьНаСервере(Истина) Тогда
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Очистка индексов в позициях выполнено успешно!'"));
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти //#Область ИНДЕКСЫ/#Область АктВыполненныхРабот/#Область КомандыФормы

#Область СВОЙСТВА

&НаКлиенте
Процедура СВОЙСТВА_АКТ_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	// проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаСвойстваРедактироватьНаСервере() Тогда
		
		// сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура СВОЙСТВА_АКТ_Редактировать(Команда, ВыполнитьКоманду = Ложь)

&НаКлиенте
Процедура СВОЙСТВА_АКТ_Добавить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаСвойстваДобавитьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура СВОЙСТВА_АКТ_Добавить(Команда, ВыполнитьКоманду = Ложь)

#КонецОбласти //#Область СВОЙСТВА/#Область АктВыполненныхРабот/#Область КомандыФормы

#КонецОбласти //#Область АктВыполненныхРабот/#Область КомандыФормы

#Область ЛокальнаяСмета

#Область РАСЦЕНКИ

// Процедура вызова переноса позиции, раздела в другой раздел
// непосредственный перенос осуществляется в процедуре "ВыбралиНовогоРодителя".
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_Перенести(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаРасценкиПеренестиОповещениеНаКлиенте", ЭтаФорма, Новый Структура("ТекущаяСмета, КомандаИмя", Документ, Команда.Имя));
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ВключатьРазделы",Истина);
//	СтруктураОтбора.Вставить("АктивныйЭлемент",Документ); 
	СтруктураОтбора.Вставить("БезАктов", Истина);
	СтруктураОтбора.Вставить("ОтборСтройка",Истина);
	СтруктураОтбора.Вставить("ВключатьОС",Истина);
	СтруктураОтбора.Вставить("ВключатьСС",Истина);
	
	Если ЗначениеЗаполнено(ЭтаФорма.Стройка) Тогда
		СтруктураОтбора.Вставить("Стройка",ЭтаФорма.Стройка);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.СМ_ДеревоСметПростое.Форма",СтруктураОтбора,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_Перенести(Команда)

// Процедура копирования позиций.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_Копировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаКопироватьОповещениеНаКлиенте", ЭтаФорма, Новый Структура("Документ, КомандаИмя", Документ, Команда.Имя));
	
	//
	ОткрытьФорму(	"Обработка.СМ_ДеревоСметПростое.Форма",
					Новый Структура("ВключатьРазделы, АктивныйЭлемент, БезАктов, ОтборСтройка",
									ИСТИНА,
									Документ,
									Истина,
									Истина),
					ЭтаФорма,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	                 
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_Копировать(Команда)

// Удаляем выбранные элементы
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_Удалить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаУдалитьНаСервере(Параметры["Операция"]) Тогда
				
		//	обновить дерево значений.
		ДеревоЗначенийОбновитьНаКлиенте();
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_Удалить(Команда)


// Инициализируем отметку галочки Расчет в выбранных документах.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_РасчетИстина(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	установить значение реквизита (цикл)
	Если УстановитьРасчетНаСервере(Истина) Тогда
	
		//
		ДеревоЗначенийОбновитьНаКлиенте();
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_РасчетИстина(Команда)  

// Инициализируем снятие галки расчет в выбранных документах.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_РасчетЛожь(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	установить значение реквизита (цикл)
	Если УстановитьРасчетНаСервере(Ложь) Тогда
	
		//	Обновим дерево на форме.
		ДеревоЗначенийОбновитьНаКлиенте();
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_РасчетИстина(Команда)


// Инициализируем ввод базисных нормативов НР и СП.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_ЗадатьБазисныеНормативыНРиСП(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьНормативыНРиСПОповещениеНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ОткрытьФорму(	"Обработка.СМ_ГрупповаяОбработкаПозиций.Форма.ВводНРиСП",
					Новый Структура("Вид", "Базисные"),
					ЭтаФорма,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)

КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ЗадатьБазисныеНормативыНРиСП(Команда)       

// Инициализируем ввод текущих нормативов НР и СП.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_ЗадатьТекущиеНормативыНРиСП(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьНормативыНРиСПОповещениеНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	ОткрытьФорму(	"Обработка.СМ_ГрупповаяОбработкаПозиций.Форма.ВводНРиСП",
					Новый Структура("Вид", "Текущие"),
					ЭтаФорма,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ЗадатьТекущиеНормативыНРиСП(Команда)

// Инциализация обновления НР и СП
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_ОбновитьНРиСП(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	Отобрать, только те элементы, которые будут учавствовать в операции.
	ОтобратьОбрабатываемыеЭлементыНаКлиенте(Команда);
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ОбновитьНРиСП(Команда)


// Запускаем расчет расценок в позиции по базисным ценам.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_РассчитатьПоБазису(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	рассчитать стоимости по базисным ценам (Истина)
	Если КомандаРассчитатьСтоимостиНаСервере(Истина) Тогда
		
		//	снять отметки с элементов дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), Ложь);
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_РассчитатьПоБазису(Команда)

// Запускаем расчет расценок в позиции по текущим ценам.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_РассчитатьПоТек(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	рассчитать стоимости по текущим ценам (Ложь)
	Если КомандаРассчитатьСтоимостиНаСервере(Ложь) Тогда
		
		//	снять отметки с элементов дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), Ложь);
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_РассчитатьПоТек(Команда)


// Инициализируем обновление выбранных документов по нормативной базе.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_ОбновитьПоНормативнойБазе(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаОбновитьПоНормативнойБазеНаКлиенте() Тогда
	
		//	снять отметки дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ОбновитьПоНормативнойБазе(Команда)

// Инциализация  для добавления поправки 1.15 - 1.25.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_Поправка115(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	добавить строку, в табличную часть (если нет)
	Если КомандаПоправка115НаСервере() Тогда
	
		//	снять отметки дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
			
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_Поправка115(Команда)

// Инициализируем установку флага Не индексировать в выбранных документах.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_УстановитьНеИндексировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	установить значение	
	Если КомандаУстановитьНеИндексироватьНаСервере() Тогда
	
		//	снять отметки дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
			
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_УстановитьНеИндексировать(Команда)	 

//	ввод значений

// Инициализируем изменение объема в выбранных документах.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_ИзменитьОпределители(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьОпределительОповещениеНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЗначения(ОписаниеОповещения, ПредопределенноеЗначение("Справочник.СМ_Определители.ПустаяСсылка"), НСтр("ru='Выберите новый определитель позиций'")); 
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ИзменитьОпределители(Команда)  

// Инициализируем изменение объема в выбранных документах.
//
&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_УстановитьОбъем(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьОбъемОповещениеНаКлиенте", ЭтотОбъект, Новый Структура("ТипОбъекта, КомандаИмя", "ЛокальнаяСмета", Команда.Имя));
	
	//
	ПоказатьВводЧисла(ОписаниеОповещения, 0, НСтр("ru='Введите объем'"), 12, 5);

КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_УстановитьОбъем(Команда)      

&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_СохранитьВФрагменте(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаСохранитьВФрагментеОповещениеНаКлиенте", ЭтотОбъект, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводСтроки(ОписаниеОповещения, "", НСтр("ru='Введите наименование фрагмента'"), 150);
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_СохранитьВФрагменте(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_НеИзменятьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	// Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
	//	Возврат;
	// КонецЕсли;
	//
		//	установить значение	
	Если КомандаУстановитьНеИзменятьЦены() Тогда
	
		//	снять отметки дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
			
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_ИзменятьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	// Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
	//	Возврат;
	// КонецЕсли;
	//
		//	установить значение	
	Если КомандаУстановитьНеИзменятьЦены(Ложь) Тогда
	
		//	снять отметки дерева значений
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
			
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура РАСЦЕНКИ_ЛС_СтатусРесурса(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	// Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
	//	Возврат;
	// КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьСтатусРесурсаНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЗначения(ОписаниеОповещения, ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.ПустаяСсылка"), НСтр("ru='Выберите новый статус ресурса'")); 
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ИзменитьОпределители(Команда)  

#КонецОбласти //#Область РАСЦЕНКИ/#Область ЛокальнаяСмета/#Область КомандыФормы

#Область РЕСУРСЫ

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_Заменить(Команда, ВыполнитьКоманду = Ложь)
		
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	переменные процедуры
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ОбрабатываемыеРесурсы			= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ПараметрыОповещения 			= РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета, "Ресурсы");
	ПараметрыОткрытия				= РесурсыЗаменитьПолучитьПараметрыПоискаНаКлиенте(ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета);
	ОписаниеОповещения				= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);

	//
	ОткрытьФорму(	"Справочник.СМ_Ресурсы.Форма.ФормаВыбора",
					ПараметрыОткрытия,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

		
КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_Заменить(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_ЗаменитьНС(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ОбрабатываемыеРесурсы			= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ПараметрыОповещения 			= РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета, "НС");
	ОписаниеОповещения				= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
	
	ОткрытьФорму(	"Справочник.СМ_НормативныеСборники.Форма.ФормаВыбора",
					,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_ЗаменитьНС(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_ЗаменитьПлюсМинус(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//	переменные процедуры
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ОбрабатываемыеРесурсы			= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ПараметрыОповещения 			= РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета, "Ресурсы");
	ПараметрыОткрытия				= РесурсыЗаменитьПолучитьПараметрыПоискаНаКлиенте(ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета);
	ОписаниеОповещения				= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьПлюсМинусОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);

	ОткрытьФорму(	"Справочник.СМ_Ресурсы.Форма.ФормаВыбора",
					ПараметрыОткрытия,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_ЗаменитьПлюсМинус(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_ЗаменитьПлюсМинусИзВБ(Команда, ВыполнитьКоманду = Ложь, Идентификаторы = Неопределено)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	ПараметрыРасчета	= Новый Структура();
	
	//	Общая проверка.
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда, Идентификаторы, ПараметрыРасчета) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ИдФормы
		= СметнаяКомпонента.ПоказатьОкноТекущихЦен(	СокрЛП(ПараметрыРасчета.ФайлСборникаТекущихЦен),
													Строка(СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(ПараметрыРасчета.Район, "Код")),
													,
													,
													Истина,
													Ложь);	
	
КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_ЗаменитьПлюсМинусИзВБ(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_РедактироватьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	Проверить доступность обработки команды.
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
		
	//	Выполнить изменение цен ресурсов.
	Если КомандаРесурсыРедактироватьЦеныНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление цен в позициях выполнено успешно!'"));
		
	КонецЕсли;
	
КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_РедактироватьЦены(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_Удалить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаРесурсыУдалитьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_Удалить(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_НеИзменятьЦену(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	Проверить доступность обработки команды.
	// Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
	//	Возврат;
	// КонецЕсли;
		
	//	Выполнить изменение цен ресурсов.
	Если КомандаРесурсыНеИзменятьЦены() Тогда
		
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление статуса ""Не изменять текущие цены при обновлении"" выполнено успешно!'"));
		
		СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(Документ);
	КонецЕсли;
	
КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_РедактироватьЦены(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_ИзменятьЦену(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	Выполнить изменение цен ресурсов.
	Если КомандаРесурсыНеИзменятьЦены(Ложь) Тогда
		
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление статуса ""Не изменять текущие цены при обновлении"" выполнено успешно!'"));
		
		СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(Документ);
	КонецЕсли;
	
КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_РедактироватьЦены(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ЛС_СтатусРесурса(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	// Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
	//	Возврат;
	// КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьСтатусРесурсаТЧНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЗначения(ОписаниеОповещения, ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.ПустаяСсылка"), НСтр("ru='Выберите новый статус ресурса'")); 
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ИзменитьОпределители(Команда)  

#КонецОбласти //#Область РЕСУРСЫ/#Область ЛокальнаяСмета/#Область КомандыФормы

#Область ПОПРАВКИ

// 
//
&НаКлиенте
Процедура ПОПРАВКИ_ЛС_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	Общая проверка.
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаПоправкиРедактироватьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление поправок в позициях выполнено успешно!'"));
		
	КонецЕсли;

КонецПроцедуры //Процедура ПОПРАВКИ_ЛС_РедактироватьПоправки(Команда)

// Воноков 
//
&НаКлиенте
Процедура ПОПРАВКИ_ЛС_Добавить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
		
	// подготовим таблицу
	Если КомандаПоправкиДобавитьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление поправок в позициях выполнено успешно!'"));
		
	КонецЕсли;
	
КонецПроцедуры //Процедура ПОПРАВКИ_ЛС_ДобавитьПоправки(Команда)

//
//
&НаКлиенте
Процедура ПОПРАВКИ_ЛС_Удалить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
		
	// подготовим таблицу
	Если КомандаПоправкиУдалитьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Удаление отмеченных поправок в позициях выполнено успешно!'"));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти //#Область ПОПРАВКИ/#Область ЛокальнаяСмета/#Область КомандыФормы

#Область НАЧИСЛЕНИЯ

&НаКлиенте
Процедура НАЧИСЛЕНИЯ_ЛС_РедактироватьНачисления(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если Не СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
		
	// подготовим таблицу
	Если КомандаНачисленияРедактироватьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление значений числовых параметров в позициях выполнено успешно!'"));
		
	КонецЕсли;
	
КонецПроцедуры //Процедура НАЧИСЛЕНИЯ_ЛС_РедактироватьНачисления(Команда)

&НаКлиенте
Процедура НАЧИСЛЕНИЯ_ЛС_УстановитьСтандартныеЗначения(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если Не СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
		
	//	подготовим таблицу
	Если КомандаНачисленияРедактироватьНаСервере(Истина) Тогда
		
		//	Сообщить пользователю.
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление значений числовых параметров в позициях выполнено успешно!'"));
		
		
		//	Обновить значения в табличной части.
		ЗаполнитьТабличнаяЧастьНачисленияНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры //Процедура НАЧИСЛЕНИЯ_ЛС_ПрименитьСтандартныеЗначения(Команда)

#КонецОбласти //#Область НАЧИСЛЕНИЯ/#Область ЛокальнаяСмета/#Область КомандыФормы

#Область ИНДЕКСЫ

&НаКлиенте
Процедура ИНДЕКСЫ_ЛС_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	Если Не СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;

	// подготовим таблицу
	Если КомандаИндексыРедактироватьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Редактирование индексов в позициях выполнено успешно!'"));
		
	КонецЕсли;
	
КонецПроцедуры //Процедура ИНДЕКСЫ_ЛС_РедактироватьИндексы(Команда)

&НаКлиенте
Процедура ИНДЕКСЫ_ЛС_Очистить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	2. Выполнить действие.
	
	//
	Если Не СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
		
	// подготовим таблицу
	Если КомандаИндексыОчиститьНаСервере(Истина) Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Очистка индексов в позициях выполнено успешно!'"));
		
	КонецЕсли;
	
КонецПроцедуры //Процедура ИНДЕКСЫ_ЛС_Очистить(Команда)

#КонецОбласти //#Область ИНДЕКСЫ/#Область ЛокальнаяСмета/#Область КомандыФормы

#Область СВОЙСТВА

&НаКлиенте
Процедура СВОЙСТВА_ЛС_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаСвойстваРедактироватьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура СВОЙСТВА_ЛС_Редактировать(Команда)

&НаКлиенте
Процедура СВОЙСТВА_ЛС_Добавить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаСвойстваДобавитьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура СВОЙСТВА_ЛС_Добавить(Команда)

#КонецОбласти //#Область СВОЙСТВА/#Область ЛокальнаяСмета/#Область КомандыФормы

#КонецОбласти //#Область ЛокальнаяСмета/#Область КомандыФормы

#Область ОбъектнаяСмета

#Область РАСЦЕНКИ

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_Перенести(Команда, ВыполнитьКоманду = Ложь)
	
	// Устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	// Проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// Переменные процедуры
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаРасценкиПеренестиОповещениеНаКлиенте", ЭтаФорма, Новый Структура("ТекущаяСмета, КомандаИмя", Документ, Команда.Имя));
	
	//
	СписокИсключений		= Новый СписокЗначений;
	ОбрабатываемыеДокументы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("УчастиеПометка", Истина));
	Для Каждого Строка Из ОбрабатываемыеДокументы Цикл
		СписокИсключений.Добавить(Строка["СсылкаНаОбъект"]);	
	КонецЦикла;
	
	//
	ПараметрыКоманды	= Новый Структура("ВключатьСС, ВключатьОС, ВключатьЛС, ВключатьРазделы, АктивныйЭлемент, БезАктов, ОтборСтройка");
	ПараметрыКоманды.Вставить("ВключатьСС"		, ПолучитьВключатьСС());
	ПараметрыКоманды.Вставить("ВключатьОС"		, ПолучитьВключатьОС());
	ПараметрыКоманды.Вставить("ВключатьЛС"		, ПолучитьВключатьЛС());
	ПараметрыКоманды.Вставить("ВключатьРазделы"	, ПолучитьВключатьРазделы());
	ПараметрыКоманды.Вставить("БезАктов"		, Истина);
	ПараметрыКоманды.Вставить("ОтборСтройка"	, Истина);
	ПараметрыКоманды.Вставить("СписокИсключений", СписокИсключений);
		
	//	открыть форму для выбора
	ОткрытьФорму(	"Обработка.СМ_ДеревоСметПростое.Форма",
					ПараметрыКоманды,
					ЭтаФорма,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_Перенести(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_Копировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	переменные процедуры
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаКопироватьОповещениеНаКлиенте", ЭтаФорма, Новый Структура("Документ, КомандаИмя", Документ, Команда.Имя));
	
	ПараметрыКоманды	= Новый Структура("ВключатьСС, ВключатьОС, ВключатьЛС, ВключатьРазделы, АктивныйЭлемент, БезАктов, ОтборСтройка");
	ПараметрыКоманды.Вставить("ВключатьСС"		, ПолучитьВключатьСС());
	ПараметрыКоманды.Вставить("ВключатьОС"		, ПолучитьВключатьОС());
	ПараметрыКоманды.Вставить("ВключатьЛС"		, ПолучитьВключатьЛС());
	ПараметрыКоманды.Вставить("ВключатьРазделы"	, ПолучитьВключатьРазделы());
	ПараметрыКоманды.Вставить("БезАктов"		, Истина);
	ПараметрыКоманды.Вставить("ОтборСтройка"	, Истина);
	
	//	открыть форму для выбора
	ОткрытьФорму(	"Обработка.СМ_ДеревоСметПростое.Форма",
					ПараметрыКоманды,
					ЭтаФорма,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_Копировать(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_Удалить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	если были удалены элементы
	Если КомандаУдалитьНаСервере(Параметры["Операция"]) тогда
		
		//	обновить дерево значений.
		ДеревоЗначенийОбновитьНаКлиенте();
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_Удалить(Команда)


&НаКлиенте
Процедура РАСЦЕНКИ_ОС_РасчетИстина(Команда, ВыполнитьКоманду = Ложь)
		
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	установить значение реквизита (цикл)
	Если УстановитьРасчетНаСервере(Истина) Тогда
	
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
		
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_РасчетИстина(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_РасчетЛожь(Команда, ВыполнитьКоманду = Ложь)
		
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	установить значение реквизита (цикл)
	Если УстановитьРасчетНаСервере(Ложь) Тогда
	
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
		
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_РасчетЛожь(Команда)


&НаКлиенте
Процедура РАСЦЕНКИ_ОС_РассчитатьПоБазису(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаРассчитатьСтоимостиНаСервере(Истина) Тогда
		
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_РассчитатьПоБазису(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_РассчитатьПоТек(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) Тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаРассчитатьСтоимостиНаСервере(Ложь) Тогда
		
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_РассчитатьПоТек(Команда)


&НаКлиенте
Процедура РАСЦЕНКИ_ОС_УстановитьНормативыНРиСПБазисные(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьНормативыНРиСПОповещениеНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ОткрытьФорму(	"Обработка.СМ_ГрупповаяОбработкаПозиций.Форма.ВводНРиСП",
					Новый Структура("Вид", "Базисные"),
					ЭтаФорма,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьНормативыНРиСПБазисные(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_УстановитьНормативыНРиСПТекущие(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаУстановитьНормативыНРиСПОповещениеНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ОткрытьФорму(	"Обработка.СМ_ГрупповаяОбработкаПозиций.Форма.ВводНРиСП",
					Новый Структура("Вид", "Текущие"),
					ЭтаФорма,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьНормативыНРиСПТекущие(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_УстановитьНормативыНРиСП(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	Отобрать, только те элементы, которые будут учавствовать в операции.
	ОтобратьОбрабатываемыеЭлементыНаКлиенте(Команда);
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьНормативыНРиСП(Команда)


&НаКлиенте
Процедура РАСЦЕНКИ_ОС_ОбновитьПоНормативнойБазе(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	Если КомандаОбновитьПоНормативнойБазеНаКлиенте() Тогда
	
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_ОбновитьПоНормативнойБазе(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_Поправка115(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	добавить строку, в табличную часть (если нет)
	Если КомандаПоправка115НаСервере() Тогда
	
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_Поправка115(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_УстановитьНеИндексировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	установить значение	
	Если КомандаУстановитьНеИндексироватьНаСервере() Тогда
	
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьНеИндексировать(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_НеИзменятьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	установить значение	
	Если КомандаУстановитьНеИзменятьЦены() Тогда
	
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьНеИндексировать(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_ИзменятьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	
	//	установить значение	
	Если КомандаУстановитьНеИзменятьЦены(Ложь) Тогда
	
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();

		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьНеИндексировать(Команда)

//	ввод значений

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_УстановитьОпределитель(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаУстановитьОпределительОповещениеНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЗначения(	ОписаниеОповещения,
							ПредопределенноеЗначение("Справочник.СМ_Определители.ПустаяСсылка"),
							НСтр("ru='Выберите новый определитель позиций'"));
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьОпределитель(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_УстановитьСтатусРесурса(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьСтатусРесурсаНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЗначения(ОписаниеОповещения, ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.ПустаяСсылка"), НСтр("ru='Выберите новый статус ресурса'")); 
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьОпределитель(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_УстановитьОбъем(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения		= Новый ОписаниеОповещения("КомандаУстановитьОбъемОповещениеНаКлиенте", ЭтотОбъект, Новый Структура("ТипОбъекта, КомандаИмя", "ОбъектнаяСмета", Команда.Имя));
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//	Отобразим текущий объем, если обрабатывается одна позиция.
	Если ОбрабатываемыеПозиции.Количество() = 1 Тогда
		СтрокаДерева	= ЭлементыДеревоЗначений.НайтиПоИдентификатору(ОбрабатываемыеПозиции[0].Идентификатор);	
		Объем			= СтрокаДерева.Объем;	
	Иначе
		Объем			= 0;	
	КонецЕсли;
	
	ПоказатьВводЧисла(ОписаниеОповещения, Объем, НСтр("ru='Введите объем'"), 12, 5);
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_УстановитьОбъем(Команда)

&НаКлиенте
Процедура РАСЦЕНКИ_ОС_СохранитьВФрагменте(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаСохранитьВФрагментеОповещениеНаКлиенте", ЭтотОбъект, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводСтроки(ОписаниеОповещения, "", НСтр("ru='Введите наименование фрагмента'"), 150);
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ОС_СохранитьВФрагменте(Команда)

#КонецОбласти //#Область РАСЦЕНКИ/#Область ОбъектнаяСмета

#Область РЕСУРСЫ   

//	Вызываем несколько форм и передаем сквозные "ПараметрыОповещения".
//	1. Выбор ресурса замены.
//	2. Ввод значений ресурса замены.
//

&НаКлиенте
Процедура РЕСУРСЫ_ОС_Заменить(Команда, ВыполнитьКоманду = Ложь)
	
	//	выбрать команду
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	переменные процедуры
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ОбрабатываемыеРесурсы			= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ПараметрыОповещения 			= РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета, "Ресурсы");
	ПараметрыОткрытия				= РесурсыЗаменитьПолучитьПараметрыПоискаНаКлиенте(ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета);
	ОписаниеОповещения				= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);

	//
	ОткрытьФорму(	"Справочник.СМ_Ресурсы.Форма.ФормаВыбора",
					ПараметрыОткрытия,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры //Процедура РЕСУРСЫ_ОС_Заменить(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ОС_ЗаменитьНС(Команда, ВыполнитьКоманду = Ложь)
	
	//	выбрать команду
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	переменные процедуры
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ОбрабатываемыеРесурсы			= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ПараметрыОповещения 			= РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета, "НС");
	ОписаниеОповещения				= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
	
	//
	ОткрытьФорму("Справочник.СМ_НормативныеСборники.Форма.ФормаВыбора",,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры //Процедура РЕСУРСЫ_ОС_ЗаменитьНС(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ОС_ЗаменитьПлюсМинус(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверяем возможность выполнения команды
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	переменные процедуры
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ОбрабатываемыеРесурсы			= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ПараметрыОткрытия				= РесурсыЗаменитьПолучитьПараметрыПоискаНаКлиенте(ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета);
	ПараметрыОповещения 			= РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета);
	ОписаниеОповещения				= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьПлюсМинусОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
	
	//
	ОткрытьФорму(	"Справочник.СМ_Ресурсы.Форма.ФормаВыбора",
					ПараметрыОткрытия,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры //Процедура РЕСУРСЫ_ОС_ЗаменитьПлюсМинус(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ОС_ЗаменитьПлюсМинусИзВБ(Команда, ВыполнитьКоманду = Ложь)
	
	//	выбрать команду
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	ПараметрыРасчета	= Новый Структура();
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда,, ПараметрыРасчета) тогда
		Возврат;
	КонецЕсли;
	
	//
	ИдФормы	= СметнаяКомпонента.ПоказатьОкноТекущихЦен(	СокрЛП(ПараметрыРасчета.ФайлСборникаТекущихЦен),
														Строка(СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(ПараметрыРасчета.Район, "Код")),
														,
														,
														Истина,
														Ложь);

КонецПроцедуры //Процедура РЕСУРСЫ_ОС_ЗаменитьПлюсМинусИзВБ(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ОС_РедактироватьЦены(Команда, ВыполнитьКоманду = Ложь)
	
	//	выбрать команду
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// Подготовим таблицу.
	Если КомандаРесурсыРедактироватьЦеныНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РЕСУРСЫ_ОС_РедактироватьЦены(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ОС_Удалить(Команда, ВыполнитьКоманду = Ложь)
	
	//	выбрать команду
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаРесурсыУдалитьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура РЕСУРСЫ_ОС_Удалить(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ОС_НеИзменятьЦену(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	Выполнить изменение цен ресурсов.
	Если КомандаРесурсыНеИзменятьЦены() Тогда
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление статуса ""Не изменять текущие цены при обновлении"" выполнено успешно!'"));
		СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(Документ);
	КонецЕсли;
	
КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_РедактироватьЦены(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ОС_ИзменятьЦену(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
		
	//	Выполнить изменение цен ресурсов.
	Если КомандаРесурсыНеИзменятьЦены(Ложь) Тогда
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя, НСтр("ru='Обновление статуса ""Не изменять текущие цены при обновлении"" выполнено успешно!'"));
		СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(Документ);
	КонецЕсли;
	
КонецПроцедуры //Процедура РЕСУРСЫ_ЛС_РедактироватьЦены(Команда)

&НаКлиенте
Процедура РЕСУРСЫ_ОС_СтатусРесурса(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаУстановитьСтатусРесурсаТЧНаКлиенте", ЭтаФорма, Новый Структура("КомандаИмя", Команда.Имя));
	
	//
	ПоказатьВводЗначения(ОписаниеОповещения, ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.ПустаяСсылка"), НСтр("ru='Выберите новый статус ресурса'")); 
	
КонецПроцедуры //Процедура РАСЦЕНКИ_ЛС_ИзменитьОпределители(Команда)  

#КонецОбласти //#Область РЕСУРСЫ/#Область ОбъектнаяСмета/#Область КомандыФормы

#Область ПОПРАВКИ

&НаКлиенте
Процедура ПОПРАВКИ_ОС_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаПоправкиРедактироватьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура ПОПРАВКИ_ОС_Редактировать(Команда)

&НаКлиенте
Процедура ПОПРАВКИ_ОС_Добавить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаПоправкиДобавитьНаСервере() Тогда
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура ПОПРАВКИ_ОС_Добавить(Команда)

&НаКлиенте
Процедура ПОПРАВКИ_ОС_Удалить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаПоправкиУдалитьНаСервере() Тогда
	
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура ПОПРАВКИ_ОС_Удалить(Команда)

#КонецОбласти //#Область ПОПРАВКИ/#Область ОбъектнаяСмета/#Область КомандыФормы

#Область НАЧИСЛЕНИЯ

&НаКлиенте
Процедура НАЧИСЛЕНИЯ_ОС_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаНачисленияРедактироватьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура НАЧИСЛЕНИЯ_ОС_Редактировать(Команда)

&НаКлиенте
Процедура НАЧИСЛЕНИЯ_ОС_УстановитьСтандартныеЗначения(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	//	подготовим таблицу
	Если КомандаНачисленияРедактироватьНаСервере(Истина) Тогда
		
		//	Сообщить пользователю.
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
		//	Обновить значения в табличной части.
		ЗаполнитьТабличнаяЧастьНачисленияНаКлиенте();
		
	КонецЕсли;;

КонецПроцедуры //Процедура НАЧИСЛЕНИЯ_ОС_УстановитьСтандартныеЗначения(Команда)

#КонецОбласти //#Область НАЧИСЛЕНИЯ/#Область ОбъектнаяСмета/#Область КомандыФормы

#Область ИНДЕКСЫ

&НаКлиенте
Процедура ИНДЕКСЫ_ОС_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаИндексыРедактироватьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура ИНДЕКСЫ_ОС_Редактировать(Команда)

&НаКлиенте
Процедура ИНДЕКСЫ_ОС_Очистить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	2. Выполнить действие.
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаИндексыОчиститьНаСервере(Истина) Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;

КонецПроцедуры //Процедура ИНДЕКСЫ_ОС_Очистить(Команда)

#КонецОбласти //#Область ИНДЕКСЫ/#Область ОбъектнаяСмета/#Область КомандыФормы

#Область СВОЙСТВА

&НаКлиенте
Процедура СВОЙСТВА_ОС_Редактировать(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаСвойстваРедактироватьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура СВОЙСТВА_ОС_Редактировать(Команда)

&НаКлиенте
Процедура СВОЙСТВА_ОС_Добавить(Команда, ВыполнитьКоманду = Ложь)
	
	//	устанавливаем и проверяем возможность установки, "действие" - реквизит на форме
	Если НЕ ВыполнитьКоманду Тогда
		ДоступнаСменаКомандыВопросНаКлиенте(Команда);
		Возврат;
	КонецЕсли;
	
	//	проверка
	Если НЕ СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда) тогда
		Возврат;
	КонецЕсли;
	
	// подготовим таблицу
	Если КомандаСвойстваДобавитьНаСервере() Тогда
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(Команда.Имя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура СВОЙСТВА_ОС_Добавить(Команда)

#КонецОбласти //#Область СВОЙСТВА/#Область ОбъектнаяСмета/#Область КомандыФормы

#КонецОбласти //#Область ОбъектнаяСмета/#Область КомандыФормы

//	Команды обработчики табличных частей.
#Область ТаблицыЗначений

#Область РЕСУРСЫ

&НаКлиенте
Процедура РесурсыУстановитьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьРесурсы, Элементы.тзРесурсы.ОтборСтрок, Истина);
	
КонецПроцедуры //Процедура РесурсыУстановитьФлажки(Команда)

&НаКлиенте
Процедура РесурсыСнятьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьРесурсы,, Ложь);
	
КонецПроцедуры //Процедура РесурсыСнятьФлажки(Команда)


&НаКлиенте
Процедура ОтборВсеРесурсы(Команда)
	
	//
	СтруктураОтбора = Новый ФиксированнаяСтруктура();
	Элементы.тзРесурсы.ОтборСтрок = СтруктураОтбора;
	
	//	заголовок выбранного значения
	Элементы.ГруппаОтборыРесурсов.Заголовок	= Элементы["СводныеРесурсы" + Команда.Имя].Заголовок;
	
КонецПроцедуры //Процедура ОтборВсеРесурсы(Команда)

&НаКлиенте
Процедура ОтборМатериалы(Команда)
	
	//
	СтруктураОтбора = Новый ФиксированнаяСтруктура("ВидРесурса", ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.Материалы"));
	Элементы.тзРесурсы.ОтборСтрок = СтруктураОтбора;

	//	заголовок выбранного значения
	Элементы.ГруппаОтборыРесурсов.Заголовок	= Элементы["СводныеРесурсы" + Команда.Имя].Заголовок;
	
КонецПроцедуры //Процедура ОтборМатериалы(Команда)

&НаКлиенте
Процедура ОтборЗатратыТрудаРабочих(Команда)
	
	//
	СтруктураОтбора = Новый ФиксированнаяСтруктура("ВидРесурса", ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.ЗатратыТрудаРабочих"));
	Элементы.тзРесурсы.ОтборСтрок = СтруктураОтбора;

	//	заголовок выбранного значения
	Элементы.ГруппаОтборыРесурсов.Заголовок	= Элементы["СводныеРесурсы" + Команда.Имя].Заголовок;
	
КонецПроцедуры //Процедура ОтборЗатратыТрудаРабочих(Команда)

&НаКлиенте
Процедура ОтборЗатратыТрудаМашинистов(Команда)
	
	//
	СтруктураОтбора = Новый ФиксированнаяСтруктура("ВидРесурса", ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов"));
	Элементы.тзРесурсы.ОтборСтрок = СтруктураОтбора;

	//	заголовок выбранного значения
	Элементы.ГруппаОтборыРесурсов.Заголовок	= Элементы["СводныеРесурсы" + Команда.Имя].Заголовок;
	
КонецПроцедуры //Процедура ОтборЗатратыТрудаМашинистов(Команда)     

&НаКлиенте
Процедура ОтборМашиныИМеханизмы(Команда)
	
	//
	СтруктураОтбора = Новый ФиксированнаяСтруктура("ВидРесурса", ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.МашиныИМеханизмы"));
	Элементы.тзРесурсы.ОтборСтрок = СтруктураОтбора;

	//	заголовок выбранного значения
	Элементы.ГруппаОтборыРесурсов.Заголовок	= Элементы["СводныеРесурсы" + Команда.Имя].Заголовок;
	
КонецПроцедуры //Процедура ОтборМашиныИМеханизмы(Команда)

&НаКлиенте
Процедура ОтборОборудование(Команда)
	
	//
	СтруктураОтбора = Новый ФиксированнаяСтруктура("ВидРесурса", ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.Оборудование"));
	Элементы.тзРесурсы.ОтборСтрок = СтруктураОтбора;

	//	заголовок выбранного значения
	Элементы.ГруппаОтборыРесурсов.Заголовок	= Элементы["СводныеРесурсы" + Команда.Имя].Заголовок;
	
КонецПроцедуры //Процедура ОтборОборудование(Команда)

&НаКлиенте
Процедура ОтборНеучтенные(Команда)
	
	//
	СтруктураОтбора = Новый ФиксированнаяСтруктура("ЭтоНеучтенный", ИСТИНА);
	Элементы.тзРесурсы.ОтборСтрок = СтруктураОтбора;
	
	//	заголовок выбранного значения
	Элементы.ГруппаОтборыРесурсов.Заголовок	= Элементы["СводныеРесурсы" + Команда.Имя].Заголовок;
	
КонецПроцедуры //Процедура ОтборНеучтенные(Команда)

#КонецОбласти //#Область РЕСУРСЫ/#Область ТаблицыЗначений/#Область КомандыФормы

#Область ПОПРАВКИ

&НаКлиенте
Процедура ПоправкиУстановитьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьПоправки, Элементы.тзПоправки.ОтборСтрок, Истина);
	
КонецПроцедуры //Процедура ПоправкиУстановитьФлажки(Команда)

&НаКлиенте
Процедура ПоправкиСнятьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьПоправки,, Ложь);
	
КонецПроцедуры //Процедура ПоправкиСнятьФлажки(Команда) 

// Воноков 
&НаКлиенте
Процедура ДобавитьСтрокуПоправки(Команда)
	
	Элементы.тзПоправки.ДобавитьСтроку();
	Элементы.тзПоправки.ТекущиеДанные.Пометка = Истина;
	Элементы.тзПоправки.ТекущиеДанные.ВариантРасчета = ПредопределенноеЗначение("Перечисление.СМ_ВариантыРасчетаЭММ.Одинаковые");
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоправкуИзСправочника(Команда)
	// Докторсофт
	ПараметрыФормы = Новый Структура();
	Если Элементы.ЭлементыДеревоЗначений.ТекущиеДанные <> Неопределено И ТипЗнч(Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		ТекПозиция = Элементы.ЭлементыДеревоЗначений.ТекущиеДанные.Элемент;
		ЗаполнитьПараметрыВыбораПопракиНаСервере(ПараметрыФормы, ТекПозиция);
	КонецЕсли;
	ОписаниеОЗакрытииФормыВыбораПоправок = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораПоправок",ЭтаФорма, );
	ОткрытьФорму("Справочник.СМ_ПоправкиПоТехническимЧастям.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораПоправок,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    // Докторсофт
КонецПроцедуры

#Область ВспомогательныеФункции

// Докторсофт
&НаСервере
Процедура ЗаполнитьПараметрыВыбораПопракиНаСервере(ПараметрыФормы, ТекПозиция)
	
	НомерСборника = СМ_СметаВызовСервера.ОпределитьНомерСборника(ТекПозиция.ТипНормативныхСборников,ТекПозиция.ШифрРасценки);
	ПараметрыФормы.Вставить("ТипНормативногоСборника",ТекПозиция.ТипНормативныхСборников);
	ПараметрыФормы.Вставить("СметноНормативнаяБаза",ТекПозиция.РегиональнаяБаза);
	ПараметрыФормы.Вставить("НомерСборника",НомерСборника);
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СправочникСМ_ПоправкиПоТехническимЧастям.Ссылка,
	               |	СправочникСМ_ПоправкиПоТехническимЧастям.Наименование КАК Обоснование,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА &ОтборНомера
	               |						ТОГДА СправочникСМ_ПоправкиПоТехническимЧастям.НомерСборника = &НомерСборника
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &ОтборТНС
	               |						ТОГДА СправочникСМ_ПоправкиПоТехническимЧастям.СметноНормативнаяБаза = &СметноНормативнаяБаза
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И СправочникСМ_ПоправкиПоТехническимЧастям.ТипНормативногоСборника = &ТипНормативногоСборника
	               |				И СправочникСМ_ПоправкиПоТехническимЧастям.ЭтоГруппа = ЛОЖЬ
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Порядок
	               |ИЗ
	               |	Справочник.СМ_ПоправкиПоТехническимЧастям КАК СправочникСМ_ПоправкиПоТехническимЧастям
	               |ГДЕ
	               |	СправочникСМ_ПоправкиПоТехническимЧастям.ЭтоГруппа = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА &ОтборНомера
	               |				ТОГДА СправочникСМ_ПоправкиПоТехническимЧастям.НомерСборника = &НомерСборника
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ОтборТНС
	               |				ТОГДА СправочникСМ_ПоправкиПоТехническимЧастям.СметноНормативнаяБаза = &СметноНормативнаяБаза
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И СправочникСМ_ПоправкиПоТехническимЧастям.ТипНормативногоСборника = &ТипНормативногоСборника
	               |			И СправочникСМ_ПоправкиПоТехническимЧастям.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок,
	               |	Обоснование";
				  
	НеОтбирать = Истина;
	Запрос.УстановитьПараметр("НомерСборника",НомерСборника); 
	Запрос.УстановитьПараметр("ОтборНомера",?(НомерСборника=0,Ложь,Истина));
	Запрос.УстановитьПараметр("ТипНормативногоСборника",ТекПозиция.ТипНормативныхСборников); 
	Запрос.УстановитьПараметр("ОтборТНС",ЗначениеЗаполнено(ТекПозиция.ТипНормативныхСборников));
	НеОтбирать = Не ЗначениеЗаполнено(ТекПозиция.РегиональнаяБаза);
	Запрос.УстановитьПараметр("СметноНормативнаяБаза",ТекПозиция.РегиональнаяБаза); 
	Если НеОтбирать Тогда
		ТекущаяСтрока = Неопределено;
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ТекущаяСтрока = Выборка.Ссылка;
		Иначе
			ТекущаяСтрока = Неопределено;
		КонецЕсли;	
	КонецЕсли;
	
	ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
КонецПроцедуры

// Осуществляет действия после закрытия формы выбора поправок.
// Параметры:
//   Результат - СправочникСсылка.СМ_ПоправкиПоТехническимЧастям - выбранная поправка.
//   Параметры - Структура - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораПоправок(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.СМ_ПоправкиПоТехническимЧастям") Тогда
		СтруктураПопр = Новый СписокЗначений;
		СтруктураПопр.Добавить(Результат);
		ДобавитьПоправкуИзСправочникаНаСервере(СтруктураПопр);
		ТекДанные = ТабличнаяЧастьПоправки.Добавить();
		Для Сч = 1 По СтруктураПопр.Количество() - 1 Цикл
			
			Представление	= СтруктураПопр.Получить(Сч).Представление;
			Значение		= СтруктураПопр.Получить(Сч).Значение;
			
			ТекДанные.Применить			= Истина;
			ТекДанные.Пометка			= Истина;
			ТекДанные.ЭтоНоваяСтрока	= Истина;
			
			Если Представление = "УсловияПрименения" Тогда
				ТекДанные.УсловияПрименения = Значение;
			ИначеЕсли Представление = "Обоснование" Тогда
				ТекДанные.Обоснование = Значение;
			ИначеЕсли Представление = "КоэффициентКОсновнойЗарплате" Тогда
				ТекДанные.КоэффОЗ = Значение;
			ИначеЕсли Представление = "КоэффициентКЭксплуатацииМашин" Тогда
				ТекДанные.КоэффЭМ = Значение;
			ИначеЕсли Представление = "КоэффициентКЗарплатеМашинистов" Тогда
				ТекДанные.КоэффЗМ = Значение;
			ИначеЕсли Представление = "КоэффициентКСтоимостиМатериалов" Тогда
				ТекДанные.КоэффСМ = Значение;
			ИначеЕсли Представление = "КоэффициентКТрудозатратамРабочих" Тогда
				ТекДанные.КоэффТР = Значение;
			ИначеЕсли Представление = "КоэффициентКТрудозатратамМашинистов" Тогда
				ТекДанные.КоэффТМ = Значение;
			ИначеЕсли Представление = "ДобавитьКПрямымЗатратам" Тогда
				ТекДанные.ДобавПЗ = Значение;
			ИначеЕсли Представление = "ДобавитьКОсновнойЗарплате" Тогда
				ТекДанные.ДобавОЗ = Значение;
			ИначеЕсли Представление = "ДобавитьКЭксплуатацииМашин" Тогда
				ТекДанные.ДобавЭМ = Значение;
			ИначеЕсли Представление = "ДобавитьКЗарплатеМашинистов" Тогда
				ТекДанные.ДобавЗМ = Значение;
			ИначеЕсли Представление = "ДобавитьКСтоимостиМатериалов" Тогда
				ТекДанные.ДобавСМ = Значение;
			ИначеЕсли Представление = "ДобавитьКТрудозатратамРабочих" Тогда
				ТекДанные.ДобавТР = Значение;
			ИначеЕсли Представление = "ДобавитьКТрудозатратам" Тогда
				//ТекДанные.ДобавТМ = Значение;
				ТекДанные.ДобавТ = Значение;
			ИначеЕсли Представление = "ТипПоправки" Тогда
				ТекДанные.ТипПоправки = Значение;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьПоправкуИзСправочникаНаСервере(СтруктураПопр)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоправкиПоТехническимЧастям.УсловияПрименения КАК УсловияПрименения,
	               |	ПоправкиПоТехническимЧастям.Обоснование КАК Обоснование,
	               |	ПоправкиПоТехническимЧастям.КоэффициентКОсновнойЗарплате КАК КоэффициентКОсновнойЗарплате,
	               |	ПоправкиПоТехническимЧастям.КоэффициентКЭксплуатацииМашин КАК КоэффициентКЭксплуатацииМашин,
	               |	ПоправкиПоТехническимЧастям.КоэффициентКЗарплатеМашинистов КАК КоэффициентКЗарплатеМашинистов,
	               |	ПоправкиПоТехническимЧастям.КоэффициентКСтоимостиМатериалов КАК КоэффициентКСтоимостиМатериалов,
	               |	ПоправкиПоТехническимЧастям.КоэффициентКТрудозатратамРабочих КАК КоэффициентКТрудозатратамРабочих,
	               |	ПоправкиПоТехническимЧастям.КоэффициентКТрудозатратамМашинистов КАК КоэффициентКТрудозатратамМашинистов,
	               |	ПоправкиПоТехническимЧастям.ДобавитьКПрямымЗатратам КАК ДобавитьКПрямымЗатратам,
	               |	ПоправкиПоТехническимЧастям.ДобавитьКОсновнойЗарплате КАК ДобавитьКОсновнойЗарплате,
	               |	ПоправкиПоТехническимЧастям.ДобавитьКЭксплуатацииМашин КАК ДобавитьКЭксплуатацииМашин,
	               |	ПоправкиПоТехническимЧастям.ДобавитьКЗарплатеМашинистов КАК ДобавитьКЗарплатеМашинистов,
	               |	ПоправкиПоТехническимЧастям.ДобавитьКСтоимостиМатериалов КАК ДобавитьКСтоимостиМатериалов,
	               |	ПоправкиПоТехническимЧастям.ДобавитьКТрудозатратамРабочих КАК ДобавитьКТрудозатратамРабочих,
	               |	ПоправкиПоТехническимЧастям.ДобавитьКТрудозатратам КАК ДобавитьКТрудозатратам,
	               |	ПоправкиПоТехническимЧастям.Справка КАК Справка,
	               |	ПоправкиПоТехническимЧастям.ТипПоправки
	               |ИЗ
	               |	Справочник.СМ_ПоправкиПоТехническимЧастям КАК ПоправкиПоТехническимЧастям
	               |ГДЕ
	               |	ПоправкиПоТехническимЧастям.Ссылка = &Ссылка";
	ТекПопр = СтруктураПопр.Получить(0);				   
	Запрос.УстановитьПараметр("Ссылка",ТекПопр.Значение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Инд = 0;
	Для Каждого СтрЗнач Из  РезультатЗапроса Цикл
		Для каждого колонка Из РезультатЗапроса.Колонки Цикл
			Наим = Колонка.Имя;
			СтруктураПопр.Добавить(СтрЗнач.Получить(Инд),Колонка.Имя);
			Инд = Инд +1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти //#Область ВспомогательныеФункции/#Область ПОПРАВКИ/#Область ТаблицыЗначений/#Область КомандыФормы

#КонецОбласти //#Область ПОПРАВКИ/#Область ТаблицыЗначений/#Область КомандыФормы

#Область НАЧИСЛЕНИЯ

&НаКлиенте
Процедура НачисленияУстановитьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьНачисления, Элементы.тзНачисления.ОтборСтрок, Истина);
	
КонецПроцедуры //Процедура НачисленияУстановитьФлажки(Команда)

&НаКлиенте
Процедура НачисленияСнятьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьНачисления,, Ложь);
	
КонецПроцедуры //Процедура НачисленияСнятьФлажки(Команда) 

#КонецОбласти //#Область НАЧИСЛЕНИЯ/#Область ТаблицыЗначений/#Область КомандыФормы

#Область ИНДЕКСЫ

&НаКлиенте
Процедура ИндексыУстановитьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьИндексы, Элементы.тзИндексы.ОтборСтрок, Истина);
	
КонецПроцедуры //Процедура ИндексыУстановитьФлажки(Команда)

&НаКлиенте
Процедура ИндексыСнятьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьИндексы,, Ложь);
	
КонецПроцедуры //Процедура ИндексыСнятьФлажки(Команда)

#КонецОбласти //#Область ИНДЕКСЫ/#Область ТаблицыЗначений/#Область КомандыФормы

#Область СВОЙСТВА

&НаКлиенте
Процедура СвойстваУстановитьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьСвойства, Элементы.тзСвойства.ОтборСтрок, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СвойстваСнятьФлажки(Команда)
	
	//
	УстановитьСнятьПометкаТаблицаНаКлиенте(ТабличнаяЧастьСвойства, Элементы.тзСвойства.ОтборСтрок, Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура СвойстваСоздать(Команда)
	
	НаборДополнительныхРеквизитовИСведений	= НаборДополнительныхРеквизитовИСведенийНаСервере();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НаборСвойств", НаборДополнительныхРеквизитовИСведений);
	ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
	ПараметрыФормы.Вставить("ТекущийНаборСвойств", НаборДополнительныхРеквизитовИСведений);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта",
		ПараметрыФормы, Элементы.СвойстваЛокальнаяСмета);

КонецПроцедуры

#КонецОбласти //#Область СВОЙСТВА/#Область ТаблицыЗначений/#Область КомандыФормы

#КонецОбласти //#Область ТаблицыЗначений/#Область КомандыФормы

//	(!) НЕ КОМАНДЫ (процедуры, функции используемые в командах).
#Область ВспомогательныеФункции

#Область РАСЦЕНКИ

#Область Перенести

//	Процедура, обрабатывающая перенос позиции, раздела в другой раздел
// срабатывает после вызова обработки "СМ_ДеревоСметПростое" в процедуре "ПереместитьВРаздел"
// ПАРАМЕТРЫ:
//// Результат - ответ пользователя на вопрос (продолжать или нет)
//// Параметры - дополнительные параметры переданные при формировании вопроса пользовтелю.
&НаКлиенте
Процедура КомандаРасценкиПеренестиОповещениеНаКлиенте(ЭлементПриемник, ПараметрыОповещения) Экспорт
	
	//
	ДоступнаОбработкаКоманды	= Истина;
	ТекстПредупреждения			= "Ошибка! Обработка команды [перенести]- прекращена!";
	
	//	если отказались от переноса
	Если ЭлементПриемник = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	//	проверить выбранный элемент приемник
	Если НЕ СМ_ДоступнаОбработкаПеренестиКопироватьНаКлиенте(ЭлементПриемник, ТекстПредупреждения) Тогда
		//	(!) ошибка, сообщить пользователю
		ПоказатьПредупреждение(, ТекстПредупреждения);		
		Возврат;
	КонецЕсли;
	
	//	Добавить локальную смету приемника, в обрабатываемые.
	ОбрабатываемыеЭлементыДобавитьПриемникНаСервере(ЭлементПриемник);
	
	//	(!) ВЫПОЛНИТЬ
	Если ДоступнаОбработкаКоманды
		И КомандаРасценкиПеренестиНаСервере(ЭлементПриемник, ТекстПредупреждения) Тогда
	
		//	обновить дерево значений
		ДеревоЗначенийОбновитьНаКлиенте();
	
		//	выполнено успешно, сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	Иначе
		//	(!) ошибка, сообщить пользователю
		ПоказатьПредупреждение(, ТекстПредупреждения);		
	КонецЕсли;

КонецПроцедуры //Процедура КомандаРасценкиПеренестиОповещениеНаКлиенте()   

&НаСервере
Функция КомандаРасценкиПеренестиНаСервере(ЭлементПриемник, ТекстПредупреждения = "")
	
	//
	Если Параметры["Операция"] = "ОбработкаПозиции"
		И ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		ТекстПредупреждения	= НСтр("ru = 'Позиции, возможно переносить, только в разделы!';");
		Возврат Ложь;
	КонецЕсли;
	
	//
	ОбрабатываемыеОбъектныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка, УчастиеПриемник", Строка(Тип("ДокументСсылка.СМ_ОбъектнаяСмета")), Истина, Ложь));
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеРодитель", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")), Истина));
	ОбрабатываемыеРазделы			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина));
	ОбрабатываемыеПозиции			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ДеревоЗначений					= РеквизитФормыВЗначение("ЭлементыДеревоЗначений", Тип("ДеревоЗначений"));
	ОбработкаЗавершенаСОшибкой		= Ложь;
	
	//
	НачатьТранзакцию();
	
	//
	Если Параметры["Операция"] = "ОбработкаОбъектнойСметы" Тогда
		
		//
		Для Каждого Строка Из ОбрабатываемыеОбъектныеСметы Цикл
			
			//	сводная смета
			
		КонецЦикла;
			
	ИначеЕсли Параметры["Операция"] = "ОбработкаЛокальнойСметы" Тогда
		
		//
		Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
			
			//
			УстановитьРодительЛокальнойСметыНаСервереБезКонтекста(Строка["СсылкаНаОбъект"], ЭлементПриемник);	
			
		КонецЦикла;
			
	ИначеЕсли Параметры["Операция"] = "ОбработкаРаздела" Тогда
		
		//	разделы
		Для Каждого Строка Из ОбрабатываемыеРазделы Цикл
			
			//
			Если Строка["СсылкаНаОбъект"] = ЭлементПриемник Тогда
				ОбработкаЗавершена = Ложь;
				ТекстСообщенияПользователю	= НСтр("ru='Выберите другой раздел. Перенос в этот же раздел невозможен!'");	
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю);
			Иначе
				ОбработкаЗавершена = УстановитьРодительРазделаПозицииНаСервере(Строка["СсылкаНаОбъект"], ЭлементПриемник);	
			КонецЕсли;
			//
			Если НЕ ОбработкаЗавершена Тогда
				ОбработкаЗавершенаСОшибкой = Истина;
				Прервать;
				// Перейти ~ОбработкаЗавершенаСОшибкой;	
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ОбработкаЗавершенаСОшибкой Тогда
			// позиции
			Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
				УстановитьРодительРазделаПозицииНаСервере(Строка["СсылкаНаОбъект"], ЭлементПриемник);	
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли Параметры["Операция"] = "ОбработкаПозиции" Тогда
		
		//	позиции
		Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
			Если Строка.СтатусРедактирования = 1 Тогда
				Продолжить;
			КонецЕсли;

			УстановитьРодительРазделаПозицииНаСервере(Строка["СсылкаНаОбъект"], ЭлементПриемник);	
		КонецЦикла;
			
	КонецЕсли;
	
	// ~ОбработкаЗавершенаСОшибкой:
	
	//	Перенумеровать документы.
	ДеревоЗначенийПеренумероватьНаСервереБезКонтекста(ДеревоЗначений.Строки);
	
	//	Перенумеровать документы.
	Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
		СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(Строка["СсылкаНаОбъект"]);
	КонецЦикла;

	СметаПриемник = СМ_СметаВызовСервера.НайтиЛС(ЭлементПриемник);
	СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(СметаПриемник);
	
	ЗафиксироватьТранзакцию();  //СУДАРИКОВ - блокировки
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ,Истина);
	ДокументПерерасчетНаСервере(СметаПриемник,Истина);
	
	// ЗафиксироватьТранзакцию(); СУДАРИКОВ - блокировки.
	
	Возврат Истина;

КонецФункции //Функция КомандаРасценкиПеренестиНаСервере()

&НаСервереБезКонтекста
Функция УстановитьРодительЛокальнойСметыНаСервереБезКонтекста(СсылкаНаОбъект, ЭлементПриемник)
	
	//
	ДокументОбъект = СсылкаНаОбъект.ПолучитьОбъект();
	
	ДокументОбъект.ПорНомер		= 0;
	ДокументОбъект.ИДРодителя	= ЭлементПриемник;
		
	ДокументОбъект.Записать();
	
	Возврат Истина;
	
КонецФункции //Функция УстановитьРодительЛокальнойСметыНаСервереБезКонтекста(СсылкаНаОбъект, ЭлементПриемник)

&НаСервере
Функция УстановитьРодительРазделаПозицииНаСервере(СсылкаНаОбъект, ЭлементПриемник)
	
	//	получим значения, для подставновки "ИДСметы", "ИДРодителя"
	ПараметрыСменыРодителя	= ПолучитьПараметрыСменыРодителяНаСервере(СсылкаНаОбъект, ЭлементПриемник);
	
	// *********************************************
	// ++ AVV Роли в системе
	// Если пользователь не обладает ролью "Управление стройками",
	// то он не может копировать или перемещать сущности (позиции, разделы) в сметы других строек.
	//Если НЕ РольДоступна("СМ_УправлениеСтройками") Тогда 
	//	Если СсылкаНаОбъект.ИДСметы.Стройка <> ЭлементПриемник.ИДСметы.Стройка Тогда
	//		ТекстСообщенияПользователю	= НСтр("ru='Перенос объекта " + СсылкаНаОбъект + " невозможен! Отличаются объекты строительства.'");	
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю);
	//		Возврат Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	// -- AVV Роли в системе
	// *********************************************	
	
	ДокументОбъект 				= СсылкаНаОбъект.ПолучитьОбъект();
	ДокументОбъект.ПорНомер		= 0;
	ДокументОбъект.ИДСметы		= ПараметрыСменыРодителя.ЛокальнаяСмета;
	ДокументОбъект.ИДРодителя	= ПараметрыСменыРодителя.Родитель;
	ДокументОбъект.Записать();
	
	Возврат Истина;
	
КонецФункции //Функция УстановитьРодительРазделаПозицииНаСервере(СсылкаНаОбъект, ЭлементПриемник)

#КонецОбласти //#Область Перенести/#Область РАСЦЕНКИ

#Область Копировать

// Процедура, обрабатывающая копирование позиции, раздела в другой раздел
// срабатывает после вызова обработки "СМ_ДеревоСметПростое" в процедуре "ПереместитьВРаздел"
// ПАРАМЕТРЫ:
//// Результат - ответ пользователя на вопрос (продолжать или нет)
//// Параметры - дополнительные параметры переданные при формировании вопроса пользовтелю.
&НаКлиенте
Процедура КомандаКопироватьОповещениеНаКлиенте(ЭлементПриемник, ПараметрыОповещения) Экспорт
	
	//
	ДоступнаОбработкаКоманды	= Истина;
	ТекстПредупреждения			= "Ошибка! Обработка команды [перенести]- прекращена!";
	
	Если ЭлементПриемник = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//	проверить выбранный элемент приемник
	Если НЕ СМ_ДоступнаОбработкаПеренестиКопироватьНаКлиенте(ЭлементПриемник, ТекстПредупреждения) Тогда
		//	(!) ошибка, сообщить пользователю
		ПоказатьПредупреждение(, ТекстПредупреждения);		
		Возврат;
	КонецЕсли;
	
	//	Добавить выбранный элемент-приемник, в обрабатываемые.
	ОбрабатываемыеЭлементыДобавитьПриемникНаСервере(ЭлементПриемник);
	
	//
	Если КомандаКопироватьНаСервере(ЭлементПриемник, ПараметрыОповещения) Тогда
	
		//
		ДеревоЗначенийОбновитьНаКлиенте();
		
		//
		Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ТекущийЭлемент) Тогда
			
			//
			Оповестить("ОбновитьПослеКопирования", Новый Структура("Смета", ЭтаФорма.Параметры.ТекущийДокумент));
			
		КонецЕсли;
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;	
	
КонецПроцедуры //Процедура КомандаКопироватьОповещениеНаКлиенте(Результат, Параметры) Экспорт

// Непосредственно копирование объектов.
//
&НаСервере
Функция КомандаКопироватьНаСервере(ЭлементПриемник, ПараметрыОповещения)
	
	//
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")), Истина));
	ОбрабатываемыеПозиции			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ДеревоЗначений					= РеквизитФормыВЗначение("ЭлементыДеревоЗначений", Тип("ДеревоЗначений"));
	
	//
	НачатьТранзакцию();
	
	Если Параметры["Операция"] = "ОбработкаЛокальнойСметы" Тогда
		
		//
		КомандаКопироватьОбработкаЛокальнойСметыНаСервере(ЭлементПриемник, ПараметрыОповещения);
		
	ИначеЕсли Параметры["Операция"] = "ОбработкаРаздела" Тогда
		
		//
		СтартововаяСтрокаДерева	= ОбрабатываемыеЭлементыМаксимальноПоУровнюОтмеченныйНаСервере();
		
		//	рекурсивно создаем документы "разделы"
		КомандаКопироватьОбработкаРазделаНаСервере(ЭлементПриемник, Новый Структура("Тип, УчастиеПометка, Родитель", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина, СтартововаяСтрокаДерева["ЭлементРодитель"]), ПараметрыОповещения);
		
		//	позиции
		Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
			
			//
			КомандаКопироватьПозицияНаСервере(Строка["СсылкаНаОбъект"], ЭлементПриемник);	
			
		КонецЦикла;
		
	ИначеЕсли Параметры["Операция"] = "ОбработкаПозиции" Тогда
		
		//
		КомандаКопироватьОбработкаПозицииНаСервере(ЭлементПриемник, ПараметрыОповещения);
			
	КонецЕсли;
	
	// Перенумеровать документы.
	Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
		СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(Строка["СсылкаНаОбъект"]);
	КонецЦикла;

	СметаПриемник = СМ_СметаВызовСервера.НайтиЛС(ЭлементПриемник);
	СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(СметаПриемник);

	ЗафиксироватьТранзакцию(); // СУДАРИКОВ - блокировки
	
	// Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	// ЗафиксироватьТранзакцию(); // СУДАРИКОВ - блокировки.
	
	Возврат Истина;
	
КонецФункции //Функция КомандаКопироватьНаСервере(ЭлементПриемник, ПараметрыОповещения)


//	Процедура перебора объектов для копирования
//
&НаСервере
Процедура КомандаКопироватьОбработкаЛокальнойСметыНаСервере(ЭлементПриемник, ПараметрыОповещения)

	//
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")), Истина));
	
	//	локальные сметы
	Для Каждого СтрокаЛокальнаяСмета Из ОбрабатываемыеЛокальныеСметы Цикл
		
		//	скопировать "ЛокальнаяСмета", запомним скопированную "ЛокальнаяСмета"
		СтрокаЛокальнаяСмета.Копия	= КомандаКопироватьЛокальнаяСметаНаСервереБезКонтекста(СтрокаЛокальнаяСмета["СсылкаНаОбъект"], ЭлементПриемник);	
		
		//	отобрать разделы, принадлежащие данной смете
		ЛокальнаяСметаОбрабатываемыеРазделы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, ЛокальнаяСмета", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), СтрокаЛокальнаяСмета["СсылкаНаОбъект"]));
		
		//	разделы УникальныйИдентификатор
		Для Каждого СтрокаРаздел Из ЛокальнаяСметаОбрабатываемыеРазделы Цикл
			
			//	запомнить копию документа
			СтрокаРаздел.Копия	= КомандаКопироватьРазделНаСервереБезКонтекста(СтрокаРаздел["СсылкаНаОбъект"], ЭлементПриемник);	
				
			//	отобрать позиции, вложенные в данный раздел
			ЛокальнаяСметаОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка, ЛокальнаяСмета, Родитель", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина, СтрокаЛокальнаяСмета["СсылкаНаОбъект"], СтрокаРаздел["СсылкаНаОбъект"]));
			
			//	позиции
			Для Каждого СтрокаПозиция Из ЛокальнаяСметаОбрабатываемыеПозиции Цикл
				
				//
				КомандаКопироватьПозицияНаСервере(СтрокаПозиция["СсылкаНаОбъект"], ЭлементПриемник);	
				
			КонецЦикла;
			
		КонецЦикла;
			
	КонецЦикла;
			
КонецПроцедуры //Процедура КомандаКопироватьОбработкаЛокальнойСметыНаСервере(ЭлементПриемник, ПараметрыОповещения)

//	Процедура перебора объектов для копирования
//
&НаСервере
Процедура КомандаКопироватьОбработкаРазделаНаСервере(ЭлементПриемник, ПараметрыОтбора, ПараметрыОповещения)
	
	//
	ОбрабатываемыеРазделыУровня	= ОбрабатываемыеЭлементы.НайтиСтроки(ПараметрыОтбора);
	
	//	разделы
	Для Каждого ОбрабатываемыйЭлемент Из ОбрабатываемыеРазделыУровня Цикл
		
		//	Создаем копию документа и вносим ссылку в таблицу.
		Если ОбрабатываемыйЭлемент["УчастиеПометка"] Тогда
			ОбрабатываемыйЭлемент.Копия	= КомандаКопироватьРазделНаСервереБезКонтекста(ОбрабатываемыйЭлемент["СсылкаНаОбъект"], ЭлементПриемник);	
		КонецЕсли;
		
		//
		ПараметрыОтбора	= Новый Структура("Тип, УчастиеПометка, Родитель", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина, ОбрабатываемыйЭлемент["СсылкаНаОбъект"]);
		
		//
		КомандаКопироватьОбработкаРазделаНаСервере(ЭлементПриемник, ПараметрыОтбора, ПараметрыОповещения);
		
	КонецЦикла;
		
КонецПроцедуры //Процедура КомандаКопироватьОбработкаРазделаНаСервере(ЭлементПриемник, ПараметрыОповещения)

//	Процедура перебора объектов для копирования
//
&НаСервере
Процедура КомандаКопироватьОбработкаПозицииНаСервере(ЭлементПриемник, ПараметрыОповещения)

	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//	позиции
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		
		//	создаем копию документа и вносим ссылку в таблицу
		Строка.Копия	= КомандаКопироватьПозицияНаСервере(Строка["СсылкаНаОбъект"], ЭлементПриемник);	
		
	КонецЦикла;
			
КонецПроцедуры //Процедура КомандаКопироватьОбработкаПозицииНаСервере(ЭлементПриемник, ПараметрыОповещения)


&НаСервереБезКонтекста
Функция КомандаКопироватьЛокальнаяСметаНаСервереБезКонтекста(СсылкаНаОбъект, ЭлементПриемник = Неопределено)
	
	//
	Если ЭлементПриемник = Неопределено Тогда
		ЭлементПриемник	= Документы.СМ_ОбъектнаяСмета.ПустаяСсылка();	
	КонецЕсли;
	
	//
	ПараметрыСменыРодителя	= Новый Структура("ЛокальнаяСмета, Родитель", СсылкаНаОбъект, ЭлементПриемник);
	
	//
	ДокументОбъект = СсылкаНаОбъект.Скопировать();
	ДокументОбъект.Дата 				= ТекущаяДатаСеанса(); 
	ДокументОбъект.КорректируетСмету	= Документы.СМ_РазделЛокальнойСметы.ПустаяСсылка();
	ДокументОбъект.Наименование			= СсылкаНаОбъект.Наименование; //СледующееНаименованиеКопииНаСервереБезКонтекста(СсылкаНаОбъект, СсылкаНаОбъект.Наименование, ПараметрыСменыРодителя); 
	ДокументОбъект.Комментарий			= "Создан копированием объекта [" + Строка(СсылкаНаОбъект) + "]."; 
	
	ДокументОбъект.ИДРодителя			= ЭлементПриемник;
	
	ДокументОбъект.Записать();
	
	// Добавим, только что скопированную "ЛокальнаяСмета", в табличную часть "ОбъектнаяСмета.ЛокальныеСметы".
	ОбъектнаяСметаОбъект	= ЭлементПриемник.ПолучитьОбъект();
	
	//
	НомерПП	= ОбъектнаяСметаОбъект.ЛокальныеСметы.Количество() + 1;
	
	//
	Строка	= ОбъектнаяСметаОбъект.ЛокальныеСметы.Добавить();	
	Строка.ЛокальнаяСмета		= ДокументОбъект.Ссылка;
	Строка.НомерПП				= НомерПП;
	Строка.КоличествоОбъектов	= 1;
	Строка.Расчет				= Истина;
	
	ОбъектнаяСметаОбъект.Записать();
	
	//
	Возврат ДокументОбъект.Ссылка;

КонецФункции //Функция КомандаКопироватьЛокальнаяСметаНаСервереБезКонтекста(СсылкаНаОбъект, ЭлементПриемник = Неопределено)

&НаСервере
Функция КомандаКопироватьРазделНаСервереБезКонтекста(СсылкаНаОбъект, ЭлементПриемник = Неопределено)
	
	//	получим значения, для подставновки "ИДСметы", "ИДРодителя"
	ПараметрыСменыРодителя	= ПолучитьПараметрыСменыРодителяНаСервере(СсылкаНаОбъект, ЭлементПриемник, Истина);
	
	//
	ДокументОбъект = СсылкаНаОбъект.Скопировать();
	ДокументОбъект.Дата 					= ТекущаяДатаСеанса(); 
	ДокументОбъект.КорректируетРаздел		= Документы.СМ_РазделЛокальнойСметы.ПустаяСсылка();
	ДокументОбъект.НаименованиеДляПечати	= ДокументОбъект.НаименованиеДляПечати; //СледующееНаименованиеКопииНаСервереБезКонтекста(СсылкаНаОбъект, ДокументОбъект.НаименованиеДляПечати, ПараметрыСменыРодителя); 
	ДокументОбъект.Комментарий				= "Создан копированием объекта [" + Строка(СсылкаНаОбъект) + "]."; 
	
	ДокументОбъект.ИДРодителя				= ПараметрыСменыРодителя.Родитель;
	ДокументОбъект.ИДСметы					= ПараметрыСменыРодителя.ЛокальнаяСмета;
	
	ДокументОбъект.Записать();
	
	Возврат ДокументОбъект.Ссылка;

КонецФункции //Функция КомандаКопироватьРазделНаСервере(СсылкаНаОбъект, ЭлементПриемник = Неопределено, ЛокальнаяСметаКопия = Неопределено)

&НаСервере
Функция КомандаКопироватьПозицияНаСервере(СсылкаНаОбъект, ЭлементПриемник = Неопределено)
	
	//	получим значения, для подставновки "ИДСметы", "ИДРодителя"
	ПараметрыСменыРодителя	= ПолучитьПараметрыСменыРодителяНаСервере(СсылкаНаОбъект, ЭлементПриемник, Истина);
	
	//
	ДокументОбъект = СсылкаНаОбъект.Скопировать();
	ДокументОбъект.Дата 				= ТекущаяДатаСеанса(); 
	ДокументОбъект.КорректируетПозицию	= Документы.СМ_ПозицияЛокальнойСметы.ПустаяСсылка();
	ДокументОбъект.Наименование			= ДокументОбъект.Наименование; //СледующееНаименованиеКопииНаСервереБезКонтекста(СсылкаНаОбъект, ДокументОбъект.Наименование, ПараметрыСменыРодителя); 
	ДокументОбъект.Комментарий			= "Создан копированием объекта [" + Строка(СсылкаНаОбъект) + "].";
	
	ДокументОбъект.ИДПозицииВладельца	= ПараметрыСменыРодителя.Владелец;
	ДокументОбъект.КорректируетПозицию	= Документы.СМ_ПозицияЛокальнойСметы.ПустаяСсылка();
	
	ДокументОбъект.ИДРодителя			= ПараметрыСменыРодителя.Родитель;
	ДокументОбъект.ИДСметы				= ПараметрыСменыРодителя.ЛокальнаяСмета;
	
	ДокументОбъект.Записать();
	
	Возврат ДокументОбъект.Ссылка;

КонецФункции //Функция КомандаКопироватьПозицияНаСервере(СсылкаНаОбъект, ЭлементПриемник = Неопределено)

#КонецОбласти //#Область Копировать/#Область РАСЦЕНКИ

#Область Удалить
	
// Процедура непорседственного удаления документа - позиции, на входе - ссылка.
//
&НаСервере
Функция КомандаУдалитьНаСервере(Операция = "")
	
	//
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")), Истина));
	ОбрабатываемыеРазделы			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина));
	ОбрабатываемыеПозиции			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	НачатьТранзакцию();
	
	//	цикл
	Если Операция = "ОбработкаЛокальнойСметы" Тогда
			
		//	локальные сметы
		Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
			
			//
			СМ_СметаВызовСервера.УдалитьЛС(Строка["СсылкаНаОбъект"]);
			
			//	Удалить из дерева значений, на форме.
			СтрокаДерева	= ЭлементыДеревоЗначений.НайтиПоИдентификатору(Строка["Идентификатор"]);
			
			Если НЕ СтрокаДерева = Неопределено Тогда
				СтрокаДерева.ПолучитьРодителя().ПолучитьЭлементы().Удалить(СтрокаДерева);
			КонецЕсли;
			
		КонецЦикла;

	ИначеЕсли Операция = "ОбработкаРаздела" Тогда
			
		//	разделы
		Для Каждого Строка Из ОбрабатываемыеРазделы Цикл
			
			//
			СМ_СметаВызовСервера.УдалитьПозициюЛС(Строка["СсылкаНаОбъект"], Истина);
			
			//	Удалить из дерева значений, на форме.
			СтрокаДерева	= ЭлементыДеревоЗначений.НайтиПоИдентификатору(Строка["Идентификатор"]);
			
			Если НЕ СтрокаДерева = Неопределено Тогда
				СтрокаДерева.ПолучитьРодителя().ПолучитьЭлементы().Удалить(СтрокаДерева);
			КонецЕсли;
			
		КонецЦикла;

	ИначеЕсли Операция = "ОбработкаПозиции" Тогда
		
		//	позиции
		Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
			
			Если Строка.СтатусРедактирования = 1 Тогда
				Продолжить;
			КонецЕсли;

			//
			СМ_СметаВызовСервера.УдалитьПозициюЛС(Строка["СсылкаНаОбъект"], Истина);
			
			//	Удалить из дерева значений, на форме.
			СтрокаДерева	= ЭлементыДеревоЗначений.НайтиПоИдентификатору(Строка["Идентификатор"]);
			
			Если НЕ СтрокаДерева = Неопределено Тогда
				СтрокаДерева.ПолучитьРодителя().ПолучитьЭлементы().Удалить(СтрокаДерева);
			КонецЕсли;
			
		КонецЦикла;
			
	КонецЕсли;
	
	ДеревоЗначений	= РеквизитФормыВЗначение("ЭлементыДеревоЗначений", Тип("ДеревоЗначений"));
	
	// Перенумеровать документов.
	Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
		СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(Строка["СсылкаНаОбъект"]);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();// СУДАРИКОВ - блокировки

	// Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	// ЗафиксироватьТранзакцию();// СУДАРИКОВ - блокировки
		
	Возврат Истина;
	
КонецФункции //Функция КомандаУдалитьНаСервере(Операция = "")

#КонецОбласти //#Область Удалить/#Область РАСЦЕНКИ


#Область Поправка115

//  Добавление поправки 1.15 - 1.25, если такой в ТЧ позиции нет.
//
&НаСервере
Функция КомандаПоправка115НаСервере()

	ТекПоправка115			= Справочники.СМ_ПоправкиПоТехническимЧастям.Поправка115;
	ВариантРасчетаЭММ		= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета", "ВариантРасчетаЭксплуатацииМашин");	
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	СтруктураОтбора			= Новый Структура;
	СтруктураОтбора.Вставить("УсловияПрименения", ТекПоправка115.УсловияПрименения);
	СтруктураОтбора.Вставить("Обоснование"		, ТекПоправка115.Обоснование);
	
	НачатьТранзакцию();
	
	Для каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		// Проверка, что такая была поправка.
		ВремТабл	= ОбъектПозиции.ПоправкиПозиции.Выгрузить();
		МассивСтрок = ВремТабл.НайтиСтроки(СтруктураОтбора);
		Если МассивСтрок.Количество() Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ОбъектПозиции.ПоправкиПозиции.Добавить();
		НоваяСтрока.УсловияПрименения	= ТекПоправка115.УсловияПрименения; 
		НоваяСтрока.Обоснование			= ТекПоправка115.Обоснование;
		НоваяСтрока.Применить			= Истина;
		НоваяСтрока.ВариантРасчета		= ВариантРасчетаЭММ;
		НоваяСтрока.КоэффОЗ 			= ТекПоправка115.КоэффициентКОсновнойЗарплате;		  
		НоваяСтрока.КоэффЭМ 			= ТекПоправка115.КоэффициентКЭксплуатацииМашин;
		НоваяСтрока.КоэффЗМ 			= ТекПоправка115.КоэффициентКЗарплатеМашинистов;
		НоваяСтрока.КоэффТР 			= ТекПоправка115.КоэффициентКТрудозатратамРабочих;
		НоваяСтрока.КоэффТМ 			= ТекПоправка115.КоэффициентКТрудозатратамМашинистов;
		НоваяСтрока.ТипПоправки 		= ТекПоправка115.ТипПоправки;

		ОбъектПозиции.Записать();

	КонецЦикла;	
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаПоправка115НаСервере()

#КонецОбласти //#Область Поправка115

#Область УстановитьНеИндексировать 

// Непосредственно установка флага Не индексировать в выбранных документах.
//
&НаСервере
Функция КомандаУстановитьНеИндексироватьНаСервере()
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//	Транзакция
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;
		Если ЭтоРаботаНаСервереБезКонтекста(Строка["СсылкаНаОбъект"].Определитель, Строка["СсылкаНаОбъект"].ТипНормативныхСборников)
			ИЛИ ЭтоБазисноИндексныйУровеньСметаНаСервереБезКонтекста(Строка["СсылкаНаОбъект"].ИДСметы) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		ОбъектПозиции.НеПрименятьИндексы = Истина;
		ОбъектПозиции.Записать();
		
	КонецЦикла;
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаУстановитьНеИндексироватьНаСервере()

&НаСервере
Функция КомандаУстановитьНеИзменятьЦены(НеИзменятьЦены = Истина)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//	Транзакция
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		ОбъектПозиции.НеИзменятьЦены = НеИзменятьЦены;
		ОбъектПозиции.Записать();
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаУстановитьНеИндексироватьНаСервере()

&НаСервереБезКонтекста
Функция ЭтоРаботаНаСервереБезКонтекста(Определитель, ТипНормативныхСборников)
	
	Если  Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Работа
		И (Не ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаЭксплуатациюМашин
		И Не ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.Транспортировка) Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //Функция ЭтоРаботаНаСервереБезКонтекста(Определитель, ТипНормативныхСборников)

&НаСервереБезКонтекста
Функция ЭтоБазисноИндексныйУровеньСметаНаСервереБезКонтекста(Смета)

	Возврат (Смета.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный И Смета.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета);

КонецФункции //Функция ЭтоБазисноИндексныйУровеньСметаНаСервереБезКонтекста(Смета)

#КонецОбласти //#Область УстановитьНеИндексировать

#Область УстановитьРасчет

// Выполняем непосредственно включение/исключение из расчета.
//
&НаСервере
Функция УстановитьРасчетНаСервере(ЗначениеРасчета)
	
	//
	ОбрабатываемыеРазделы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина));
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеРазделы Цикл
		
		//
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		ОбъектПозиции.Расчет = ЗначениеРасчета;
		ОбъектПозиции.Записать();
			
	КонецЦикла;
	
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;

		//
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		ОбъектПозиции.Расчет = ЗначениеРасчета;
		ОбъектПозиции.Записать();
			
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();// СУДАРИКОВ - блокировки

	// Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	// ЗафиксироватьТранзакцию(); // СУДАРИКОВ - блокировки.
	
	Возврат Истина;
	
КонецФункции //Функция УстановитьРасчетНаСервере(ЗначениеРасчета)

#КонецОбласти //#Область УстановитьРасчет/#Область РАСЦЕНКИ


#Область РассчитатьСтоимости

// Расчет стоимостей, только для вида ресурса (ЗатратыТрудаРабочих, МашиныИМеханизмы, Материалы, ЗатратыТрудаМашинистов).
//
&НаСервере
Функция КомандаРассчитатьСтоимостиНаСервере(ПоБазису)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;
		//
		СМ_СметаВызовСервера.РасчетСтоимостиРасценок(ПоБазису, Строка["СсылкаНаОбъект"]);
	
	КонецЦикла;
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	//
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаРассчитатьСтоимостиНаСервере(ПоБазису)

#КонецОбласти //#Область РассчитатьСтоимости


#Область УстановитьНормативыНРиСП

// Срабатывает после выбора нормативов НР и СП, запускаем запись выбранного в документы.
//
&НаКлиенте
Процедура КомандаУстановитьНормативыНРиСПОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;                                 
	КонецЕсли;
	
	//
	Если КомандаУстановитьНормативыНРиСПНаСервере(Результат) Тогда
	
		//	снять пометки с элементов
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), Ложь);
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура КомандаУстановитьНормативыНРиСПОповещениеНаКлиенте()

// Непосредственно замена нормативов НР и СП в позициях.
//
&НаСервере
Функция КомандаУстановитьНормативыНРиСПНаСервере(Результат)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	НачатьТранзакцию();
	
	//	цикл
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();  
		Если Результат.Вид = "Текущие" Тогда
			ОбъектПозиции.НакладныеРасходыТекущие	= Результат.НР;
			ОбъектПозиции.СметнаяПрибыльТекущие		= Результат.СП;
		Иначе
			ОбъектПозиции.НакладныеРасходыБазисные	= Результат.НР;
			ОбъектПозиции.СметнаяПрибыльБазисные	= Результат.СП;
		КонецЕсли;
		ОбъектПозиции.Записать();
		
	КонецЦикла;	
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаУстановитьНормативыНРиСПНаСервере(ОбъектыДляОперации, Результат)	


&НаКлиенте
Процедура ОтобратьОбрабатываемыеЭлементыНаКлиенте(Команда)
	
	ПараметрыКоманды = ПолучитьПараметрыКомандыНаКлиенте(Команда);
	
	Если ПараметрыКоманды["Операция"]["НРиСП"] Тогда
		СписокВыбора = ПолучитьСписокВыбораНРиСПНаСервере();
	Иначе
		СписокВыбора = Новый СписокЗначений;	
	КонецЕсли;
	
	ПараметрыОповещения	= Новый Структура();
	ПараметрыОповещения.Вставить("ПараметрыКоманды", ПараметрыКоманды);
		
	ПараметрыОткрытия	= Новый Структура();
	ПараметрыОткрытия.Вставить("СписокВыбора", СписокВыбора);
	
	Если СписокВыбора.Количество() <= 1 Тогда
	 	МассивВыбора = Новый Массив;
		Для Каждого ТекЭлемент Из СписокВыбора Цикл
			МассивВыбора.Добавить(ТекЭлемент.Значение);	
		КонецЦикла;
		ОтобраныОбрабатываемыеЭлементыНаКлиенте(МассивВыбора, ПараметрыОповещения);
	Иначе
		ОписаниеОповещения	= Новый ОписаниеОповещения("ОтобраныОбрабатываемыеЭлементыНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
		ОткрытьФорму("ОбщаяФорма.СМ_ВыборИзСписка", ПараметрыОткрытия, ЭтотОбъект,,,,ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры //Процедура ОтобратьОбрабатываемыеЭлементыНаКлиенте(ПараметрыКоманды)

&НаСервере
Функция ПолучитьСписокВыбораНРиСПНаСервере()
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	СписокВыбора			= Новый СписокЗначений;
		
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		
		// ********************************************
		// ++ AVV Обработка позиций ЛС с пустым видом работ

		//	Исключить повторы.
		Если НЕ СписокВыбора.НайтиПоЗначению(Строка["СсылкаНаОбъект"].ВидРабот) = Неопределено Тогда
			Продолжить;	
		КонецЕсли;
		
		//	Исключить не заполненные значения.
		Если НЕ ЗначениеЗаполнено(Строка["СсылкаНаОбъект"].ВидРабот) Тогда
			СписокВыбора.Добавить("", "Не заполнены");
		Иначе
			СписокВыбора.Добавить(Строка["СсылкаНаОбъект"].ВидРабот, Строка(Строка["СсылкаНаОбъект"].ВидРабот));
		КонецЕсли;
		// -- AVV
	    // ********************************************
		
	КонецЦикла;
	
	//
	Возврат СписокВыбора;
		
КонецФункции //Функция ПолучитьСписокВыбораНРиСПНаСервере()

&НаКлиенте
Процедура ОтобраныОбрабатываемыеЭлементыНаКлиенте(МассивВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если МассивВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры["ПараметрыКоманды"]["Операция"]["НРиСП"] Тогда
		ОтобратьОбрабатываемыеПозицииНРИСПНаСервере(МассивВыбора, ДополнительныеПараметры["ПараметрыКоманды"]);
	Иначе
	КонецЕсли;
	
	// Выполнить процедуру команды и вернуть выполнена/не выполнена.
	ВыполнитьКоманду = ВыполнитьКомандуНаКлиенте(ДополнительныеПараметры["ПараметрыКоманды"]["Действие"]);
	Если ВыполнитьКоманду Тогда
		// сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ДополнительныеПараметры["ПараметрыКоманды"]["Команда"]);
	КонецЕсли;
	
КонецПроцедуры //Процедура ОтобраныОбрабатываемыеЭлементыНаКлиенте(ПараметрыКоманды)

&НаКлиенте
Функция ВыполнитьКомандуНаКлиенте(ДействиеКоманды)
	
	Если ДействиеКоманды = "УстановитьНормативыНРиСП" Тогда
		Возврат ОбновитьНРиСПНаСервере();
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции //Функция ВыполнитьКомандуНаКлиенте(ДействиеКоманды)

&НаСервере
Процедура ОтобратьОбрабатываемыеПозицииНРИСПНаСервере(МассивВыбора, ПараметрыКоманды)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если МассивВыбора.Найти(Строка["СсылкаНаОбъект"].ВидРабот) = Неопределено Тогда
			ОбрабатываемыеЭлементы.Удалить(Строка);
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры //Процедура ОтобратьОбрабатываемыеПозицииНРИСПНаСервере(МассивВыбора, ПараметрыКоманды)

#КонецОбласти //#Область УстановитьНормативыНРиСП

#Область ОбновитьНРиСП  

// Непосредственно обновление НР и СП.
//
&НаСервере
Функция ОбновитьНРиСПНаСервере()
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		Документы.СМ_ПозицияЛокальнойСметы.ОбновитьНРиСП(ОбъектПозиции, Неопределено);
		ОбъектПозиции.Записать();

	КонецЦикла;	
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции //Функция ОбновитьНРиСПНаСервере()

#КонецОбласти

#Область ОбновитьПоНормативнойБазе

&НаКлиенте
Функция КомандаОбновитьПоНормативнойБазеНаКлиенте()
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	Позиции					= Новый Массив();
	
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;
		Позиции.Добавить(Строка["СсылкаНаОбъект"]);	
	КонецЦикла;
	
	//	
	СМ_СметаКлиент.ОбновитьПоНормативнойБазе(Позиции);
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаОбновитьПоНормативнойБазеНаКлиенте()

#КонецОбласти //#Область ОбновитьПоНормативнойБазе

#Область Процентовать

&НаКлиенте
Процедура КомандаПроцентоватьОповещениеНаКлиенте(Процент, ПараметрыОповещения) Экспорт
	
	//
	Если Процент = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если КомандаПроцентоватьНаСервере(Процент) Тогда
		
		//
		ДеревоЗначенийОбновитьНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

//  Изменение процентования расценок.
&НаСервере
Функция КомандаПроцентоватьНаСервере(Процент)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ДокументОбъект 			= Документ.ПолучитьОбъект();
		
	//
	НачатьТранзакцию();
	
	Для каждого Строка Из ОбрабатываемыеПозиции Цикл
		
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;

		Объем = (Строка["СсылкаНаОбъект"].ОбъемРабот/100) * Процент;
		
		СМ_СметаВызовСервера.ИзменитьФактОбъемПозицииАкта(ДокументОбъект, Строка["СсылкаНаОбъект"], Объем,,,Истина);
	
	КонецЦикла;
	
	ДокументОбъект.Записать();
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;

КонецФункции //Функция КомандаПроцентоватьНаСервере(Процент)

#КонецОбласти //#Область Процентовать

//	ввод значений

#Область УстановитьОпределитель

// Обработка изменения объема в выбранных документах.
//
&НаКлиенте
Процедура КомандаУстановитьОпределительОповещениеНаКлиенте(Определитель, ПараметрыОповещения) Экспорт
	
	//
	Если Определитель = НЕОПРЕДЕЛЕНО тогда
		Возврат;	
	КонецЕсли;
		
	//
	Если КомандаУстановитьОпределительНаСервере(Определитель) Тогда		
	
		//
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура КомандаУстановитьОпределительОповещениеНаКлиенте(Определитель, ПараметрыОповещения) Экспорт

&НаКлиенте
Процедура КомандаУстановитьСтатусРесурсаНаКлиенте(СтатусРесурса, ПараметрыОповещения) Экспорт
	
	//
	Если СтатусРесурса = НЕОПРЕДЕЛЕНО тогда
		Возврат;	
	КонецЕсли;
		
	//
	Если КомандаУстановитьСтатусРесурсаНаСервере(СтатусРесурса) Тогда		
	
		//
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаУстановитьСтатусРесурсаТЧНаКлиенте(СтатусРесурса, ПараметрыОповещения) Экспорт
	
	//
	Если СтатусРесурса = НЕОПРЕДЕЛЕНО тогда
		Возврат;	
	КонецЕсли;
		
	//
	Если КомандаРесурсыСтатусРесурса(СтатусРесурса) Тогда		
	
		//
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаУстановитьСтатусРесурсаАктТЧНаКлиенте(СтатусРесурса, ПараметрыОповещения) Экспорт
	
	//
	Если СтатусРесурса = НЕОПРЕДЕЛЕНО тогда
		Возврат;	
	КонецЕсли;
		
	//
	Если КомандаРесурсыСтатусРесурсаАкт(СтатусРесурса) Тогда		
	
		//
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
		Оповестить("ОбновитьДерево", Новый Структура("АктВыполненныхРабот", Документ));
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура КомандаУстановитьСтатусРесурсаАктРасценка(СтатусРесурса, ПараметрыОповещения) Экспорт
	
	//
	Если СтатусРесурса = НЕОПРЕДЕЛЕНО тогда
		Возврат;	
	КонецЕсли;
		
	//
	Если КомандаУстановитьСтатусРесурсаАктНаСервере(СтатусРесурса) Тогда		
	
		//
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЛОЖЬ);
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
		Оповестить("ОбновитьДерево", Новый Структура("АктВыполненныхРабот", Документ));
	КонецЕсли;
	
КонецПроцедуры 

// Непосредственное изменение объема в выбранных документах.
//
&НаСервере
Функция КомандаУстановитьОпределительНаСервере(Определитель)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	НачатьТранзакцию();
	
	//	
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		ОбъектПозиции.Определитель	= Определитель;
		ОбъектПозиции.формулаОбъема	= "";
		
		Документы.СМ_ПозицияЛокальнойСметы.ЗаполнитьНачисленияПозицииПоУмолчанию(ОбъектПозиции);
		
		ОбъектПозиции.Записать();

	КонецЦикла;	
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаУстановитьОпределительНаСервере(Определитель)	

&НаСервере
Функция КомандаУстановитьСтатусРесурсаНаСервере(СтатусРесурса)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	НачатьТранзакцию();
	
	//	
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		
		Если Не Строка["СсылкаНаОбъект"].Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал
			И Не Строка["СсылкаНаОбъект"].Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Оборудование Тогда
			Продолжить;
		КонецЕсли;

		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		ОбъектПозиции.СтатусРесурса	= СтатусРесурса;
		ОбъектПозиции.Записать();

	КонецЦикла;	
	
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции 

&НаСервере
Функция КомандаУстановитьСтатусРесурсаАктНаСервере(СтатусРесурса)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	НачатьТранзакцию();
	
	//	
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		
		Если Не Строка["СсылкаНаОбъект"].Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал
			И Не Строка["СсылкаНаОбъект"].Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Оборудование Тогда
			Продолжить;
		КонецЕсли;

		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		ОбъектПозиции.СтатусРесурсаАкт	= СтатусРесурса;
		ОбъектПозиции.Записать();

	КонецЦикла;	
	
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции 

#КонецОбласти //#Область УстановитьОпределитель/#Область РАСЦЕНКИ/#Область ВспомогательныеФункции/#Область КомандыФормы

#Область УстановитьОбъем  

&НаКлиенте
Процедура КомандаУстановитьОбъемОповещениеНаКлиенте(Объем, ПараметрыОповещения) Экспорт
	
	//
	Если Объем = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	//
	Если НЕ ПараметрыОповещения.Свойство("ТипОбъекта") тогда
		ПоказатьПредупреждение(, НСтр("ru='Ошибка! Параметры оповещения, не имеют свойства ""ТипОбъекта""!';"));
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаУстановитьОбъемНаСервере(Документ, Объем, ПараметрыОповещения) Тогда
		
		//
		ДеревоЗначенийОбновитьНаКлиенте();
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура КомандаУстановитьОбъемОповещениеНаКлиенте(Объем, ПараметрыОповещения) Экспорт

&НаСервере
Функция КомандаУстановитьОбъемНаСервере(Ссылка, Объем, ПараметрыОповещения)
	
	НачатьТранзакцию();
	
	//
	Если ПараметрыОповещения["ТипОбъекта"] = "АктВыполненныхРабот" тогда
		
		КомандаУстановитьОбъемАктВыполненныхРаботНаСервере(Ссылка, Объем);		
		
	Иначе
				
		КомандаУстановитьОбъемСметаНаСервере(Объем);
		
	КонецЕсли;
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаУстановитьОбъемНаСервере(ОбъектыДляОперации, Объем)

//	АктВыполненныхРабот. Непосредственное изменение объема в выбранных документах.
//
&НаСервере
Функция КомандаУстановитьОбъемАктВыполненныхРаботНаСервере(Ссылка, Объем)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ФактОбъем				= Объем;
	ДокументОбъект			= Ссылка.ПолучитьОбъект();
	
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;

		ФактОбъем = СМ_СметаВызовСервера.ИзменитьФактОбъемПозицииАкта(ДокументОбъект, Строка.СсылкаНаОбъект, ФактОбъем);
	КонецЦикла;
	
	ДокументОбъект.Записать();
	
	Возврат Истина;
	
КонецФункции //Функция КомандаУстановитьОбъемАктВыполненныхРаботНаСервере(Ссылка, Объем)

&НаСервере
Функция КомандаУстановитьНеИзменятьЦеныАктВыполненныхРаботНаСервере(Ссылка,НеИзменятьЦены = Истина)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
		
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		ДокументОбъект			= Строка.СсылкаНаОбъект.ПолучитьОбъект();
		ДокументОбъект.НеИзменятьЦены = НеИзменятьЦены;
		ДокументОбъект.Записать();
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции 

//	ЛокальнаяСмета, ОбъектнаяСмета. Непосредственное изменение объема в выбранных документах.
//
&НаСервере
Процедура КомандаУстановитьОбъемСметаНаСервере(Объем)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		Если Объем < Строка.ОбъемВсего И Строка.СтатусРедактирования = 1 Тогда
			Продолжить;
		КонецЕсли;
		ОбъектПозиции = Строка["СсылкаНаОбъект"].ПолучитьОбъект();
		ОбъектПозиции.ОбъемРабот	= Объем;
		ОбъектПозиции.формулаОбъема	= "";
		
		// Судариков - расчет в базовых единицах
		ВводОбъемовВБазовыхЕдИзм = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета", "ВводОбъемовВБазовыхЕдИзм",Ложь);
		Если ВводОбъемовВБазовыхЕдИзм Тогда
			
			ОбъектПозиции.ОбъемРабот = СМ_СметаВызовСервера.ПересчитатьВбазовыхЕдиницахИзмерения(ОбъектПозиции, ОбъектПозиции.ОбъемРабот);
					
		КонецЕсли;
		
		ОбъектПозиции.Записать();

	КонецЦикла;
	
КонецПроцедуры //Процедура КомандаУстановитьОбъемСметаНаСервере(Объем)	

#КонецОбласти //#Область УстановитьОбъем/#Область РАСЦЕНКИ/#Область ВспомогательныеФункции/#Область КомандыФормы

#Область СохранитьВФрагменте

&НаКлиенте
Процедура КомандаСохранитьВФрагментеОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт
	
	//
	Если Результат = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	//
	ПараметрыОповещения.Вставить("Фрагмент", Результат);
	
	//
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаСохранитьВФрагментеВыборГруппыОповещениеНаКлиенте", ЭтаФорма, ПараметрыОповещения);
	
	//
	ОткрытьФорму("Справочник.СМ_Фрагменты.ФормаВыбораГруппы", ПараметрыОповещения, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //Процедура КомандаСохранитьВФрагментеОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт

//
//
&НаКлиенте
Процедура КомандаСохранитьВФрагментеВыборГруппыОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат = НЕОПРЕДЕЛЕНО Тогда
		Возврат;
	КонецЕсли;	
	
	//
	Если КомандаСохранитьВФрагментеНаСервере(Результат, ПараметрыОповещения) Тогда
		
		//
		УстановитьСнятьПометкаРебенокНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы(), Ложь);
		
		//	сообщить пользователю
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура КомандаСохранитьВФрагментеВыборГруппыОповещениеНаКлиенте()	

// Сохранение группы расценок, как фрагмент в справочнике Фрагменты.
&НаСервере
Функция КомандаСохранитьВФрагментеНаСервере(ГруппаФрагментов, ПараметрыОповещения)
	
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	СправочникОбъект				= Справочники.СМ_Фрагменты.СоздатьЭлемент();
	СправочникОбъект.Родитель		= ГруппаФрагментов;
	СправочникОбъект.Наименование	= ПараметрыОповещения.Фрагмент; 
	
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		
		СтрокаРасценкиФрагмента = СправочникОбъект.РасценкиФрагмента.Добавить();
		СтрокаРасценкиФрагмента.ШифрРасценки			= Строка["СсылкаНаОбъект"].ШифрРасценки;
		СтрокаРасценкиФрагмента.НаименованиеРасценки	= Строка["СсылкаНаОбъект"].Наименование;
		СтрокаРасценкиФрагмента.ТипНормативныхСборников	= Строка["СсылкаНаОбъект"].ТипНормативныхСборников;
		СтрокаРасценкиФрагмента.ЕдиницаИзмерения		= Строка["СсылкаНаОбъект"].ЕдиницаИзмерения;		
		СтрокаРасценкиФрагмента.Измеритель				= Строка["СсылкаНаОбъект"].Измеритель;	
		СтрокаРасценкиФрагмента.Определитель			= Строка["СсылкаНаОбъект"].Определитель;	
		СтрокаРасценкиФрагмента.ФормулаОбъема			= ?(Строка["СсылкаНаОбъект"].ФормулаОбъема = "", СокрЛП(Строка(Строка["СсылкаНаОбъект"].ОбъемРабот)), Строка["СсылкаНаОбъект"].ФормулаОбъема);		
		СтрокаРасценкиФрагмента.Привязка				= ?(Строка["СсылкаНаОбъект"].ИДПозицииВладельца.Пустая(), Ложь, Истина);

	КонецЦикла;	
	
	Попытка
		СправочникОбъект.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось сохранить расценки в справочнике Фрагменты'"));
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;

КонецФункции //Функция КомандаСохранитьВФрагментеНаСервере()

#КонецОбласти //#Область СохранитьВФрагменте




#Область ПараметрыОткрытия

//	Сводные сметы, если выбрана объектная
//
//
//	ВозвращаемоеЗначение	- Булево
//
&НаКлиенте
Функция ПолучитьВключатьСС()
	
	Возврат Ложь;
	
КонецФункции //Функция ПолучитьВключатьСС()

//	Объектные сметы, если выбрана локальная
//
//
//	ВозвращаемоеЗначение	- Булево
//
&НаКлиенте
Функция ПолучитьВключатьОС()
	
	Если Параметры["Операция"] = "ОбработкаЛокальнойСметы" тогда
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции //Функция ПолучитьВключатьОС()

//	Локальные сметы, если выбраны раздел, позиция
//
//
//	ВозвращаемоеЗначение	- Булево
//
&НаКлиенте
Функция ПолучитьВключатьЛС()
	
	Если Параметры["Операция"] = "ОбработкаРаздела" тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции //Функция ПолучитьВключатьЛС()

//	Разделы, если выбраны раздел, позиция
//
//
//	ВозвращаемоеЗначение	- Булево
//
&НаКлиенте
Функция ПолучитьВключатьРазделы()
	
	Если Параметры["Операция"] = "ОбработкаРаздела" 
		ИЛИ Параметры["Операция"] = "ОбработкаПозиции" тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции //Функция ПолучитьВключатьРазделы()

#КонецОбласти //#Область ПараметрыОткрытия

#КонецОбласти //#Область РАСЦЕНКИ/#Область ВспомогательныеФункции/#Область КомандыФормы

#Область РЕСУРСЫ

#Область Заменить

//	Оповещение, после выбора нового ресурса.
//
//	Параметры:
//	Результат			- СправочникСсылка.СМ_Ресурсы - выбранный ресурс, на замену.
//	ПараметрыОповещения	- Структура	- 	
//
&НаКлиенте
Процедура КомандаРесурсыЗаменитьОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт
		
	РесурсВыб	= СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(Результат);
	
	Если Не ЗначениеЗаполнено(РесурсВыб) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПараметрыОповещения.МестоЗамены = "Ресурсы" Тогда
		
		ПараметрыОткрытия	= РесурсыЗаменитьПолучитьПараметрыВводаРасходаНаКлиенте(РесурсВыб, ПараметрыОповещения);
		ОписаниеОповещения 	= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьВводЗначенияОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
		
		ОткрытьФорму(	"ОбщаяФорма.СМ_ВводРасходаРесурса",
						ПараметрыОткрытия,
						,
						,
						,
						,
						ОписаниеОповещения,
						РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	ИначеЕсли ПараметрыОповещения.МестоЗамены = "НС" Тогда
		
		ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
		
		ПараметрыОповещения.Вставить("Ресурс"			, РесурсВыб);
		ПараметрыОповещения.Вставить("ПозицияРесурса"	, ОбрабатываемаяЛокальнаяСмета);
		
		ПараметрыОткрытия		= РесурсыЗаменитьПолучитьПараметрыВводаРасходаНаКлиенте(РесурсВыб, ПараметрыОповещения);
		
		Определитель			= СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(РесурсВыб, "Определитель");
		ВидРасценки				= СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Определитель, "ВидРасценки");
		
		ПараметрыОповещения2	= ОбъединитьПараметрыНаКлиенте(ПараметрыОткрытия, ПараметрыОповещения);
		
		Если ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Транспортировка")
			ИЛИ ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Работа") Тогда
			
			Оповещение = Новый ОписаниеОповещения("КомандаРесурсыЗаменитьПродолжитьОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения2);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Выбран не материал. Продолжить?';"
											+ " en = 'Do you want to continue?'"), РежимДиалогаВопрос.ДаНет, 0);
		Иначе
			КомандаРесурсыЗаменитьПродолжитьОповещениеНаКлиенте(КодВозвратаДиалога.Да, ПараметрыОповещения2);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры //Процедура КомандаРесурсыЗаменитьОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт

&НаКлиенте
Процедура КомандаРесурсыЗаменитьАктВыполненныхРаботОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт
	
	РесурсВыб	= СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(Результат);
	
	Если Не ЗначениеЗаполнено(РесурсВыб) Тогда
		Возврат;
	КонецЕсли; 
	
	//
	ПараметрыОткрытия	= РесурсыЗаменитьПолучитьПараметрыВводаРасходаНаКлиенте(РесурсВыб, ПараметрыОповещения);
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьВводЗначенияОповещениеНаКлиенте", ЭтотОбъект);
	
	ОткрытьФорму(	"ОбщаяФорма.СМ_ВводРасходаРесурса",
					ПараметрыОткрытия,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры //Процедура КомандаРесурсыЗаменитьАктВыполненныхРаботОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт

&НаКлиенте
Процедура КомандаРесурсыЗаменитьПлюсМинусОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт
	
	РесурсВыб	= СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(Результат);
	
	Если Не ЗначениеЗаполнено(РесурсВыб) Тогда
		Возврат;
	КонецЕсли; 
	
	//
	ПараметрыОткрытия	= РесурсыЗаменитьПолучитьПараметрыВводаРасходаНаКлиенте(РесурсВыб, ПараметрыОповещения);
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьПлюсМинусВводЗначенияОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
	
	ОткрытьФорму(	"ОбщаяФорма.СМ_ВводРасходаРесурса",
					ПараметрыОткрытия,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры //Процедура КомандаРесурсыЗаменитьПлюсМинусОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт

&НаКлиенте
Процедура КомандаРесурсыЗаменитьПлюсМинусИзВБНаКлиенте(Данные) Экспорт
	
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ОбрабатываемыеРесурсы			= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ПараметрыРасчета				= СМ_ПолучитьПараметрыРасчетаНаКлиенте(ОбрабатываемаяЛокальнаяСмета);
	ЗаменяемыйРесурс				= Элементы.тзРесурсы.ТекущиеДанные.Ресурс;
	РасходПоНормеСтарый				= Элементы.тзРесурсы.ТекущиеДанные.РасходПоНорме;
	Результат						= ПривестиСтруктуруНаКлиенте(Данные);
	
	//
	Если Результат = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данный ресурс не найден в БД.'"));
		Возврат;
	КонецЕсли;
	
	//
	ТекущаяКоманда		= ПолучитьТекущуюКомандуНаКлиенте();
	ПараметрыОповещения	= РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(ТекущаяКоманда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета, "", Истина);
	ПараметрыОткрытия	= РесурсыЗаменитьПолучитьПараметрыВводаРасходаНаКлиенте(Результат.Ресурс, ПараметрыОповещения);
	ОписаниеОповещения	= Новый ОписаниеОповещения("КомандаРесурсыЗаменитьПлюсМинусВводЗначенияОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
	
	ОткрытьФорму(	"ОбщаяФорма.СМ_ВводРасходаРесурса",
					ПараметрыОткрытия,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры //Процедура КомандаРесурсыЗаменитьПлюсМинусИзВБНаКлиенте(Данные) Экспорт


//	Оповещение, после ввода новых значений, выбранного ресурса.
//
//	Параметры:
//	Результат			- СправочникСсылка.СМ_Ресурсы - выбранный ресурс, на замену.
//	ПараметрыОповещения	- Структура	- 	
//
&НаКлиенте
Процедура КомандаРесурсыЗаменитьВводЗначенияОповещениеНаКлиенте(ПараметрыЗамены, ПараметрыОповещения) Экспорт
	
	//
	Если Не ЗначениеЗаполнено(ПараметрыЗамены) Тогда
		Возврат;
	КонецЕсли;
	
	//	Выполнить действие.
	Если КомандаРесурсыЗаменитьНаСервере(ОбъединитьПараметрыНаКлиенте(ПараметрыЗамены, ПараметрыОповещения)) Тогда
		
		//	Заполнить дерево значений.
		ДеревоЗначенийОбновитьНаКлиенте(Новый Структура("Документ", Документ));
		
		//	Заполнить сводные таблицы значений, по табличным частям документов.
		ЗаполнитьТаблицыЗначенийНаСервере();
		
		//	Добавить строки в отобранные "Ресурсы", "Поправки", "Начисления", "Индексы", "Свойства".
		ЗаполнитьТабличныеЧастиНаКлиенте();
		
		//	Сообщить пользователю.
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;	
	
КонецПроцедуры //Процедура КомандаРесурсыЗаменитьВводЗначенияОповещениеНаКлиенте(ПараметрыЗамены, ПараметрыОповещения) Экспорт

&НаКлиенте
Процедура КомандаРесурсыЗаменитьАктВыполненныхРаботВводЗначенияОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	//
	Если КомандаРесурсыЗаменитьАктВыполненныхРаботНаСервере(Результат) Тогда
		
		//	Заполнить дерево значений.
		ДеревоЗначенийОбновитьНаКлиенте(Новый Структура("Документ", Документ));
		
		//	Добавить строки в отобранные "Ресурсы", "Поправки", "Начисления", "Индексы", "Свойства".
		ЗаполнитьТабличныеЧастиНаКлиенте();
		
		//	Сообщить пользователю.
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;
	
КонецПроцедуры //Процедура КомандаРесурсыЗаменитьАктВыполненныхРаботВводЗначенияОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт

&НаКлиенте
Процедура КомандаРесурсыЗаменитьПлюсМинусВводЗначенияОповещениеНаКлиенте(ПараметрыЗамены, ПараметрыОповещения) Экспорт
	
	//
	Если Не ЗначениеЗаполнено(ПараметрыЗамены) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ПараметрыРасчета				= СМ_ПолучитьПараметрыРасчетаНаКлиенте(ОбрабатываемаяЛокальнаяСмета);
	
	//
	Если КомандаРесурсыЗаменитьПлюсМинусНаСервере(ОбъединитьПараметрыНаКлиенте(ПараметрыЗамены, ПараметрыОповещения), ПараметрыРасчета) Тогда
		
		//	Заполнить дерево значений.
		ДеревоЗначенийОбновитьНаКлиенте(Новый Структура("Документ", Документ));
		
		//	Добавить строки в отобранные "Ресурсы", "Поправки", "Начисления", "Индексы", "Свойства".
		ЗаполнитьТабличныеЧастиНаКлиенте();
		
		//	Сообщить пользователю.
		СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(ПараметрыОповещения.КомандаИмя);
		
	КонецЕсли;	
	
КонецПроцедуры //Процедура КомандаРесурсыЗаменитьПлюсМинусВводЗначенияОповещениеНаКлиенте(Результат, ПараметрыОповещения) Экспорт

//	Выполнение необходимых действий, выбранной команды.
//
&НаСервере
Функция КомандаРесурсыЗаменитьНаСервере(ПараметрыЗамены)
	
	//
	тзОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ОбрабатываемыеПозиции	= тзОбрабатываемыеПозиции.ВыгрузитьКолонку("СсылкаНаОбъект");
	
	//
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		
		// 1. Замена ресурса в табличной части ресурсов акта
		СМ_СметаВызовСервера.ЗаменитьРесурсВТЧРесурсыАкта(Документ, ПараметрыЗамены, ОбрабатываемыеПозиции); 
		
	Иначе
		
		// 1. Замена ресурса в табличной части ресурсов документов позиций
		СМ_СметаВызовСервера.ЗаменитьРесурсВТЧРесурсыСметы(ПараметрыЗамены,, ОбрабатываемыеПозиции); 
		
		// 2. Пересчитываем
		ДокументПерерасчетНаСервере(Документ);
	
	КонецЕсли;
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаРесурсыЗаменитьНаСервере(ПараметрыДополнительные)

&НаСервере
Функция КомандаРесурсыЗаменитьАктВыполненныхРаботНаСервере(Результат)
	
	ОтборПозиций	= Новый Массив();
	
	// 1. Замена ресурса в табличной части ресурсов акта
	СМ_СметаВызовСервера.ЗаменитьРесурсВТЧРесурсыАкта(Документ, Результат, ОтборПозиций); 
	
	//
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция КомандаРесурсыЗаменитьПлюсМинусНаСервере(ПараметрыЗамены, ПараметрыРасчета)
	
	НачатьТранзакцию();
	
	//
	тзОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	Позиции					= тзОбрабатываемыеПозиции.ВыгрузитьКолонку("СсылкаНаОбъект");
	ОтборПоПозициямСЗ		= Новый СписокЗначений();
	ОтборПоПозициямСЗ.ЗагрузитьЗначения(Позиции);
	
	// Не учтенные - не меняем.
	ТаблицаРесурсовПозиций = СМ_СметаВызовСервера.ПолучитьСписокВсехРесурсовПозиций(ОтборПоПозициямСЗ, ПараметрыЗамены.ЗаменяемыйРесурс, Истина); 
	СписокРесурсов 	= Новый СписокЗначений();
	СписокРесурсов.ЗагрузитьЗначения(ТаблицаРесурсовПозиций.ВыгрузитьКолонку("Ресурс"));
	
	//
	Для Каждого Строка Из ТаблицаРесурсовПозиций Цикл
		
		Если НЕ ТипЗнч(Строка.Позиция) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
			Продолжить;
		КонецЕсли;
		//
		//Предупреждение = НСтр("ru='Разные единицы измерения ресурсов, проверьте объем в позиции-ресурсе замены'");
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Предупреждение);
		
		ПозицияОбъект = Строка.Позиция.ПолучитьОбъект();
		
		//	Старый ресурс вставляется за расценку со знаком Минус.
		ПараметрыПоиска	= РесурсыЗаменитьПлюсМинусПолучитьПараметрыПоискаНаСервере(Строка, ПозицияОбъект, ПараметрыЗамены);
		СМ_СметаВызовСервера.СоздатьПозициюНеучтенныйРесурс(ПозицияОбъект, ПараметрыПоиска, ПараметрыРасчета);
		
		//	Новый ресурс. Норма расхода = Норма расхода заменяемого ресурса * КоэффициентКНорме.
		//	Временно от этого отказываемся.
		ПараметрыПоиска	= РесурсыЗаменитьПлюсМинусЗаменяемыйРесурсПолучитьПараметрыПоискаНаСервере(Строка, ПозицияОбъект, ПараметрыЗамены);
		СМ_СметаВызовСервера.СоздатьПозициюНеучтенныйРесурс(ПозицияОбъект, ПараметрыПоиска, ПараметрыРасчета);
		
	КонецЦикла;
	 
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;

КонецФункции


// Процедура продолжает обработку выбранного значения замены. 
//
// Параметры:
//     КодВозврата			- код возврата диалога.
//     ПараметрыОповещения	- набор необходимых параметров.
//
&НаКлиенте
Процедура КомандаРесурсыЗаменитьПродолжитьОповещениеНаКлиенте(КодВозврата, ПараметрыОповещения) Экспорт
	
	Если КодВозврата = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;
	
	//	ресурс - в данном случае, нормативный сборник
	СМ_СметаВызовСервера.ЗаполнитьДанныеРесурса(ПараметрыОповещения.Ресурс, ПараметрыОповещения);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("КомандаРесурсыЗаменитьВводЗначенияОповещениеНаКлиенте", ЭтотОбъект, ПараметрыОповещения);
	
	ОткрытьФорму(	"ОбщаяФорма.СМ_ВводРасходаРесурса",
					ПараметрыОповещения,
					,
					,
					,
					,
					ОписаниеОповещения,
					РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры //Процедура КомандаРесурсыЗаменитьПродолжитьОповещениеНаКлиенте(КодВозврата, ПараметрыОповещения) Экспорт


#Область ВспомогательныеФункции

//	ПАРАМЕТРЫ

&НаКлиенте
Функция РесурсыЗаменитьПолучитьПараметрыВводаРасходаНаКлиенте(Элемент, ПараметрыОповещения)
	
	//
	Структура				= Новый Структура();
	Цены					= Новый Структура("БазиснаяЦена, БазиснаяЗарплатаМашинистов, ТекущаяЦена, ТекущаяЗарплатаМашинистов", 0, 0, 0, 0);
	ДополнительныеПараметры = РесурсыЗаменитьПолучитьПараметрыДополнительныеНаКлиенте(ПараметрыОповещения);
	БезЦены					= Ложь;
	
	Если ПараметрыОповещения.МестоЗамены = "НС" Тогда
		БезЦены = Истина;
		// Перейти ~БезЦены;	
	КонецЕсли;
	
	Если НЕ БезЦены Тогда
	
		// Получить цены
		Если НЕ СметнаяКомпонента = Неопределено И ДополнительныеПараметры.АвтоЗагрузкаЦен И
			ЗначениеЗаполнено(ДополнительныеПараметры.ФайлТекущихЦен) Тогда
			// Проверка подтягивания цен из ВБ.
			СМ_СметаКлиент.ПолучитьЦеныНовогоРесурса(	Элемент,
														ДополнительныеПараметры.Район,
														ДополнительныеПараметры.ИмяФайлаСборникаТекущихЦен,
														ДополнительныеПараметры.КодРегиональнойБазы,
														Цены);
		Иначе
			//
			СМ_СметаВызовСервера.ПолучитьЦеныНовогоРесурса(	Элемент,
															ДополнительныеПараметры.Район,
															ДополнительныеПараметры.РегиональнаяБаза,
															ДополнительныеПараметры.ДатаТекущихЦен,
															Цены,
															ДополнительныеПараметры.ВыбиратьТекущиеЦены);
		КонецЕсли;
														
	КонецЕсли;

	// ~БезЦены:
	
	Структура.Вставить("ЗаменяемыйРесурс"	, ПараметрыОповещения.ЗаменяемыйРесурс);
	Структура.Вставить("Ресурс"				, Элемент);
	Структура.Вставить("БазисЦена"			, Цены.БазиснаяЦена);
	Структура.Вставить("БазисЗарплМаш"		, Цены.БазиснаяЗарплатаМашинистов);
	Структура.Вставить("ТекЦена"			, Цены.ТекущаяЦена);
	Структура.Вставить("ТекЗарплМаш"		, Цены.ТекущаяЗарплатаМашинистов);
	Структура.Вставить("РасходПоНорме"		, ПараметрыОповещения.РасходПоНорме);
	Структура.Вставить("РасходПоФакту"		, ПараметрыОповещения.РасходПоФакту);
	
	//	
	Возврат Структура;
		
КонецФункции //Функция РесурсыЗаменитьПолучитьПараметрыВводаРасходаНаКлиенте(Элемент, ПараметрыОповещения)

&НаКлиенте
Функция РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета, МестоЗамены = "", ЗаменаПлюсМинусВБ = Ложь)
	
	//
	Структура = Новый Структура();
	
	//
	Если ОбрабатываемыеРесурсы.Количество() Тогда
		
		Структура.Вставить("КомандаИмя"			, Команда.Имя);
		Структура.Вставить("Документ"			, ОбрабатываемаяЛокальнаяСмета);
		Структура.Вставить("ЗаменяемыйРесурс"	, ОбрабатываемыеРесурсы[0].Ресурс);
		Структура.Вставить("РасходПоНорме"		, ОбрабатываемыеРесурсы[0].РасходПоНорме);
		Структура.Вставить("РасходПоФакту"		, ОбрабатываемыеРесурсы[0].РасходПоФакту);
		Структура.Вставить("РасходПоНормеСтарый", ОбрабатываемыеРесурсы[0].РасходПоНорме);
		Структура.Вставить("ЗаменаПлюсМинусВБ"	, ЗаменаПлюсМинусВБ);
		Структура.Вставить("ТолькоНорма"		, Истина);
	    Структура.Вставить("МестоЗамены"		, МестоЗамены);
		
		//
		Возврат Структура;
		
	Иначе
		Возврат Структура;
	КонецЕсли;
	
КонецФункции //Функция РесурсыЗаменитьПолучитьПараметрыОповещенияНаКлиенте(Команда, ОбрабатываемыеРесурсы, МестоЗамены = "")

&НаКлиенте
Функция РесурсыЗаменитьПолучитьПараметрыДополнительныеНаКлиенте(ПараметрыОповещения)
	
	//
	Структура						= Новый Структура("АвтоЗагрузкаЦен, Район, ДатаТекущихЦен, ФайлТекущихЦен, КодРегионаФайлаТекущихЦен");
	ОбрабатываемаяЛокальнаяСмета	= ЛокальнаяСметаНаСервере(Документ);
	ПараметрыРасчета				= СМ_ПолучитьПараметрыРасчетаНаКлиенте(ОбрабатываемаяЛокальнаяСмета);
	
	// получим цены
	ВыбиратьТекущиеЦены = 	НЕ ЗначениеЗаполнено(ПараметрыРасчета.ФайлСборникаТекущихЦен)
							И НЕ ПараметрыРасчета.РегионДляВыбораЦен.Пустая()
							И ПараметрыРасчета.АвтозагрузкаЦен;	
							
	//
	Структура.Вставить("АвтоЗагрузкаЦен"			, ПараметрыРасчета.АвтозагрузкаЦен);
	Структура.Вставить("Район"						, ПараметрыРасчета.Район);
	Структура.Вставить("ДатаТекущихЦен"				, ПараметрыРасчета.ДатаТекущихЦен);
	Структура.Вставить("ФайлТекущихЦен"				, ПараметрыРасчета.ФайлСборникаТекущихЦен);
	Структура.Вставить("КодРегионаФайлаТекущихЦен"	, ПараметрыРасчета.КодРегионаФайлаТекущихЦен);
	Структура.Вставить("РегиональнаяБаза"			, ПараметрыРасчета.РегионДляВыбораЦен);
	Структура.Вставить("КодРегиональнойБазы"		, ПараметрыРасчета.КодРегионаФайлаТекущихЦен);
	Структура.Вставить("ИмяФайлаСборникаТекущихЦен"	, ПараметрыРасчета.ФайлСборникаТекущихЦен);
	Структура.Вставить("ВыбиратьТекущиеЦены"		, ВыбиратьТекущиеЦены);
	
	//
	Возврат Структура;
	
КонецФункции //Функция РесурсыЗаменитьПолучитьПараметрыДополнительныеНаКлиенте(ПараметрыОповещения)

&НаКлиенте
Функция РесурсыЗаменитьПолучитьПараметрыПоискаНаКлиенте(ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета)
	
	//
	Структура = Новый Структура("РегиональнаяБаза, Район, ДатаТекущихЦен, ТекРесурс");
	
	//	либо одна строка, либо нет выделенных
	Если ОбрабатываемыеРесурсы.Количество() Тогда
		
		//
		ПараметрыРасчета	= СМ_ПолучитьПараметрыРасчетаНаКлиенте(ОбрабатываемаяЛокальнаяСмета);
		
		//	
		Структура.Вставить("РегиональнаяБаза"	, ПараметрыРасчета.РегионДляВыбораЦен);
		Структура.Вставить("Район"				, ПараметрыРасчета.Район);
		Структура.Вставить("ДатаТекущихЦен"		, ПараметрыРасчета.ДатаТекущихЦен);
		Структура.Вставить("ТекРесурс"			, ОбрабатываемыеРесурсы[0].Ресурс);
		
		//
		Возврат Структура;
	
	Иначе
		Возврат Структура;	
	КонецЕсли;
		
КонецФункции //Функция РесурсыЗаменитьПолучитьПараметрыПоискаНаКлиенте(ОбрабатываемыеРесурсы, ОбрабатываемаяЛокальнаяСмета)

&НаСервере
Функция РесурсыЗаменитьПлюсМинусПолучитьПараметрыПоискаНаСервере(Строка, ПозицияОбъект, ПараметрыЗамены)
	
	Структура = Новый Структура;
	
	НормаРасхода	= СтрЗаменить(Строка.НормаРасхода,",",".");
	
	Структура.Вставить("Ресурс"						, ПараметрыЗамены.ЗаменяемыйРесурс);
	Структура.Вставить("РегиональнаяБаза"			, ПозицияОбъект.РегиональнаяБаза);
	Структура.Вставить("Район");
	Структура.Вставить("ДатаТекущихЦен");
	Структура.Вставить("ЗагружатьТекущиеЦены");
	Структура.Вставить("ФайлСборникаТекущихЦен");
	Структура.Вставить("КодРегионаФайлаТекущихЦен");
	Структура.Вставить("НеИндексировать"			, Истина);
	Структура.Вставить("БазиснаяЦена"				, Строка.Базиснаяцена);
	Структура.Вставить("ТекущаяЦена"				, Строка.ТекущаяЦена);
	Структура.Вставить("БазиснаяЗарплМаш"			, Строка.БазиснаяЗарплатаМашинистов);
	Структура.Вставить("ТекущаяЗарплМаш"			, Строка.ТекущаяЗарплатаМашинистов);
	Структура.Вставить("Код"						, Строка.СметныйКодРесурса);
	Структура.Вставить("ВидРесурса"					, Строка.ВидРесурса);
	Структура.Вставить("ТипМатериала"				, Строка.ТипМатериала);
	Структура.Вставить("ЕдИзм"						, Строка.Ресурс.ЕдиницаИзмерения);
	Структура.Вставить("Норма"						, -1 * НормаРасхода);
	Структура.Вставить("Раздел"						, ПозицияОбъект.ИДРодителя); 
	Структура.Вставить("Владелец"					, ПозицияОбъект);
	
	//
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция РесурсыЗаменитьПлюсМинусЗаменяемыйРесурсПолучитьПараметрыПоискаНаСервере(Строка, ПозицияОбъект, ПараметрыЗамены)
	
	Структура = Новый Структура;
	
	// Коэффициент к расходу ресурса.
	// Определение коэффициента к норме расхода, исходя из заданного пользователем.
	Если ПараметрыЗамены.ЗаменаПлюсМинусВБ Тогда
		// Определение коэффициента к норме расхода, исходя только из соответствия. 
		// Единиц измерения, т к норму расхода при выборе из ВБ задать нельзя. 
		Если НЕ ПараметрыЗамены.ЗаменяемыйРесурс.ЕдиницаИзмерения = ПараметрыЗамены.Ресурс.ЕдиницаИзмерения Тогда
			КоэффициентКНорме = ОпределитьКоэффициентКНорме(ПараметрыЗамены.ЗаменяемыйРесурс.ЕдиницаИзмерения, ПараметрыЗамены.Ресурс.ЕдиницаИзмерения);	
		КонецЕсли;	
	Иначе
		Если НЕ ПараметрыЗамены.РасходПоНормеСтарый = 0 Тогда
			КоэффициентКНорме = ПараметрыЗамены.РасходПоНорме/ПараметрыЗамены.РасходПоНормеСтарый;
		Иначе
			КоэффициентКНорме = 1;
		КонецЕсли;
	КонецЕсли;	
	
	Структура.Вставить("Ресурс"						, ПараметрыЗамены.Ресурс);
	Структура.Вставить("РегиональнаяБаза"			, ПозицияОбъект.РегиональнаяБаза);
	Структура.Вставить("Район");
	Структура.Вставить("ДатаТекущихЦен");
	Структура.Вставить("ЗагружатьТекущиеЦены");
	Структура.Вставить("ФайлСборникаТекущихЦен");
	Структура.Вставить("КодРегионаФайлаТекущихЦен");
	Структура.Вставить("НеИндексировать"			, Истина);
	Структура.Вставить("БазиснаяЦена"				, ПараметрыЗамены.БазисЦена);
	Структура.Вставить("ТекущаяЦена"				, ПараметрыЗамены.ТекЦена);
	Структура.Вставить("БазиснаяЗарплМаш"			, ПараметрыЗамены.БазисЗарплМаш);
	Структура.Вставить("ТекущаяЗарплМаш"			, ПараметрыЗамены.ТекЗарплМаш);
	Структура.Вставить("Код"						, ПараметрыЗамены.Ресурс.Код);
	Структура.Вставить("ВидРесурса"					, ПараметрыЗамены.Ресурс.ВидРесурса);
	Структура.Вставить("ЕдИзм"						, ПараметрыЗамены.Ресурс.ЕдиницаИзмерения);
	Структура.Вставить("Норма"						, Строка.НормаРасхода * КоэффициентКНорме);
	Структура.Вставить("Раздел"						, ПозицияОбъект.ИДРодителя); 
	Структура.Вставить("Владелец"					, ПозицияОбъект);
		
	//
	Возврат Структура;
	
КонецФункции


&НаСервере
Функция ЛокальнаяСметаНаСервере(ВыбранноеЗначение)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		Возврат ВыбранноеЗначение.ЛокальнаяСмета;
	Иначе
		Возврат ПолучитьОбрабатываемуюЛокальнуюСметуНаСервере();
	КонецЕсли;
		
КонецФункции

//

&НаКлиенте
Функция ПолучитьТекущуюКомандуНаКлиенте()
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		Возврат Новый Структура("Имя", "РЕСУРСЫ_ОС_0_3_ЗаменитьПлюсМинусИзВБ");
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Возврат Новый Структура("Имя", "РЕСУРСЫ_ЛС_0_3_ЗаменитьПлюсМинусИзВБ");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции


&НаКлиенте
Функция ПолучитьОбрабатываемыеРесурсыНаКлиенте()
	
	//
	Массив	= Новый Массив();
	
	//
	Для Каждого Идентификатор Из Элементы.тзРесурсы.ВыделенныеСтроки Цикл
		Строка	= ТабличнаяЧастьРесурсы.НайтиПоИдентификатору(Идентификатор);
		Массив.Добавить(Строка);
	КонецЦикла;
	
	//
	Возврат Массив;
	
КонецФункции //Функция ПолучитьОбрабатываемыеРесурсыНаКлиенте()

&НаКлиенте
Функция ОбъединитьПараметрыНаКлиенте(Результат, ПараметрыОповещения)
	
	//	скопировать
	ФиксированнаяСтруктура	= Новый ФиксированнаяСтруктура(Результат);
	Структура				= Новый Структура(ФиксированнаяСтруктура);
	
	//
	Если ТипЗнч(Структура.Ресурс) = Тип("Строка") Тогда
		Структура.Вставить("НаименованиеРесурса"	, ?(ТипЗнч(ПараметрыОповещения.Ресурс) = Тип("Строка"), ПараметрыОповещения.Ресурс, ПараметрыОповещения.Ресурс.ДлинноеНаименование));
		Структура.Вставить("КодРесурса"				, ПараметрыОповещения.ШифрРасценки);
		Структура.Вставить("ЕдиницаИзмеренияРесурса", ПараметрыОповещения.ЕдиницаИзмерения);
		Структура.Вставить("ВидРесурса"				, СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(ПараметрыОповещения.Определитель, "ВидРасценки"));
	КонецЕсли;
	
	//
	Если ТипЗнч(ПараметрыОповещения) = Тип("Структура") Тогда
		Для Каждого КлючИЗначение Из ПараметрыОповещения Цикл
			Если НЕ Структура.Свойство(КлючИЗначение.Ключ) Тогда
				Структура.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//
	Возврат Структура;
	
КонецФункции //Функция ОбъединитьПараметрыНаКлиенте(Результат, ПараметрыОповещения)


//	ЗаменитьРесурсПлюсМинус
//
&НаСервере
Функция ОпределитьКоэффициентКНорме(СтараяЕдиницаИзмерения, НоваяЕдиницаИзмерения)
	Коэффициент = 1;
	БазоваяСтарая = СтараяЕдиницаИзмерения.БазоваяЕдиница;
	БазоваяНовая = НоваяЕдиницаИзмерения.БазоваяЕдиница;
	Если БазоваяНовая <> Неопределено Тогда
		Если БазоваяНовая = СтараяЕдиницаИзмерения Тогда
			Если НоваяЕдиницаИзмерения.КоэффициентПеревода <> 0 Тогда
				Коэффициент = 1 / НоваяЕдиницаИзмерения.КоэффициентПеревода; 
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Если БазоваяСтарая <> Неопределено Тогда
		Если БазоваяСтарая = НоваяЕдиницаИзмерения Тогда
			Если СтараяЕдиницаИзмерения.КоэффициентПеревода <> 0 Тогда
				Коэффициент =  СтараяЕдиницаИзмерения.КоэффициентПеревода; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Коэффициент;
КонецФункции

//	используется в процедуре "ВнешнееСобытие"
//
&НаСервере
Функция ПривестиСтруктуруНаКлиенте(Данные)
	
	ТаблицаРесурса = СМ_СметаЗагрузкаВызовСервера.ЗагрузитьТекущиеЦеныВТаблицу(Данные);
	
	Если ТаблицаРесурса.Количество() Тогда
		СтрРесурс = ТаблицаРесурса[0];
		Ресурс = НайтиРесурсПоШифру(СтрРесурс.ШифрРасценки);
		Если Ресурс = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			Структура = Новый Структура();
			Структура.Вставить("Ресурс"						, Ресурс);
			Структура.Вставить("Норма"						, СтрЗаменить(СтрРесурс.ОбъемРабот,",","."));
			Структура.Вставить("ТекущаяЦена"				, СтрЗаменить(СтрРесурс.ТекущаяЦена,",","."));
			Структура.Вставить("ТекущаяЗарплатаМашинистов"	, СтрЗаменить(СтрРесурс.ТекущаяЗарплатаМашинистов,",","."));
			Возврат Структура;
		КонецЕсли;
	КонецЕсли;
		
КонецФункции

// Поиск в справочнике ресурсов.
//
&НаСервере
Функция НайтиРесурсПоШифру(Шифр)
	Ресурс = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		               |	СправочникСмета.Ссылка КАК Ресурс
	    	           |ИЗ
	        	       |	Справочник.СМ_Ресурсы КАК СправочникСмета
	            	   |ГДЕ
		               |	СправочникСмета.Код = &Шифр";
	Запрос.УстановитьПараметр("Шифр",Шифр);
	РесурсыДанные = Запрос.Выполнить().Выбрать();
	Если РесурсыДанные.Следующий() Тогда
		Ресурс = РесурсыДанные.Ресурс;
	КонецЕсли; 
	Возврат Ресурс;
КонецФункции


#КонецОбласти //#Область ВспомогательныеФункции/#Область Заменить/#Область РЕСУРСЫ

#КонецОбласти //#Область Заменить/#Область РЕСУРСЫ

#Область РедактироватьЦены

&НаСервере
Функция КомандаРесурсыРедактироватьЦеныНаСервере()
		
	//
	ТаблицаЗначенийОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ОтобранныеПозиции						= ТаблицаЗначенийОбрабатываемыеПозиции.ВыгрузитьКолонку("СсылкаНаОбъект");
	
	// !!! Важно !!!
	// Когда нажимаем "СОбнулением", во всех строках проставляется значение "Модифицированность".
	ТаблицаЗначенийРесурсы 					= ТабличнаяЧастьРесурсы.Выгрузить(Новый Структура("Модифицированность", Истина));
	
	НачатьТранзакцию(); // СУДАРИКОВ - блокировки
	
	// Установка управляемой блокировки позиций ЛС по ИДсметы
	Если ОтобранныеПозиции.Количество() > 0 Тогда 
		Блокировка 					= Новый БлокировкаДанных;
		ЭлементБлокировки 			= Блокировка.Добавить();
		ЭлементБлокировки.Область 	= "Документ.СМ_ПозицияЛокальнойСметы";
		ЭлементБлокировки.Режим 	= РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("ИДСметы", ОтобранныеПозиции[0].ИДСметы); 
		Блокировка.Заблокировать();	
	КонецЕсли;
	
	//	Записываем в документы.
	СМ_СметаВызовСервера.ОбновитьЦеныРесурсыСметы(ТаблицаЗначенийРесурсы,, ОтобранныеПозиции, СОбнулением); 

	ЗафиксироватьТранзакцию();  // СУДАРИКОВ - блокировки
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
		
	//	Обновить таблицу значений, на форме.	
	Для Каждого Строка Из ТабличнаяЧастьРесурсы Цикл
		
		//	снять модифицированность, т.к. ресурсы изменены.
		Строка.Модифицированность	= Ложь;
		Строка.ЦенаБазиснаяСтарая	= Строка.ЦенаБазисная;
		Строка.ЦенаТекущаяСтарая	= Строка.ЦенаТекущая;
		Строка.ЦенаЗМБазиснаяСтарая	= Строка.ЦенаЗМБазисная;
		Строка.ЦенаТекущаяЗМСтарая	= Строка.ЦенаТекущаяЗМ;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции //Функция КомандаРесурсыРедактироватьЦеныНаСервере()

&НаСервере
Функция КомандаРесурсыРедактироватьЦеныАктНаСервере()
	
	//
	ТаблицаЗначений	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ОтборПозиций	= ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект");
	
	ТаблицаРедактированияЦен = ТабличнаяЧастьРесурсы.Выгрузить();
	ИменаКолонокМассив = Новый Массив();
	ИменаКолонокМассив.Добавить("ЦенаБазисная");
	ИменаКолонокМассив.Добавить("ЦенаТекущая");
	ИменаКолонокМассив.Добавить("ЦенаЗМБазисная");
	ИменаКолонокМассив.Добавить("ЦенаТекущаяЗМ");
	
	//// 1. Оставим только измененные значения.
	//ОставитьТолькоИзмененныеЗначенияВТаблице(ТаблицаРедактированияЦен, ИменаКолонокМассив, СОбнулением);
	
	Если ТаблицаРедактированияЦен.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нет изменений в ценах'"));
		Возврат Ложь;
	КонецЕсли;
	
	// 2. Записываем в документы.
	Возврат СМ_СметаВызовСервера.ОбновитьЦеныРесурсовАкта(Документ, ТаблицаРедактированияЦен, ОтборПозиций, СОбнулением); 
			
КонецФункции

#КонецОбласти //#Область РедактироватьЦены

#Область Удалить

&НаСервере
Функция КомандаРесурсыУдалитьАктВыполненныхРаботНаСервере()
	
	//
	Идентификаторы	= Элементы.тзРесурсы.ВыделенныеСтроки;
	МассивПозиции	= Новый Массив();
	МассивРесурсы	= Новый Массив();
	
	//	Получить обрабатываемые ресурсы и позиции.
	ПолучитьОбрабатываемыеПозицииРесурсыНаСервере(Идентификаторы, МассивПозиции, МассивРесурсы);
	
	//	Установить признак удаленного, в документе.
	ДокументОбъект	= Документ.ПолучитьОбъект();
		
	Для Каждого Строка Из ДокументОбъект.РесурсыПозицийАкта Цикл
		
		Если НЕ МассивРесурсы.Найти(Строка.Ресурс) = Неопределено Тогда
			Строка.Удален	= Истина;	
		КонецЕсли;	
		
	КонецЦикла;
	
	ДокументОбъект.Записать();		
		
	//	Удалить из табличной части, на форме.
	РесурсыУдалитьСтрокиНаСервере(Идентификаторы);
	
	//
	Возврат Истина;
			
КонецФункции //Функция КомандаРесурсыУдалитьНаСервере()

&НаСервере
Функция КомандаРесурсыАктНеИзменятьЦены(НеИзменятьЦены = Истина)
	
	//
	МассивПозиции	= Новый Массив();
	МассивРесурсы	= Новый Массив();
	
	//	Получить обрабатываемые ресурсы и позиции.
	ПолучитьОбрабатываемыеПозицииРесурсыНаСервереПоФлагам(МассивПозиции, МассивРесурсы);
	
	ДокументОбъект	= Документ.ПолучитьОбъект();
		
	Для Каждого Строка Из ДокументОбъект.РесурсыПозицийАкта Цикл
		
		Если НЕ МассивРесурсы.Найти(Строка.Ресурс) = Неопределено Тогда
			Строка.НеИзменятьЦены	= НеИзменятьЦены;	
		КонецЕсли;	
		
	КонецЦикла;
	
	ДокументОбъект.Записать();		
		
	Возврат Истина;
			
КонецФункции 

&НаСервере
Функция КомандаРесурсыНеИзменятьЦены(НеИзменятьЦены = Истина)
	
	//
	МассивПозиции	= Новый Массив();
	МассивРесурсы	= Новый Массив();
	
	//	Получить обрабатываемые ресурсы и позиции.
	ПолучитьОбрабатываемыеПозицииРесурсыНаСервереПоФлагам(МассивПозиции, МассивРесурсы);
	
	
	Для Каждого СсылкаНаОбъект Из МассивПозиции Цикл
		
		ДокументОбъект	= СсылкаНаОбъект.ПолучитьОбъект();
		
		Для Каждого Строка Из ДокументОбъект.РесурсыПозицииЛокальнойСметы Цикл
			
			Если НЕ МассивРесурсы.Найти(Строка.Ресурс) = Неопределено Тогда
				Строка.НеИзменятьЦены	= НеИзменятьЦены;	
			КонецЕсли;	
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ИДПозицииВладельца) Тогда
			ДокументОбъект.НеИзменятьЦены	= НеИзменятьЦены;
		ИначеЕсли НЕ МассивРесурсы.Найти(СокрЛП(СсылкаНаОбъект.Наименование)) = Неопределено Тогда
			ДокументОбъект.НеИзменятьЦены	= НеИзменятьЦены;
		КонецЕсли;

		ДокументОбъект.Записать();		

		
	КонецЦикла;
	
	
	Возврат Истина;
	
КонецФункции 

&НаСервере
Функция КомандаРесурсыУдалитьНаСервере()
	
	//
	Идентификаторы	= Элементы.тзРесурсы.ВыделенныеСтроки;
	МассивПозиции	= Новый Массив();
	МассивРесурсы	= Новый Массив();
	
	//	Получить обрабатываемые ресурсы и позиции.
	ПолучитьОбрабатываемыеПозицииРесурсыНаСервере(Идентификаторы, МассивПозиции, МассивРесурсы);
	
	//	Установить признак удаленного, в документе.
	Для Каждого СсылкаНаОбъект Из МассивПозиции Цикл
		
		//
		ДокументОбъект	= СсылкаНаОбъект.ПолучитьОбъект();
		
		Для Каждого Строка Из ДокументОбъект.РесурсыПозицииЛокальнойСметы Цикл
			
			Если НЕ МассивРесурсы.Найти(Строка.Ресурс) = Неопределено Тогда
				Строка.Удален	= Истина;	
			КонецЕсли;	
			
		КонецЦикла;
		
		ДокументОбъект.Записать();		
		
	КонецЦикла;
	
	//	Удалить из табличной части, на форме.
	РесурсыУдалитьСтрокиНаСервере(Идентификаторы);
	
	//
	Возврат Истина;
			
КонецФункции //Функция КомандаРесурсыУдалитьНаСервере()

&НаСервере
Функция КомандаРесурсыСтатусРесурса(СтатусРесурса)
	
	МассивПозиции	= Новый Массив();
	МассивРесурсы	= Новый Массив();
	
	//	Получить обрабатываемые ресурсы и позиции.
	ПолучитьОбрабатываемыеПозицииРесурсыНаСервереПоФлагам(МассивПозиции, МассивРесурсы);
	
	
	Для Каждого СсылкаНаОбъект Из МассивПозиции Цикл
		
		ДокументОбъект	= СсылкаНаОбъект.ПолучитьОбъект();
		
		Для Каждого Строка Из ДокументОбъект.РесурсыПозицииЛокальнойСметы Цикл
			
			Если НЕ МассивРесурсы.Найти(Строка.Ресурс) = Неопределено Тогда
				Строка.СтатусРесурса	= СтатусРесурса;	
			КонецЕсли;	
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ИДПозицииВладельца) Тогда
			ДокументОбъект.СтатусРесурса	= СтатусРесурса;
		ИначеЕсли НЕ МассивРесурсы.Найти(СсылкаНаОбъект.Наименование) = Неопределено Тогда
			ДокументОбъект.СтатусРесурса	= СтатусРесурса;
		КонецЕсли;
		
		ДокументОбъект.Записать();		

		
	КонецЦикла;
	
	
	Возврат Истина;
	
КонецФункции 

&НаСервере
Функция КомандаРесурсыСтатусРесурсаАкт(СтатусРесурса)
	
	МассивПозиции	= Новый Массив();
	МассивРесурсы	= Новый Массив();
	
	//	Получить обрабатываемые ресурсы и позиции.
	ПолучитьОбрабатываемыеПозицииРесурсыНаСервереПоФлагам(МассивПозиции, МассивРесурсы);
	
	ДокументАкт = Документ.ПолучитьОбъект();
	
	Для Каждого СсылкаНаОбъект Из МассивПозиции Цикл
		
		Для Каждого Строка Из ДокументАкт.РесурсыПозицийАкта Цикл
			
			Если НЕ МассивРесурсы.Найти(Строка.Ресурс) = Неопределено 
				И Строка.Позиция = СсылкаНаОбъект  Тогда
				Строка.СтатусРесурсаАкт	= СтатусРесурса;	
			КонецЕсли;	
			
		КонецЦикла;
		
		ДокументОбъект	= СсылкаНаОбъект.ПолучитьОбъект();
		Если ЗначениеЗаполнено(СсылкаНаОбъект.ИДПозицииВладельца) Тогда
			ДокументОбъект.СтатусРесурсаАкт	= СтатусРесурса;
		ИначеЕсли НЕ МассивРесурсы.Найти(СсылкаНаОбъект.Наименование) = Неопределено Тогда
			ДокументОбъект.СтатусРесурсаАкт	= СтатусРесурса;
		КонецЕсли;
		ДокументОбъект.Записать();		

		
	КонецЦикла;
	
	ДокументАкт.Записать();
	
	Возврат Истина;
	
КонецФункции 

&НаСервере
Процедура РесурсыУдалитьСтрокиНаСервере(Идентификаторы)
		
	//	Удалить из табличной части, на форме.
	Для Каждого Идентификатор Из Идентификаторы Цикл
		
		//        
		Строка	= ТабличнаяЧастьРесурсы.НайтиПоИдентификатору(Идентификатор);
		
		//
		ТабличнаяЧастьРесурсы.Удалить(Строка);
		
	КонецЦикла;
	
	//
	Элементы.тзРесурсы.Обновить();
	
КонецПроцедуры //Процедура РесурсыУдалитьСтрокиНаСервере(Идентификаторы)

&НаСервере
Процедура ПолучитьОбрабатываемыеПозицииРесурсыНаСервереПоФлагам(МассивПозиции, МассивРесурсы)
	
	//	Получить обрабатываемые ресурсы и позиции.
	Для Каждого Идентификатор Из ТабличнаяЧастьРесурсы Цикл
		Если Идентификатор.Пометка Тогда
			//	добавить ресурс
			Если ЗначениеЗаполнено(Идентификатор.Ресурс) Тогда
				МассивРесурсы.Добавить(Идентификатор.Ресурс);
			Иначе
				МассивРесурсы.Добавить(Идентификатор.НаименованиеРесурса);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//
	ТаблицаЗначений	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	МассивПозиции	= ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект");
	
КонецПроцедуры //Процедура ПолучитьОбрабатываемыеПозицииРесурсыНаСервере(Идентификаторы, МассивПозиции, МассивРесурсы)

&НаСервере
Процедура ПолучитьОбрабатываемыеПозицииРесурсыНаСервере(Идентификаторы, МассивПозиции, МассивРесурсы)
	
	//	Получить обрабатываемые ресурсы и позиции.
	Для Каждого Идентификатор Из Идентификаторы Цикл
	
		//        
		Строка	= ТабличнаяЧастьРесурсы.НайтиПоИдентификатору(Идентификатор);
		
		//	добавить ресурс
		МассивРесурсы.Добавить(Строка.Ресурс);
		
	КонецЦикла;
	
	//
	ТаблицаЗначений	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	МассивПозиции	= ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект");
	
КонецПроцедуры //Процедура ПолучитьОбрабатываемыеПозицииРесурсыНаСервере(Идентификаторы, МассивПозиции, МассивРесурсы)

#КонецОбласти //#Область Удалить

#КонецОбласти //#Область РЕСУРСЫ/#Область ВспомогательныеФункции/#Область КомандыФормы

#Область ПОПРАВКИ

&НаСервере
Функция КомандаПоправкиРедактироватьНаСервере()
	
	//
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")), Истина));
	
	//
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
		
		//
		ТаблицаЗначенийОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка, ЛокальнаяСмета", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина, Строка["СсылкаНаОбъект"]));
		ОтобранныеПозиции						= ТаблицаЗначенийОбрабатываемыеПозиции.ВыгрузитьКолонку("СсылкаНаОбъект");
		
		//	(!) Когда нажимаем "СОбнулением", во всех строках проставляется значение "Модифицированность".
		ТаблицаЗначенийПоправки					= ТабличнаяЧастьПоправки.Выгрузить(Новый Структура("Пометка, Модифицированность", Истина, Истина));
		
		//	Записываем в документы.
		СМ_СметаВызовСервера.ОбновитьПоправкиСметы(ТаблицаЗначенийПоправки,, ОтобранныеПозиции, СОбнулением); 
	
	КонецЦикла;
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаПоправкиРедактироватьНаСервере()

// Воноков 
&НаСервере
Функция КомандаПоправкиДобавитьНаСервере()
	
	//
	ТаблицаЗначений	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	СписокПозиций	= ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект");
	Результат		= Истина;
	
	//	Обрабатываемые поправки.
	ТаблицаРедактированияПоправок = ТабличнаяЧастьПоправки.Выгрузить(Новый Структура("ЭтоНоваяСтрока", Истина));

	//	Транзакция
	НачатьТранзакцию();
	
	//	Записываем в документы.
	Результат = СМ_СметаВызовСервера.ДобавитьПоправкиСметы(ТаблицаРедактированияПоправок,, СписокПозиций); 
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	Возврат Результат;
	
КонецФункции //Функция КомандаПоправкиДобавитьНаСервере()

// Удаление Поправок. 
&НаСервере
Функция КомандаПоправкиУдалитьНаСервере()
	
	//
	Результат						= Истина;
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")), Истина));
		
	НачатьТранзакцию();

	//
	Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
		
		ТаблицаЗначенийПозиции	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка, ЛокальнаяСмета", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина, Строка["СсылкаНаОбъект"]));
		ОтборПозиций			= ТаблицаЗначенийПозиции.ВыгрузитьКолонку("СсылкаНаОбъект");
	
		ТаблицаЗначенийПоправки = ТабличнаяЧастьПоправки.Выгрузить(Новый Структура("Пометка", Истина));	
	
		//	Запись в документы.
		Результат = СМ_СметаВызовСервера.УдалитьПоправкиСметы(ТаблицаЗначенийПоправки, Строка["СсылкаНаОбъект"], ОтборПозиций); 
	
	КонецЦикла;
	
	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	//	Удалить строки из табличной части, которые были удалены из позиций.
	НайденныеСтроки	= ТабличнаяЧастьПоправки.НайтиСтроки(Новый Структура("Пометка", Истина));
	Для Каждого Строка Из НайденныеСтроки Цикл
		ТабличнаяЧастьПоправки.Удалить(Строка);
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Результат;
	
КонецФункции //Функция КомандаПоправкиУдалитьНаСервере()

#КонецОбласти //#Область ПОПРАВКИ/#Область ВспомогательныеФункции/#Область КомандыФормы

#Область НАЧИСЛЕНИЯ

&НаСервере
Функция КомандаНачисленияРедактироватьНаСервере(ВернутьСтандартные = Ложь)
	
	НачатьТранзакцию();
	
	//
	ТаблицаЗначений	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ОтборПозиций	= ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект");
	
	ТаблицаРедактированияНачислений = ТабличнаяЧастьНачисления.Выгрузить();
	ИменаКолонокМассив = Новый Массив();
	ИменаКолонокМассив.Добавить("Значение");
	ИменаКолонокМассив.Добавить("Формула");
	
	// 1. Оставим только измененные значения
	Если ТаблицаРедактированияНачислений.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нет изменений в значениях и формулах'"));
		Возврат Ложь;
	КонецЕсли;          
	
	// 2. Записываем в документы
	Результат = СМ_СметаВызовСервера.ОбновитьНачисленияСметы(ТаблицаРедактированияНачислений, Документ, ОтборПозиций, ВернутьСтандартные); 
	
	// 3. Пересчитываем
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Результат;
	
КонецФункции //Функция КомандаНачисленияРедактироватьНаСервере(ВернутьСтандартные = Ложь)

#КонецОбласти //#Область НАЧИСЛЕНИЯ/#Область ВспомогательныеФункции/#Область КомандыФормы

#Область ИНДЕКСЫ

#Область Редактировать

&НаСервере
Функция КомандаИндексыРедактироватьНаСервере(ВернутьСтандартные = Ложь)
	
	//
	Результат						= Истина;
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))));
	
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
		
		//	Только, те позиции, которые принадлежат обрабатываемой локальной смете.
		ТаблицаЗначенийОбрабатываемыеРазделы	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка, ЛокальнаяСмета", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина, Строка["СсылкаНаОбъект"]));
		ТаблицаЗначенийОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка, ЛокальнаяСмета", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина, Строка["СсылкаНаОбъект"]));
		ОтборРазделов							= ТаблицаЗначенийОбрабатываемыеРазделы.ВыгрузитьКолонку("СсылкаНаОбъект");
		ОтборПозиций							= ТаблицаЗначенийОбрабатываемыеПозиции.ВыгрузитьКолонку("СсылкаНаОбъект");
		
		//	Только, те которые были зменены и отмечены.
		ТаблицаЗначенийИндексы					= ТабличнаяЧастьИндексы.Выгрузить(Новый Структура("Пометка, Модифицированность", Истина, Истина));
		
		//	Записываем в документы (позиции).
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
			Результат = СМ_СметаВызовСервера.ОбновитьИндексыАкта(ТаблицаЗначенийИндексы, Документ, ОтборПозиций, СОбнулением); 
		Иначе
			Результат = СМ_СметаВызовСервера.ОбновитьИндексыСметы(ТаблицаЗначенийИндексы, Строка["СсылкаНаОбъект"], ОтборПозиций, СОбнулением); 
		КонецЕсли;
	
		//	Записываем в документы (разделы).
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
			Результат = СМ_СметаВызовСервера.ОбновитьИндексыАкта(ТаблицаЗначенийИндексы, Документ, ОтборРазделов, СОбнулением); 
		Иначе
			Результат = СМ_СметаВызовСервера.ОбновитьИндексыСметы(ТаблицаЗначенийИндексы, Строка["СсылкаНаОбъект"], ОтборРазделов, СОбнулением); 
		КонецЕсли;
	
	КонецЦикла;

	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;

КонецФункции

#КонецОбласти //#Область Редактировать/#Область ИНДЕКСЫ/#Область ВспомогательныеФункции/#Область КомандыФормы

#Область Очистить

&НаСервере
Функция КомандаИндексыОчиститьНаСервере(ВернутьСтандартные = Ложь)
	
	//
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))));
	
	НачатьТранзакцию();
	
	//
	Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
		
		//	Только, те позиции, которые принадлежат обрабатываемой локальной смете.
		ТаблицаЗначенийОбрабатываемыеРазделы	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка, ЛокальнаяСмета", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина, Строка["СсылкаНаОбъект"]));
		ТаблицаЗначенийОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка, ЛокальнаяСмета", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина, Строка["СсылкаНаОбъект"]));
		ОтборРазделов							= ТаблицаЗначенийОбрабатываемыеРазделы.ВыгрузитьКолонку("СсылкаНаОбъект");
		ОтборПозиций							= ТаблицаЗначенийОбрабатываемыеПозиции.ВыгрузитьКолонку("СсылкаНаОбъект");
		
		//	Только, те которые были зменены и отмечены.
		ТаблицаЗначенийИндексы				= ТабличнаяЧастьИндексы.Выгрузить(Новый Структура("Пометка", Истина));
		ТаблицаЗначенийИндексы.ЗаполнитьЗначения(0, "КоэффОснЗарплаты, КоэффСтоимЭксплМашин, КоэффСтоимЗарплатеМашин, КоэффСтоимМатериалов, КоэффОборуд, КоэффПолнСтоимРабот");
		
		//	Записываем в документы (позиции).
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
			Результат = СМ_СметаВызовСервера.ОбновитьИндексыАкта(ТаблицаЗначенийИндексы, Документ, ОтборПозиций, Истина, Истина); 
		Иначе
			Результат = СМ_СметаВызовСервера.ОбновитьИндексыСметы(ТаблицаЗначенийИндексы, Строка["СсылкаНаОбъект"], ОтборПозиций, Истина, Истина); 
		КонецЕсли;
	
		//	Записываем в документы (разделы).
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
			Результат = СМ_СметаВызовСервера.ОбновитьИндексыАкта(ТаблицаЗначенийИндексы, Документ, ОтборРазделов, Истина, Истина); 
		Иначе
			Результат = СМ_СметаВызовСервера.ОбновитьИндексыСметы(ТаблицаЗначенийИндексы, Строка["СсылкаНаОбъект"], ОтборРазделов, Истина, Истина); 
		КонецЕсли;
	
	КонецЦикла;

	//	Перерасчет документов.
	ДокументПерерасчетНаСервере(Документ);
	
	ЗафиксироватьТранзакцию();
	
	//
	Возврат Истина;
	
КонецФункции //Функция КомандаИндексыОчиститьНаСервере()

#КонецОбласти //#Область Очистить/#Область ИНДЕКСЫ/#Область ВспомогательныеФункции

#КонецОбласти //#Область ИНДЕКСЫ/#Область ВспомогательныеФункции/#Область КомандыФормы

#Область СВОЙСТВА

&НаСервере
Функция КомандаСвойстваРедактироватьНаСервере()
	
	//
	ОтмеченныеЭлементы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("УчастиеПометка", Истина));
	ОтмеченныеСвойства	= ТабличнаяЧастьСвойства.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	//
	Для Каждого ЭлементыСтрока Из ОтмеченныеЭлементы Цикл
		
		ОбрабатываемыйОбъект	= ЭлементыСтрока["СсылкаНаОбъект"].ПолучитьОбъект();	
		
		Для Каждого СвойстваСтрока Из ОтмеченныеСвойства Цикл
			
			НайденноеСвойство	= ОбрабатываемыйОбъект.ДополнительныеРеквизиты.Найти(СвойстваСтрока["Свойство"], "Свойство");
			
			Если НайденноеСвойство = Неопределено Тогда
				Строка	= ОбрабатываемыйОбъект.ДополнительныеРеквизиты.Добавить();	
				Строка.Свойство			= СвойстваСтрока["Свойство"];
				Строка.Значение			= СвойстваСтрока["Значение"];
				//Строка.ТекстоваяСтрока	= "";
			Иначе	
				НайденноеСвойство.Значение	= СвойстваСтрока["Значение"];	
			КонецЕсли;
			
		КонецЦикла;
		
		ОбрабатываемыйОбъект.Записать();
		
	КонецЦикла;
	
	//
	Возврат Истина;

КонецФункции //Функция КомандаСвойстваРедактироватьНаСервере()

&НаСервере
Функция КомандаСвойстваДобавитьНаСервере()
	
	//
	Возврат Истина;

КонецФункции //Функция КомандаСвойстваДобавитьНаСервере()

#КонецОбласти //#Область СВОЙСТВА/#Область ВспомогательныеФункции/#Область КомандыФормы

#КонецОбласти //#Область ВспомогательныеФункции/#Область КомандыФормы

#Область ТестовыеКоманды

&НаКлиенте
Процедура КомандаТест(Команда)
	
	ТестНаСервере();
	//ТестСхемыЗапроса();
	//ЗапросНаСервере();
	
КонецПроцедуры

Процедура ТестНаСервере()
	
	тест = "тест";

КонецПроцедуры

#КонецОбласти

#КонецОбласти //#Область КомандыФормы

#Область ВспомогательныеФункции

//	Заполнение элементы формы - данными информационной базы (запросы).
#Область ЭлементыДеревоЗначений

&НаКлиенте
Процедура ПеребратьДеревоЗначений(СтрокиДерева, ИсполняемаяПроцедура, ПараметрПроцедуры = Неопределено)
	
	//
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		//	Выполнить процедуру обработки строки, дерева значений.
		Выполнить(ИсполняемаяПроцедура + "(СтрокаДерева, ПараметрПроцедуры)");
		
		//	рекурсия
		ПеребратьДеревоЗначений(СтрокаДерева.ПолучитьЭлементы(), ИсполняемаяПроцедура, ПараметрПроцедуры);
		
	КонецЦикла;
	
КонецПроцедуры //Процедура ПеребратьДеревоЗначений(СтрокиДерева, ИсполняемаяПроцедура, ПараметрПроцедуры = Неопределено)

//	ФОРМИРОВАНИЕ ДЕРЕВА

//	Обновляем дерево, используем типовую процедуру модуля СМ_СметныйСостав.
//
&НаКлиенте
Процедура ДеревоЗначенийОбновитьНаКлиенте(ПараметрыОбновления = Неопределено)
	
	ТекущиеДанные			= Элементы.ЭлементыДеревоЗначений.ТекущиеДанные;
	ТекущееСостояниеДерева	= Неопределено;
	КомандаИмя				= ПолучитьКомандаИмяНаКлиенте(Действие);
	ПараметрыКоманды		= ПолучитьПараметрыКомандыНаКлиенте(Команды[КомандаИмя]);
	ПараметрыОбработки		= СформироватьПараметрыОбработкиНаКлиенте();
	
	//	Запомнить текущую активную строку.
	СМ_СметныйСоставКлиент.СохранитьТекущийЭлемент(ТекущееСостояниеДерева, ТекущиеДанные, Элементы.ЭлементыДеревоЗначений, ЭлементыДеревоЗначений.ПолучитьЭлементы());
		
	//	Заполнить дерево значений.
	ДеревоЗначенийОбновитьНаСервере(ПараметрыОбновления);
	
	//	Развернуть дерево (всегда первый уровень - минимум).
	Если ТекущееСостояниеДерева.ТекущийЭлемент = Неопределено тогда
		ТекущееСостояниеДерева.ТекущийЭлемент = ПараметрыОбновления["Документ"];
	КонецЕсли;
	
	//	Активировать последнию строку.
	СМ_СметныйСоставКлиент.ВосстановитьТекущийЭлемент(Элементы.ЭлементыДеревоЗначений, ЭлементыДеревоЗначений.ПолучитьЭлементы(), ЭлементыДеревоЗначений, ТекущееСостояниеДерева);
	
	//	Оставить отметки строк, дерева значений.
	ПеребратьДеревоЗначений(ЭлементыДеревоЗначений.ПолучитьЭлементы(), "УстановитьПометкаНаКлиенте", ТекущееСостояниеДерева);
	
	//	Сформировать обрабатываемые элементы.
	ОбрабатываемыеЭлементыСформироватьНаСервере(, ПараметрыОбработки);
	
	//	Выбираем отмеченные элементы и создаем структуру параметров, для операции.
	ОтобратьОтмеченныеЭлементыНаКлиенте(ПараметрыОбработки);
	
	//	Видимость элементов.
	Элементы.ЭлементыДеревоЗначенийОбъемПоАкту.Видимость	= ТипЗнч(ПараметрыОбновления["Документ"]) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот");
	
КонецПроцедуры //Процедура ДеревоЗначенийОбновитьНаСервере(ПараметрыОбновления = Неопределено)	

//	Обновляем дерево, используем типовую процедуру модуля СМ_СметныйСостав.
//
&НаСервере
Процедура ДеревоЗначенийОбновитьНаСервере(ПараметрыОбновления = Неопределено)
	
	//	сформируем структуру параметров, если они не заданы
	ДеревоЗначенийПараметрыОбновленияСформировать(ПараметрыОбновления);

	
	//	получить дерево значений, для обработки
	ДеревоЗначений = РеквизитФормыВЗначение("ЭлементыДеревоЗначений", Тип("ДеревоЗначений"));
	
	//	делаем запрос и строим дерево значений
	ДеревоЗначенийПостроитьНаСервере(ДеревоЗначений, ПараметрыОбновления);
	
	//	установить дерево значений
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ЭлементыДеревоЗначений");
		
КонецПроцедуры //Процедура ДеревоЗначенийОбновитьНаСервере(ПараметрыОбновления = Неопределено)	

&НаСервереБезКонтекста
Процедура ДеревоЗначенийПеренумероватьНаСервереБезКонтекста(СтрокиДерева, Номер = 1, ПорядковыйНомерРаздела = 1, ПорядковыйНомерПозиции = 1)
	
	//
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		//
		Если ТипЗнч(СтрокаДерева.Элемент) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")
			ИЛИ ТипЗнч(СтрокаДерева.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
			
			//
			Если СтрокаДерева.Элемент.Расчет Тогда 
				ПорядковыйНомер = ?(ТипЗнч(СтрокаДерева.Элемент) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы"), ПорядковыйНомерРаздела, ПорядковыйНомерПозиции);
			Иначе
				ПорядковыйНомер	= 0;
			КонецЕсли;
			
			//
			ДокументОбъект	= СтрокаДерева.Элемент.ПолучитьОбъект();
			ДокументОбъект.ПорНомер				= ПорядковыйНомер;
			ДокументОбъект.НомерВДереве			= Номер;
			ДокументОбъект.НомерВПределахСметы	= Номер;
			ДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			
			//	номер в дереве, номер в пределах сметы
			Номер	= Номер + 1;
			
			//	порядковый номер
			Если СтрокаДерева.Элемент.Расчет Тогда
				ПорядковыйНомерРаздела	= ?(ТипЗнч(СтрокаДерева.Элемент) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы"), ПорядковыйНомерРаздела + 1, ПорядковыйНомерРаздела);
				ПорядковыйНомерПозиции	= ?(ТипЗнч(СтрокаДерева.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"), ПорядковыйНомерПозиции + 1, ПорядковыйНомерПозиции);
			КонецЕсли;
			
		КонецЕсли;
		
		//
		ДеревоЗначенийПеренумероватьНаСервереБезКонтекста(СтрокаДерева.Строки, Номер, ПорядковыйНомерРаздела, ПорядковыйНомерПозиции);	
	
	КонецЦикла;
	
КонецПроцедуры //Процедура ДеревоЗначенийПеренумероватьНаСервереБезКонтекста(СтрокиДерева, Номер = 1, ПорядковыйНомерРаздела = 1, ПорядковыйНомерПозиции = 1)

#Область ДеревоЗначенийСформировать

&НаСервере
Процедура ДеревоЗначенийПараметрыОбновленияСформировать(ПараметрыОбновления = Неопределено)
	
	//
	Если ПараметрыОбновления = НЕОПРЕДЕЛЕНО тогда
		ПараметрыОбновления	= Новый Структура();
	Иначе
		Если НЕ ТипЗнч(ПараметрыОбновления) = Тип("Структура") тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	//	Документ
	Если НЕ ПараметрыОбновления.Свойство("Документ") тогда
		ПараметрыОбновления.Вставить("Документ"					, Документ);
	КонецЕсли;
	
	//	НеОбновлятьОбъект
	Если НЕ ПараметрыОбновления.Свойство("НеОбновлятьОбъект") тогда
		ПараметрыОбновления.Вставить("НеОбновлятьОбъект"		, ЛОЖЬ);
	КонецЕсли;
	
	//	Перенумеровать
	Если НЕ ПараметрыОбновления.Свойство("Перенумеровать") тогда
		ПараметрыОбновления.Вставить("Перенумеровать"			, ЛОЖЬ);
	КонецЕсли;
	
	//	Действие
	Если НЕ ПараметрыОбновления.Свойство("Действие") тогда
		ПараметрыОбновления.Вставить("Действие"					, "Обновить");	
	КонецЕсли;
	
	//	Процент
	Если НЕ ПараметрыОбновления.Свойство("Процент") тогда
		ПараметрыОбновления.Вставить("Процент"					, ЛОЖЬ);
	КонецЕсли;	
	
	//	КопироватьИндексы
	Если НЕ ПараметрыОбновления.Свойство("КопироватьИндексы") тогда
		ПараметрыОбновления.Вставить("КопироватьИндексы"		, ЛОЖЬ);
	КонецЕсли;	
	
	//	Временное
	Если НЕ ПараметрыОбновления.Свойство("Временное") тогда
		ПараметрыОбновления.Вставить("Временное"				, ЛОЖЬ);
	КонецЕсли;
	
	//	СчетчикНомер
	Если НЕ ПараметрыОбновления.Свойство("СчетчикНомер") тогда
		ПараметрыОбновления.Вставить("СчетчикНомер"				, 1);
	КонецЕсли;
	
	//	СчетчикПорНомерРазделы
	Если НЕ ПараметрыОбновления.Свойство("СчетчикПорНомерРазделы") тогда
		ПараметрыОбновления.Вставить("СчетчикПорНомерРазделы"	, 1);
	КонецЕсли;
	
	//	СчетчикПорНомерПозиции
	Если НЕ ПараметрыОбновления.Свойство("СчетчикПорНомерПозиции") тогда
		ПараметрыОбновления.Вставить("СчетчикПорНомерПозиции"	, 1);
	КонецЕсли;
	
	//	Вид
	Если НЕ ПараметрыОбновления.Свойство("Вид") тогда
		ПараметрыОбновления.Вставить("Вид"						, "");
	КонецЕсли;
	
	//	Преобразовать текст в БУЛЕВО.
	СтруктураБулево	= Новый Структура("Перенумеровать, ");
	СтруктураБулево.Вставить("Перенумеровать"				, Булево(Найти(ПараметрыОбновления["Действие"], "Перенумеровать")));
	СтруктураБулево.Вставить("НеОбновлятьОбъект"			, Булево(Найти(ПараметрыОбновления["Действие"], "ОбновитьБезТаблицАкта")));
	СтруктураБулево.Вставить("ПроцентоватьАкт"				, Булево(Найти(ПараметрыОбновления["Действие"], "Процентовать")));
	СтруктураБулево.Вставить("ЗаполнитьПоОстаткам"			, Булево(Найти(ПараметрыОбновления["Действие"], "ЗаполнитьПоОстаткам") ИЛИ Найти(ПараметрыОбновления["Действие"], "СметаНаОстаток")));
	СтруктураБулево.Вставить("ОбновлениеДерева"				, Булево(НЕ Найти(ПараметрыОбновления["Действие"], "БезОбновления")));
	СтруктураБулево.Вставить("НеИзменятьАкт"				, Булево(НЕ Найти(ПараметрыОбновления["Действие"], "БезТаблицАкта") ИЛИ Найти(ПараметрыОбновления["Действие"], "СметаНаОстаток")));
	СтруктураБулево.Вставить("ЭтоГрупповаяОбработкаПозиций"	, Булево(Найти(ПараметрыОбновления["Вид"], "ГрупповаяОбработкаПозиций")));
		
	ПараметрыОбновления.Вставить("_", СтруктураБулево);
		
КонецПроцедуры //Процедура ОбработатьПараметрыОбновления()

//	Новая версия универсальных процедур вывода дерева.
//	Основная процедура работы с деревом.
//
&НаСервере
Процедура ДеревоЗначенийПостроитьНаСервере(ДеревоЗначений, ПараметрыОбновления = Неопределено)
	
	Ссылка			= ?(ТипЗнч(ПараметрыОбновления["Документ"]) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот"), ПараметрыОбновления["Документ"].ЛокальнаяСмета, ПараметрыОбновления["Документ"]);
	ЭлементКорня	= СМ_СметаВызовСервера.ПолучитьСсылкуНаДокумент(Ссылка); 
	ИтогПоСмете		= ПолучитьИтогПоСмете();
	ТекстЗапроса	= ПолучитьТекстЗапросаНаДеревоСмет(ПараметрыОбновления["Документ"]);
	
	//	ДеревоЗначений
	ДеревоЗначений.Строки.Очистить();

	//	СтруктураПараметров
	СформироватьПараметрыОбновленияНаСервере(ПараметрыОбновления);
	
	//	Запрос
	Если ЗначениеЗаполнено(ТекстЗапроса) тогда
		
		//	
		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;	
		ДокСсылка = ПараметрыОбновления["Документ"];
		Запрос.УстановитьПараметр("Ссылка"					, ДокСсылка);
		Если ТипЗнч(ДокСсылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
			Запрос.УстановитьПараметр("ЛокальнаяСмета"			, ДокСсылка.ЛокальнаяСмета);
		КонецЕсли;
		Запрос.УстановитьПараметр("ИтогРаздела"				, Справочники.СМ_ИтогиПоРазделу.ИтогоПоРазделу);
		Запрос.УстановитьПараметр("ИтогСметы"				, ИтогПоСмете);
		Запрос.УстановитьПараметр("ВидРасценкиОборудование"	, Перечисления.СМ_ВидыРасценки.Оборудование);
		Запрос.УстановитьПараметр("ВидРасценкиМатериал"		, Перечисления.СМ_ВидыРасценки.Материал);
		Запрос.УстановитьПараметр("РазрешитьРедактирование"	, ПолучитьФункциональнуюОпцию("СМ_РазрешитьРедактированиеЗакрытыхСмет"));
		
		ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
		
		//	ДеревоЗначений.Добавить()
		ДеревоЗначенийЗаполнитьПоТаблицеЗначенийНаСервере(
			ДеревоЗначений,
			ТаблицаЗначений,
			ПараметрыОбновления,
			Новый Структура("ЭлементРодитель", Неопределено));
		
	КонецЕсли;
	
КонецПроцедуры //Процедура ДеревоЗначенийПостроитьНаСервере()

// Процедура строит дерево по таблице значений с данными о позициях и разделах сметы или акта.
//
&НаСервере
Процедура ДеревоЗначенийЗаполнитьПоТаблицеЗначенийНаСервере(ДеревоЗначений, ТаблицаЗначений, ПараметрыОбновления, Отбор)
	
	//
	СтрокиУровня = ТаблицаЗначений.НайтиСтроки(Отбор);   	
	
	Для Каждого Строка Из СтрокиУровня Цикл
		
		НайденнаяСтрока = ДеревоЗначений.Строки.Найти(Строка.ЭлементРодитель, "Элемент", Истина);
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			СтрокаДерева		= НайденнаяСтрока.Строки.Добавить();	
		Иначе
			СтрокаДерева		= ДеревоЗначений.Строки.Добавить();	
		КонецЕсли;
		
		//	Заполнить строку.
		ЗаполнитьЗначенияСвойств(СтрокаДерева, Строка);
		
		//	Определение уровня строки дерева значений.
		СтрокаДерева.Уровень		= СтрокаДерева.Уровень();
		//	Параметры локальной сметы.
		Если ТипЗнч(Строка["Элемент"]) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
			СтрокаДерева.Параметры	= СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Строка["Элемент"]);
		КонецЕсли;
		
		//
		Если ПараметрыОбновления["_"]["Перенумеровать"] Тогда
			ПрисвоитьНомерОбъекту(СМ_СметаВызовСервера.ПолучитьОбъектСтрокиДереваСмет(СтрокаДерева), ПараметрыОбновления["СчетчикНомер"], ПараметрыОбновления["СчетчикПорНомерРазделы"]);
		КонецЕсли;

		//
		Отбор = Новый Структура();
		Отбор.Вставить("ЭлементРодитель", СМ_СметаВызовСервера.ПолучитьСсылкуСтрокиДереваСмет(СтрокаДерева, "Элемент"));
		
		// вставка объектов
		//Участие = "УчастиеПометка";
		//НайденныеСтроки		= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("СсылкаНаОбъект", СтрокаДерева.Элемент));
		//
		//Если НайденныеСтроки.Количество() Тогда
		//	Для Каждого Строка Из НайденныеСтроки Цикл
		//		
		//		ЗначенияЗаполнения	= Новый Структура(Участие, Истина);	
		//		
		//		ОбрабатываемыеЭлементыЗаполнитьСтрокуНаСервереБезКонтекста(ОбрабатываемыеЭлементы, Строка, ЗначенияЗаполнения);
		//		
		//	КонецЦикла;
		//Иначе
		//	
		//	//
		//	ЭлементКоллекции	= ОбрабатываемыеЭлементыДобавитьСтрокуНаСервереБезКонтекста(ОбрабатываемыеЭлементы, СтрокаДерева, НайденнаяСтрока = Неопределено, Участие = "УчастиеРодитель", Участие = "УчастиеПометка", Участие = "УчастиеВладелец", Участие = "УчастиеПриемник");
		//	
		//	//
		//	СтрокаДерева.Идентификатор	= ЭлементКоллекции.ПолучитьИдентификатор();
		//	
		//КонецЕсли;
		//
		////	Сортировать НайтиПоИдентификатору
		//ОбрабатываемыеЭлементы.Сортировать("Уровень Убыв");
		//
		
		
		//	рекурсия
		ДеревоЗначенийЗаполнитьПоТаблицеЗначенийНаСервере(ДеревоЗначений, ТаблицаЗначений, ПараметрыОбновления, Отбор);

	КонецЦикла;
	
КонецПроцедуры //Процедура ДеревоЗначенийЗаполнитьПоТаблицеЗначенийНаСервере()

// Расчет Нормы расхода с поправками. 
// 
Функция РассчитатьКоличество(ТекСтрока,ЭлПозиция)
	
	Позиция = ЭлПозиция.ПолучитьОбъект();
	Если ТекСтрока.ТипМатериала = Перечисления.СМ_ТипыМатериалов.НеУчтенный ИЛИ ТекСтрока.ТипМатериала = Перечисления.СМ_ТипыМатериалов.ПоПроекту ИЛИ ТекСтрока.Удален Тогда
		Возврат(ТекСтрока.НормаРасхода);
	КонецЕсли;
	
	//Если Позиция.ИдСметы.МетодикаТСН Тогда
	Если Позиция.ИдСметы.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_МетодикаТСНГородаМосква Тогда
		// Применим ЗУ.
		ПрименитьЗУНормамМат = Позиция.ИдСметы.ПрименитьЗУНормамМат;
		ПрименитьЗУНормамМаш = Позиция.ИдСметы.ПрименитьЗУНормамМаш;
		ПрименитьЗУТрудРабочих =  Позиция.ИдСметы.ПрименитьЗУТрудРабочих;
		ПрименитьЗУТрудМашинистов = Позиция.ИдСметы.ПрименитьЗУТрудМашинистов;
		ТипСтроительстваРемонт = (Позиция.ИдСметы.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт);
	Иначе
		ПрименитьЗУНормамМат = Ложь;
		ПрименитьЗУНормамМаш = Ложь;
		ПрименитьЗУТрудРабочих =  Ложь;
		ПрименитьЗУТрудМашинистов = Ложь;
		ТипСтроительстваРемонт = Ложь;
	КонецЕсли;			

	Количество = ТекСтрока.НормаРасхода * ?(ЗначениеЗаполнено(ТекСтрока.КоэффициентКРасходуРесурсов),ТекСтрока.КоэффициентКРасходуРесурсов,1);
	
	СписокПоз = Новый СписокЗначений();
	СписокПоз.Добавить(Позиция.Ссылка);
	ТаблПоправок = СМ_СметаРасчетСервер.ПолучитьПоправки( СписокПоз,Ложь);
	
	Для каждого СтрокаТаблПоправок Из ТаблПоправок Цикл
		Если ТекСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда	
			Количество = Количество * СтрокаТаблПоправок.КоэффициентКТрудозатратамРабочих;	
		ИначеЕсли ТекСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда	
			Количество = Количество * СтрокаТаблПоправок.КоэффициентКТрудозатратамМашинистов;	
		ИначеЕсли ТекСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда	
			Количество = Количество * СтрокаТаблПоправок.КоэффициентКСтоимостиМатериалов;	
		ИначеЕсли ТекСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда	
			Количество = Количество * СтрокаТаблПоправок.КоэффициентКЭксплуатацииМашин;	
		КонецЕсли;
	КонецЦикла;
	Если ТипСтроительстваРемонт Тогда
		ЗимнееУдорож = ?(Позиция.ЗимнееУдорожРемонт = 0,1,Позиция.ЗимнееУдорожРемонт);
		ЗимнееУдорожМатериал = ?(Позиция.ЗимнееУдорожМатериалРемонт = 0,1,Позиция.ЗимнееУдорожМатериалРемонт);
	Иначе
		ЗимнееУдорож = ?(Позиция.ЗимнееУдорож = 0,1,Позиция.ЗимнееУдорож);
		ЗимнееУдорожМатериал = ?(Позиция.ЗимнееУдорожМатериал = 0,1,Позиция.ЗимнееУдорожМатериал);
	КонецЕсли;
	Если ПрименитьЗУТрудРабочих И ТекСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
		Количество = Количество * ЗимнееУдорож;
	КонецЕсли;
	
	Если ПрименитьЗУТрудМашинистов И ТекСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
		Количество = Количество * ЗимнееУдорож;
	КонецЕсли;
	
	Если ПрименитьЗУНормамМаш И ТекСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
		Количество = Количество * ЗимнееУдорож;
	КонецЕсли;
	
	Если ПрименитьЗУНормамМат И ТекСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
		Количество = Количество * ЗимнееУдорожМатериал;
	КонецЕсли;
	Возврат(Количество);	
КонецФункции

#КонецОбласти //#Область ДеревоЗначенийСформировать

#Область Запрос

//	(!) Обязательные поля запроса
//
//	Элемент
//		- ссылка, на документ ("СМ_ОбъектнаяСмета", "СМ_ЛокальнаяСмета", "СМ_РазделЛокальнойСметы", "СМ_ПозицияЛокальнойСметы").
//	ЭлементРодитель
//		- ссылка, на родительский документ, для построения дерева значений.
//	ЭтоКорневойЭлемент
//		- определяем корневой элемент дерева значений, для отображения в условном оформлении.
//	Доступность
//		- определяем доступность обработки строки (например, нельзя редактировать локальные сметы, по которым есть акты выполненных работ).
//	СодержитРесурсы, СодержитПоправки, СодержитНачисления, СодержитИндексы.
//		- для выделения строк, которые содержат табличную часть, влияющую на отображения строк в текущей области обработки.
//	Связанная, СвязаннаяКартинка, СвязаннаяВладелец.
//		- отображение и отметка связанных позиций.
//	ПринадлежитСводнойСмете, ПринадлежитОбъектнойСмете, ПринадлежитЛокальнойСмете, ПринадлежитРазделу.
//		- проверка условий, выбранные позиции принадлежат одной смете или нет.
//

//	Функция возвращает запрос на формирование дерева смет.
//
// Параметры:
//     ТекущийАкт - ДокументСсылка.СМ_АктВыполненныхРабот - если формируется дерево акта,
//                  то ссылка на акт передается в данном параметре.
//
// Возвращаемое значение:
//     Строка с текстом запроса на формирование таблицы для дерева разделов и позиций.
//
Функция ПолучитьТекстЗапросаНаДеревоСмет(ТекущийДокумент = Неопределено, ЭтоФормированиеСметыНаОстатки = Ложь)
	
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") тогда
		Возврат ПолучитьТекстЗапросаНаДеревоСметАктВыполненныхРабот();
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") тогда
		Возврат ПолучитьТекстЗапросаНаДеревоСметЛокальнаяСмета();
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") тогда
		Возврат ПолучитьТекстЗапросаНаДеревоСметОбъектнаяСмета();
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_СводнаяСмета") тогда
		Возврат ПолучитьТекстЗапросаНаДеревоСметСводнаяСмета();	
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции //Функция ПолучитьТекстЗапросаНаДеревоСмет()

//	Функция возвращает запрос на формирование дерева смет.
//
// Параметры:
//
// Возвращаемое значение:
//     Строка с текстом запроса на формирование таблицы для дерева разделов и позиций.
//
Функция ПолучитьТекстЗапросаНаДеревоСметАктВыполненныхРабот()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_АктВыполненныхРабот.Ссылка,
	               |	СМ_АктВыполненныхРабот.ЛокальнаяСмета
	               |ПОМЕСТИТЬ ВТ_АктВыполненныхРабот
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
	               |ГДЕ
	               |	СМ_АктВыполненныхРабот.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СМ_АктВыполненныхРаботПозиции.Позиция,
	               |	СУММА(СМ_АктВыполненныхРаботПозиции.ФактОбъем) КАК Всего
	               |ПОМЕСТИТЬ ВТ_ПозицииАктов
	               |ИЗ
	               |	ВТ_АктВыполненныхРабот КАК ВТ_АктВыполненныхРабот
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_АктВыполненныхРаботПозиции
	               |		ПО ВТ_АктВыполненныхРабот.ЛокальнаяСмета = СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета
	               |ГДЕ
	               |	СМ_АктВыполненныхРаботПозиции.Ссылка.Проведен = ИСТИНА
	               |	И СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета = &ЛокальнаяСмета
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СМ_АктВыполненныхРаботПозиции.Позиция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_АктВыполненныхРаботПозиции.Ссылка,
	               |	СМ_АктВыполненныхРаботПозиции.Позиция,
	               |	СМ_АктВыполненныхРаботПозиции.ФактОбъем
	               |ПОМЕСТИТЬ ВТ_АктВыполненныхРаботПозиции
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_АктВыполненныхРаботПозиции
	               |ГДЕ
	               |	СМ_АктВыполненныхРаботПозиции.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_ЛокальнаяСмета.Ссылка КАК Ссылка,
	               |	СМ_ЛокальнаяСмета.Наименование КАК Наименование,
	               |	СМ_ЛокальнаяСмета.ИД КАК ИД,
	               |	СМ_ЛокальнаяСмета.ИДРодителя КАК ИДРодителя,
	               |	ИСТИНА КАК Доступность,
	               |	НЕОПРЕДЕЛЕНО КАК ЭлементРодитель,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_ЛокальнаяСмета.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА СМ_ЛокальнаяСмета.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитСводнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_ЛокальнаяСмета.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА СМ_ЛокальнаяСмета.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитОбъектнойСмете,
	               |	СМ_ЛокальнаяСмета.Ссылка КАК ПринадлежитЛокальнойСмете,
	               |	ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка) КАК ПринадлежитРазделу,
	               |	ЛОЖЬ КАК Связанная,
	               |	NULL КАК СвязаннаяКартинка,
	               |	ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка) КАК СвязаннаяВладелец,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	               |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер КАК НомерПорядковый
	               |ПОМЕСТИТЬ ВТ_ЛокальнаяСмета
	               |ИЗ
	               |	ВТ_АктВыполненныхРабот КАК ВТ_АктВыполненныхРабот
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО СМ_ЛокальнаяСмета.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |				И (СМ_НумерацияПозицийЛокальныхСмет.Раздел = ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка))
	               |				И (СМ_НумерацияПозицийЛокальныхСмет.Позиция = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка))
	               |		ПО ВТ_АктВыполненныхРабот.ЛокальнаяСмета = СМ_ЛокальнаяСмета.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_РазделЛокальнойСметы.Ссылка,
	               |	СМ_РазделЛокальнойСметы.НаименованиеДляПечати,
	               |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер КАК НомерПорядковый,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	               |	СМ_РазделЛокальнойСметы.ИД,
	               |	СМ_РазделЛокальнойСметы.ИДРодителя,
	               |	СМ_РазделЛокальнойСметы.ИДСметы,
	               |	СМ_РазделЛокальнойСметы.Расчет,
	               |	СМ_РазделЛокальнойСметы.Номер,
	               |	ИСТИНА КАК Доступность,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_РазделЛокальнойСметы.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА СМ_РазделЛокальнойСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитСводнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_РазделЛокальнойСметы.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА СМ_РазделЛокальнойСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитОбъектнойСмете,
	               |	СМ_РазделЛокальнойСметы.ИДСметы КАК ПринадлежитЛокальнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_РазделЛокальнойСметы.ИДРодителя) = ТИП(Документ.СМ_РазделЛокальнойСметы)
	               |			ТОГДА СМ_РазделЛокальнойСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитРазделу,
	               |	ЛОЖЬ КАК Связанная,
	               |	NULL КАК СвязаннаяКартинка,
	               |	ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка) КАК СвязаннаяВладелец
	               |ПОМЕСТИТЬ ВТ_РазделЛокальнойСметы
	               |ИЗ
	               |	ВТ_ЛокальнаяСмета КАК ВТ_ЛокальнаяСмета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО СМ_РазделЛокальнойСметы.ИДСметы = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |				И СМ_РазделЛокальнойСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Раздел
	               |				И (СМ_НумерацияПозицийЛокальныхСмет.Позиция = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка))
	               |		ПО ВТ_ЛокальнаяСмета.Ссылка = СМ_РазделЛокальнойСметы.ИДСметы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_ПозицияЛокальнойСметы.Ссылка КАК Ссылка,
	               |	СМ_ПозицияЛокальнойСметы.Наименование КАК Наименование,
	               |	СМ_ПозицияЛокальнойСметы.Расчет КАК Расчет,
	               |	СМ_ПозицияЛокальнойСметы.ИД КАК ИД,
	               |	СМ_ПозицияЛокальнойСметы.ИДРодителя КАК ИДРодителя,
	               |	СМ_ПозицияЛокальнойСметы.ИДСметы КАК ИДСметы,
	               |	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца КАК ИДПозицииВладельца,
	               |	СМ_ПозицияЛокальнойСметы.Номер КАК Номер,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы КАК НомерВПределахСметы,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве КАК НомерВДереве,
	               |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер КАК НомерПорядковый,
	               |	СМ_ПозицияЛокальнойСметы.ОбъемРабот КАК ОбъемРабот,
	               |	СМ_ПозицияЛокальнойСметы.ШифрРасценки КАК ШифрРасценки,
	               |	СМ_ПозицияЛокальнойСметы.Измеритель КАК Измеритель,
	               |	СМ_ПозицияЛокальнойСметы.Определитель КАК Определитель,
	               |	СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы КАК НеПрименятьИндексы,
	               |	СМ_ПозицияЛокальнойСметы.ТекущаяЦена КАК ТекущаяЦена,
	               |	СМ_ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов КАК ТекущаяЗарплатаМашинистов,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ТекущаяЦена
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |					ТОГДА ВЫБОР
	               |							КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |								ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимОборуд
	               |							ИНАЧЕ СМ_ПозицияЛокальнойСметы.Оборудование
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |							ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимПрямЗатраты
	               |						ИНАЧЕ СМ_ПозицияЛокальнойСметы.ПрямЗатраты
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ПрямЗатраты,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимОснЗарплата
	               |				ИНАЧЕ СМ_ПозицияЛокальнойСметы.ОснЗарплата
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ОснЗарплата,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки <> ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |							И СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки <> ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Материал)
	               |						ТОГДА СМ_ПозицияЛокальнойСметы.ТекущаяЦена
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимЭксплМашин
	               |				ИНАЧЕ СМ_ПозицияЛокальнойСметы.ЭксплМашин
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ЭксплМашин,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимЗарплМашин
	               |				ИНАЧЕ СМ_ПозицияЛокальнойСметы.ЗарплМашинистов
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ЗарплМашинистов,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Материал)
	               |						ТОГДА СМ_ПозицияЛокальнойСметы.ТекущаяЦена
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимСтоимМатер
	               |				ИНАЧЕ СМ_ПозицияЛокальнойСметы.СтоимМатериалов
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СтоимМатериалов,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА РесурснаяСтоимостьПозиции.ЗатратыТрудаРабочих
	               |		ИНАЧЕ СМ_ПозицияЛокальнойСметы.ЗатратыТрудаРабочих
	               |	КОНЕЦ КАК ЗатратыТрудаРабочих,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА РесурснаяСтоимостьПозиции.ЗатратыТрудаМашин
	               |		ИНАЧЕ СМ_ПозицияЛокальнойСметы.ЗатратыТрудаМашинистов
	               |	КОНЕЦ КАК ЗатратыТрудаМашинистов,
	               |	СМ_ПозицияЛокальнойСметы.ОтмеченаВДереве КАК ОтмеченаВДереве,
	               |	СМ_ПозицияЛокальнойСметы.Версия КАК Версия,
	               |	ИСТИНА КАК Доступность,
	               |	ВТ_АктВыполненныхРаботПозиции.ФактОбъем,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_ПозицияЛокальнойСметы.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитСводнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_ПозицияЛокальнойСметы.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитОбъектнойСмете,
	               |	СМ_ПозицияЛокальнойСметы.ИДСметы КАК ПринадлежитЛокальнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_ПозицияЛокальнойСметы.ИДРодителя) = ТИП(Документ.СМ_РазделЛокальнойСметы)
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитРазделу,
	               |	ЕСТЬNULL(ВТ_ПозицииАктов.Всего, 0) КАК ОбъемВсего
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыОбъемФактический
	               |ИЗ
	               |	ВТ_ЛокальнаяСмета КАК ВТ_ЛокальнаяСмета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_РесурснаяСтоимостьПозиции КАК РесурснаяСтоимостьПозиции
	               |			ПО (РесурснаяСтоимостьПозиции.Позиция = СМ_ПозицияЛокальнойСметы.Ссылка)
	               |				И (РесурснаяСтоимостьПозиции.Смета = &Ссылка)
	               |				И (РесурснаяСтоимостьПозиции.Раздел = СМ_ПозицияЛокальнойСметы.ИДРодителя)
	               |				И (СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный))
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктВыполненныхРаботПозиции КАК ВТ_АктВыполненныхРаботПозиции
	               |			ПО СМ_ПозицияЛокальнойСметы.Ссылка = ВТ_АктВыполненныхРаботПозиции.Позиция
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО СМ_ПозицияЛокальнойСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Позиция
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицииАктов КАК ВТ_ПозицииАктов
	               |			ПО СМ_ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицииАктов.Позиция
	               |				И СМ_ПозицияЛокальнойСметы.ИДСметы = ВТ_ПозицииАктов.Позиция.ИДСметы
	               |		ПО ВТ_ЛокальнаяСмета.Ссылка = СМ_ПозицияЛокальнойСметы.ИДСметы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка,
	               |	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца КАК Владелец,
	               |	МАКСИМУМ(СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве) КАК НомерВДереве
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический КАК ВТ_ПозицияЛокальнойСметыОбъемФактический
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО СМ_ПозицияЛокальнойСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Позиция
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |ГДЕ
	               |	НЕ СМ_ПозицияЛокальнойСметы.НомерВДереве ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка,
	               |	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СМ_НумерацияПозицийЛокальныхСмет.Позиция КАК Ссылка,
	               |	ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.Ссылка КАК Владелец
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |		ПО ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.Владелец = СМ_НумерацияПозицийЛокальныхСмет.Позиция.ИДПозицииВладельца
	               |			И ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.НомерВДереве = СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметы.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический КАК ВТ_ПозицияЛокальнойСметыОбъемФактический
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК РесурсыКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК НачисленияКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ПоправкиКоличество,
	               |	СУММА(1) КАК ИндексыКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК СвойстваКоличество
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический КАК ВТ_ПозицияЛокальнойСметыОбъемФактический
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.РесурсыПозицииЛокальнойСметы КАК СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.НачисленияПозиции КАК СМ_ПозицияЛокальнойСметыНачисленияПозиции
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК СМ_ПозицияЛокальнойСметыПоправкиПозиции
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.КоэффициентыПересчета КАК СМ_ПозицияЛокальнойСметыКоэффициентыПересчета
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.ДополнительныеРеквизиты КАК СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИСТИНА КАК ЭтоКорневойЭлемент,
	               |	ВЗ_ЛокальнаяСмета.Ссылка КАК Элемент,
	               |	ВЗ_ЛокальнаяСмета.ЭлементРодитель КАК ЭлементРодитель,
	               |	ВЗ_ЛокальнаяСмета.Наименование КАК Наименование,
	               |	NULL КАК Шифр,
	               |	NULL КАК Объем,
	               |	NULL КАК ОбъемПоАкту,
	               |	ВЗ_ЛокальнаяСмета.ИД КАК ИД,
	               |	НЕОПРЕДЕЛЕНО КАК ИДСметы,
	               |	ИСТИНА КАК Расчет,
	               |	ВЗ_ЛокальнаяСмета.НомерВДереве КАК НомерВДереве,
	               |	ВЗ_ЛокальнаяСмета.НомерПорядковый КАК НомерПорядковый,
	               |	ВЗ_ЛокальнаяСмета.Номер КАК Номер,
	               |	0 КАК НомерВПределахСметы,
	               |	NULL КАК Версия,
	               |	NULL КАК Измеритель,
	               |	ВЗ_ЛокальнаяСмета.ОбщВсего КАК ОбщВсего,
	               |	ВЗ_ЛокальнаяСмета.ОснЗарплата КАК ОснЗарплата,
	               |	ВЗ_ЛокальнаяСмета.ЭксплМашин КАК ЭксплМашин,
	               |	ВЗ_ЛокальнаяСмета.ЗарплМашин КАК ЗарплМашин,
	               |	ВЗ_ЛокальнаяСмета.СтоимМатер КАК СтоимМатер,
	               |	ВЗ_ЛокальнаяСмета.ЗатратыТрудаРабочих КАК ЗатратыТрудаРабочих,
	               |	ВЗ_ЛокальнаяСмета.ЗатратыТрудаМашин КАК ЗатратыТрудаМашин,
	               |	0 КАК ТипСтроки,
	               |	-100 КАК НомерРодителя,
	               |	-100 КАК НомерПозиции,
	               |	-100 КАК НомерРаздела,
	               |	0 КАК ЕдВсего,
	               |	0 КАК ЕдОснЗП,
	               |	0 КАК ЕдЭксплМашин,
	               |	0 КАК ЕдЭМЗарПлата,
	               |	0 КАК ЕдСтоимостьМатериалов,
	               |	0 КАК ЕдЗатрТрРаб,
	               |	0 КАК ЕдЗатрТрМех,
	               |	NULL КАК ОтмеченаВДереве,
	               |	ВЗ_ЛокальнаяСмета.Доступность,
	               |	ВЗ_ЛокальнаяСмета.ПринадлежитСводнойСмете,
	               |	ВЗ_ЛокальнаяСмета.ПринадлежитОбъектнойСмете,
	               |	ВЗ_ЛокальнаяСмета.ПринадлежитЛокальнойСмете,
	               |	ВЗ_ЛокальнаяСмета.ПринадлежитРазделу,
	               |	ВЗ_ЛокальнаяСмета.Связанная КАК Связанная,
	               |	ВЗ_ЛокальнаяСмета.СвязаннаяКартинка КАК СвязаннаяКартинка,
	               |	ВЗ_ЛокальнаяСмета.СвязаннаяВладелец КАК СвязаннаяВладелец,
	               |	NULL КАК СодержитРесурсы,
	               |	NULL КАК СодержитПоправки,
	               |	NULL КАК СодержитНачисления,
	               |	NULL КАК СодержитИндексы,
	               |	NULL КАК СодержитСвойства,
	               |	ВЗ_ЛокальнаяСмета.НомерПорядковый КАК НомерПорядковый1,
	               |	0 КАК СтатусРедактирования,
	               |	0 КАК ОбъемВсего
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВТ_ЛокальнаяСмета.Ссылка КАК Ссылка,
	               |		ВТ_ЛокальнаяСмета.Наименование КАК Наименование,
	               |		ВТ_ЛокальнаяСмета.ИД КАК ИД,
	               |		ВТ_ЛокальнаяСмета.ИДРодителя КАК ИДРодителя,
	               |		ВТ_ЛокальнаяСмета.Ссылка.Номер КАК Номер,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекПрямЗатраты, 0)) КАК ОбщВсего,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекОснЗарплата, 0)) КАК ОснЗарплата,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекЭксплМашин, 0)) КАК ЭксплМашин,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекЗарплМашин, 0)) КАК ЗарплМашин,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекСтоимМатер, 0)) КАК СтоимМатер,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ЗатратыТрудаРабочих, 0)) КАК ЗатратыТрудаРабочих,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ЗатратыТрудаМашин, 0)) КАК ЗатратыТрудаМашин,
	               |		ВТ_ЛокальнаяСмета.Доступность КАК Доступность,
	               |		ВТ_ЛокальнаяСмета.ЭлементРодитель КАК ЭлементРодитель,
	               |		ВТ_ЛокальнаяСмета.ПринадлежитСводнойСмете КАК ПринадлежитСводнойСмете,
	               |		ВТ_ЛокальнаяСмета.ПринадлежитОбъектнойСмете КАК ПринадлежитОбъектнойСмете,
	               |		ВТ_ЛокальнаяСмета.ПринадлежитЛокальнойСмете КАК ПринадлежитЛокальнойСмете,
	               |		ВТ_ЛокальнаяСмета.ПринадлежитРазделу КАК ПринадлежитРазделу,
	               |		ВТ_ЛокальнаяСмета.Связанная КАК Связанная,
	               |		ВТ_ЛокальнаяСмета.СвязаннаяКартинка КАК СвязаннаяКартинка,
	               |		ВТ_ЛокальнаяСмета.СвязаннаяВладелец КАК СвязаннаяВладелец,
	               |		ВТ_ЛокальнаяСмета.НомерВДереве КАК НомерВДереве,
	               |		ВТ_ЛокальнаяСмета.НомерПорядковый КАК НомерПорядковый
	               |	ИЗ
	               |		ВТ_ЛокальнаяСмета КАК ВТ_ЛокальнаяСмета
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
	               |			ПО (СМ_ИтогиПоГлавам.Смета = &Ссылка)
	               |				И (СМ_ИтогиПоГлавам.Итог = &ИтогСметы)
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО ВТ_ЛокальнаяСмета.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |				И (НЕ СМ_НумерацияПозицийЛокальныхСмет.Раздел = ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка))
	               |				И (НЕ СМ_НумерацияПозицийЛокальныхСмет.Позиция = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка))
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ЛокальнаяСмета.Ссылка,
	               |		ВТ_ЛокальнаяСмета.Наименование,
	               |		ВТ_ЛокальнаяСмета.ИД,
	               |		ВТ_ЛокальнаяСмета.ИДРодителя,
	               |		ВТ_ЛокальнаяСмета.Ссылка.Номер,
	               |		ВТ_ЛокальнаяСмета.Доступность,
	               |		ВТ_ЛокальнаяСмета.ЭлементРодитель,
	               |		ВТ_ЛокальнаяСмета.ПринадлежитСводнойСмете,
	               |		ВТ_ЛокальнаяСмета.ПринадлежитОбъектнойСмете,
	               |		ВТ_ЛокальнаяСмета.ПринадлежитЛокальнойСмете,
	               |		ВТ_ЛокальнаяСмета.ПринадлежитРазделу,
	               |		ВТ_ЛокальнаяСмета.Связанная,
	               |		ВТ_ЛокальнаяСмета.СвязаннаяКартинка,
	               |		ВТ_ЛокальнаяСмета.СвязаннаяВладелец,
	               |		ВТ_ЛокальнаяСмета.НомерВДереве,
	               |		ВТ_ЛокальнаяСмета.НомерПорядковый) КАК ВЗ_ЛокальнаяСмета
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛОЖЬ,
	               |	ВТ_РазделЛокальнойСметы.Ссылка,
	               |	ВТ_РазделЛокальнойСметы.ИДРодителя,
	               |	ВТ_РазделЛокальнойСметы.НаименованиеДляПечати,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	ВТ_РазделЛокальнойСметы.ИД,
	               |	ВТ_РазделЛокальнойСметы.ИДСметы,
	               |	ВТ_РазделЛокальнойСметы.Расчет,
	               |	ВТ_РазделЛокальнойСметы.НомерВДереве,
	               |	ВТ_РазделЛокальнойСметы.НомерПорядковый,
	               |	ВТ_РазделЛокальнойСметы.Номер,
	               |	ВТ_РазделЛокальнойСметы.НомерВПределахСметы,
	               |	NULL,
	               |	NULL,
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекОснЗарплата, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекЭксплМашин, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекСтоимМатер, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекОборуд, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекОснЗарплата, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекЭксплМашин, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекЗарплМашин, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекСтоимМатер, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ЗатратыТрудаРабочих, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ЗатратыТрудаМашин, 0),
	               |	1,
	               |	ВТ_РазделЛокальнойСметы.НомерВДереве,
	               |	ВТ_РазделЛокальнойСметы.НомерВДереве,
	               |	ВТ_РазделЛокальнойСметы.ИДРодителя.НомерВДереве,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	ВТ_РазделЛокальнойСметы.Доступность,
	               |	ВТ_РазделЛокальнойСметы.ПринадлежитСводнойСмете,
	               |	ВТ_РазделЛокальнойСметы.ПринадлежитОбъектнойСмете,
	               |	ВТ_РазделЛокальнойСметы.ПринадлежитЛокальнойСмете,
	               |	ВТ_РазделЛокальнойСметы.ПринадлежитРазделу,
	               |	ВТ_РазделЛокальнойСметы.Связанная,
	               |	ВТ_РазделЛокальнойСметы.СвязаннаяКартинка,
	               |	ВТ_РазделЛокальнойСметы.СвязаннаяВладелец,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТ_РазделЛокальнойСметы КАК ВТ_РазделЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_ИтогиПоРазделу КАК ИтогиПоРазделу
	               |		ПО ВТ_РазделЛокальнойСметы.Ссылка = ИтогиПоРазделу.Раздел
	               |			И (ИтогиПоРазделу.Смета = &Ссылка)
	               |			И (ИтогиПоРазделу.Итог = &ИтогРаздела)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЛОЖЬ,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДРодителя,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Наименование,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ШифрРасценки,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ОбъемРабот,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ФактОбъем,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ИД,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Расчет,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.НомерВДереве,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.НомерПорядковый,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Номер,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.НомерВПределахСметы,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Версия,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Измеритель,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(РегРес.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0) + ЕСТЬNULL(РегРес.ТекСтоимОборуд, 0)
	               |					ИНАЧЕ ЕСТЬNULL(Рег.СтоимОснЗарплата, 0) + ЕСТЬNULL(Рег.СтоимЭксплМашин, 0) + ЕСТЬNULL(Рег.СтоимСтоимМатер, 0) + ЕСТЬNULL(Рег.СтоимОборуд, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |								ТОГДА ЕСТЬNULL(РегРес.ТекСтоимОборуд, 0)
	               |							ИНАЧЕ ЕСТЬNULL(Рег.СтоимОборуд, 0)
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |							ТОГДА ВЫБОР
	               |									КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ПрямЗатраты <> 0
	               |											И ЕСТЬNULL(РегРес.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0) = 0
	               |										ТОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ПрямЗатраты
	               |									ИНАЧЕ ЕСТЬNULL(РегРес.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0)
	               |								КОНЕЦ
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ПрямЗатраты <> 0
	               |										И ЕСТЬNULL(Рег.СтоимОснЗарплата, 0) + ЕСТЬNULL(Рег.СтоимЭксплМашин, 0) + ЕСТЬNULL(Рег.СтоимСтоимМатер, 0) = 0
	               |									ТОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ПрямЗатраты
	               |								ИНАЧЕ ЕСТЬNULL(Рег.СтоимОснЗарплата, 0) + ЕСТЬNULL(Рег.СтоимЭксплМашин, 0) + ЕСТЬNULL(Рег.СтоимСтоимМатер, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.НеПрименятьИндексы
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(РегРес.ТекСтоимОснЗарплата, 0)
	               |				ИНАЧЕ ЕСТЬNULL(Рег.СтоимОснЗарплата, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0)
	               |					ИНАЧЕ ЕСТЬNULL(Рег.СтоимЭксплМашин, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0)
	               |				ИНАЧЕ ЕСТЬNULL(Рег.СтоимЭксплМашин, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.НеПрименятьИндексы
	               |			ТОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ТекущаяЗарплатаМашинистов
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(РегРес.ТекСтоимЗарплМашин, 0)
	               |				ИНАЧЕ ЕСТЬNULL(Рег.СтоимЗарплМашин, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0)
	               |					ИНАЧЕ ЕСТЬNULL(Рег.СтоимСтоимМатер, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0)
	               |				ИНАЧЕ ЕСТЬNULL(Рег.СтоимСтоимМатер, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА ЕСТЬNULL(РегРес.ЗатратыТрудаРабочих, 0)
	               |		ИНАЧЕ ЕСТЬNULL(Рег.ЗатратыТрудаРабочих, 0)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА ЕСТЬNULL(РегРес.ЗатратыТрудаМашин, 0)
	               |		ИНАЧЕ ЕСТЬNULL(Рег.ЗатратыТрудаМашин, 0)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |			ТОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.НомерВДереве
	               |		ИНАЧЕ ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДПозицииВладельца.НомерВДереве
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.НомерВДереве,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДРодителя.НомерВДереве,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ПрямЗатраты,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ОснЗарплата,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ЭксплМашин,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ЗарплМашинистов,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.СтоимМатериалов,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ЗатратыТрудаРабочих,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ЗатратыТрудаМашинистов,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ОтмеченаВДереве,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.Доступность,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ПринадлежитСводнойСмете,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ПринадлежитОбъектнойСмете,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ПринадлежитЛокальнойСмете,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ПринадлежитРазделу,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Количество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Количество > 0
	               |			ТОГДА NULL
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |					ТОГДА NULL
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Владелец ЕСТЬ NULL 
	               |							ТОГДА 0
	               |						ИНАЧЕ 1
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДПозицииВладельца,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.РесурсыКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА НЕ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.Ссылка = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |						И НЕ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.Ссылка ЕСТЬ NULL 
	               |						И (ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.Ссылка.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Материал)
	               |							ИЛИ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.Ссылка.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование))
	               |					ТОГДА ИСТИНА
	               |				ИНАЧЕ ЛОЖЬ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.ПоправкиКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.НачисленияКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.ИндексыКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.СвойстваКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	NULL,
	               |	0,
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический.ОбъемВсего
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметыОбъемФактический КАК ВТ_ПозицияЛокальнойСметыОбъемФактический
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК Рег
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = Рег.Позиция
	               |			И ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДРодителя = Рег.Раздел
	               |			И (Рег.Смета = &Ссылка)
	               |			И (ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета <> ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК РегРес
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = РегРес.Позиция
	               |			И ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДРодителя = РегРес.Раздел
	               |			И (РегРес.Смета = &Ссылка)
	               |			И (ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Ссылка
	               |			И ВТ_ПозицияЛокальнойСметыОбъемФактический.ИДПозицииВладельца = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Владелец
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество КАК ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество
	               |		ПО ВТ_ПозицияЛокальнойСметыОбъемФактический.Ссылка = ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерВДереве,
	               |	НомерПорядковый";
		
	Возврат ТекстЗапроса;
	
КонецФункции

//	Функция возвращает запрос на формирование дерева смет.
//
// Параметры:
//
// Возвращаемое значение:
//     Строка с текстом запроса на формирование таблицы для дерева разделов и позиций.
//
Функция ПолучитьТекстЗапросаНаДеревоСметЛокальнаяСмета()
	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ЛокальнаяСмета.Ссылка КАК Ссылка,
	               |	ЛокальнаяСмета.Наименование КАК Наименование,
	               |	ЛокальнаяСмета.ИД КАК ИД,
	               |	НЕОПРЕДЕЛЕНО КАК ИДРодителя
	               |ПОМЕСТИТЬ ВТ_ЛокальнаяСмета
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета КАК ЛокальнаяСмета
	               |ГДЕ
	               |	ЛокальнаяСмета.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СМ_АктВыполненныхРаботПозиции.Позиция,
	               |	СУММА(СМ_АктВыполненныхРаботПозиции.ФактОбъем) КАК Всего
	               |ПОМЕСТИТЬ ВТ_ПозицииАктов
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_АктВыполненныхРаботПозиции
	               |ГДЕ
	               |	СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета = &Ссылка
	               |	И СМ_АктВыполненныхРаботПозиции.Ссылка.Проведен = ИСТИНА
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СМ_АктВыполненныхРаботПозиции.Позиция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	РазделЛокальнойСметы.Ссылка,
	               |	РазделЛокальнойСметы.НаименованиеДляПечати,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	               |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер,
	               |	РазделЛокальнойСметы.ИД,
	               |	РазделЛокальнойСметы.ИДРодителя,
	               |	РазделЛокальнойСметы.ИДСметы,
	               |	РазделЛокальнойСметы.Расчет,
	               |	РазделЛокальнойСметы.Номер,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(РазделЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА РазделЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитСводнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(РазделЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА РазделЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитОбъектнойСмете,
	               |	РазделЛокальнойСметы.ИДСметы КАК ПринадлежитЛокальнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(РазделЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_РазделЛокальнойСметы)
	               |			ТОГДА РазделЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитРазделу,
	               |	ЛОЖЬ КАК СодержитРесурсы,
	               |	ЛОЖЬ КАК СодержитПоправки,
	               |	ЛОЖЬ КАК СодержитНачисления,
	               |	ЛОЖЬ КАК СодержитИндексы
	               |ПОМЕСТИТЬ ВТ_РазделЛокальнойСметы
	               |ИЗ
	               |	Документ.СМ_РазделЛокальнойСметы КАК РазделЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |		ПО РазделЛокальнойСметы.ИДСметы = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |			И РазделЛокальнойСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Раздел
	               |			И (СМ_НумерацияПозицийЛокальныхСмет.Позиция = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка))
	               |ГДЕ
	               |	РазделЛокальнойСметы.ИДСметы = &Ссылка
	               |	И РазделЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_ПозицияЛокальнойСметы.Ссылка,
	               |	СМ_ПозицияЛокальнойСметы.Наименование,
	               |	СМ_ПозицияЛокальнойСметы.Расчет,
	               |	СМ_ПозицияЛокальнойСметы.ИД,
	               |	СМ_ПозицияЛокальнойСметы.ИДРодителя,
	               |	СМ_ПозицияЛокальнойСметы.ИДСметы,
	               |	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца,
	               |	СМ_ПозицияЛокальнойСметы.Номер,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	               |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер,
	               |	СМ_ПозицияЛокальнойСметы.ОбъемРабот,
	               |	СМ_ПозицияЛокальнойСметы.ШифрРасценки,
	               |	СМ_ПозицияЛокальнойСметы.Измеритель,
	               |	СМ_ПозицияЛокальнойСметы.Определитель,
	               |	СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы,
	               |	СМ_ПозицияЛокальнойСметы.ТекущаяЦена,
	               |	СМ_ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ТекущаяЦена
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |					ТОГДА ВЫБОР
	               |							КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |								ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимОборуд
	               |							ИНАЧЕ СМ_ПозицияЛокальнойСметы.Оборудование
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |							ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимПрямЗатраты
	               |						ИНАЧЕ СМ_ПозицияЛокальнойСметы.ПрямЗатраты
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ПрямЗатраты,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимОснЗарплата
	               |				ИНАЧЕ СМ_ПозицияЛокальнойСметы.ОснЗарплата
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ОснЗарплата,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки <> ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |							И СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки <> ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Материал)
	               |						ТОГДА СМ_ПозицияЛокальнойСметы.ТекущаяЦена
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимЭксплМашин
	               |				ИНАЧЕ СМ_ПозицияЛокальнойСметы.ЭксплМашин
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ЭксплМашин,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимЗарплМашин
	               |				ИНАЧЕ СМ_ПозицияЛокальнойСметы.ЗарплМашинистов
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ЗарплМашинистов,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА СМ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Материал)
	               |						ТОГДА СМ_ПозицияЛокальнойСметы.ТекущаяЦена
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимСтоимМатер
	               |				ИНАЧЕ СМ_ПозицияЛокальнойСметы.СтоимМатериалов
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СтоимМатериалов,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА РесурснаяСтоимостьПозиции.ЗатратыТрудаРабочих
	               |		ИНАЧЕ СМ_ПозицияЛокальнойСметы.ЗатратыТрудаРабочих
	               |	КОНЕЦ КАК ЗатратыТрудаРабочих,
	               |	ВЫБОР
	               |		КОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА РесурснаяСтоимостьПозиции.ЗатратыТрудаМашин
	               |		ИНАЧЕ СМ_ПозицияЛокальнойСметы.ЗатратыТрудаМашинистов
	               |	КОНЕЦ КАК ЗатратыТрудаМашинистов,
	               |	СМ_ПозицияЛокальнойСметы.ОтмеченаВДереве,
	               |	СМ_ПозицияЛокальнойСметы.Версия,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_ПозицияЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитОбъектнойСмете,
	               |	СМ_ПозицияЛокальнойСметы.ИДСметы КАК ПринадлежитЛокальнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_ПозицияЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА СМ_ПозицияЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитСводнойСмете,
	               |	СМ_ПозицияЛокальнойСметы.ИДРодителя КАК ПринадлежитРазделу,
	               |	ЕСТЬNULL(ВТ_ПозицииАктов.Всего, 0) КАК ОбъемВсего
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметы
	               |ИЗ
	               |	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_РесурснаяСтоимостьПозиции КАК РесурснаяСтоимостьПозиции
	               |		ПО (РесурснаяСтоимостьПозиции.Позиция = СМ_ПозицияЛокальнойСметы.Ссылка)
	               |			И (РесурснаяСтоимостьПозиции.Смета = СМ_ПозицияЛокальнойСметы.ИДСметы)
	               |			И (РесурснаяСтоимостьПозиции.Раздел = СМ_ПозицияЛокальнойСметы.ИДРодителя)
	               |			И (СМ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |		ПО (СМ_НумерацияПозицийЛокальныхСмет.Позиция = СМ_ПозицияЛокальнойСметы.Ссылка)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицииАктов КАК ВТ_ПозицииАктов
	               |		ПО СМ_ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицииАктов.Позиция
	               |ГДЕ
	               |	СМ_ПозицияЛокальнойСметы.ИДСметы = &Ссылка
	               |	И СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца КАК Владелец,
	               |	МАКСИМУМ(СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве) КАК НомерВДереве
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметы КАК ВТ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО СМ_ПозицияЛокальнойСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Позиция
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |ГДЕ
	               |	НЕ СМ_ПозицияЛокальнойСметы.НомерВДереве ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_НумерацияПозицийЛокальныхСмет.Позиция КАК Ссылка,
	               |	ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.Ссылка КАК Владелец
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |		ПО ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.Владелец = СМ_НумерацияПозицийЛокальныхСмет.Позиция.ИДПозицииВладельца
	               |			И ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.НомерВДереве = СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметы.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметы КАК ВТ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК РесурсыКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК НачисленияКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ПоправкиКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ИндексыКоличество
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметы КАК ВТ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.РесурсыПозицииЛокальнойСметы КАК СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.НачисленияПозиции КАК СМ_ПозицияЛокальнойСметыНачисленияПозиции
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК СМ_ПозицияЛокальнойСметыПоправкиПозиции
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.КоэффициентыПересчета КАК СМ_ПозицияЛокальнойСметыКоэффициентыПересчета
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	0 КАК ТипСтроки,
	               |	ИСТИНА КАК ЭтоКорневойЭлемент,
	               |	ВЗ_ЛокальнаяСмета.Ссылка КАК Элемент,
	               |	ВЗ_ЛокальнаяСмета.ИДРодителя КАК ЭлементРодитель,
	               |	ВЗ_ЛокальнаяСмета.Наименование КАК Наименование,
	               |	NULL КАК Шифр,
	               |	ВЗ_ЛокальнаяСмета.ИД КАК ИД,
	               |	НЕОПРЕДЕЛЕНО КАК ИДСметы,
	               |	0 КАК НомерВДереве,
	               |	0 КАК НомерПорядковый,
	               |	0 КАК НомерВПределахСметы,
	               |	ВЗ_ЛокальнаяСмета.Номер КАК Номер,
	               |	ИСТИНА КАК Расчет,
	               |	NULL КАК Версия,
	               |	NULL КАК Объем,
	               |	NULL КАК Измеритель,
	               |	ВЗ_ЛокальнаяСмета.ОбщВсего КАК ОбщВсего,
	               |	ВЗ_ЛокальнаяСмета.ОснЗарплата КАК ОснЗарплата,
	               |	ВЗ_ЛокальнаяСмета.ЭксплМашин КАК ЭксплМашин,
	               |	ВЗ_ЛокальнаяСмета.ЗарплМашин КАК ЗарплМашин,
	               |	ВЗ_ЛокальнаяСмета.СтоимМатер КАК СтоимМатер,
	               |	ВЗ_ЛокальнаяСмета.ЗатратыТрудаРабочих КАК ЗатратыТрудаРабочих,
	               |	ВЗ_ЛокальнаяСмета.ЗатратыТрудаМашин КАК ЗатратыТрудаМашин,
	               |	0 КАК ЕдВсего,
	               |	0 КАК ЕдОснЗП,
	               |	0 КАК ЕдЭксплМашин,
	               |	0 КАК ЕдЭМЗарПлата,
	               |	0 КАК ЕдСтоимостьМатериалов,
	               |	0 КАК ЕдЗатрТрРаб,
	               |	0 КАК ЕдЗатрТрМех,
	               |	NULL КАК ОтмеченаВДереве,
	               |	ИСТИНА КАК Доступность,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВЗ_ЛокальнаяСмета.ИД.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА ВЗ_ЛокальнаяСмета.ИД.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитСводнойСмете,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВЗ_ЛокальнаяСмета.ИД.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА ВЗ_ЛокальнаяСмета.ИД.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ПринадлежитОбъектнойСмете,
	               |	ВЗ_ЛокальнаяСмета.ИД КАК ПринадлежитЛокальнойСмете,
	               |	ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка) КАК ПринадлежитРазделу,
	               |	ЛОЖЬ КАК Связанная,
	               |	NULL КАК СвязаннаяКартинка,
	               |	NULL КАК СвязаннаяВладелец,
	               |	ВЗ_ЛокальнаяСмета.СодержитРесурсы КАК СодержитРесурсы,
	               |	ВЗ_ЛокальнаяСмета.СодержитПоправки КАК СодержитПоправки,
	               |	ВЗ_ЛокальнаяСмета.СодержитНачисления КАК СодержитНачисления,
	               |	ВЗ_ЛокальнаяСмета.СодержитИндексы КАК СодержитИндексы,
	               |	0 КАК СтатусРедактирования,
	               |	0 КАК ОбъемВсего
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ЛокальнаяСметаДок.Ссылка КАК Ссылка,
	               |		ЛокальнаяСметаДок.Наименование КАК Наименование,
	               |		ЛокальнаяСметаДок.ИД КАК ИД,
	               |		ЛокальнаяСметаДок.ИДРодителя КАК ИДРодителя,
	               |		ЛокальнаяСметаДок.Ссылка.Номер КАК Номер,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекПрямЗатраты, 0)) КАК ОбщВсего,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекОснЗарплата, 0)) КАК ОснЗарплата,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекЭксплМашин, 0)) КАК ЭксплМашин,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекЗарплМашин, 0)) КАК ЗарплМашин,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекСтоимМатер, 0)) КАК СтоимМатер,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ЗатратыТрудаРабочих, 0)) КАК ЗатратыТрудаРабочих,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ЗатратыТрудаМашин, 0)) КАК ЗатратыТрудаМашин,
	               |		ЛОЖЬ КАК СодержитРесурсы,
	               |		ЛОЖЬ КАК СодержитПоправки,
	               |		ЛОЖЬ КАК СодержитНачисления,
	               |		ЛОЖЬ КАК СодержитИндексы
	               |	ИЗ
	               |		ВТ_ЛокальнаяСмета КАК ЛокальнаяСметаДок
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
	               |			ПО ЛокальнаяСметаДок.Ссылка = СМ_ИтогиПоГлавам.Смета
	               |				И (СМ_ИтогиПоГлавам.Итог = &ИтогСметы)
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ЛокальнаяСметаДок.Ссылка,
	               |		ЛокальнаяСметаДок.Наименование,
	               |		ЛокальнаяСметаДок.ИД,
	               |		ЛокальнаяСметаДок.ИДРодителя,
	               |		ЛокальнаяСметаДок.Ссылка.Номер) КАК ВЗ_ЛокальнаяСмета
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	1,
	               |	ЛОЖЬ,
	               |	ВТ_РазделЛокальнойСметы.Ссылка,
	               |	ВТ_РазделЛокальнойСметы.ИДРодителя,
	               |	ВТ_РазделЛокальнойСметы.НаименованиеДляПечати,
	               |	NULL,
	               |	ВТ_РазделЛокальнойСметы.ИД,
	               |	ВТ_РазделЛокальнойСметы.ИДСметы,
	               |	ВТ_РазделЛокальнойСметы.НомерВДереве,
	               |	ВТ_РазделЛокальнойСметы.ПорНомер,
	               |	ВТ_РазделЛокальнойСметы.НомерВПределахСметы,
	               |	ВТ_РазделЛокальнойСметы.Номер,
	               |	ВТ_РазделЛокальнойСметы.Расчет,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекОснЗарплата, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекЭксплМашин, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекСтоимМатер, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекОборуд, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекОснЗарплата, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекЭксплМашин, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекЗарплМашин, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекСтоимМатер, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ЗатратыТрудаРабочих, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ЗатратыТрудаМашин, 0),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	NULL,
	               |	ИСТИНА,
	               |	ВТ_РазделЛокальнойСметы.ПринадлежитСводнойСмете,
	               |	ВТ_РазделЛокальнойСметы.ПринадлежитОбъектнойСмете,
	               |	ВТ_РазделЛокальнойСметы.ПринадлежитЛокальнойСмете,
	               |	ВТ_РазделЛокальнойСметы.ПринадлежитРазделу,
	               |	ЛОЖЬ,
	               |	NULL,
	               |	NULL,
	               |	ВТ_РазделЛокальнойСметы.СодержитРесурсы,
	               |	ВТ_РазделЛокальнойСметы.СодержитПоправки,
	               |	ВТ_РазделЛокальнойСметы.СодержитНачисления,
	               |	ВТ_РазделЛокальнойСметы.СодержитИндексы,
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТ_РазделЛокальнойСметы КАК ВТ_РазделЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_ИтогиПоРазделу КАК ИтогиПоРазделу
	               |		ПО ВТ_РазделЛокальнойСметы.Ссылка = ИтогиПоРазделу.Раздел
	               |			И ВТ_РазделЛокальнойСметы.ИДСметы = ИтогиПоРазделу.Смета
	               |			И (ИтогиПоРазделу.Итог = &ИтогРаздела)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |			ТОГДА 2
	               |		ИНАЧЕ 3
	               |	КОНЕЦ,
	               |	ЛОЖЬ,
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	ВТ_ПозицияЛокальнойСметы.ИДРодителя,
	               |	ВТ_ПозицияЛокальнойСметы.Наименование,
	               |	ВТ_ПозицияЛокальнойСметы.ШифрРасценки,
	               |	ВТ_ПозицияЛокальнойСметы.ИД,
	               |	ВТ_ПозицияЛокальнойСметы.ИДСметы,
	               |	ВТ_ПозицияЛокальнойСметы.НомерВДереве,
	               |	ВТ_ПозицияЛокальнойСметы.ПорНомер,
	               |	ВТ_ПозицияЛокальнойСметы.НомерВПределахСметы,
	               |	ВТ_ПозицияЛокальнойСметы.Номер,
	               |	ВТ_ПозицияЛокальнойСметы.Расчет,
	               |	ВТ_ПозицияЛокальнойСметы.Версия,
	               |	ВТ_ПозицияЛокальнойСметы.ОбъемРабот,
	               |	ВТ_ПозицияЛокальнойСметы.Измеритель,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(РегРес.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0) + ЕСТЬNULL(РегРес.ТекСтоимОборуд, 0)
	               |					ИНАЧЕ ЕСТЬNULL(Рег.СтоимОснЗарплата, 0) + ЕСТЬNULL(Рег.СтоимЭксплМашин, 0) + ЕСТЬNULL(Рег.СтоимСтоимМатер, 0) + ЕСТЬNULL(Рег.СтоимОборуд, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |								ТОГДА ЕСТЬNULL(РегРес.ТекСтоимОборуд, 0)
	               |							ИНАЧЕ ЕСТЬNULL(Рег.СтоимОборуд, 0)
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |							ТОГДА ВЫБОР
	               |									КОГДА ВТ_ПозицияЛокальнойСметы.ПрямЗатраты <> 0
	               |											И ЕСТЬNULL(РегРес.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0) = 0
	               |										ТОГДА ВТ_ПозицияЛокальнойСметы.ПрямЗатраты
	               |									ИНАЧЕ ЕСТЬNULL(РегРес.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0)
	               |								КОНЕЦ
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ВТ_ПозицияЛокальнойСметы.ПрямЗатраты <> 0
	               |										И ЕСТЬNULL(Рег.СтоимОснЗарплата, 0) + ЕСТЬNULL(Рег.СтоимЭксплМашин, 0) + ЕСТЬNULL(Рег.СтоимСтоимМатер, 0) = 0
	               |									ТОГДА ВТ_ПозицияЛокальнойСметы.ПрямЗатраты
	               |								ИНАЧЕ ЕСТЬNULL(Рег.СтоимОснЗарплата, 0) + ЕСТЬNULL(Рег.СтоимЭксплМашин, 0) + ЕСТЬNULL(Рег.СтоимСтоимМатер, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(РегРес.ТекСтоимОснЗарплата, 0)
	               |				ИНАЧЕ ЕСТЬNULL(Рег.СтоимОснЗарплата, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0)
	               |					ИНАЧЕ ЕСТЬNULL(Рег.СтоимЭксплМашин, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(РегРес.ТекСтоимЭксплМашин, 0)
	               |				ИНАЧЕ ЕСТЬNULL(Рег.СтоимЭксплМашин, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВТ_ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(РегРес.ТекСтоимЗарплМашин, 0)
	               |				ИНАЧЕ ЕСТЬNULL(Рег.СтоимЗарплМашин, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0)
	               |					ИНАЧЕ ЕСТЬNULL(Рег.СтоимСтоимМатер, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(РегРес.ТекСтоимСтоимМатер, 0)
	               |				ИНАЧЕ ЕСТЬNULL(Рег.СтоимСтоимМатер, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА ЕСТЬNULL(РегРес.ЗатратыТрудаРабочих, 0)
	               |		ИНАЧЕ ЕСТЬNULL(Рег.ЗатратыТрудаРабочих, 0)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА ЕСТЬNULL(РегРес.ЗатратыТрудаМашин, 0)
	               |		ИНАЧЕ ЕСТЬNULL(Рег.ЗатратыТрудаМашин, 0)
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметы.ПрямЗатраты,
	               |	ВТ_ПозицияЛокальнойСметы.ОснЗарплата,
	               |	ВТ_ПозицияЛокальнойСметы.ЭксплМашин,
	               |	ВТ_ПозицияЛокальнойСметы.ЗарплМашинистов,
	               |	ВТ_ПозицияЛокальнойСметы.СтоимМатериалов,
	               |	ВТ_ПозицияЛокальнойСметы.ЗатратыТрудаРабочих,
	               |	ВТ_ПозицияЛокальнойСметы.ЗатратыТрудаМашинистов,
	               |	ВТ_ПозицияЛокальнойСметы.ОтмеченаВДереве,
	               |	ИСТИНА,
	               |	ВТ_ПозицияЛокальнойСметы.ПринадлежитСводнойСмете,
	               |	ВТ_ПозицияЛокальнойСметы.ПринадлежитОбъектнойСмете,
	               |	ВТ_ПозицияЛокальнойСметы.ПринадлежитЛокальнойСмете,
	               |	ВТ_ПозицияЛокальнойСметы.ПринадлежитРазделу,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Количество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Количество > 0
	               |			ТОГДА NULL
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |					ТОГДА NULL
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Владелец ЕСТЬ NULL 
	               |							ТОГДА 0
	               |						ИНАЧЕ 1
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.РесурсыКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.ПоправкиКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.НачисленияКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.ИндексыКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ОбъемВсего = 0
	               |			ТОГДА 0
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ОбъемВсего < ВТ_ПозицияЛокальнойСметы.ОбъемРабот
	               |			ТОГДА ВЫБОР
	               |					КОГДА &РазрешитьРедактирование
	               |						ТОГДА 1
	               |					ИНАЧЕ 2
	               |				КОНЕЦ
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ОбъемВсего >= ВТ_ПозицияЛокальнойСметы.ОбъемРабот
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметы.ОбъемВсего
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметы КАК ВТ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК Рег
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = Рег.Позиция
	               |			И ВТ_ПозицияЛокальнойСметы.ИДРодителя = Рег.Раздел
	               |			И ВТ_ПозицияЛокальнойСметы.ИДСметы = Рег.Смета
	               |			И (ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета <> ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК РегРес
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = РегРес.Позиция
	               |			И ВТ_ПозицияЛокальнойСметы.ИДРодителя = РегРес.Раздел
	               |			И ВТ_ПозицияЛокальнойСметы.ИДСметы = РегРес.Смета
	               |			И (ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный))
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Ссылка
	               |			И ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Владелец
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество КАК ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.Ссылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерВДереве,
	               |	НомерПорядковый";
		
	Возврат ТекстЗапроса;
	
КонецФункции

//	Функция возвращает запрос на формирование дерева смет.
//
// Параметры:
//
// Возвращаемое значение:
//     Строка с текстом запроса на формирование таблицы для дерева разделов и позиций.
//
Функция ПолучитьТекстЗапросаНаДеревоСметОбъектнаяСмета()
	                                                                                                              
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_АктВыполненныхРабот.Ссылка,
	               |	СМ_АктВыполненныхРабот.ЛокальнаяСмета
	               |ПОМЕСТИТЬ ВТ_АктВыполненныхРабот
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот КАК СМ_АктВыполненныхРабот
	               |ГДЕ
	               |	НЕ СМ_АктВыполненныхРабот.ПометкаУдаления
	               |	И СМ_АктВыполненныхРабот.ЛокальнаяСмета.ИДРодителя = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СМ_АктВыполненныхРаботПозиции.Позиция,
	               |	СУММА(СМ_АктВыполненныхРаботПозиции.ФактОбъем) КАК Всего
	               |ПОМЕСТИТЬ ВТ_ПозицииАктов
	               |ИЗ
	               |	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_АктВыполненныхРаботПозиции
	               |ГДЕ
	               |	СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета.ИДРодителя = &Ссылка
	               |	И СМ_АктВыполненныхРаботПозиции.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СМ_АктВыполненныхРаботПозиции.Позиция
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_ОбъектнаяСмета.Ссылка,
	               |	СМ_ОбъектнаяСмета.Наименование,
	               |	СМ_ОбъектнаяСмета.ИД,
	               |	СМ_ОбъектнаяСмета.ИДРодителя,
	               |	ИСТИНА КАК ЭтоКорневойЭлемент,
	               |	СМ_ОбъектнаяСмета.НомерСметы КАК НомерДокумента,
	               |	0 КАК НомерПорядковый,
	               |	0 КАК НомерВПределахСметы,
	               |	0 КАК НомерВДереве,
	               |	ЛОЖЬ КАК ОтмеченаВДереве,
	               |	4 КАК ТипСтроки
	               |ПОМЕСТИТЬ ВТ_ОбъектнаяСмета
	               |ИЗ
	               |	Документ.СМ_ОбъектнаяСмета КАК СМ_ОбъектнаяСмета
	               |ГДЕ
	               |	СМ_ОбъектнаяСмета.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.Ссылка КАК Ссылка,
	               |	СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.Наименование КАК Наименование,
	               |	СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ИД КАК ИД,
	               |	СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.ИДРодителя КАК ИДРодителя,
	               |	СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета.НомерСметы КАК НомерСметы,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве КАК НомерВДереве,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы КАК НомерВПределахСметы,
	               |	СМ_ОбъектнаяСметаЛокальныеСметы.НомерСтроки КАК ПорНомер
	               |ПОМЕСТИТЬ ВТ_ЛокальнаяСмета
	               |ИЗ
	               |	ВТ_ОбъектнаяСмета КАК ВТ_ОбъектнаяСмета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |				И (СМ_НумерацияПозицийЛокальныхСмет.Раздел = ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка))
	               |				И (СМ_НумерацияПозицийЛокальныхСмет.Позиция = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка))
	               |		ПО ВТ_ОбъектнаяСмета.Ссылка = СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ЛокальнаяСмета.Ссылка,
	               |	ВТ_ЛокальнаяСмета.Наименование,
	               |	ВТ_ЛокальнаяСмета.ИД,
	               |	ВТ_ЛокальнаяСмета.ИДРодителя,
	               |	СУММА(ВЫБОР
	               |			КОГДА ВТ_АктВыполненныхРабот.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК КоличествоАктов,
	               |	ВТ_ЛокальнаяСмета.ПорНомер КАК НомерПорядковый,
	               |	ВТ_ЛокальнаяСмета.НомерВДереве,
	               |	ВТ_ЛокальнаяСмета.НомерВПределахСметы,
	               |	ВТ_ЛокальнаяСмета.НомерСметы КАК НомерДокумента
	               |ПОМЕСТИТЬ ВТ_ЛокальнаяСметаКоличествоАктов
	               |ИЗ
	               |	ВТ_ЛокальнаяСмета КАК ВТ_ЛокальнаяСмета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АктВыполненныхРабот КАК ВТ_АктВыполненныхРабот
	               |		ПО ВТ_ЛокальнаяСмета.Ссылка = ВТ_АктВыполненныхРабот.ЛокальнаяСмета
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |		ПО ВТ_ЛокальнаяСмета.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |			И (НЕ СМ_НумерацияПозицийЛокальныхСмет.Раздел = ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка))
	               |			И (НЕ СМ_НумерацияПозицийЛокальныхСмет.Позиция = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка))
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ЛокальнаяСмета.ИДРодителя,
	               |	ВТ_ЛокальнаяСмета.Наименование,
	               |	ВТ_ЛокальнаяСмета.Ссылка,
	               |	ВТ_ЛокальнаяСмета.ИД,
	               |	ВТ_ЛокальнаяСмета.НомерСметы,
	               |	ВТ_ЛокальнаяСмета.ПорНомер,
	               |	ВТ_ЛокальнаяСмета.НомерВДереве,
	               |	ВТ_ЛокальнаяСмета.НомерВПределахСметы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_РазделЛокальнойСметы.Ссылка,
	               |	СМ_РазделЛокальнойСметы.НаименованиеДляПечати,
	               |	СМ_РазделЛокальнойСметы.Номер КАК НомерДокумента,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	               |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер КАК НомерПорядковый,
	               |	СМ_РазделЛокальнойСметы.ИД,
	               |	СМ_РазделЛокальнойСметы.ИДРодителя,
	               |	СМ_РазделЛокальнойСметы.ИДСметы,
	               |	СМ_РазделЛокальнойСметы.Расчет,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЛокальнаяСметаКоличествоАктов.КоличествоАктов > 0
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Доступность,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_РазделЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА СМ_РазделЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ СМ_РазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя
	               |	КОНЕЦ КАК СводнаяСмета,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(СМ_РазделЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА СМ_РазделЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ОбъектнаяСмета,
	               |	2 КАК ТипСтроки
	               |ПОМЕСТИТЬ ВТ_РазделЛокальнойСметы
	               |ИЗ
	               |	ВТ_ЛокальнаяСметаКоличествоАктов КАК ВТ_ЛокальнаяСметаКоличествоАктов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО СМ_РазделЛокальнойСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Раздел
	               |				И (СМ_НумерацияПозицийЛокальныхСмет.Позиция = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка))
	               |				И СМ_РазделЛокальнойСметы.ИДСметы = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |		ПО ВТ_ЛокальнаяСметаКоличествоАктов.Ссылка = СМ_РазделЛокальнойСметы.ИДСметы
	               |ГДЕ
	               |	НЕ СМ_РазделЛокальнойСметы.Ссылка ЕСТЬ NULL 
	               |	И СМ_РазделЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПозицияЛокальнойСметы.Ссылка,
	               |	ПозицияЛокальнойСметы.Наименование,
	               |	ПозицияЛокальнойСметы.Расчет,
	               |	ПозицияЛокальнойСметы.ИД,
	               |	ПозицияЛокальнойСметы.ИДРодителя,
	               |	ПозицияЛокальнойСметы.ИДСметы,
	               |	ПозицияЛокальнойСметы.ИДПозицииВладельца,
	               |	ПозицияЛокальнойСметы.Номер,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	               |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер,
	               |	ПозицияЛокальнойСметы.ОбъемРабот,
	               |	ПозицияЛокальнойСметы.ШифрРасценки,
	               |	ПозицияЛокальнойСметы.Измеритель,
	               |	ПозицияЛокальнойСметы.Определитель,
	               |	ПозицияЛокальнойСметы.НеПрименятьИндексы,
	               |	ПозицияЛокальнойСметы.ТекущаяЦена,
	               |	ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов,
	               |	ВЫБОР
	               |		КОГДА ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ПозицияЛокальнойСметы.ТекущаяЦена
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |								ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимОборуд
	               |							ИНАЧЕ ПозицияЛокальнойСметы.Оборудование
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |							ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимПрямЗатраты
	               |						ИНАЧЕ ПозицияЛокальнойСметы.ПрямЗатраты
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ПрямЗатраты,
	               |	ВЫБОР
	               |		КОГДА ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимОснЗарплата
	               |				ИНАЧЕ ПозицияЛокальнойСметы.ОснЗарплата
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ОснЗарплата,
	               |	ВЫБОР
	               |		КОГДА ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПозицияЛокальнойСметы.Определитель.ВидРасценки <> ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |							И ПозицияЛокальнойСметы.Определитель.ВидРасценки <> ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Материал)
	               |						ТОГДА ПозицияЛокальнойСметы.ТекущаяЦена
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимЭксплМашин
	               |				ИНАЧЕ ПозицияЛокальнойСметы.ЭксплМашин
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ЭксплМашин,
	               |	ВЫБОР
	               |		КОГДА ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимЗарплМашин
	               |				ИНАЧЕ ПозицияЛокальнойСметы.ЗарплМашинистов
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ЗарплМашинистов,
	               |	ВЫБОР
	               |		КОГДА ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Материал)
	               |						ТОГДА ПозицияЛокальнойСметы.ТекущаяЦена
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА РесурснаяСтоимостьПозиции.ТекСтоимСтоимМатер
	               |				ИНАЧЕ ПозицияЛокальнойСметы.СтоимМатериалов
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СтоимМатериалов,
	               |	ВЫБОР
	               |		КОГДА ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА РесурснаяСтоимостьПозиции.ЗатратыТрудаРабочих
	               |		ИНАЧЕ ПозицияЛокальнойСметы.ЗатратыТрудаРабочих
	               |	КОНЕЦ КАК ЗатратыТрудаРабочих,
	               |	ВЫБОР
	               |		КОГДА ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА РесурснаяСтоимостьПозиции.ЗатратыТрудаМашин
	               |		ИНАЧЕ ПозицияЛокальнойСметы.ЗатратыТрудаМашинистов
	               |	КОНЕЦ КАК ЗатратыТрудаМашинистов,
	               |	ПозицияЛокальнойСметы.ОтмеченаВДереве,
	               |	ПозицияЛокальнойСметы.Версия,
	               |	ВЫБОР
	               |		КОГДА ВТ_ЛокальнаяСметаКоличествоАктов.КоличествоАктов > 0
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ИСТИНА
	               |	КОНЕЦ КАК Доступность,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ПозицияЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА ПозицияЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ ПозицияЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя
	               |	КОНЕЦ КАК СводнаяСмета,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ПозицияЛокальнойСметы.ИДСметы.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА ПозицияЛокальнойСметы.ИДСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ КАК ОбъектнаяСмета,
	               |	ВЫБОР
	               |		КОГДА ПозицияЛокальнойСметы.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК ТипСтроки,
	               |	ЕСТЬNULL(ВТ_ПозицииАктов.Всего, 0) КАК ОбъемВсего
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметы
	               |ИЗ
	               |	ВТ_ЛокальнаяСметаКоличествоАктов КАК ВТ_ЛокальнаяСметаКоличествоАктов
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК ПозицияЛокальнойСметы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_РесурснаяСтоимостьПозиции КАК РесурснаяСтоимостьПозиции
	               |			ПО ПозицияЛокальнойСметы.Ссылка = РесурснаяСтоимостьПозиции.Позиция
	               |				И ПозицияЛокальнойСметы.ИДСметы = РесурснаяСтоимостьПозиции.Смета
	               |				И ПозицияЛокальнойСметы.ИДРодителя = РесурснаяСтоимостьПозиции.Раздел
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО ПозицияЛокальнойСметы.ИДСметы = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |				И ПозицияЛокальнойСметы.ИДРодителя = СМ_НумерацияПозицийЛокальныхСмет.Раздел
	               |				И ПозицияЛокальнойСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Позиция
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицииАктов КАК ВТ_ПозицииАктов
	               |			ПО ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицииАктов.Позиция
	               |				И ПозицияЛокальнойСметы.ИДСметы = ВТ_ПозицииАктов.Позиция.ИДСметы
	               |		ПО ВТ_ЛокальнаяСметаКоличествоАктов.Ссылка = ПозицияЛокальнойСметы.ИДСметы
	               |ГДЕ
	               |	НЕ ПозицияЛокальнойСметы.Ссылка ЕСТЬ NULL 
	               |	И ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца КАК Владелец,
	               |	МАКСИМУМ(СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве) КАК НомерВДереве
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметы КАК ВТ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |			ПО СМ_ПозицияЛокальнойСметы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Позиция
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |ГДЕ
	               |	НЕ СМ_ПозицияЛокальнойСметы.НомерВДереве ЕСТЬ NULL 
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СМ_НумерацияПозицийЛокальныхСмет.Позиция КАК Ссылка,
	               |	ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.Ссылка КАК Владелец
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |		ПО ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.Владелец = СМ_НумерацияПозицийЛокальныхСмет.Позиция.ИДПозицииВладельца
	               |			И ВТ_ПозицияЛокальнойСметыСвязанныеПозицииНомерПоследней.НомерВДереве = СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметы.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК Количество
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметы КАК ВТ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК РесурсыКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК НачисленияКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ПоправкиКоличество,
	               |	СУММА(ВЫБОР
	               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ 1
	               |		КОНЕЦ) КАК ИндексыКоличество
	               |ПОМЕСТИТЬ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметы КАК ВТ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.РесурсыПозицииЛокальнойСметы КАК СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметыРесурсыПозицииЛокальнойСметы.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.НачисленияПозиции КАК СМ_ПозицияЛокальнойСметыНачисленияПозиции
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК СМ_ПозицияЛокальнойСметыПоправкиПозиции
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы.КоэффициентыПересчета КАК СМ_ПозицияЛокальнойСметыКоэффициентыПересчета
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	""ОБЪЕКТНАЯ СМЕТА"" КАК _ТипЗапроса,
	               |	ВТ_ОбъектнаяСмета.ЭтоКорневойЭлемент КАК ЭтоКорневойЭлемент,
	               |	ВТ_ОбъектнаяСмета.ТипСтроки КАК ТипСтроки,
	               |	ВТ_ОбъектнаяСмета.Ссылка КАК Элемент,
	               |	НЕОПРЕДЕЛЕНО КАК ЭлементРодитель,
	               |	ВТ_ОбъектнаяСмета.Наименование КАК Наименование,
	               |	ВТ_ОбъектнаяСмета.ИД КАК ИД,
	               |	ВТ_ОбъектнаяСмета.ИДРодителя КАК ПринадлежитСводнойСмете,
	               |	ВТ_ОбъектнаяСмета.Ссылка КАК ПринадлежитОбъектнойСмете,
	               |	ЗНАЧЕНИЕ(Документ.СМ_ЛокальнаяСмета.ПустаяСсылка) КАК ПринадлежитЛокальнойСмете,
	               |	ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка) КАК ПринадлежитРазделу,
	               |	ИСТИНА КАК Расчет,
	               |	ВТ_ОбъектнаяСмета.НомерДокумента КАК НомерДокумента,
	               |	ВТ_ОбъектнаяСмета.НомерПорядковый КАК НомерПорядковый,
	               |	ВТ_ОбъектнаяСмета.НомерВДереве КАК НомерВДереве,
	               |	ВТ_ОбъектнаяСмета.НомерВПределахСметы КАК НомерВПределахСметы,
	               |	NULL КАК Шифр,
	               |	NULL КАК Объем,
	               |	NULL КАК Версия,
	               |	NULL КАК Измеритель,
	               |	NULL КАК ОбщВсего,
	               |	NULL КАК ОснЗарплата,
	               |	NULL КАК ЭксплМашин,
	               |	NULL КАК ЗарплМашин,
	               |	NULL КАК СтоимМатер,
	               |	NULL КАК ЗатратыТрудаРабочих,
	               |	NULL КАК ЗатратыТрудаМашин,
	               |	NULL КАК ЕдВсего,
	               |	NULL КАК ЕдОснЗП,
	               |	NULL КАК ЕдЭксплМашин,
	               |	NULL КАК ЕдЭМЗарПлата,
	               |	NULL КАК ЕдСтоимостьМатериалов,
	               |	NULL КАК ЕдЗатрТрРаб,
	               |	NULL КАК ЕдЗатрТрМех,
	               |	ВТ_ОбъектнаяСмета.ОтмеченаВДереве КАК ОтмеченаВДереве,
	               |	ИСТИНА КАК Доступность,
	               |	ЛОЖЬ КАК СодержитРесурсы,
	               |	ЛОЖЬ КАК СодержитПоправки,
	               |	ЛОЖЬ КАК СодержитНачисления,
	               |	ЛОЖЬ КАК СодержитИндексы,
	               |	ЛОЖЬ КАК Связанная,
	               |	NULL КАК СвязаннаяКартинка,
	               |	NULL КАК СвязаннаяВладелец,
	               |	0 КАК СтатусРедактирования,
	               |	0 КАК ОбъемВсего
	               |ИЗ
	               |	ВТ_ОбъектнаяСмета КАК ВТ_ОбъектнаяСмета
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ЛОКАЛЬНАЯ СМЕТА"",
	               |	ЛОЖЬ,
	               |	ВЗ_ЛокальнаяСмета.ТипСтроки,
	               |	ВЗ_ЛокальнаяСмета.Ссылка,
	               |	ВЗ_ЛокальнаяСмета.ИДРодителя,
	               |	ВЗ_ЛокальнаяСмета.Наименование,
	               |	ВЗ_ЛокальнаяСмета.ИД,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВЗ_ЛокальнаяСмета.ИДРодителя) = ТИП(Документ.СМ_СводнаяСмета)
	               |			ТОГДА ВЗ_ЛокальнаяСмета.ИДРодителя
	               |		ИНАЧЕ ВЗ_ЛокальнаяСмета.ИДРодителя.ИДРодителя
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВЗ_ЛокальнаяСмета.ИДРодителя) = ТИП(Документ.СМ_ОбъектнаяСмета)
	               |			ТОГДА ВЗ_ЛокальнаяСмета.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ЗНАЧЕНИЕ(Документ.СМ_ЛокальнаяСмета.ПустаяСсылка),
	               |	ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка),
	               |	ИСТИНА,
	               |	ВЗ_ЛокальнаяСмета.НомерДокумента,
	               |	ВЗ_ЛокальнаяСмета.НомерПорядковый,
	               |	ВЗ_ЛокальнаяСмета.НомерВДереве,
	               |	ВЗ_ЛокальнаяСмета.НомерВПределахСметы,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	ВЗ_ЛокальнаяСмета.ОбщВсего,
	               |	ВЗ_ЛокальнаяСмета.ОснЗарплата,
	               |	ВЗ_ЛокальнаяСмета.ЭксплМашин,
	               |	ВЗ_ЛокальнаяСмета.ЗарплМашин,
	               |	ВЗ_ЛокальнаяСмета.СтоимМатер,
	               |	ВЗ_ЛокальнаяСмета.ЗатратыТрудаРабочих,
	               |	ВЗ_ЛокальнаяСмета.ЗатратыТрудаМашин,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА ИСТИНА
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ""ОтмеченаВДереве""
	               |	КОНЕЦ,
	               |	ВЗ_ЛокальнаяСмета.Доступность,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	NULL,
	               |	NULL,
	               |	0,
	               |	0
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекПрямЗатраты, 0)) КАК ОбщВсего,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекОснЗарплата, 0)) КАК ОснЗарплата,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекЭксплМашин, 0)) КАК ЭксплМашин,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекЗарплМашин, 0)) КАК ЗарплМашин,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ТекСтоимМатер, 0)) КАК СтоимМатер,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ЗатратыТрудаРабочих, 0)) КАК ЗатратыТрудаРабочих,
	               |		СУММА(ЕСТЬNULL(СМ_ИтогиПоГлавам.ЗатратыТрудаМашин, 0)) КАК ЗатратыТрудаМашин,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.Ссылка КАК Ссылка,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.Наименование КАК Наименование,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.ИД КАК ИД,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.ИДРодителя КАК ИДРодителя,
	               |		ВЫБОР
	               |			КОГДА ВТ_ЛокальнаяСметаКоличествоАктов.КоличествоАктов > 0
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ КАК Доступность,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.НомерВДереве КАК НомерВДереве,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.НомерВПределахСметы КАК НомерВПределахСметы,
	               |		3 КАК ТипСтроки,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.НомерПорядковый КАК НомерПорядковый,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.НомерДокумента КАК НомерДокумента
	               |	ИЗ
	               |		ВТ_ЛокальнаяСметаКоличествоАктов КАК ВТ_ЛокальнаяСметаКоличествоАктов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
	               |			ПО ВТ_ЛокальнаяСметаКоличествоАктов.Ссылка = СМ_ИтогиПоГлавам.Смета
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.Ссылка,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.Наименование,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.ИД,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.ИДРодителя,
	               |		ВЫБОР
	               |			КОГДА ВТ_ЛокальнаяСметаКоличествоАктов.КоличествоАктов > 0
	               |				ТОГДА ЛОЖЬ
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.НомерВДереве,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.НомерВПределахСметы,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.НомерПорядковый,
	               |		ВТ_ЛокальнаяСметаКоличествоАктов.НомерДокумента) КАК ВЗ_ЛокальнаяСмета
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""РАЗДЕЛ"",
	               |	ЛОЖЬ,
	               |	ВТ_РазделЛокальнойСметы.ТипСтроки,
	               |	ВТ_РазделЛокальнойСметы.Ссылка,
	               |	ВТ_РазделЛокальнойСметы.ИДРодителя,
	               |	ВТ_РазделЛокальнойСметы.НаименованиеДляПечати,
	               |	ВТ_РазделЛокальнойСметы.ИД,
	               |	ВТ_РазделЛокальнойСметы.СводнаяСмета,
	               |	ВТ_РазделЛокальнойСметы.ОбъектнаяСмета,
	               |	ВТ_РазделЛокальнойСметы.ИДСметы,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_РазделЛокальнойСметы.ИДРодителя) = ТИП(Документ.СМ_РазделЛокальнойСметы)
	               |			ТОГДА ВТ_РазделЛокальнойСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВТ_РазделЛокальнойСметы.Расчет,
	               |	ВТ_РазделЛокальнойСметы.НомерДокумента,
	               |	ВТ_РазделЛокальнойСметы.НомерПорядковый,
	               |	ВТ_РазделЛокальнойСметы.НомерВДереве,
	               |	ВТ_РазделЛокальнойСметы.НомерВПределахСметы,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	NULL,
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекОснЗарплата, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекЭксплМашин, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекСтоимМатер, 0) + ЕСТЬNULL(ИтогиПоРазделу.ТекОборуд, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекОснЗарплата, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекЭксплМашин, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекЗарплМашин, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ТекСтоимМатер, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ЗатратыТрудаРабочих, 0),
	               |	ЕСТЬNULL(ИтогиПоРазделу.ЗатратыТрудаМашин, 0),
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА ИСТИНА
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ""ОтмеченаВДереве""
	               |	КОНЕЦ,
	               |	ВТ_РазделЛокальнойСметы.Доступность,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	ЛОЖЬ,
	               |	NULL,
	               |	NULL,
	               |	0,
	               |	0
	               |ИЗ
	               |	ВТ_РазделЛокальнойСметы КАК ВТ_РазделЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_ИтогиПоРазделу КАК ИтогиПоРазделу
	               |		ПО ВТ_РазделЛокальнойСметы.Ссылка = ИтогиПоРазделу.Раздел
	               |			И ВТ_РазделЛокальнойСметы.ИДСметы = ИтогиПоРазделу.Смета
	               |			И (ИтогиПоРазделу.Итог = &ИтогРаздела)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""ПОЗИЦИЯ"",
	               |	ЛОЖЬ,
	               |	ВТ_ПозицияЛокальнойСметы.ТипСтроки,
	               |	ВТ_ПозицияЛокальнойСметы.Ссылка,
	               |	ВТ_ПозицияЛокальнойСметы.ИДРодителя,
	               |	ВТ_ПозицияЛокальнойСметы.Наименование,
	               |	ВТ_ПозицияЛокальнойСметы.ИД,
	               |	ВТ_ПозицияЛокальнойСметы.СводнаяСмета,
	               |	ВТ_ПозицияЛокальнойСметы.ОбъектнаяСмета,
	               |	ВТ_ПозицияЛокальнойСметы.ИДСметы,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(ВТ_ПозицияЛокальнойСметы.ИДРодителя) = ТИП(Документ.СМ_РазделЛокальнойСметы)
	               |			ТОГДА ВТ_ПозицияЛокальнойСметы.ИДРодителя
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметы.Расчет,
	               |	ВТ_ПозицияЛокальнойСметы.Номер,
	               |	ВТ_ПозицияЛокальнойСметы.ПорНомер,
	               |	ВТ_ПозицияЛокальнойСметы.НомерВДереве,
	               |	ВТ_ПозицияЛокальнойСметы.НомерВПределахСметы,
	               |	ВТ_ПозицияЛокальнойСметы.ШифрРасценки,
	               |	ВТ_ПозицияЛокальнойСметы.ОбъемРабот,
	               |	ВТ_ПозицияЛокальнойСметы.Версия,
	               |	ВТ_ПозицияЛокальнойСметы.Измеритель,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер, 0) + ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОборуд, 0)
	               |					ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата, 0) + ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин, 0) + ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер, 0) + ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |								ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОборуд, 0)
	               |							ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд, 0)
	               |						КОНЕЦ
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |							ТОГДА ВЫБОР
	               |									КОГДА ВТ_ПозицияЛокальнойСметы.ПрямЗатраты <> 0
	               |											И ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер, 0) = 0
	               |										ТОГДА ВТ_ПозицияЛокальнойСметы.ПрямЗатраты
	               |									ИНАЧЕ ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата, 0) + ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин, 0) + ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер, 0)
	               |								КОНЕЦ
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ВТ_ПозицияЛокальнойСметы.ПрямЗатраты <> 0
	               |										И ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата, 0) + ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин, 0) + ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер, 0) = 0
	               |									ТОГДА ВТ_ПозицияЛокальнойСметы.ПрямЗатраты
	               |								ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата, 0) + ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин, 0) + ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер, 0)
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА 0
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата, 0)
	               |				ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин, 0)
	               |					ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин, 0)
	               |				ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВТ_ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЗарплМашин, 0)
	               |				ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.НеПрименятьИндексы
	               |			ТОГДА ВЫБОР
	               |					КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |						ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер, 0)
	               |					ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер, 0)
	               |				КОНЕЦ
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |					ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер, 0)
	               |				ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер, 0)
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаРабочих, 0)
	               |		ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаРабочих, 0)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ИДСметы.МетодРасчета = ЗНАЧЕНИЕ(Перечисление.СМ_МетодыРасчетаЛС.Ресурсный)
	               |			ТОГДА ЕСТЬNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаМашин, 0)
	               |		ИНАЧЕ ЕСТЬNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаМашин, 0)
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметы.ПрямЗатраты,
	               |	ВТ_ПозицияЛокальнойСметы.ОснЗарплата,
	               |	ВТ_ПозицияЛокальнойСметы.ЭксплМашин,
	               |	ВТ_ПозицияЛокальнойСметы.ЗарплМашинистов,
	               |	ВТ_ПозицияЛокальнойСметы.СтоимМатериалов,
	               |	ВТ_ПозицияЛокальнойСметы.ЗатратыТрудаРабочих,
	               |	ВТ_ПозицияЛокальнойСметы.ЗатратыТрудаМашинистов,
	               |	ВТ_ПозицияЛокальнойСметы.ОтмеченаВДереве,
	               |	ВТ_ПозицияЛокальнойСметы.Доступность,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.РесурсыКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВТ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Материал)
	               |				ИЛИ ВТ_ПозицияЛокальнойСметы.Определитель.ВидРасценки = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыРасценки.Оборудование)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.ПоправкиКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.НачисленияКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.ИндексыКоличество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Количество > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Количество > 0
	               |			ТОГДА NULL
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |					ТОГДА NULL
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Владелец ЕСТЬ NULL 
	               |							ТОГДА 0
	               |						ИНАЧЕ 1
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца,
	               |	ВЫБОР
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ОбъемВсего = 0
	               |			ТОГДА 0
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ОбъемВсего < ВТ_ПозицияЛокальнойСметы.ОбъемРабот
	               |			ТОГДА ВЫБОР
	               |					КОГДА &РазрешитьРедактирование
	               |						ТОГДА 1
	               |					ИНАЧЕ 2
	               |				КОНЕЦ
	               |		КОГДА ВТ_ПозицияЛокальнойСметы.ОбъемВсего >= ВТ_ПозицияЛокальнойСметы.ОбъемРабот
	               |			ТОГДА 2
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВТ_ПозицияЛокальнойСметы.ОбъемВсего
	               |ИЗ
	               |	ВТ_ПозицияЛокальнойСметы КАК ВТ_ПозицияЛокальнойСметы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция
	               |			И ВТ_ПозицияЛокальнойСметы.ИДСметы = СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета
	               |			И ВТ_ПозицияЛокальнойСметы.ИДРодителя = СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция
	               |			И ВТ_ПозицияЛокальнойСметы.ИДСметы = СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета
	               |			И ВТ_ПозицияЛокальнойСметы.ИДРодителя = СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество КАК ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицияЛокальнойСметыТабличныеЧастиКоличество.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииКоличество.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней КАК ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней
	               |		ПО ВТ_ПозицияЛокальнойСметы.Ссылка = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Ссылка
	               |			И ВТ_ПозицияЛокальнойСметы.ИДПозицииВладельца = ВТ_ПозицияЛокальнойСметыСвязанныеПозицииСсылкаПоследней.Владелец
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерВДереве,
	               |	НомерПорядковый";
		
	Возврат ТекстЗапроса;

КонецФункции

//	Функция возвращает запрос на формирование дерева смет.
//
// Параметры:
//
// Возвращаемое значение:
//     Строка с текстом запроса на формирование таблицы для дерева разделов и позиций.
//
Функция ПолучитьТекстЗапросаНаДеревоСметСводнаяСмета()
	
	ТекстЗапроса = "";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти //#Область Запрос/#Область ЭлементыДеревоЗначений

#Область ВспомогательныеФункции

&НаКлиенте
Процедура УстановитьПометкаНаКлиенте(СтрокаДерева, ТекущееСостояниеДерева)
	
	//
	ОтмеченнаяСтрока	= ТекущееСостояниеДерева.ОткрытыеЭлементы.СписокОтмеченных.НайтиПоЗначению(СтрокаДерева.Элемент);
	
	//
	Если НЕ ОтмеченнаяСтрока = Неопределено Тогда
		
		//
		Если ЗначениеЗаполнено(ОтмеченнаяСтрока.Представление) Тогда
			Пометка	= Число(ОтмеченнаяСтрока.Представление);	
		Иначе
			Пометка	= 0;	
		КонецЕсли;
		
		//
		СтрокаДерева.Пометка	= Пометка;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьУсловияОтбора(СсылкаНаОбъект, ПараметрыОтбора, Шифр, СтатусРедактирования = 0)
	
	//	"По умолчанию" - проходит отбор
	ОтборОпределитель				= Истина;
	ОтборВидРасценки				= Истина;
	ОтборТипНормативныхСборников	= Истина;
	ОтборНомерСборника				= Истина;
	ОтборОбработкаДемонтажа			= Истина;
	
	//	Определитель
	Если ПараметрыОтбора.Свойство("Определитель") Тогда
		ОтборОпределитель
			= СравнитьЗначениеНаСервере(СсылкаНаОбъект.Определитель, ПараметрыОтбора["Определитель"]["ВидСравнения"], ПараметрыОтбора["Определитель"]["Значение"]);
	КонецЕсли;
		
	//	Вид расценки
	Если ПараметрыОтбора.Свойство("ВидРасценки") Тогда
		ОтборВидРасценки
			= СравнитьЗначениеНаСервере(СсылкаНаОбъект.Определитель.ВидРасценки, ПараметрыОтбора["ВидРасценки"]["ВидСравнения"], ПараметрыОтбора["ВидРасценки"]["Значение"]);
	КонецЕсли;

	//	Тип нормативного сборника
	Если ПараметрыОтбора.Свойство("ТипНормативныхСборников") Тогда
		ОтборТипНормативныхСборников
			= СравнитьЗначениеНаСервере(СсылкаНаОбъект.ТипНормативныхСборников, ПараметрыОтбора["ТипНормативныхСборников"]["ВидСравнения"], ПараметрыОтбора["ТипНормативныхСборников"]["Значение"]);
	КонецЕсли;
	
	//	Номер сборника
	Если ПараметрыОтбора.Свойство("НомерСборника") Тогда
		НомерСборникаРасценки	= СМ_СметаВызовСервера.ОпределитьНомерСборника(СсылкаНаОбъект.ТипНормативныхСборников, Шифр);
		ОтборНомерСборника
			= СравнитьЗначениеНаСервере(НомерСборникаРасценки, ПараметрыОтбора["НомерСборника"]["ВидСравнения"], ПараметрыОтбора["НомерСборника"]["Значение"]);
	КонецЕсли;
	
	//	Демонтаж
	Если ПараметрыОтбора.Свойство("ОбработкаДемонтажа") Тогда
		ОтборОбработкаДемонтажа
			= СравнитьЗначениеНаСервере(СсылкаНаОбъект.Демонтаж, ПараметрыОтбора["ОбработкаДемонтажа"]["ВидСравнения"], ПараметрыОтбора["ОбработкаДемонтажа"]["Значение"]);
	КонецЕсли;
	
	// СтатусРедактирования
	Если ПараметрыОтбора.Свойство("СтатусРедактирования") Тогда
		ОтборОбработкаДемонтажа
		= СравнитьЗначениеНаСервере(СтатусРедактирования, ПараметрыОтбора["СтатусРедактирования"]["ВидСравнения"], ПараметрыОтбора["СтатусРедактирования"]["Значение"]);
	КонецЕсли;

	Возврат ОтборОпределитель
			И ОтборВидРасценки
			И ОтборТипНормативныхСборников
			И ОтборНомерСборника
			И ОтборОбработкаДемонтажа;	

КонецФункции //Функция ПроверитьУсловияОтбора(СтруктураПараметров, ТекЭлемент, ТекШифр)

&НаСервере
Функция СравнитьЗначениеНаСервере(ЗначениеЛевое, ВидСравнения, ЗначениеПравое)
	
	//
	Если ВРег(ВидСравнения) = ВРег("Равно") Тогда
		Возврат ЗначениеЛевое = ЗначениеПравое;	
	ИначеЕсли ВРег(ВидСравнения) = ВРег("НеРавно") Тогда
		Возврат НЕ ЗначениеЛевое = ЗначениеПравое;	
	ИначеЕсли ВРег(ВидСравнения) = ВРег("Заполнено") Тогда
		Возврат ЗначениеЗаполнено(ЗначениеЛевое);	
	ИначеЕсли ВРег(ВидСравнения) = ВРег("НеЗаполнено") Тогда
		Возврат НЕ ЗначениеЗаполнено(ЗначениеЛевое);	
	Иначе
		Возврат Ложь;	
	КонецЕсли;
		
КонецФункции //Функция СравнитьЗначениеНаСервере(ЗначениеЛевое, ВидСравнения, ЗначениеПравое)

#КонецОбласти //#Область ВспомогательныеФункции/#Область ДеревоЗначений

#КонецОбласти //#Область ЭлементыДеревоЗначений

//	Заполнение табличных частей.
#Область ТаблицыЗначений

#Область СоздатьЗаполнить

&НаСервере
Процедура СоздатьЗаполнитьТаблицыЗначенийНаСервере(ВыбранноеЗначение)
	
	//	РЕСУРСЫ
	СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(ВыбранноеЗначение);
	
	//	ПОПРАВКИ
	СоздатьЗаполнитьТаблицаЗначенийПоправкиНаСервере(ВыбранноеЗначение);
	
	//	НАЧИСЛЕНИЯ
	СоздатьЗаполнитьТаблицаЗначенийНачисленияНаСервере(ВыбранноеЗначение);
	
	//	ИНДЕКСЫ
	СоздатьЗаполнитьТаблицаЗначенийИндексыНаСервере(ВыбранноеЗначение);
	
	//	СВОЙСТВА
	СоздатьЗаполнитьТаблицаЗначенийСвойстваНаСервере(ВыбранноеЗначение);
	
КонецПроцедуры //Процедура СоздатьЗаполнитьТаблицыЗначенийНаСервере(ВыбранноеЗначение)

&НаСервере
Процедура СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Ресурсы")
	
	//
	ТаблицаЗначений		= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	СписокПозиций		= Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуСтоимостиРесурсовАкта(ВыбранноеЗначение, Ложь, СписокПозиций,, Истина, Истина);
	Иначе
		Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуСтоимостиРесурсовСметы(СписокПозиций, Ложь, Ложь, Истина,, Истина);
	КонецЕсли;
	
	//	Создать реквизиты формы.
	ПолноеНаименованиеТаблицы	= СоздатьТаблицуНаСервере(НаименованиеТаблицы, Таблица.Колонки);
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
	
КонецПроцедуры //Процедура СоздатьЗаполнитьТаблицаЗначенийРесурсыНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Ресурсы")

&НаСервере
Процедура СоздатьЗаполнитьТаблицаЗначенийПоправкиНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Поправки")
	
	//
	ТаблицаЗначений		= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	СписокПозиций		= Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуПоправокСметы(СписокПозиций);
	
	//	Создать реквизиты формы.
	ПолноеНаименованиеТаблицы	= СоздатьТаблицуНаСервере(НаименованиеТаблицы, Таблица.Колонки);
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
		
КонецПроцедуры //Процедура СоздатьЗаполнитьТаблицаЗначенийПоправкиНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Поправки")

&НаСервере
Процедура СоздатьЗаполнитьТаблицаЗначенийНачисленияНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Начисления")
	
	//
	ТаблицаЗначений				= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	СписокПозиций				= Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Таблица 					= СМ_СметаРасчетСервер.ПолучитьТаблицуНачисленийСметы(СписокПозиций);
	
	//	Создать реквизиты формы.
	ПолноеНаименованиеТаблицы	= СоздатьТаблицуНаСервере(НаименованиеТаблицы, Таблица.Колонки);
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
	
КонецПроцедуры //Процедура СоздатьЗаполнитьТаблицаЗначенийНачисленияНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Начисления")

&НаСервере
Процедура СоздатьЗаполнитьТаблицаЗначенийИндексыНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Индексы")
	
	//
	ТаблицаЗначений				= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	СписокПозиций				= Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуИндексовАкта(ВыбранноеЗначение, Ложь, СписокПозиций);
	Иначе
		Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуИндексовСметы(СписокПозиций);
	КонецЕсли;
	
	//	Создать реквизиты формы.
	ПолноеНаименованиеТаблицы	= СоздатьТаблицуНаСервере(НаименованиеТаблицы, Таблица.Колонки);
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
	
КонецПроцедуры //Процедура СоздатьЗаполнитьТаблицаЗначенийИндексыНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Индексы")

&НаСервере
Процедура СоздатьЗаполнитьТаблицаЗначенийСвойстваНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Свойства")
	
	//
	ТаблицаЗначений	= ОбрабатываемыеЭлементы.Выгрузить();
	СписокОбъектов	= Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Таблица			= ПолучитьТаблицуСвойствНаСервере(СписокОбъектов);
	
	//	Создать реквизиты формы.
	ПолноеНаименованиеТаблицы	= СоздатьТаблицуНаСервере(НаименованиеТаблицы, Таблица.Колонки);
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
	
	//
	Таблица			= ПолучитьТаблицуДополнительныхРеквизитовНаСервере();
	ПолноеНаименованиеТаблицы		= СоздатьТаблицуНаСервере("ДополнительныеРеквизиты", Таблица.Колонки);
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);

КонецПроцедуры //Процедура СоздатьЗаполнитьТаблицаЗначенийСвойстваНаСервере(ВыбранноеЗначение, НаименованиеТаблицы = "Свойства")


&НаСервере
Функция СоздатьТаблицуНаСервере(НаименованиеТаблицы = "", Колонки = Неопределено)
	
	//
	Реквизиты	= ПолучитьРеквизиты();
	
	//
	ДобавляемыеРеквизиты		= Новый Массив;
	УдаляемыеРеквизиты			= Новый Массив;
	ПолноеНаименованиеТаблицы	= ПолноеНаименованиеНаСервере("ВТ_", НаименованиеТаблицы);
	РеквизитТаблица				= Новый РеквизитФормы(ПолноеНаименованиеТаблицы, Новый ОписаниеТипов("ТаблицаЗначений"), "",  НаименованиеТаблицы, Ложь);
	
	//	Удалить реквизит формы, если уже создавали таблицу. Методов поиска и проверки, на уже созданный реквизит формы не нашел.
	Для Каждого РеквизитФормы Из Реквизиты Цикл
		Если РеквизитФормы.Имя = ПолноеНаименованиеТаблицы Тогда
			УдаляемыеРеквизиты.Добавить(ПолноеНаименованиеТаблицы);
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	
	//
	ДобавляемыеРеквизиты.Добавить(РеквизитТаблица);
	
	//	Создать реквизиты, для временной таблицы значений.
	Для Каждого Колонка Из Колонки Цикл
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, ПолноеНаименованиеТаблицы,  Колонка.Заголовок, Ложь));
	КонецЦикла;
	
	//
	ИзменитьРеквизиты(ДобавляемыеРеквизиты, УдаляемыеРеквизиты);
	
	//
	Возврат ПолноеНаименованиеТаблицы;

КонецФункции //Функция СоздатьТаблицуНаСервере(НаименованиеТаблицы = "", Колонки = Неопределено)

#КонецОбласти //#Область СоздатьЗаполнить/#Область ТаблицыЗначений

#Область Заполнить

&НаКлиенте
Процедура ОтобразитьТабличныеЧастиНаКлиенте()
	
	Если Параметры["АвтоматическиОбновлятьТабличнуюЧасть"] Тогда
	
		//	Добавить строки в отобранные "Ресурсы", "Поправки", "Начисления", "Индексы", "Свойства".
		ЗаполнитьТабличныеЧастиНаКлиенте();
		
	Иначе
		ОтобразитьИнформационноеСообщениеНаКлиенте(Истина);	
	КонецЕсли;
	
КонецПроцедуры //Процедура ОтобразитьТабличныеЧастиНаКлиенте()

&НаСервере
Процедура ЗаполнитьТаблицыЗначенийНаСервере()
	
	//	РЕСУРСЫ
	ЗаполнитьТаблицаЗначенийРесурсыНаСервере();
	
	//	ПОПРАВКИ
	ЗаполнитьТаблицаЗначенийПоправкиНаСервере();
	
	//	НАЧИСЛЕНИЯ
	ЗаполнитьТаблицаЗначенийНачисленияНаСервере();
	
	//	ИНДЕКСЫ
	ЗаполнитьТаблицаЗначенийИндексыНаСервере();
	
	//	СВОЙСТВА
	ЗаполнитьТаблицаЗначенийСвойстваНаСервере();
	
КонецПроцедуры //Процедура ЗаполнитьТаблицыЗначенийНаСервере()

//
//
&НаКлиенте
Процедура ЗаполнитьТабличныеЧастиНаКлиенте(ПараметрыКоманды = Неопределено)
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	ОбрабатываемыеДокументы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("УчастиеПометка", Истина));
	
	//	РЕСУРСЫ
	Если НЕ ОбластьОбработки = "РАСЦЕНКИ"
		И Элементы.СтраницыТабличныеЧасти.ТекущаяСтраница = Элементы.СтраницаРесурсы Тогда
		ЗаполнитьТабличнаяЧастьРесурсыНаКлиенте(ОбрабатываемыеПозиции);
	КонецЕсли;
	
	//	ПОПРАВКИ	
	Если НЕ ОбластьОбработки = "РАСЦЕНКИ"
		И Элементы.СтраницыТабличныеЧасти.ТекущаяСтраница = Элементы.СтраницаПоправки Тогда
		ЗаполнитьТабличнаяЧастьПоправкиНаКлиенте(ОбрабатываемыеПозиции);
	КонецЕсли;
	
	//	НАЧИСЛЕНИЯ
	Если НЕ ОбластьОбработки = "РАСЦЕНКИ"
		И Элементы.СтраницыТабличныеЧасти.ТекущаяСтраница = Элементы.СтраницаНачисления Тогда
		ЗаполнитьТабличнаяЧастьНачисленияНаКлиенте(ОбрабатываемыеПозиции);
	КонецЕсли;
	
	//	ИНДЕКСЫ
	Если НЕ ОбластьОбработки = "РАСЦЕНКИ"
		И Элементы.СтраницыТабличныеЧасти.ТекущаяСтраница = Элементы.СтраницаИндексы Тогда
		ЗаполнитьТабличнаяЧастьИндексыНаКлиенте(ОбрабатываемыеПозиции);
	КонецЕсли;
	
	//	СВОЙСТВА
	Если НЕ ОбластьОбработки = "РАСЦЕНКИ"
		И Элементы.СтраницыТабличныеЧасти.ТекущаяСтраница = Элементы.СтраницаСвойства Тогда
		ЗаполнитьТабличнаяЧастьСвойстваНаКлиенте(ОбрабатываемыеДокументы);
	КонецЕсли;
	
КонецПроцедуры //Процедура ЗаполнитьТабличныеЧастиНаКлиенте(ПараметрыКоманды = Неопределено)	

&НаКлиенте
Процедура ЗаполнитьТабличнаяЧастьРесурсыНаКлиенте(ОбрабатываемыеПозиции = Неопределено)
	
	//
	Если ОбрабатываемыеПозиции = Неопределено Тогда
		ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	КонецЕсли;
	
	//	Очистить табличную часть.
	ТабличнаяЧастьРесурсы.Очистить();
	
	//	Заполнить табличную часть.	
	РесурсыЗаполнитьНаКлиенте(ОбрабатываемыеПозиции);
		
	//	Вывести/скрыть сообщение о пустой табличной части.
	РесурсыОтобразитьПустуюТаблицуНаКлиенте();	
	
	//	Сортировка ДанныеФормыКоллекция
	ТабличнаяЧастьРесурсы.Сортировать("Сортировка1 Убыв, КодРесурса Возр");	
	
КонецПроцедуры //Процедура ЗаполнитьТабличнаяЧастьРесурсыНаКлиенте(СписокПозиций = Неопределено)

&НаКлиенте
Процедура ЗаполнитьТабличнаяЧастьПоправкиНаКлиенте(ОбрабатываемыеПозиции = Неопределено)
	
	//
	Если ОбрабатываемыеПозиции = Неопределено Тогда
		ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	КонецЕсли;
	
	//	Очистить табличную часть.
	ТабличнаяЧастьПоправки.Очистить();
	
	//	Заполнить табличную часть.	
	ПоправкиЗаполнитьНаКлиенте(ОбрабатываемыеПозиции);
	
	//	Вывести/скрыть сообщение о пустой табличной части.
	ПоправкиОтобразитьПустуюТаблицуНаКлиенте();
		
	//	сортировка
	ТабличнаяЧастьПоправки.Сортировать("УсловияПрименения");	
	
	//	Запомнить текущие значения в табличной части, перед изменением.
	Для Каждого Строка Из ТабличнаяЧастьПоправки Цикл
		Строка.ПрименитьСтарая 		= Строка.Применить;
		Строка.ДобавПЗСтарая 		= Строка.ДобавПЗ;
		Строка.ДобавОЗСтарая 		= Строка.ДобавОЗ;
		Строка.ДобавЭМСтарая 		= Строка.ДобавЭМ;
		Строка.ДобавЗМСтарая 		= Строка.ДобавЗМ;
		Строка.ДобавСМСтарая 		= Строка.ДобавСМ;
		Строка.ДобавТРСтарая 		= Строка.ДобавТР;
		Строка.ДобавТМСтарая 		= Строка.ДобавТ;
//		Строка.ДобавТМСтарая 		= Строка.ДобавТМ;
		Строка.КоэффПЗСтарая 		= Строка.КоэффПЗ;
		Строка.КоэффОЗСтарая 		= Строка.КоэффОЗ;
		Строка.КоэффЭМСтарая 		= Строка.КоэффЭМ;
		Строка.КоэффЗМСтарая 		= Строка.КоэффЗМ;
		Строка.КоэффСМСтарая 		= Строка.КоэффСМ;
		Строка.КоэффТРСтарая 		= Строка.КоэффТР;
		Строка.КоэффТМСтарая 		= Строка.КоэффТМ;
		Строка.ВариантРасчетаСтарая	= Строка.ВариантРасчета;
	КонецЦикла;		
	
КонецПроцедуры //Процедура ЗаполнитьТабличнаяЧастьПоправкиНаКлиенте(СписокПозиций = Неопределено)

&НаКлиенте
Процедура ЗаполнитьТабличнаяЧастьНачисленияНаКлиенте(ОбрабатываемыеПозиции = Неопределено)
	
	//
	Если ОбрабатываемыеПозиции = Неопределено Тогда
		ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	КонецЕсли;
	
	//	Очистить табличную часть.
	ТабличнаяЧастьНачисления.Очистить();
	
	//	Заполнить табличную часть.	
	НачисленияЗаполнитьНаКлиенте(ОбрабатываемыеПозиции);
	
	//	Вывести/скрыть сообщение о пустой табличной части.
	НачисленияОтобразитьПустуюТаблицуНаКлиенте();
	
	//	Запомнить текущие значения в табличной части, перед изменением.
	Для Каждого Строка Из ТабличнаяЧастьНачисления Цикл
		Строка.ЗначениеСтарая	= Строка.Значение;
		Строка.ФормулаСтарая	= Строка.Формула;
	КонецЦикла;		
	
КонецПроцедуры //Процедура ЗаполнитьТабличнаяЧастьНачисленияНаКлиенте(СписокПозиций = Неопределено)

&НаКлиенте
Процедура ЗаполнитьТабличнаяЧастьИндексыНаКлиенте(ОбрабатываемыеПозиции = Неопределено)
	
	//
	Если ОбрабатываемыеПозиции = Неопределено Тогда
		ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	КонецЕсли;
	
	//	Очистить табличную часть.
	ТабличнаяЧастьИндексы.Очистить();
	
	//
	ИндексыЗаполнитьНаКлиенте(ОбрабатываемыеПозиции);
	
	//	Вывести/скрыть сообщение о пустой табличной части.
	ИндексыОтобразитьПустуюТаблицуНаКлиенте();
	
КонецПроцедуры //Процедура ЗаполнитьТабличнаяЧастьИндексыНаКлиенте(СписокПозиций = Неопределено)

&НаКлиенте
Процедура ЗаполнитьТабличнаяЧастьСвойстваНаКлиенте(ОбрабатываемыеДокументы)
	
	//
	Если ОбрабатываемыеДокументы = Неопределено Тогда
		ОбрабатываемыеДокументы	= ОбрабатываемыеЭлементы.НайтиСтроки();
	КонецЕсли;
	
	//	Очистить табличную часть.
	ТабличнаяЧастьСвойства.Очистить();
	
	//	Заполнить табличную часть.	
	СвойстваЗаполнитьНаКлиенте(ОбрабатываемыеДокументы);
	
	//	Вывести/скрыть сообщение о пустой табличной части.
	СвойстваОтобразитьПустуюТаблицуНаКлиенте();

КонецПроцедуры //Процедура ЗаполнитьТабличнаяЧастьСвойстваНаКлиенте(ОбрабатываемыеДокументы)


&НаСервере
Процедура ЗаполнитьТаблицаЗначенийРесурсыНаСервере(НаименованиеТаблицы = "Ресурсы")
	
	//
	ПолноеНаименованиеТаблицы	= ПолноеНаименованиеНаСервере(, НаименованиеТаблицы);
	ТаблицаЗначений				= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	СписокПозиций				= Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуСтоимостиРесурсовАкта(Документ, Ложь, СписокПозиций,, Истина, Истина);
	Иначе
		Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуСтоимостиРесурсовСметы(СписокПозиций, Ложь, Ложь, Истина,, Истина);
	КонецЕсли;
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
	
КонецПроцедуры //Процедура СоздатьТаблицуЗначенийРесурсыНаСервере(НаименованиеТаблицы = "Ресурсы")

&НаСервере
Процедура ЗаполнитьТаблицаЗначенийПоправкиНаСервере(НаименованиеТаблицы = "Поправки")
	
	//
	ПолноеНаименованиеТаблицы	= ПолноеНаименованиеНаСервере(, НаименованиеТаблицы);
	ТаблицаЗначений				= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	СписокПозиций				= Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуПоправокСметы(СписокПозиций);
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
		
КонецПроцедуры //Процедура ЗаполнитьТаблицаЗначенийПоправкиНаСервере(НаименованиеТаблицы = "Поправки")

&НаСервере
Процедура ЗаполнитьТаблицаЗначенийНачисленияНаСервере(НаименованиеТаблицы = "Начисления")
	
	//
	ПолноеНаименованиеТаблицы	= ПолноеНаименованиеНаСервере(, НаименованиеТаблицы);
	ТаблицаЗначений				= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	СписокПозиций				= Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Таблица 					= СМ_СметаРасчетСервер.ПолучитьТаблицуНачисленийСметы(СписокПозиций);
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
	
КонецПроцедуры //Процедура ЗаполнитьТаблицаЗначенийНачисленияНаСервере(НаименованиеТаблицы = "Начисления")

&НаСервере
Процедура ЗаполнитьТаблицаЗначенийИндексыНаСервере(НаименованиеТаблицы = "Индексы")
	
	//
	ПолноеНаименованиеТаблицы	= ПолноеНаименованиеНаСервере(, НаименованиеТаблицы);
	ТаблицаЗначений				= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	СписокПозиций				= Новый СписокЗначений;
	СписокПозиций.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуИндексовАкта(Документ, Ложь, СписокПозиций);
	Иначе
		Таблица 	= СМ_СметаРасчетСервер.ПолучитьТаблицуИндексовСметы(СписокПозиций);
	КонецЕсли;
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
	
КонецПроцедуры //Процедура ЗаполнитьТаблицаЗначенийИндексыНаСервере(НаименованиеТаблицы = "Индексы")

&НаСервере
Процедура ЗаполнитьТаблицаЗначенийСвойстваНаСервере(НаименованиеТаблицы = "Свойства")
	
	//
	ПолноеНаименованиеТаблицы	= ПолноеНаименованиеНаСервере(, НаименованиеТаблицы);
	ТаблицаЗначений	= ОбрабатываемыеЭлементы.Выгрузить();
	СписокОбъектов	= Новый СписокЗначений;
	СписокОбъектов.ЗагрузитьЗначения(ТаблицаЗначений.ВыгрузитьКолонку("СсылкаНаОбъект"));
	
	//	Получить общую табличную часть.	
	Таблица			= ПолучитьТаблицуСвойствНаСервере(СписокОбъектов);
	
	//	Заполнить временную таблицу значений.
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);
	
	//
	Таблица			= ПолучитьТаблицуДополнительныхРеквизитовНаСервере();
	ПолноеНаименованиеТаблицы		= СоздатьТаблицуНаСервере("ДополнительныеРеквизиты", Таблица.Колонки);
	ЭтаФорма[ПолноеНаименованиеТаблицы].Загрузить(Таблица);

КонецПроцедуры //Процедура ЗаполнитьТаблицаЗначенийСвойстваНаСервере(НаименованиеТаблицы = "Свойства")

#КонецОбласти //#Область Заполнить/#Область ТаблицыЗначений


#Область ВспомогательныеФункции

//
//
&НаКлиенте
Функция РесурсыЗаполнитьНаКлиенте(ОбрабатываемыеПозиции = Неопределено) Экспорт
	
	//
	Если ОбрабатываемыеПозиции = Неопределено Тогда
		ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	КонецЕсли;
	
	//	Группируемые колонки.
	ГруппируемыеКолонки	= Новый Массив;
	ГруппируемыеКолонки.Добавить("НеИзменятьЦены");
	ГруппируемыеКолонки.Добавить("Ресурс");
	ГруппируемыеКолонки.Добавить("Картинка");
	ГруппируемыеКолонки.Добавить("КодРесурса");
	ГруппируемыеКолонки.Добавить("ВидРесурса");
	ГруппируемыеКолонки.Добавить("НаименованиеРесурса");
	ГруппируемыеКолонки.Добавить("ЕдиницаИзмеренияРесурса");
	ГруппируемыеКолонки.Добавить("ЭтоУчтенный");
	ГруппируемыеКолонки.Добавить("ЭтоНеучтенный");
	ГруппируемыеКолонки.Добавить("ЭтоОборудование");
	ГруппируемыеКолонки.Добавить("ЦенаБазисная");
	ГруппируемыеКолонки.Добавить("ЦенаЗМБазисная");
	ГруппируемыеКолонки.Добавить("ЦенаТекущая");
	ГруппируемыеКолонки.Добавить("ЦенаТекущаяЗМ");
		
	//	Суммируемые колонки.
	СуммируемыеКолонки	= Новый Структура;
	СуммируемыеКолонки.Вставить("Количество"			, Новый Структура("Функция, ЗначениеНеравенства", "СУММА", "разн. знч."));
	СуммируемыеКолонки.Вставить("РасходПоНорме"			, Новый Структура("Функция, ЗначениеНеравенства", "СУММА", "разн. знч."));
	СуммируемыеКолонки.Вставить("РасходПоФакту"			, Новый Структура("Функция, ЗначениеНеравенства", "СУММА", "разн. знч."));
	СуммируемыеКолонки.Вставить("СтоимостьБазисная"		, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("СтоимостьЗМБазисная"	, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("СтоимостьТекущая"		, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("СтоимостьТекущаяЗМ"	, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	
	//
	СформироватьСводнуюТаблицуНаКлиенте(ОбрабатываемыеПозиции, "Ресурсы", ГруппируемыеКолонки, СуммируемыеКолонки);
		
КонецФункции //Функция РесурсыЗаполнитьНаКлиенте(ОбрабатываемыеПозиции = Неопределено) Экспорт

//
//
&НаКлиенте
Функция ПоправкиЗаполнитьНаКлиенте(ОбрабатываемыеПозиции) Экспорт
	
	//
	Если ОбрабатываемыеПозиции = Неопределено Тогда
		ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	КонецЕсли;
	
	//	Группируемые колонки.
	ГруппируемыеКолонки	= Новый Массив;
	ГруппируемыеКолонки.Добавить("УсловияПрименения");
	ГруппируемыеКолонки.Добавить("Обоснование");
	ГруппируемыеКолонки.Добавить("ВариантРасчета");
			
	//	Суммируемые колонки.
	СуммируемыеКолонки	= Новый Структура;
	СуммируемыеКолонки.Вставить("КоэффПЗ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("КоэффОЗ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("КоэффЭМ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("КоэффЗМ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("КоэффСМ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("КоэффТР", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("КоэффТМ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
		
	СуммируемыеКолонки.Вставить("ДобавПЗ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("ДобавОЗ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("ДобавЭМ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("ДобавЗМ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("ДобавСМ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("ДобавТР", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	СуммируемыеКолонки.Вставить("ДобавТ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	//СуммируемыеКолонки.Вставить("ДобавТМ", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));	
	//
	СформироватьСводнуюТаблицуНаКлиенте(ОбрабатываемыеПозиции, "Поправки", ГруппируемыеКолонки, СуммируемыеКолонки);
	
КонецФункции //Функция ПоправкиЗаполнитьНаКлиенте(ОбрабатываемыеПозиции) Экспорт

//
//
&НаКлиенте
Функция НачисленияЗаполнитьНаКлиенте(ОбрабатываемыеПозиции) Экспорт
	
	//
	Если ОбрабатываемыеПозиции = Неопределено Тогда
		ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	КонецЕсли;
	
	//	Группируемые колонки.
	ГруппируемыеКолонки	= Новый Массив;
	ГруппируемыеКолонки.Добавить("ЧисловойПараметр");
	ГруппируемыеКолонки.Добавить("ЧисловойПараметрТипЗначения");
	ГруппируемыеКолонки.Добавить("ЧисловойПараметрПорядокРасчета");
	ГруппируемыеКолонки.Добавить("ЧисловойПараметрСтандартноеЗначение");
	ГруппируемыеКолонки.Добавить("Формула");
			
	//	Суммируемые колонки.
	СуммируемыеКолонки	= Новый Структура;
	СуммируемыеКолонки.Вставить("Значение", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	
	//
	СформироватьСводнуюТаблицуНаКлиенте(ОбрабатываемыеПозиции, "Начисления", ГруппируемыеКолонки, СуммируемыеКолонки);
		
КонецФункции //Функция НачисленияЗаполнитьНаКлиенте(ОбрабатываемыеПозиции) Экспорт

//
//
&НаКлиенте
Функция ИндексыЗаполнитьНаКлиенте(ОбрабатываемыеПозиции) Экспорт
	
	//
	Если ОбрабатываемыеПозиции = Неопределено Тогда
		ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы"))));
	КонецЕсли;
	
	//	Группируемые колонки.
	ГруппируемыеКолонки	= Новый Массив;
	ГруппируемыеКолонки.Добавить("ВидРабот");
	ГруппируемыеКолонки.Добавить("ВариантПересчетаЭММ");
			
	//	Суммируемые колонки.
	СуммируемыеКолонки	= Новый Структура;
	СуммируемыеКолонки.Вставить("КоэффОборуд"				, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", 0));
	СуммируемыеКолонки.Вставить("КоэффПолнСтоимРабот"		, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", 0));
	СуммируемыеКолонки.Вставить("КоэффОснЗарплаты"			, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", 0));
	СуммируемыеКолонки.Вставить("КоэффСтоимЭксплМашин"		, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", 0));
	СуммируемыеКолонки.Вставить("КоэффСтоимЗарплатеМашин"	, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", 0));
	СуммируемыеКолонки.Вставить("КоэффСтоимМатериалов"		, Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", 0));

	//
	СформироватьСводнуюТаблицуНаКлиенте(ОбрабатываемыеПозиции, "Индексы", ГруппируемыеКолонки, СуммируемыеКолонки);
	
КонецФункции //Функция ИндексыЗаполнитьНаКлиенте(ОбрабатываемыеПозиции) Экспорт

//
//
&НаКлиенте
Функция СвойстваЗаполнитьНаКлиенте(ОбрабатываемыеДокументы) Экспорт
	
	//
	Если ОбрабатываемыеДокументы = Неопределено Тогда
		ОбрабатываемыеДокументы	= ОбрабатываемыеЭлементы.НайтиСтроки();
	КонецЕсли;
	
	//	Группируемые колонки.
	ГруппируемыеКолонки	= Новый Массив;
	ГруппируемыеКолонки.Добавить("Свойство");
			
	//	Суммируемые колонки.
	СуммируемыеКолонки	= Новый Структура;
	СуммируемыеКолонки.Вставить("Значение", Новый Структура("Функция, ЗначениеНеравенства", "СРАВНЕНИЕ", "разн. знч."));
	
	//
	СформироватьТаблицуДополнительныеРеквизитыНаКлиенте("ДополнительныеРеквизиты");

	//
	СформироватьСводнуюТаблицуНаКлиенте(ОбрабатываемыеДокументы, "Свойства", ГруппируемыеКолонки, СуммируемыеКолонки);
	
КонецФункции //Функция СвойстваЗаполнитьНаКлиенте(ОбрабатываемыеДокументы) Экспорт


&НаКлиенте
Процедура СформироватьСводнуюТаблицуНаКлиенте(ОбрабатываемыеДокументы, НаименованиеТаблицы, ГруппируемыеКолонки, СуммируемыеКолонки)
	
	//
	НаименованиеВременнойТаблицы	= "ВТ_" + НаименованиеТаблицы;
	ПолноеНаименованиеТаблицы		= "ТабличнаяЧасть" + НаименованиеТаблицы;
	
	//
	СведениеТабличнойЧасти.Очистить();
	
	//	Собираем сводную таблицу. Для каждой позиции.
	Для Каждого СтрокаОписаниеДокумента Из ОбрабатываемыеДокументы Цикл
		Если СтрокаОписаниеДокумента.СтатусРедактирования = 2 Тогда
			Продолжить;
		КонецЕсли;
		НайденныеЗначенияТаблицы	= ЭтаФорма[НаименованиеВременнойТаблицы].НайтиСтроки(Новый Структура("Позиция", СтрокаОписаниеДокумента["СсылкаНаОбъект"]));
		
		//	Значения табличной части. Для конкретной позиции.
		Для Каждого Строка Из НайденныеЗначенияТаблицы Цикл
			
			//	Группируемые колонки.
			ПараметрыПоиска	= Новый Структура();
			Для Каждого Значение Из ГруппируемыеКолонки Цикл
				ПараметрыПоиска.Вставить(Значение, Строка[Значение]);
			КонецЦикла;
			
			//	Получим ранее добавленную строку или убедимся, что таких строк еще нет.
			НайденныеСтроки	= ЭтаФорма[ПолноеНаименованиеТаблицы].НайтиСтроки(ПараметрыПоиска);
			
			//	Свести.
			Если НайденныеСтроки.Количество() Тогда
				
				Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
					
					//	Суммируемые колонки. Сложить значения.
					Для Каждого КлючИЗначение Из СуммируемыеКолонки Цикл
						
						//	Описание обработки колонки.
						ОписаниеКолонки	= ПолучитьОписаниеКолонкиНаКлиенте(КлючИЗначение.Значение);
						
						//	Обработка функции.
						Если ОписаниеКолонки["Функция"] = "СУММА" Тогда
							НайденнаяСтрока[КлючИЗначение.Ключ]	= СводнаяТаблицаФункцияСуммаНаКлиенте(ОписаниеКолонки, НайденнаяСтрока[КлючИЗначение.Ключ], Строка[КлючИЗначение.Ключ]);	
						ИначеЕсли ОписаниеКолонки["Функция"] = "СРАВНЕНИЕ" Тогда
							НайденнаяСтрока[КлючИЗначение.Ключ]	= СводнаяТаблицаФункцияСравнениеНаКлиенте(ОписаниеКолонки, НайденнаяСтрока[КлючИЗначение.Ключ], Строка[КлючИЗначение.Ключ]);	
						ИначеЕсли ОписаниеКолонки["Функция"] = "СРЕДНЕЕ" Тогда
							НайденнаяСтрока[КлючИЗначение.Ключ]	= СводнаяТаблицаФункцияСреднееНаКлиенте(ОписаниеКолонки, НайденнаяСтрока[КлючИЗначение.Ключ], Строка[КлючИЗначение.Ключ]);
						КонецЕсли;
						
					КонецЦикла;
					
					//	Количество сложенных значений. Имитация функции запроса (СРЕДНЕЕ).
					ВспомогательнаяТаблицаЗначенийВставить(НайденнаяСтрока);
				
				КонецЦикла;
				
			Иначе
				
				//	Добавить строку.
				ТабличнаяЧастьСтрока	= ЭтаФорма[ПолноеНаименованиеТаблицы].Добавить();
				ЗаполнитьЗначенияСвойств(ТабличнаяЧастьСтрока, Строка);
				
				//	Количество сложенных значений. Имитация функции запроса (СРЕДНЕЕ).
				ВспомогательнаяТаблицаЗначенийВставить(ТабличнаяЧастьСтрока);
			
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	//	Вычисление формул, имитировавших функции группировки запроса.
	Для Каждого Строка Из СведениеТабличнойЧасти Цикл
		Для Каждого КлючИЗначение Из СуммируемыеКолонки Цикл
			Если КлючИЗначение.Значение = "СРЕДНЕЕ" Тогда
				
				ТабличнаяЧастьСтрока	= ЭтаФорма[ПолноеНаименованиеТаблицы].НайтиПоИдентификатору(Строка.Строка);
				
				ТабличнаяЧастьСтрока[КлючИЗначение.Ключ]	= ТабличнаяЧастьСтрока[КлючИЗначение.Ключ] / Строка.Количество;
				
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры //Процедура СформироватьСводнуюТаблицуНаКлиенте(ОбрабатываемыеДокументы, НаименованиеТаблицы, ГруппируемыеКолонки, СуммируемыеКолонки)

&НаКлиенте
Функция СводнаяТаблицаФункцияСуммаНаКлиенте(ОписаниеКолонки, Значение1, Значение2)
	
	//	Проверка на правильность типа значения.
	Если НЕ ТипЗнч(Значение1) = Тип("Число") Тогда
		Возврат "Ошибка! Значение1";		
	КонецЕсли;
	Если НЕ ТипЗнч(Значение2) = Тип("Число") Тогда
		Возврат "Ошибка! Значение2";		
	КонецЕсли;
	
	//
	Возврат Значение1 + Значение2;
	

КонецФункции //Функция СводнаяТаблицаФункцияСуммаНаКлиенте(ОписаниеКолонки, Значение1, Значение2)

&НаКлиенте
Функция СводнаяТаблицаФункцияСравнениеНаКлиенте(ОписаниеКолонки, Значение1, Значение2)
	
	//
	Если Значение1 = Значение2 Тогда
		Возврат Значение1;
	Иначе
		Возврат ОписаниеКолонки["ЗначениеНеравенства"];
	КонецЕсли;
	
КонецФункции //Функция СводнаяТаблицаФункцияСравнениеНаКлиенте(ОписаниеКолонки, Значение1, Значение2)

&НаКлиенте
Функция СводнаяТаблицаФункцияСреднееНаКлиенте(ОписаниеКолонки, Значение1, Значение2)
	
	//	Проверка на правильность типа значения.
	Если НЕ ТипЗнч(Значение1) = Тип("Число") Тогда
		Возврат "Ошибка! Значение1";		
	КонецЕсли;
	Если НЕ ТипЗнч(Значение2) = Тип("Число") Тогда
		Возврат "Ошибка! Значение2";		
	КонецЕсли;
	
	//
	Возврат Значение1 + Значение2;
	
КонецФункции //Функция СводнаяТаблицаФункцияСреднееНаКлиенте(ОписаниеКолонки, Значение1, Значение2)

&НаКлиенте
Функция ПолучитьОписаниеКолонкиНаКлиенте(ОписаниеКолонки)
	
	//
	Если ТипЗнч(ОписаниеКолонки) = Тип("Структура") Тогда
		Структура	= ОписаниеКолонки;
	Иначе
		Структура	= Новый Структура;
	КонецЕсли;
	
	//	Функция
	Если НЕ Структура.Свойство("Функция") Тогда
		Структура.Вставить("Функция", "СУММА");
	КонецЕсли;
	
	//	Значение неравенства
	Если НЕ Структура.Свойство("ЗначениеНеравенства") Тогда
		Структура.Вставить("ЗначениеНеравенства", "разн. знч.");
	КонецЕсли;
	
	//
	Возврат Структура;
	
КонецФункции //Функция ПолучитьОписаниеКолонкиНаКлиенте(ОписаниеКолонки)

&НаКлиенте
Функция ВспомогательнаяТаблицаЗначенийВставить(ТабличнаяЧастьСтрока)
	
	//
	ИдентификаторСтроки	= ТабличнаяЧастьСтрока.ПолучитьИдентификатор();
	НайденныеСтроки		= СведениеТабличнойЧасти.НайтиСтроки(Новый Структура("Строка", ИдентификаторСтроки));
	
	Если НЕ НайденныеСтроки.Количество() Тогда
		
		Строка	= СведениеТабличнойЧасти.Добавить();
		Строка.Строка		= ИдентификаторСтроки;
		Строка.Количество	= 1;
		
	Иначе
		
		Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.Количество	= НайденнаяСтрока.Количество + 1;	
		КонецЦикла;
		
	КонецЕсли;
	
	//	Обрабатываемая строка.
	Если НайденнаяСтрока = Неопределено Тогда
		ВозвращаемоеЗначение	= Строка;
	Иначе
		ВозвращаемоеЗначение	= НайденнаяСтрока;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаКлиенте
Процедура СформироватьТаблицуДополнительныеРеквизитыНаКлиенте(НаименованиеТаблицы)
	
	//
	ПолноеНаименованиеТаблицы		= "ВТ_" + НаименованиеТаблицы;
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")), Истина));
	ОбрабатываемыеРазделы			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина));
	ОбрабатываемыеПозиции			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	Для Каждого Строка Из ЭтаФорма[ПолноеНаименованиеТаблицы] Цикл
		
		//
		Если ОбрабатываемыеЛокальныеСметы.Количество()
			И Строка.ИмяПредопределенныхДанных = "Документ_СМ_ЛокальнаяСмета"
			ИЛИ ОбрабатываемыеРазделы.Количество()
			И Строка.ИмяПредопределенныхДанных = "Документ_СМ_РазделЛокальнойСметы"
			ИЛИ ОбрабатываемыеПозиции.Количество()
			И Строка.ИмяПредопределенныхДанных = "Документ_СМ_ПозицияЛокальнойСметы" Тогда
			
			//
			ТабличнаяЧастьСтрока	= ТабличнаяЧастьСвойства.Добавить();
			ЗаполнитьЗначенияСвойств(ТабличнаяЧастьСтрока, Строка);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти //#Область ВспомогательныеФункции/#Область ТаблицыЗначений

#КонецОбласти //#Область ТаблицыЗначений

//	Формируем списки отмеченных элементов.
#Область ОбрабатываемыеЭлементы

//	Drug & Drop. Выделенные элементы (при переносе, копировании и т.д.).

// Получаем все отмеченные элементы дерева - ссылки на документы - и помещаем в массив.
//
&НаСервере
Функция ПеребратьИдентификаторыНаСервереБезКонтекста(Идентификаторы, ПараметрыОбработки)
	
	//	Раскидываем дерево значений, на списки, по типам документов КоллекцияСтрокДереваЗначений.
	Для Каждого ИдентификаторСтроки Из Идентификаторы Цикл
		
		//
		СтрокаДерева	= ЭлементыДеревоЗначений.НайтиПоИдентификатору(ИдентификаторСтроки);
		
		// Нужно, для проверки доступности обработки команды.
		// ПараметрыОбработкиДобавитьВладелецНаСервере(СтрокаДерева, ПараметрыОбработки);
			
		// Запоминаем выбранные элементы (исключаем дубли).
		ОбрабатываемыеЭлементыДобавитьНаСервере(СтрокаДерева, ПараметрыОбработки);
		
		// Получить связанные позиции (здесь предполагаем, что у позиции всегда есть родитель - "раздел").
		Если СтрокаДерева.Связанная Тогда
			ОбрабатываемыеЭлементыДобавитьСвязанныеНаСервере(СтрокаДерева.Родитель.Строки, Ложь, ПараметрыОбработки);
		КонецЕсли;
		
		// Получить все вложенные узлы.
		// ОбрабатываемыеЭлементыДобавитьНаСервере(СтрокаДерева);
		
	КонецЦикла;	
		
	//
	Возврат Истина;
	
КонецФункции //Функция ПеребратьИдентификаторыНаСервереБезКонтекста(СтрокиДерева, Идентификаторы, ПараметрыОбработки = Неопределено)	

//	Отмеченные элементы (Пометка = Истина).

// Вычисляет отмеченные элементы дерева значений и устанавливает параметры формы.
//
&НаКлиенте
Процедура ОтобратьОтмеченныеЭлементыНаКлиенте(ПараметрыОбработки = Неопределено, ПараметрыКоманды = Неопределено)
	
	//
	СформироватьПараметрыОбработкиНаКлиенте(ПараметрыОбработки);
	
	//	Отметить элементы дерева (находяться в отдельной таблице).
	ОбрабатываемыеЭлементыОтобратьНаКлиенте(ЭлементыДеревоЗначений, ПараметрыОбработки, ПараметрыКоманды);
	
	//	УчастиеВладелец. Отметить элементы дерева.
	Для Каждого ЭлементМассива Из ПараметрыОбработки["ВладельцыСводныеСметы"] Цикл
		
		ОбрабатываемыйЭлемент	= ОбрабатываемыеЭлементы.НайтиПоИдентификатору(ЭлементМассива["СтрокаДерева"].Идентификатор);
		
		Если НЕ ОбрабатываемыйЭлемент = Неопределено Тогда
			ОбрабатываемыйЭлемент.УчастиеВладелец	= Истина;
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из ПараметрыОбработки["ВладельцыОбъектныеСметы"] Цикл
		
		ОбрабатываемыйЭлемент	= ОбрабатываемыеЭлементы.НайтиПоИдентификатору(ЭлементМассива["СтрокаДерева"].Идентификатор);
		
		Если НЕ ОбрабатываемыйЭлемент = Неопределено Тогда
			ОбрабатываемыйЭлемент.УчастиеВладелец	= Истина;
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из ПараметрыОбработки["ВладельцыЛокальныеСметы"] Цикл
		
		ОбрабатываемыйЭлемент	= ОбрабатываемыеЭлементы.НайтиПоИдентификатору(ЭлементМассива["СтрокаДерева"].Идентификатор);
		
		Если НЕ ОбрабатываемыйЭлемент = Неопределено Тогда
			ОбрабатываемыйЭлемент.УчастиеВладелец	= Истина;
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из ПараметрыОбработки["ВладельцыРазделы"] Цикл
		
		ОбрабатываемыйЭлемент	= ОбрабатываемыеЭлементы.НайтиПоИдентификатору(ЭлементМассива["СтрокаДерева"].Идентификатор);
		
		Если НЕ ОбрабатываемыйЭлемент = Неопределено Тогда
			ОбрабатываемыйЭлемент.УчастиеВладелец	= Истина;
		КонецЕсли;
	
	КонецЦикла;

	//	ПАРАМЕТРЫ
	УстановитьПараметрыОбрабатываемыеЭлементыНаКлиенте(ПараметрыОбработки);
	
КонецПроцедуры //Процедура ОтобратьОтмеченныеЭлементыНаКлиенте(ПараметрыОбработки = Неопределено)

// Раскидываем дерево значений, на списки, по типам документов.
//
&НаКлиенте
Функция ОбрабатываемыеЭлементыОтобратьНаКлиенте(ЭлементДерева, ПараметрыОбработки = Неопределено, ПараметрыКоманды = Неопределено)
	
	//	1. Пометка
	//	2. Родитель
	//	3. Владелец
	
	//
	Для Каждого СтрокаДерева Из ЭлементДерева.ПолучитьЭлементы() Цикл
		
		//
		ОбрабатываемыйЭлемент	= ОбрабатываемыеЭлементы.НайтиПоИдентификатору(СтрокаДерева.Идентификатор);	
		
		Если ОбрабатываемыйЭлемент = Неопределено Тогда
			//	рекурсия
			ОбрабатываемыеЭлементыОтобратьНаКлиенте(СтрокаДерева,,ПараметрыКоманды);
			Продолжить;	
		КонецЕсли;
		
		//	УчастиеПометка
		Если СтрНайти(ВРег(Действие),"РАСЧЕТ")>0 Тогда
			ОбрабатываемыйЭлемент.УчастиеПометка		= (СтрокаДерева.Пометка = 1);	
		Иначе
			ОбрабатываемыйЭлемент.УчастиеПометка		= (СтрокаДерева.Пометка = 1 И (Не ОбрабатываемыйЭлемент.СтатусРедактирования = 2 ИЛИ Действие = "Копировать"));	
		КонецЕсли;
		
		Перенос = Ложь;
		Если Не ПараметрыКоманды = Неопределено Тогда
			Если ВРег(ПараметрыКоманды.Действие) = "ПЕРЕНЕСТИ" Тогда
				Перенос = Истина;
			КонецЕсли;
			Если Перенос
				И Не ТипЗнч(ОбрабатываемыйЭлемент.СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")
				И Не ТипЗнч(ОбрабатываемыйЭлемент.СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
				ОбрабатываемыйЭлемент.УчастиеПометка = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		//	УчастиеРодитель. Нужно, для перерасчета.
		Если ЕстьОтмеченныеНаКлиенте(СтрокаДерева.ПолучитьЭлементы()) Тогда
			ОбрабатываемыйЭлемент.УчастиеРодитель	= Истина;	
		КонецЕсли;
				
		//	УчастиеВладелец. Нужно, для проверки доступности обработки команды.
		Если ОбрабатываемыйЭлемент.УчастиеПометка И НЕ Перенос Тогда
			ПараметрыОбработкиДобавитьВладелецНаКлиенте(СтрокаДерева, ПараметрыОбработки);
		КонецЕсли;
		
		//	рекурсия
		ОбрабатываемыеЭлементыОтобратьНаКлиенте(СтрокаДерева, ПараметрыОбработки,ПараметрыКоманды);
		
	КонецЦикла;
	
КонецФункции //Функция ОбрабатываемыеЭлементыОтобратьНаКлиенте(ЭлементДерева, ПараметрыОбработки = Неопределено)	


&НаСервере
Процедура ОбрабатываемыеЭлементыСформироватьНаСервере(Идентификаторы = Неопределено, ПараметрыОбработки = Неопределено)
	
	//	Очистить. Очистить таблицы значений "Обрабатываемые...".
	ОбрабатываемыеЭлементы.Очистить();
	
	//	ОбрабатываемыеЭлементы (сформировать таблицы значений, либо отмеченные, либо выделенные).
	Если НЕ Идентификаторы = Неопределено Тогда
		ПеребратьИдентификаторыНаСервереБезКонтекста(Идентификаторы, ПараметрыОбработки);
	Иначе
		ОбрабатываемыеЭлементыДобавитьНаСервере(ЭлементыДеревоЗначений, ПараметрыОбработки);
	КонецЕсли;
	
КонецПроцедуры //Процедура ОбрабатываемыеЭлементыСформироватьНаСервере(Идентификаторы = Неопределено, ПараметрыОбработки = Неопределено)

// Получаем все элементы дерева - ссылки на документы - и помещаем в таблицу значений.
//
&НаСервере
Функция ОбрабатываемыеЭлементыДобавитьНаСервере(СтрокаДерева1, ПараметрыОбработки = Неопределено)
	
	// Раскидываем дерево значений, на списки, по типам документов.
	// Заполним структуру параметров, выбранными элементами.
	Для Каждого СтрокаДерева2 Из СтрокаДерева1.ПолучитьЭлементы() Цикл
		
		//	Запоминаем элементы (исключаем дубли).
		ОбрабатываемыеЭлементыВставитьНаСервере(СтрокаДерева2);
			
		//	рекурсия
		ОбрабатываемыеЭлементыДобавитьНаСервере(СтрокаДерева2, ПараметрыОбработки);
		
	КонецЦикла;	
		
	//
	Возврат Истина;
	
КонецФункции //Функция ОбрабатываемыеЭлементыДобавитьНаСервере(СтрокаДерева1, ПараметрыОбработки = Неопределено)	


//	Сформировать параметры обработки.

&НаКлиенте
Функция ПараметрыОбработкиДобавитьВладелецНаКлиенте(СтрокаДерева, ПараметрыОбработки)
	
	Если НЕ СтрокаДерева.ПринадлежитСводнойСмете = ПредопределенноеЗначение("Документ.СМ_СводнаяСмета.ПустаяСсылка")
		И ПараметрыОбработкиВладельцыНайтиНаКлиенте(ПараметрыОбработки["ВладельцыСводныеСметы"], СтруктураВладельцыНаКлиенте(СтрокаДерева.ПринадлежитСводнойСмете, СтрокаДерева)) = Неопределено Тогда
		ПараметрыОбработки["ВладельцыСводныеСметы"].Добавить(СтруктураВладельцыНаКлиенте(СтрокаДерева.ПринадлежитСводнойСмете, СтрокаДерева));
	КонецЕсли;
	
	Если НЕ СтрокаДерева.ПринадлежитОбъектнойСмете = ПредопределенноеЗначение("Документ.СМ_ОбъектнаяСмета.ПустаяСсылка")
		И ПараметрыОбработкиВладельцыНайтиНаКлиенте(ПараметрыОбработки["ВладельцыОбъектныеСметы"], СтруктураВладельцыНаКлиенте(СтрокаДерева.ПринадлежитОбъектнойСмете, СтрокаДерева)) = Неопределено Тогда
		ПараметрыОбработки["ВладельцыОбъектныеСметы"].Добавить(СтруктураВладельцыНаКлиенте(СтрокаДерева.ПринадлежитОбъектнойСмете, СтрокаДерева));
	КонецЕсли;

	Если НЕ СтрокаДерева.ПринадлежитЛокальнойСмете = ПредопределенноеЗначение("Документ.СМ_ЛокальнаяСмета.ПустаяСсылка")
		И ПараметрыОбработкиВладельцыНайтиНаКлиенте(ПараметрыОбработки["ВладельцыЛокальныеСметы"], СтруктураВладельцыНаКлиенте(СтрокаДерева.ПринадлежитЛокальнойСмете, СтрокаДерева)) = Неопределено Тогда
		ПараметрыОбработки["ВладельцыЛокальныеСметы"].Добавить(СтруктураВладельцыНаКлиенте(СтрокаДерева.ПринадлежитЛокальнойСмете, СтрокаДерева));
	КонецЕсли;

	Если НЕ СтрокаДерева.ПринадлежитРазделу = ПредопределенноеЗначение("Документ.СМ_РазделЛокальнойСметы.ПустаяСсылка")
		И ПараметрыОбработкиВладельцыНайтиНаКлиенте(ПараметрыОбработки["ВладельцыРазделы"], СтруктураВладельцыНаКлиенте(СтрокаДерева.ПринадлежитРазделу, СтрокаДерева)) = Неопределено Тогда
		ПараметрыОбработки["ВладельцыРазделы"].Добавить(СтруктураВладельцыНаКлиенте(СтрокаДерева.ПринадлежитРазделу, СтрокаДерева));
	КонецЕсли;
		
КонецФункции //Функция ПараметрыОбработкиДобавитьВладелецНаКлиенте(СтрокаДерева, ПараметрыОбработки)

&НаКлиенте
Функция ПараметрыОбработкиВладельцыНайтиНаКлиенте(Массив, Значение)
		
	//
	Для Каждого ЭлементМассива Из Массив Цикл
		
		//
		Если ЭлементМассива["СсылкаНаОбъект"] = Значение["СсылкаНаОбъект"] Тогда
			Возврат ЭлементМассива;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции //Функция ПараметрыОбработкиВладельцыНайтиНаКлиенте(Массив)

&НаКлиенте
Функция ЕстьОтмеченныеНаКлиенте(СтрокиДерева)
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		Если Булево(СтрокаДерева.Пометка = 1) Тогда
			Возврат Истина;
			Прервать;
		КонецЕсли;
		
		Если ЕстьОтмеченныеНаКлиенте(СтрокаДерева.ПолучитьЭлементы()) Тогда
			Возврат Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции //Функция ЕстьОтмеченныеНаКлиенте(СтрокиДерева)

// Обработать таблицы значений "Обрабатываемые...".

//
//
&НаСервере
Функция ОбрабатываемыеЭлементыДобавитьСвязанныеНаСервере(СтрокиДерева, ТолькоОтмеченные = Истина, ПараметрыОбработки = Неопределено)
	
	// Заполним структуру "ОбъектыДляОперации"
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		// Раскидываем дерево значений, на списки, по типам документов
		Если НЕ ТолькоОтмеченные
			ИЛИ ТолькоОтмеченные И Булево(СтрокаДерева.Пометка = 1) Тогда
			
			// Нужно, для проверки доступности обработки команды.
			// ПараметрыОбработкиДобавитьВладелецНаСервере(СтрокаДерева, ПараметрыОбработки);
			
			// Предполагаем, что связанные бывают, только позиции, остальные игнорируем.
			Если СтрокаДерева.Связанная Тогда
				Если ОбрабатываемыеЭлементы.Найти(СтрокаДерева.Элемент) = Неопределено Тогда
					ОбрабатываемыеЭлементыДобавитьСтрокуНаСервереБезКонтекста(ОбрабатываемыеЭлементы, СтрокаДерева.Элемент);
				КонецЕсли;		
			КонецЕсли;

		КонецЕсли;		
		
	КонецЦикла;	
		
	//
	Возврат Истина;
	
КонецФункции //Функция ОбрабатываемыеЭлементыДобавитьСвязанныеНаСервере(СтрокиДерева, ТолькоОтмеченные = Истина, ПараметрыОбработки = Неопределено)	

&НаСервере
Функция ОбрабатываемыеЭлементыВставитьНаСервере(СтрокаДерева, Участие = "УчастиеПометка")
	
	// Нужно, что бы назначить первому элементу родитель = "Неопределено",
	// для возможности, рекурсивного обхода элементов, при копировании.
	Если ОбрабатываемРодительскийЭлементНаСервере(СтрокаДерева["Элемент"]) Тогда
		ЭтоПервыйЭлементВетки	= Истина;	
	Иначе
		ЭтоПервыйЭлементВетки	= Ложь;	
	КонецЕсли;
	
	//
	НайденныеСтроки	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("СсылкаНаОбъект", СтрокаДерева.Элемент));
	
	Если НайденныеСтроки.Количество() Тогда
		Для Каждого Строка Из НайденныеСтроки Цикл
			
			ЗначенияЗаполнения = Новый Структура(Участие, Истина);	
			
			ОбрабатываемыеЭлементыЗаполнитьСтрокуНаСервереБезКонтекста(ОбрабатываемыеЭлементы, Строка, ЗначенияЗаполнения);
			
		КонецЦикла;
	Иначе
		
		//
		ЭлементКоллекции	= ОбрабатываемыеЭлементыДобавитьСтрокуНаСервереБезКонтекста(ОбрабатываемыеЭлементы, СтрокаДерева, ЭтоПервыйЭлементВетки, Участие = "УчастиеРодитель", Участие = "УчастиеПометка", Участие = "УчастиеВладелец", Участие = "УчастиеПриемник");
		
		//
		СтрокаДерева.Идентификатор	= ЭлементКоллекции.ПолучитьИдентификатор();
			
	КонецЕсли;
	
	//	Сортировать НайтиПоИдентификатору
	ОбрабатываемыеЭлементы.Сортировать("Уровень Убыв");
		
КонецФункции //Функция ОбрабатываемыеЭлементыВставитьНаСервере(СтрокаДерева, Участие = "УчастиеПометка")

&НаСервереБезКонтекста
Функция ОбрабатываемыеЭлементыДобавитьСтрокуНаСервереБезКонтекста(ТаблицаЗначений, СтрокаДерева, ЭтоПервыйЭлементВетки = Ложь, УчастиеРодитель = Ложь, УчастиеПометка = Ложь, УчастиеВладелец = Ложь, УчастиеПриемник = Ложь)
	
	//
	Если ТипЗнч(СтрокаДерева.Элемент) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")
		ИЛИ ТипЗнч(СтрокаДерева.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		ЛокальнаяСмета	= СтрокаДерева.Элемент.ИДСметы;	
	Иначе
		ЛокальнаяСмета	= Неопределено;	
	КонецЕсли;
	
	//
	Если ЭтоПервыйЭлементВетки Тогда
		Родитель	= Неопределено;
	Иначе
		Родитель	= СтрокаДерева.Элемент.ИДРодителя;
	КонецЕсли;
	
	//
	Строка	= ТаблицаЗначений.Добавить();
	Строка["Тип"]				= Строка(ТипЗнч(СтрокаДерева["Элемент"]));
	Строка["ЛокальнаяСмета"]	= ЛокальнаяСмета;
	Строка["Родитель"]			= Родитель;
	Строка["СсылкаНаОбъект"]	= СтрокаДерева.Элемент;
	Строка["Копия"]				= Неопределено;
	Строка["Идентификатор"]		= ?(ТипЗнч(СтрокаДерева)=Тип("СтрокаДереваЗначений"),СтрокаДерева.Идентификатор,СтрокаДерева.ПолучитьИдентификатор());
	Строка["Уровень"]			= СтрокаДерева.Уровень;
	Строка["Параметры"]			= СтрокаДерева.Параметры;
	Строка["УчастиеРодитель"]	= УчастиеРодитель;
	Строка["УчастиеПометка"]	= УчастиеПометка;
	Строка["УчастиеВладелец"]	= УчастиеВладелец;
	Строка["УчастиеПриемник"]	= УчастиеПриемник;
	Строка["ОбъемВсего"]	    = СтрокаДерева.ОбъемВсего;
	Строка["СтатусРедактирования"]  = СтрокаДерева.СтатусРедактирования;
	Возврат Строка;
	
КонецФункции //Функция ОбрабатываемыеЭлементыДобавитьСтрокуНаСервереБезКонтекста(ТаблицаЗначений, СтрокаДерева, ЭтоПервыйЭлементВетки = Ложь, УчастиеРодитель = Ложь, УчастиеПометка = Ложь, УчастиеВладелец = Ложь)

&НаСервереБезКонтекста
Функция ОбрабатываемыеЭлементыЗаполнитьСтрокуНаСервереБезКонтекста(ТаблицаЗначений, Строка, ЗначенияЗаполнения)
	
	//
	Для Каждого КлючИЗначение Из ЗначенияЗаполнения Цикл
		
		Если Строка.Свойство(КлючИЗначение.Ключ) Тогда
			Строка[КлючИЗначение.Ключ]	= КлючИЗначение.Значение;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Строка;

КонецФункции //Функция ОбрабатываемыеЭлементыЗаполнитьСтрокуНаСервереБезКонтекста(ТаблицаЗначений, Строка, ЗначенияЗаполнения)


&НаСервере
Функция ОбрабатываемыеЭлементыДобавитьПриемникНаСервере(ЭлементПриемник)
	
	//	рекурсия
	ПараметрыОбработки	= Новый Структура("Функция, Прервать, ЭлементПриемник", "ЭлементыДеревоЗначенийНайтиНаСервере", Ложь, ЭлементПриемник);
	СтрокаДерева		= ЭлементыДеревоЗначенийРекурсияНаСервере(ЭлементыДеревоЗначений, ПараметрыОбработки);
	
	//	рекурсия
	ПараметрыОбработки	= Новый Структура("Функция, Прервать, ЭлементПриемник", "ОбрабатываемыеЭлементыДобавитьПриемникВставитьНаСервере", Ложь, ЭлементПриемник);
	ЭлементыДеревоЗначенийРекурсияНаСервере(СтрокаДерева, ПараметрыОбработки);
	
	//	рекурсия
	ПараметрыОбработки	= Новый Структура("Функция, ЭлементПриемник", "ОбрабатываемыеЭлементыДобавитьПриемникВставитьНаСервере", ЭлементПриемник);
	ЭлементыДеревоЗначенийПоднятьсяНаСервере(СтрокаДерева, ПараметрыОбработки);
	
КонецФункции //Функция ОбрабатываемыеЭлементыДобавитьПриемникНаСервере(ЭлементПриемник)

&НаСервере
Функция ОбрабатываемыеЭлементыДобавитьПриемникВставитьНаСервере(СтрокаДерева, ПараметрыОбработки)
	
	//
	ОбрабатываемыеЭлементыВставитьНаСервере(СтрокаДерева, "УчастиеПриемник");
	
	Возврат СтрокаДерева;
	
КонецФункции //Функция ОбрабатываемыеЭлементыДобавитьПриемникВставитьНаСервере(СтрокаДерева, ПараметрыОбработки)

&НаСервере
Функция ЭлементыДеревоЗначенийНайтиНаСервере(СтрокаДерева, ПараметрыОбработки)
	
	//
	Если СтрокаДерева["Элемент"] = ПараметрыОбработки["ЭлементПриемник"] Тогда
		ПараметрыОбработки["Прервать"]	= Истина;	
	КонецЕсли;
	
	//
	Возврат СтрокаДерева;
	
КонецФункции //Функция ЭлементыДеревоЗначенийНайтиНаСервере(ЭлементПриемник, СтрокаДерева = Неопределено)


&НаСервере
Функция ОбрабатываемыеЭлементыМаксимальноПоУровнюОтмеченныйНаСервере()
	
	//	рекурсия
	ПараметрыОбработки	= Новый Структура("Функция, Прервать, Пометка", "ОбрабатываемыеЭлементыСравнитьНаСервере", Ложь, Истина);
	Возврат	ЭлементыДеревоЗначенийРекурсияНаСервере(ЭлементыДеревоЗначений, ПараметрыОбработки);	
	
КонецФункции //Функция ОбрабатываемыеЭлементыМаксимальноПоУровнюОтмеченныйНаСервере()

&НаСервере
Функция ОбрабатываемыеЭлементыСравнитьНаСервере(СтрокаДерева, ПараметрыОбработки)
	
	//
	Если СтрокаДерева["Пометка"] = ПараметрыОбработки["Пометка"] Тогда
		ПараметрыОбработки["Прервать"]	= Истина;	
	КонецЕсли;
	
	Возврат СтрокаДерева;
	
КонецФункции //Функция ОбрабатываемыеЭлементыСравнитьНаСервере(СтрокаДерева, ПараметрыОбработки)

//	Функции универсальные, для перебора дерева значений.

&НаСервере
Функция ЭлементыДеревоЗначенийРекурсияНаСервере(СтрокаДерева, ПараметрыОбработки = Неопределено, ВозвращаемоеЗначение = Неопределено)
	
	Если ПараметрыОбработки = Неопределено Тогда
		ПараметрыОбработки	= Новый Структура("Функция, Прервать", "тест", Ложь);
	ИначеЕсли ТипЗнч(ПараметрыОбработки) = Тип("Структура") Тогда
		
		// Функция
		Если НЕ ПараметрыОбработки.Свойство("Функция") Тогда
			ПараметрыОбработки.Вставить("Функция", "тест");
		КонецЕсли;
		
		// Прервать
		Если НЕ ПараметрыОбработки.Свойство("Прервать") Тогда
			ПараметрыОбработки.Вставить("Прервать", Ложь);
		КонецЕсли;
		
	Иначе
	    Сообщение 		= Новый СообщениеПользователю();
	    Сообщение.Текст = НСтр("ru = 'Параметры рекурсии, могут быть только структурой!'");
	    Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаДерева1 Из СтрокаДерева.ПолучитьЭлементы() Цикл
		
		Если ПараметрыОбработки["Прервать"] Тогда
			Прервать;	
		КонецЕсли;
		
		Выполнить("ВозвращаемоеЗначение	= " + ПараметрыОбработки["Функция"] + "(СтрокаДерева1, ПараметрыОбработки)");
		
		// рекурсия
		ЭлементыДеревоЗначенийРекурсияНаСервере(СтрокаДерева1, ПараметрыОбработки, ВозвращаемоеЗначение);	
		
	КонецЦикла;	
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции //Функция ЭлементыДеревоЗначенийРекурсияНаСервере(СтрокаДерева, ПараметрыОбработки = Неопределено, ВозвращаемоеЗначение = Неопределено)

&НаСервере
Функция ЭлементыДеревоЗначенийПоднятьсяНаСервере(СтрокаДерева, ПараметрыОбработки = Неопределено)
	
	ВозвращаемоеЗначение	= Неопределено;
	СтрокаДереваРодитель	= СтрокаДерева;
	
	Если ПараметрыОбработки = Неопределено Тогда
		ПараметрыОбработки	= Новый Структура("Функция", "тест");
	ИначеЕсли ТипЗнч(ПараметрыОбработки) = Тип("Структура") Тогда
		
		// Функция
		Если НЕ ПараметрыОбработки.Свойство("Функция") Тогда
			ПараметрыОбработки.Вставить("Функция", "тест");
		КонецЕсли;
		
	Иначе
	    Сообщение 		= Новый СообщениеПользователю();
	    Сообщение.Текст = НСтр("ru = 'Параметры выполнения, могут быть только структурой!'");
	    Сообщение.Сообщить();
		Возврат Ложь;
	КонецЕсли;
	
	Пока НЕ СтрокаДереваРодитель = Неопределено Цикл
		
		Выполнить("ВозвращаемоеЗначение	= " + ПараметрыОбработки["Функция"] + "(СтрокаДереваРодитель, ПараметрыОбработки)");
		
		СтрокаДереваРодитель	= СтрокаДереваРодитель.ПолучитьРодителя();
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции //Функция ЭлементыДеревоЗначенийПоднятьсяНаСервере(СтрокаДерева, ПараметрыОбработки = Неопределено)

&НаСервере
Функция тест(СтрокаДерева1, ПараметрыОбработки)
	
    Сообщение 		= Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Тест'");
    Сообщение.Сообщить();
	
	Возврат "тест";
	
КонецФункции //Функция тест(СтрокаДерева1, ПараметрыРекурсии)

#КонецОбласти //#Область ОбрабатываемыеЭлементы/#Область ПолучитьЗначение

//	Отображение формы (видимость элементов, списки выбора), в зависимости от выбранных значений.
#Область Отображение

&НаКлиенте
Процедура ДокументПриИзмененииНаКлиенте(ТекущийДокумент = Неопределено, ДействиеПоУмолчанию = "")
	
	//
	СформироватьОбластьОбработкиНаКлиенте();
	
	//	Отображение табличных частей ("РАСЦЕНКИ" - не отображать табличные части).
	ОбработатьПереключениеОбластиОбработкиНаКлиенте();
	
	//
	СформироватьКомандыДействиеНаКлиенте(ТекущийДокумент, ДействиеПоУмолчанию);	
	
	//	
	КомандаИмя			= ПолучитьКомандаИмяНаКлиенте(Действие);
	ПараметрыКоманды	= ПолучитьПараметрыКомандыНаКлиенте(Новый Структура("Имя", КомандаИмя));
	
	//	Видимость/доступность элементов на форме
	УстановитьВидимостьДоступностьЭлементовНаКлиенте(ПараметрыКоманды);
		
КонецПроцедуры //Процедура ДокументПриИзмененииНаКлиенте(ТекущийДокумент = Неопределено, ДействиеПоУмолчанию = "")	

&НаКлиенте
Процедура СформироватьОбластьОбработкиНаКлиенте()
	
	//	РАСЦЕНКИ, РЕСУРСЫ
	Элементы.ОбластьОбработки.СписокВыбора.Очистить();
	Элементы.ОбластьОбработки.СписокВыбора.Добавить("РАСЦЕНКИ", "Расценки");
	Элементы.ОбластьОбработки.СписокВыбора.Добавить("РЕСУРСЫ", "Ресурсы");
	
	//	ПОПРАВКИ, НАЧИСЛЕНИЯ
	Если НЕ Параметры.ЭтоОбработкаАктаВыполненныхРабот Тогда
		Элементы.ОбластьОбработки.СписокВыбора.Добавить("ПОПРАВКИ", "Поправки");
		Элементы.ОбластьОбработки.СписокВыбора.Добавить("НАЧИСЛЕНИЯ", "Начисления");
	КонецЕсли;
	
	//	ИНДЕКСЫ
	Если Параметры.СодержитБазисноИндексныйУровеньРасценка
		ИЛИ Параметры.СодержитБазисноИндексныйУровеньРаздел Тогда
		Элементы.ОбластьОбработки.СписокВыбора.Добавить("ИНДЕКСЫ", "Индексы");
	КонецЕсли;
	
	//	СВОЙСТВА
	Элементы.ОбластьОбработки.СписокВыбора.Добавить("СВОЙСТВА", "Свойства");
	
	//	Установить значение.
	Если Элементы.ОбластьОбработки.СписокВыбора.НайтиПоЗначению(ОбластьОбработки) = Неопределено Тогда
		ОбластьОбработки = "РАСЦЕНКИ";
	КонецЕсли;

КонецПроцедуры //Процедура СформироватьОбластьОбработкиНаКлиенте()

&НаКлиенте
Процедура ОбработатьПереключениеОбластиОбработкиНаКлиенте()
	
	//	Отображение табличных частей ("РАСЦЕНКИ" - не отображать табличные части).
	Элементы.СтраницыТабличныеЧасти.Видимость				= (НЕ ОбластьОбработки = "РАСЦЕНКИ");
	Если НЕ ОбластьОбработки = "РАСЦЕНКИ" тогда
		Элементы.СтраницыТабличныеЧасти.ТекущаяСтраница		= Элементы["Страница" + ОбластьОбработки];
	КонецЕсли;
	
КонецПроцедуры //Процедура ОбработатьПереключениеОбластиОбработкиНаКлиенте()	

&НаКлиенте
Процедура СформироватьКомандыДействиеНаКлиенте(ТекущийДокумент = Неопределено, ДействиеПоУмолчанию = "")
	
	//	Элементы.Действие.СписокВыбора.Добавить() - установить список команд
	УстановитьСписокКоманд(ТекущийДокумент, ДействиеПоУмолчанию, СметнаяКомпонента = Неопределено);
	
	//
	УстановитьСписокКомандПодменюНаСервере(ТекущийДокумент, ОбластьОбработки);
	
	//	Выберем первый элемент. 
	Если ЗначениеЗаполнено(ДействиеПоУмолчанию) тогда
		
		//	установить значение
		Действие 	= ДействиеПоУмолчанию;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Действие) тогда
			
			Если Элементы.Действие.СписокВыбора.Количество() тогда
				Действие = Элементы.Действие.СписокВыбора[0].Значение;
			КонецЕсли;
			
			Элементы.Действие.Доступность = ЗначениеЗаполнено(Действие);
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //Процедура СформироватьКомандыДействиеНаКлиенте(ТекущийДокумент = Неопределено, ДействиеПоУмолчанию = "")

//	ДЕЙСТВИЕ (список команд, в зависимости от выбранной области обработки).

&НаСервере
Процедура УстановитьСписокКоманд(ТекущийДокумент, ДействиеПоУмолчанию = "", СметнаяКомпонентаНеопределена = Ложь)
	
	//
	Действие	= "";
	
	Элементы.Действие.СписокВыбора.Очистить();    	
	
	Для каждого Команда Из Команды Цикл
			
		Если Команда.Имя = "ВыполнитьКоманду" Тогда
			Продолжить;
		КонецЕсли;	
		
		Если СметнаяКомпонентаНеопределена Тогда 
			Если Команда.Имя = "РАСЦЕНКИ_ЛС_ОбновитьПоНормативнойБазе" 
				ИЛИ Команда.Имя = "РЕСУРСЫ_ЛС_ЗаменитьРесурсПлюсМинусИзВБ" Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если Найти(Команда.Имя, ОбластьОбработки) Тогда 
			Если (ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") И Найти(Команда.Имя, "_АКТ")) ИЛИ
				(ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") И Найти(Команда.Имя, "_ЛС")) ИЛИ
				(ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") И Найти(Команда.Имя, "_ОС")) ИЛИ
				(ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_СводнаяСмета") И Найти(Команда.Имя, "_СС")) Тогда
				
				//
				ПараметрыКоманды	= СтрРазделить(Команда.Имя, "_");
				Значение			= ПараметрыКоманды[ПараметрыКоманды.Количество()-1];
				
				//
				Элементы.Действие.СписокВыбора.Добавить(Значение, Команда.Заголовок);
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Процедура УстановитьСписокКомандПодменюНаСервере(ТекущийДокумент, ОбластьОбработки)
	
	Если ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") тогда
		ТипДокумента	= "АКТ";	
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_СводнаяСмета") тогда
		ТипДокумента	= "СМ";	
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") тогда
		ТипДокумента	= "ОС";	
	ИначеЕсли ТипЗнч(ТекущийДокумент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") тогда
		ТипДокумента	= "ЛС";	
	Иначе
		ТипДокумента	= "";	
	КонецЕсли;
		
	//	удалить созданные кнопки формы
	Для Каждого ОписаниеКоманды Из ДействиеКоманды Цикл
		
		//	удалить элемент
		Если НЕ Элементы.Найти(ОписаниеКоманды.Элемент) = Неопределено Тогда
			Элементы.Удалить(Элементы[ОписаниеКоманды.Элемент]);
		КонецЕсли;
		
		//	удалить группу
		Если НЕ Элементы.Найти(ОписаниеКоманды.Группа) = Неопределено Тогда
			Элементы.Удалить(Элементы[ОписаниеКоманды.Группа]);
		КонецЕсли;
		
	КонецЦикла;
	
	//	очистить таблицу
	ДействиеКоманды.Очистить();
	
	//	получить команды
	Для Каждого Команда Из Команды Цикл
		
		ПараметрыКоманды	= СтрРазделить(Команда.Имя, "_", Истина);
		
		//
		Если НЕ ПараметрыКоманды.Количество() = 5 Тогда
			Продолжить;
		КонецЕсли;
		
		//
		Если НЕ ПараметрыКоманды[0] = ОбластьОбработки
			ИЛИ НЕ ПараметрыКоманды[1] = ТипДокумента тогда
			Продолжить;
		КонецЕсли;
		
		//
		ГруппаКнопокИмя	= ПараметрыКоманды[0] + "_" + ПараметрыКоманды[1] + "_" + "Группа" + "_" + ПараметрыКоманды[2];
		КнопкаИмя		= ПараметрыКоманды[0] + "_" + ПараметрыКоманды[1] + "_" + ПараметрыКоманды[4];
		
		//
		ОписаниеКоманды	= ДействиеКоманды.Добавить();
		ОписаниеКоманды.Индекс			= Число(ПараметрыКоманды[3]);
		ОписаниеКоманды.ИндексГруппа	= Число(ПараметрыКоманды[2]);
		ОписаниеКоманды.Группа			= ГруппаКнопокИмя;
		ОписаниеКоманды.Элемент			= КнопкаИмя;
		ОписаниеКоманды.Команда			= Команда.Имя;
		ОписаниеКоманды.Заголовок		= Команда.Заголовок;
		ОписаниеКоманды.Действие		= ПараметрыКоманды[ПараметрыКоманды.Количество()-1];
		
	КонецЦикла;
	
	//	сортировать
	ДействиеКоманды.Сортировать("ИндексГруппа Возр, Индекс Возр");
		
	//	создать элементы формы
	Для Каждого ОписаниеКоманды Из ДействиеКоманды Цикл
		
		//	создать группу кнопок ПодчиненныеЭлементы
		Если Элементы.Найти(ОписаниеКоманды.Группа) = Неопределено Тогда
			ПодменюГруппаКнопок	= Элементы.Вставить(ОписаниеКоманды.Группа, Тип("ГруппаФормы"), Элементы.ГруппаКомандыДействиеПодменю);
			ПодменюГруппаКнопок.Вид	= ВидГруппыФормы.ГруппаКнопок;
		Иначе
			ПодменюГруппаКнопок	= Элементы.Найти(ОписаниеКоманды.Группа);
		КонецЕсли;
		
		//	создать кнопку
		ПодменюКнопка		= Элементы.Добавить(ОписаниеКоманды.Элемент, Тип("КнопкаФормы"), ПодменюГруппаКнопок);
		ПодменюКнопка.ИмяКоманды	= ОписаниеКоманды.Команда;
		ПодменюКнопка.Заголовок		= Команды[ОписаниеКоманды.Команда].Заголовок;
		
	КонецЦикла;
	
КонецПроцедуры //Процедура УстановитьСписокКомандПодменюНаСервере(ОбластьОбработки)


&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовНаКлиенте(ПараметрыКоманды)
	
	Если ПараметрыКоманды = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	//	флажок, возле кнопки "Выполнить"
	Элементы.СОбнулением.Доступность 	= ПараметрыКоманды["Операция"]["Редактировать"];
		
	//	РЕСУРСЫ
	УстановитьВидимостьДоступностьЭлементовРесурсыНаКлиенте(ПараметрыКоманды);
	
	//	ПОПРАВКИ
	УстановитьВидимостьДоступностьЭлементовПоправкиНаКлиенте(ПараметрыКоманды);
	
	//	НАЧИСЛЕНИЯ
	УстановитьВидимостьДоступностьЭлементовНачисленияНаКлиенте(ПараметрыКоманды);
		
	//	ИНДЕКСЫ
	УстановитьВидимостьДоступностьЭлементовИндексыНаКлиенте(ПараметрыКоманды);
	
КонецПроцедуры //Процедура УстановитьВидимостьДоступностьЭлементовНаКлиенте(Действие)

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовРесурсыНаКлиенте(ПараметрыКоманды)
	
	// Флажок, возле кнопки "Выполнить"
	Элементы.СОбнулением.Доступность 				= ПараметрыКоманды["Операция"]["Редактировать"];
	
	// Доступность колонок
	Элементы.тзРесурсыЦенаБазисная.ТолькоПросмотр	= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзРесурсыЦенаЗМБазисная.ТолькоПросмотр	= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзРесурсыЦенаТекущая.ТолькоПросмотр	= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзРесурсыЦенаТекущаяЗМ.ТолькоПросмотр	= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	// Видимость колонки "пометка", т.к. при некоторых действиях работаем с выделенными строками, а не с отмеченными.
	Элементы.тзРесурсыПометка.Видимость 			= ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.ГруппаРесурсыФлажки.Видимость			= ПараметрыКоманды["Операция"]["Редактировать"];
	// Видимость колонки, для документа "Акт выполненных работ".
	Элементы.тзРесурсыРасходПоФакту.Видимость 		= ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот");
		
КонецПроцедуры //Процедура УстановитьВидимостьДоступностьЭлементовРесурсыНаКлиенте(Действие)

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовПоправкиНаКлиенте(ПараметрыКоманды)
	
	//	флажок, возле кнопки "Выполнить"
	Элементы.СОбнулением.Доступность 					= ПараметрыКоманды["Операция"]["Редактировать"];
	
	//	доступность колонок
	Элементы.тзПоправкиДобавЗМ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиДобавОЗ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиДобавПЗ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиДобавСМ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиДобавТМ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиДобавТР.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиДобавЭМ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиКоэффЗМ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиКоэффОЗ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиКоэффПЗ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиКоэффСМ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиКоэффТМ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиКоэффТР.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиКоэффЭМ.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиПрименить.ТолькоПросмотр			= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиВариантРасчета.ТолькоПросмотр	= НЕ ПараметрыКоманды["Операция"]["Редактировать"] И НЕ ПараметрыКоманды["Операция"]["Добавить"];

	//	доступность кнопок "Добавить"
	Элементы.ГруппаПоправкиДобавить.Доступность			= ПараметрыКоманды["Операция"]["Добавить"];
	
	//	запрет изменения состава строк
	Элементы.тзПоправки.ИзменятьСоставСтрок				= ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправки.АвтоВводНовойСтроки				= ПараметрыКоманды["Операция"]["Добавить"];
	
	Элементы.тзПоправкиУсловияПрименения.ТолькоПросмотр	= НЕ ПараметрыКоманды["Операция"]["Добавить"];
	Элементы.тзПоправкиОбоснование.ТолькоПросмотр		= НЕ ПараметрыКоманды["Операция"]["Добавить"];
//	Элементы.тзПоправкиВариантРасчета.ТолькоПросмотр	= НЕ ПараметрыКоманды["Операция"]["Добавить"];

КонецПроцедуры //Процедура УстановитьВидимостьДоступностьЭлементовПоправкиНаКлиенте(ПараметрыКоманды)

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовНачисленияНаКлиенте(ПараметрыКоманды)
	
	//	доступность колонок	
	Элементы.тзНачисленияЗначение.ТолькоПросмотр 	= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзНачисленияФормула.ТолькоПросмотр 	= НЕ ПараметрыКоманды["Операция"]["Редактировать"];

КонецПроцедуры //Процедура УстановитьВидимостьДоступностьЭлементовНачисленияНаКлиенте(ПараметрыКоманды)

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовИндексыНаКлиенте(ПараметрыКоманды)
	
	//	доступность колонок	
	Элементы.тзИндексыВариантПересчетаЭММ.ТолькоПросмотр 		= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзИндексыКоэффПолнСтоимРабот.ТолькоПросмотр 		= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзИндексыКоэффОснЗарплаты.ТолькоПросмотр 			= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзИндексыКоэффСтоимЭксплМашин.ТолькоПросмотр 		= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзИндексыКоэффСтоимЗарплатеМашин.ТолькоПросмотр 	= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзИндексыКоэффСтоимМатериалов.ТолькоПросмотр 		= НЕ ПараметрыКоманды["Операция"]["Редактировать"];
	Элементы.тзИндексыКоэффОборуд.ТолькоПросмотр 				= НЕ ПараметрыКоманды["Операция"]["Редактировать"];

	//	видимость колонок (индексы в зависимости от способа расчета).
	//Элементы.тзИндексыВариантПересчетаЭММ.Видимость 			= Параметры.ЭтоИндексыПоЭлементам;
	//Элементы.тзИндексыКоэффПолнСтоимРабот.Видимость 			= Параметры.ЭтоИндексыПоЭлементам;
	//Элементы.тзИндексыКоэффОснЗарплаты.Видимость 				= Параметры.ЭтоИндексыПоЭлементам;
	//Элементы.тзИндексыКоэффСтоимЭксплМашин.Видимость 			= Параметры.ЭтоИндексыПоЭлементам;
	//Элементы.тзИндексыКоэффСтоимЗарплатеМашин.Видимость 		= Параметры.ЭтоИндексыПоЭлементам;
	//Элементы.тзИндексыКоэффСтоимМатериалов.Видимость 			= Параметры.ЭтоИндексыПоЭлементам;
	//Элементы.тзИндексыКоэффОборуд.Видимость 					= Параметры.ЭтоИндексыПоЭлементам;
	
КонецПроцедуры //Процедура УстановитьВидимостьДоступностьЭлементовИндексыНаКлиенте(ПараметрыКоманды)

//	ОТБОР СТРОК (в табличных частях).

//&НаКлиенте
//Процедура УстановитьОтборСтрокНаКлиенте(СтрокаДерева = Неопределено)
//	
//	////	РЕСУРСЫ
//	//ТаблицаОтборСтрокНаКлиенте(Ресурсы, СтрокаДерева);
//	
//	////	ПОПРАВКИ
//	//ТаблицаОтборСтрокНаКлиенте(Поправки, СтрокаДерева);
//	//
//	////	НАЧИСЛЕНИЯ
//	//ТаблицаОтборСтрокНаКлиенте(Начисления, СтрокаДерева);
//	//
//	////	ИНДЕКСЫ
//	//ТаблицаОтборСтрокНаКлиенте(Индексы, СтрокаДерева);
//	//
//	////	СВОЙСТВА
//	//ТаблицаОтборСтрокНаКлиенте(Свойства, СтрокаДерева);
//	
//КонецПроцедуры //Процедура УстановитьОтборСтрокНаКлиенте(СтрокаДерева)

//&НаКлиенте
//Процедура ТаблицаОтборСтрокНаКлиенте(Таблица, СтрокаДерева)
//	
//	Для Каждого Идентификатор из СтрокаДерева.Идентификаторы Цикл
//		
//		НайденныеСтроки	= Таблица.НайтиСтроки(Новый Структура("Идентификатор", Идентификатор.Значение));
//		
//		Для Каждого Строка Из НайденныеСтроки Цикл
//			Строка.Выбран	= СтрокаДерева.Пометка;
//		КонецЦикла;
//			
//	КонецЦикла;
//
//КонецПроцедуры //Процедура ТаблицаОтборСтрокНаКлиенте(Таблица, СтрокаДерева)

//	ПУСТАЯ ТАБЛИЦА (отображение строки сообщения, в таблице).

&НаКлиенте
Процедура РесурсыОтобразитьПустуюТаблицуНаКлиенте()
	
	//
	Элементы.тзРесурсыГруппаПустаяТаблица.ОтображатьВШапке	= НЕ ТабличнаяЧастьРесурсы.Количество();
	
КонецПроцедуры //Процедура РесурсыОтобразитьПустуюТаблицуНаКлиенте()

&НаКлиенте
Процедура ПоправкиОтобразитьПустуюТаблицуНаКлиенте(ПараметрыКоманды = Неопределено)
	
	//
	Если ПараметрыКоманды = Неопределено Тогда
		ОтображатьПустуюТаблицу	= Истина;	
	Иначе
		ОтображатьПустуюТаблицу	= НЕ ПараметрыКоманды["Операция"]["Добавить"];
	КонецЕсли;
	
	//
	Элементы.тзПоправкиГруппаПустаяТаблица.ОтображатьВШапке	= 	ОтображатьПустуюТаблицу
																И НЕ ТабличнаяЧастьПоправки.Количество();
	
КонецПроцедуры //Процедура ПоправкиОтобразитьПустуюТаблицуНаКлиенте()

&НаКлиенте
Процедура НачисленияОтобразитьПустуюТаблицуНаКлиенте()
	
	//
	Элементы.тзНачисленияГруппаПустаяТаблица.ОтображатьВШапке	= НЕ ТабличнаяЧастьНачисления.Количество();
	
КонецПроцедуры //Процедура НачисленияОтобразитьПустуюТаблицуНаКлиенте()

&НаКлиенте
Процедура ИндексыОтобразитьПустуюТаблицуНаКлиенте()
	
	//
	Элементы.тзИндексыГруппаПустаяТаблица.ОтображатьВШапке	= НЕ ТабличнаяЧастьИндексы.Количество();
	
КонецПроцедуры //Процедура ИндексыОтобразитьПустуюТаблицуНаКлиенте()

&НаКлиенте
Процедура СвойстваОтобразитьПустуюТаблицуНаКлиенте()
	
	//
	Элементы.тзСвойстваГруппаПустаяТаблица.ОтображатьВШапке	= НЕ ТабличнаяЧастьСвойства.Количество();
	
КонецПроцедуры //Процедура СвойстваОтобразитьПустуюТаблицуНаКлиенте()

#КонецОбласти //#Область Отображение

//	Заполнение параметров формы.
#Область Параметры

&НаСервере
Процедура УстановитьПараметрыНаСервере(ВыбранноеЗначение = Неопределено)
	
	//
	Параметры["СодержитБазисноИндексныйУровеньРасценка"]	= СодержитБазисноИндексныйУровеньРасценка(ВыбранноеЗначение);
	Параметры["СодержитБазисноИндексныйУровеньРаздел"]		= СодержитБазисноИндексныйУровеньРаздел(ВыбранноеЗначение);
	Параметры["СодержитИндексыПоЭлементам"]					= СодержитИндексыПоЭлементам(ВыбранноеЗначение);
	Параметры["СодержитФайлСборникаТекущихЦен"]				= СодержитФайлСборникаТекущихЦен(ВыбранноеЗначение);

	Параметры["ЭтоОбработкаАктаВыполненныхРабот"]			= ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот");
	Параметры["ЭтоОбработкаСводнойСметы"]					= ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_СводнаяСмета");
	Параметры["ЭтоОбработкаОбъектнойСметы"]					= ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета");
	Параметры["ЭтоОбработкаЛокальнойСметы"]					= ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета");
	
	//
	Если НЕ ЗначениеЗаполнено(Параметры["ПоУмолчаниюОбластьОбработки"]) Тогда
		//Параметры["ПоУмолчаниюОбластьОбработки"]			= "РАСЦЕНКИ";	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры["ПоУмолчаниюДействие"]) Тогда
		//Параметры["ПоУмолчаниюДействие"]					= "Перенести";	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры["ПоУмолчаниюОтбор"]) Тогда
	КонецЕсли;
	
	//	Текущий документ, определит внешний вид обработки по умолчанию.
	Если ЗначениеЗаполнено(Параметры["ТекущийДокумент"]) Тогда
		//Параметры["ТекущийДокумент"] = Документы.СМ_ЛокальнаяСмета.ПустаяСсылка();
		Документ = Параметры.ТекущийДокумент; 
		Если Параметры.ЭтоОбработкаЛокальнойСметы Тогда
			Стройка = Документ.Стройка;
		КонецЕсли;
	КонецЕсли;
	
	//
	Параметры.АвтоматическиОбновлятьТабличнуюЧасть			= Истина;
	
	//	Ограничить доступ к обработке, если выбрана "Локальная мета" и по ней есть акты выполненных работ.
	Параметры.ЕстьАктыВыполненныхРабот						= СМ_УчетВыполненныхРаботСервер.СуществуютАктыПоСмете(Параметры.ТекущийДокумент);
	
КонецПроцедуры //Процедура УстановитьПараметрыНаСервере(ВыбранноеЗначение = Неопределено)

&НаКлиенте
Процедура УстановитьПараметрыОбрабатываемыеЭлементыНаКлиенте(ПараметрыОбработки = Неопределено)
	
	//	Необходимо определить поведение алгоритмов.
	УстановитьПараметрыПринадлежитНаКлиенте(ПараметрыОбработки);
		
	//	Необходимо запретить переносить позиции (без родителей), в сметы.
	Параметры["ЕстьПозицииБезБыбранногоРаздела"]	= ЕстьПозицииБезБыбранногоРазделаНаКлиенте();
	
	//	Нужно, для проверки доступности обработки команды.
	УстановитьПараметрыОперацияНаКлиенте();	
	
КонецПроцедуры //Процедура УстановитьПараметрыОбрабатываемыеЭлементыНаКлиенте(ПараметрыОбработки = Неопределено)


&НаКлиенте
Процедура УстановитьПараметрыОперацияНаКлиенте()
	
	//
	ОбрабатываемыеОбъектныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ОбъектнаяСмета")), Истина));
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")), Истина));
	ОбрабатываемыеРазделы			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина));
	ОбрабатываемыеПозиции			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
		
	//	нужно, для проверки доступности обработки команды
	Если ОбрабатываемыеОбъектныеСметы.Количество() Тогда
		Параметры["Операция"]	= "ОбработкаОбъектнойСметы";	//	для документов с типом "Сводная смета"
	ИначеЕсли ОбрабатываемыеЛокальныеСметы.Количество() Тогда
		Параметры["Операция"]	= "ОбработкаЛокальнойСметы"; 	//	для документов с типом "Сводная смета", "Объектная смета"
	ИначеЕсли ОбрабатываемыеРазделы.Количество() Тогда
		Параметры["Операция"]	= "ОбработкаРаздела"; 			//	для документов с типом "Локальная смета"
	ИначеЕсли ОбрабатываемыеПозиции.Количество() Тогда
		Параметры["Операция"]	= "ОбработкаПозиции";			//	для документов с типом "Локальная смета"
	КонецЕсли;

КонецПроцедуры //Процедура УстановитьПараметрыОперацияНаКлиенте()

&НаКлиенте
Процедура УстановитьПараметрыПринадлежитНаКлиенте(ПараметрыОбработки)
	
	//
	Параметры["ПринадлежатОднойОбъектнойСмете"]	= ПараметрыОбработки["ВладельцыОбъектныеСметы"].Количество()=1;
	Параметры["ПринадлежатОднойЛокальнойСмете"]	= ПараметрыОбработки["ВладельцыЛокальныеСметы"].Количество()=1;
	Параметры["ПринадлежатОдномуРазделу"]		= ПараметрыОбработки["ВладельцыРазделы"].Количество()=1;

КонецПроцедуры //Процедура УстановитьПараметрыПринадлежитНаКлиенте(ПараметрыОбработки)

&НаКлиенте
Функция ЕстьПозицииБезБыбранногоРазделаНаКлиенте()
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	Для Каждого ОбрабатываемаяПозиция Из ОбрабатываемыеПозиции Цикл
		
		//	Массив
		ПозицияВложена			= Ложь;
		ОбрабатываемыеРазделы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")), Истина));
		
		//	Если выбран раздел, для обрабатываемой позиции.
		Для Каждого ОбрабатываемыйРаздел Из ОбрабатываемыеРазделы Цикл
			Если ОбрабатываемыйРаздел["СсылкаНаОбъект"] = ОбрабатываемаяПозиция["Родитель"] Тогда
				ПозицияВложена	= Истина;
				Прервать;	
			КонецЕсли;
		КонецЦикла;
		
		//
		Если НЕ ПозицияВложена Тогда
			Возврат Истина;
			Прервать;	
		КонецЕсли;
		
	КонецЦикла;
	
	//
	Возврат Ложь;
	
КонецФункции //Функция ЕстьПозицииБезБыбранногоРазделаНаКлиенте()


&НаСервере
Процедура СформироватьПараметрыОбновленияНаСервере(ПараметрыОбновления)
	
	Если ПараметрыОбновления = Неопределено Тогда
		ПараметрыОбновления = Новый Структура;
	КонецЕсли;
	
	ПараметрыОбновления.Вставить("ОтображатьПрефиксы"	, ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ОтображатьПрефиксы",Ложь));
	ПараметрыОбновления.Вставить("Вид"					, "ГрупповаяОбработкаПозиций");
		
КонецПроцедуры //Процедура СформироватьПараметрыОбновленияНаСервере(ПараметрыОбновления)

&НаКлиенте
Функция СформироватьПараметрыОбработкиНаКлиенте(ПараметрыОбработки = Неопределено)
	
	//
	Если ПараметрыОбработки = Неопределено Тогда
		ПараметрыОбработки	= Новый Структура;	
	КонецЕсли;
	
	//	ВладельцыСводныеСметы
	Если НЕ ПараметрыОбработки.Свойство("ВладельцыСводныеСметы") Тогда
		ПараметрыОбработки.Вставить("ВладельцыСводныеСметы", Новый Массив);
	КонецЕсли;
	
	//	ВладельцыСводныеСметы
	Если НЕ ПараметрыОбработки.Свойство("ВладельцыОбъектныеСметы") Тогда
		ПараметрыОбработки.Вставить("ВладельцыОбъектныеСметы", Новый Массив);
	КонецЕсли;
	
	//	ВладельцыСводныеСметы
	Если НЕ ПараметрыОбработки.Свойство("ВладельцыЛокальныеСметы") Тогда
		ПараметрыОбработки.Вставить("ВладельцыЛокальныеСметы", Новый Массив);
	КонецЕсли;
	
	//	ВладельцыСводныеСметы
	Если НЕ ПараметрыОбработки.Свойство("ВладельцыРазделы") Тогда
		ПараметрыОбработки.Вставить("ВладельцыРазделы", Новый Массив);
	КонецЕсли;
	
	//
	Возврат ПараметрыОбработки;
	
КонецФункции //Функция СформироватьПараметрыОбработкиНаКлиенте(ПараметрыОбработки = Неопределено)

//
//
//	Параметры:
//
//	СсылкаНаОбъект	- ДокументСсылка.СМ_РазделЛокальнойСметы, ДокументСсылка.СМ_ПозицияЛокальнойСметы	- 
//	Родитель		- 
//	ЛокальнаяСмета	-
//	Операция		-
//	Разделы			-
//
&НаСервере
Функция ПолучитьПараметрыСменыРодителяНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование = Ложь)
	
	//
	Структура		= Новый Структура("ЛокальнаяСмета, Родитель, Владелец");
	
	//	1. Определим, какой локальной смете, принадлежит документ (копируемый, перемещаемый).
	ЛокальнаяСмета	= ПолучитьПараметрыСменыРодителяЛокальнаяСметаНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование);
	
	//	2. Определим родителя раздела/позиции.
	Родитель		= ПолучитьПараметрыСменыРодителяРодительНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование);	
	
	//	3. Определи владельца, привязанной позиции.
	Владелец		= ПолучитьПараметрыСменыРодителяВладелецНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование);
	
	Структура.Вставить("ЛокальнаяСмета"	, ЛокальнаяСмета);
	Структура.Вставить("Родитель"		, Родитель);
	Структура.Вставить("Владелец"		, Владелец);

	//
	Возврат Структура;
	
КонецФункции //Функция ПолучитьПараметрыСменыРодителяНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование = Ложь)

//
//
//	Параметры:
//
//	СсылкаНаОбъект	- ДокументСсылка.СМ_РазделЛокальнойСметы, ДокументСсылка.СМ_ПозицияЛокальнойСметы	- 
//	Родитель		- 
//	ЛокальнаяСмета	-
//	Операция		-
//	Разделы			-
//
&НаСервере
Функция ПолучитьПараметрыСменыРодителяЛокальнаяСметаНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование = Ложь)
	
	//
	Если ЭтоКопирование Тогда
		
		//
		Структура	= Неопределено;
		
		//
		Если ОбрабатываемРодительскийЭлементНаСервере(СсылкаНаОбъект, Структура) Тогда
			
			//	1. если переносим элемент корня
			
			Если ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
				//	1. локальная смета приемника
				Возврат ЭлементПриемник.ИДСметы;
			ИначеЕсли ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
				//	2. сама локальная смета
				Возврат ЭлементПриемник;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
			
		Иначе
			
			//	2. если переносим вложенный элемент	
			
			Если ТипЗнч(Структура["СтрокаДерева"]["СсылкаНаОбъект"]) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
				Возврат Структура["СтрокаДерева"]["Копия"];
			Иначе
				Возврат Структура["СтрокаДерева"]["Копия"].ИДСметы;
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Если ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
			//	1. локальная смета приемника
			Возврат ЭлементПриемник.ИДСметы;
		ИначеЕсли ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
			//	2. сама локальная смета
			Возврат ЭлементПриемник;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции //Функция ПолучитьПараметрыСменыРодителяЛокальнаяСметаНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование = Ложь)

//
//
//	Параметры:
//
//	СсылкаНаОбъект	- ДокументСсылка.СМ_РазделЛокальнойСметы, ДокументСсылка.СМ_ПозицияЛокальнойСметы	- 
//	Родитель		- 
//	ЛокальнаяСмета	-
//	Операция		-
//	Разделы			-
//
&НаСервере
Функция ПолучитьПараметрыСменыРодителяРодительНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование = Ложь)
	
	//	Заполняем структуру, в следующей функции.
	Структура	= Новый Структура();
	ЭтоВложение	= НЕ ОбрабатываемРодительскийЭлементНаСервере(СсылкаНаОбъект, Структура);
	
	//
	Если ЭтоВложение Тогда
		
		Если ЭтоКопирование Тогда
			
			Если Структура["СтрокаДерева"] = Неопределено Тогда
				Возврат ЭлементПриемник;	
			Иначе
				Возврат Структура["СтрокаДерева"]["Копия"];	
			КонецЕсли;
			
		Иначе
			Возврат СсылкаНаОбъект.ИДРодителя;
		КонецЕсли;
			
	Иначе
		
		Возврат ЭлементПриемник;
	
	КонецЕсли;

КонецФункции //Функция ПолучитьПараметрыСменыРодителяРодительНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование = Ложь)

//
//
//	Параметры:
//
//	СсылкаНаОбъект	- ДокументСсылка.СМ_РазделЛокальнойСметы, ДокументСсылка.СМ_ПозицияЛокальнойСметы	- 
//	Родитель		- 
//	ЛокальнаяСмета	-
//	Операция		-
//	Разделы			-
//
&НаСервере
Функция ПолучитьПараметрыСменыРодителяВладелецНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование = Ложь)
	
	//	Привязанными, могут быть только позиции.
	Если НЕ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		Возврат Документы.СМ_ПозицияЛокальнойСметы.ПустаяСсылка();	
	КонецЕсли;
	
	//
	ТаблицаЗначенийОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	СтрокаПозиция		= ТаблицаЗначенийОбрабатываемыеПозиции.Найти(СсылкаНаОбъект.ИДПозицииВладельца, "СсылкаНаОбъект");
	КопируемВладельца	= НЕ (СтрокаПозиция = Неопределено);
		
	//
	Если КопируемВладельца Тогда
		
		Возврат СтрокаПозиция["Копия"];
			
	Иначе
		
		Возврат Документы.СМ_ПозицияЛокальнойСметы.ПустаяСсылка();
	
	КонецЕсли;

КонецФункции //Функция ПолучитьПараметрыСменыРодителяВладелецНаСервере(СсылкаНаОбъект, ЭлементПриемник, ЭтоКопирование = Ложь)

//
&НаСервере
Функция ОбрабатываемРодительскийЭлементНаСервере(СсылкаНаОбъект, Структура = Неопределено)
	
	//	(!) проверим, если переносим родительский элемент, значит у данного элемента родитель - не изменится.
	
	//
	ТаблицаЗначений	= ОбрабатываемыеЭлементы.Выгрузить(Новый Структура("УчастиеПометка", Истина));
	
	//
	СтрокаДерева	= ТаблицаЗначений.Найти(СсылкаНаОбъект.ИДРодителя, "СсылкаНаОбъект");
	
	//
	Структура	= Новый Структура("СтрокаДерева");
	Структура.Вставить("СтрокаДерева", СтрокаДерева);
		
	//
	Возврат (СтрокаДерева = Неопределено);
	
КонецФункции //Функция ОбрабатываемРодительскийЭлементНаСервере(СсылкаНаОбъект, Структура = Неопределено)

#КонецОбласти //#Область Параметры

// Предупреждающие надписи, проверка соблюдения условий.
#Область ОповещениеПользователя

// Предупреждение, дальнейшие действия не возможны
&НаСервере
Функция СМ_ДоступнаОбработкаДокументаНаСервере(ВыбранноеЗначение, ТекстПредупреждения)
	
	Если ВыбранноеЗначение = Тип("ДокументСсылка.СМ_СводнаяСмета") тогда
		
		ТекстПредупреждения		= НСтр("ru = 'Обработка данного типа документа - в разработке!'");
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот")
		И ТипЗнч(ВыбранноеЗначение) = Тип("СтрокаГруппировкиДинамическогоСписка") тогда
		
		ТекстПредупреждения		= НСтр("ru = 'Необходимо выбрать акт выполненных работ!'");
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
	// Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
	//	И СМ_УчетВыполненныхРаботСервер.СуществуютАктыПоСмете(ВыбранноеЗначение) тогда
	//	
	//	ТекстПредупреждения		= НСтр("ru = 'По локальной смете, уже имеются акты выполненных работ! Действие недоступно.'");
	//	
	//	Возврат ЛОЖЬ;
	//	
	// КонецЕсли;
	
	Возврат ИСТИНА;
	
КонецФункции //Функция СМ_ДоступнаОбработкаДокументаНаСервере(ВыбранноеЗначение, ТекстПредупреждения)

&НаКлиенте
Функция СМ_ДоступнаОбработкаНаКлиенте(Команда, Тип = "", Идентификаторы = Неопределено)

	//
	ДоступнаОбработкаКоманды	= Истина;
	ТекстПредупреждения			= НСтр("ru='Обработка команды, не возможна!';");
	
	//	заполнить таблицы, отмеченными элементами и заполнить параметры формы
	ОтобратьОтмеченныеЭлементыНаКлиенте(Идентификаторы);
	
	//	проверка, есть ли данные для обработки
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		ДоступнаОбработкаКоманды		= Ложь;
	КонецЕсли;
	
	//	проверка, есть ли отмеченные элементы
	Если НетОтмеченныхЭлементовНаКлиенте() Тогда
		ДоступнаОбработкаКоманды		= Ложь;
		ТекстПредупреждения				= НСтр("ru='Нет отмеченных элементов!';");
	КонецЕсли;	
	
	//	попытка перенести позицию, в корень локальной сметы
	Если (Параметры["Операция"] = "ОбработкаРаздела" ИЛИ Параметры["Операция"] = "ОбработкаПозиции")
		И НЕ Параметры["ПринадлежатОднойЛокальнойСмете"] Тогда
		ДоступнаОбработкаКоманды		= Ложь;
		ТекстПредупреждения				= НСтр("ru='Для данной операции, необходимо сделать выбор, из одной локальной сметы!';");
	КонецЕсли;
	
	//
	Если ДоступнаОбработкаКоманды Тогда
		Возврат Истина;
	Иначе
		ПоказатьПредупреждение(Новый ОписаниеОповещения("НеДоступнаОбработкаКомандыНаКлиенте", ЭтаФорма), ТекстПредупреждения,, "Обработка команды """ + Команда.Имя + """");
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //Функция СМ_ДоступнаОбработкаНаКлиенте(Команда, Тип = "", Идентификаторы = Неопределено)

&НаКлиенте
Функция СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда, Идентификаторы = Неопределено, ПараметрыРасчета = Неопределено)
	
	//
	ДоступнаОбработкаКоманды	= Истина;
	ТекстПредупреждения			= НСтр("ru='Обработка команды, не возможна!';");
	//	имя команды, разобранное в структуру 
	ПараметрыКоманды				= ПолучитьПараметрыКомандыНаКлиенте(Команда);
	
	//	заполнить таблицы, отмеченными элементами и заполнить параметры формы
	ОтобратьОтмеченныеЭлементыНаКлиенте(Идентификаторы);
	
	//	параметры расчета
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ПараметрыРасчета				= СМ_ПолучитьПараметрыРасчетаНаКлиенте(ОбрабатываемаяЛокальнаяСмета);
	
	//
	Если НЕ Параметры.ЭтоОбработкаАктаВыполненныхРабот Тогда
		ДоступнаОбработкаКоманды		= Ложь;
	КонецЕсли;
	
	//
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		ДоступнаОбработкаКоманды		= Ложь;
	КонецЕсли;
	
	//	проверка, есть ли отмеченные элементы
	Если НетОтмеченныхЭлементовНаКлиенте() Тогда
		ДоступнаОбработкаКоманды		= Ложь;
		ТекстПредупреждения				= НСтр("ru='Нет отмеченных элементов!';");
	КонецЕсли;	
	
	//
	Если ПараметрыКоманды["Тип"] = "РЕСУРСЫ" Тогда
		Если НЕ СМ_ДоступнаОбработкаРесурсыНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения, ПараметрыРасчета) Тогда
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	ИначеЕсли ПараметрыКоманды["Тип"] = "ИНДЕКСЫ" Тогда
		Если НЕ СМ_ДоступнаОбработкаИндексыНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения) Тогда	
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//
	Если ДоступнаОбработкаКоманды Тогда
		Возврат Истина;
	Иначе
		ПоказатьПредупреждение(Новый ОписаниеОповещения("НеДоступнаОбработкаКомандыНаКлиенте", ЭтаФорма), ТекстПредупреждения);
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //Функция СМ_ДоступнаОбработкаАктВыполненныхРаботНаКлиенте(Команда, Тип = "")

&НаКлиенте
Функция СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда, Идентификаторы = Неопределено, ПараметрыРасчета = Неопределено)

	//
	ДоступнаОбработкаКоманды		= Истина;
	ТекстПредупреждения				= НСтр("ru='Обработка команды, не возможна!';");
	КомандаЗаголовок				= ПолучитьСвойствоКомандыДействиеНаКлиенте(Команда.Имя, "Заголовок");
	//	имя команды, разобранное в структуру 
	ПараметрыКоманды				= ПолучитьПараметрыКомандыНаКлиенте(Команда);
	
	//	заполнить таблицы, отмеченными элементами и заполнить параметры формы
	ОтобратьОтмеченныеЭлементыНаКлиенте(Идентификаторы,ПараметрыКоманды);
	
	//	параметры расчета
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ПараметрыРасчета				= СМ_ПолучитьПараметрыРасчетаНаКлиенте(ОбрабатываемаяЛокальнаяСмета);
	
	//	(!) ДЛЯ ПРОГРАММИСТА, проверим, что правильно используем функцию
	Если НЕ Параметры.ЭтоОбработкаОбъектнойСметы Тогда
		ДоступнаОбработкаКоманды		= Ложь;
	КонецЕсли;
	
	//	проверка, есть ли данные для обработки
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		ДоступнаОбработкаКоманды		= Ложь;
	КонецЕсли;
	
	//	проверка, есть ли отмеченные элементы
	Если НетОтмеченныхЭлементовНаКлиенте() Тогда
		ДоступнаОбработкаКоманды		= Ложь;
		ТекстПредупреждения				= НСтр("ru='Нет отмеченных элементов!';");
	КонецЕсли;	
	
	//	попытка перенести позицию, в корень локальной сметы
	Если ПараметрыКоманды["Операция"]["Перенести"]
		ИЛИ ПараметрыКоманды["Операция"]["Копировать"] Тогда
		Если (Параметры["Операция"] = "ОбработкаРаздела" ИЛИ Параметры["Операция"] = "ОбработкаПозиции")
			И НЕ Параметры["ПринадлежатОднойЛокальнойСмете"] Тогда
			ДоступнаОбработкаКоманды	= Ложь;
			ТекстПредупреждения			= НСтр("ru='Для данной операции, необходимо сделать выбор, из одной локальной сметы!';");
		КонецЕсли;
	КонецЕсли;
	
	//	проверка, для табличных частей
	Если ПараметрыКоманды["Тип"] = "РЕСУРСЫ" Тогда
		Если НЕ СМ_ДоступнаОбработкаРесурсыНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения, ПараметрыРасчета) Тогда
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	ИначеЕсли ПараметрыКоманды["Тип"] = "ПОПРАВКИ" Тогда
		Если НЕ СМ_ДоступнаОбработкаПоправкиНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения) Тогда
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	ИначеЕсли ПараметрыКоманды["Тип"] = "НАЧИСЛЕНИЯ" Тогда
		Если НЕ СМ_ДоступнаОбработкаНачисленияНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения) Тогда
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	ИначеЕсли ПараметрыКоманды["Тип"] = "ИНДЕКСЫ" Тогда
		Если НЕ СМ_ДоступнаОбработкаИндексыНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения) Тогда	
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	КонецЕсли;
	
	//	попытка перенести позицию, в корень локальной сметы
	
	//
	Если ДоступнаОбработкаКоманды Тогда
		Возврат Истина;
	Иначе
		ПоказатьПредупреждение(Новый ОписаниеОповещения("НеДоступнаОбработкаКомандыНаКлиенте", ЭтаФорма), ТекстПредупреждения,, "Обработка команды """ + КомандаЗаголовок + """");
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции //Функция СМ_ДоступнаОбработкаОбъектнаяСметаНаКлиенте(Команда, Тип = "", Идентификаторы = Неопределено)

&НаКлиенте
Функция СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда, Идентификаторы = Неопределено, ПараметрыРасчета = Неопределено)
	
	//
	ДоступнаОбработкаКоманды		= Истина;
	ТекстПредупреждения				= НСтр("ru='Обработка команды, не возможна!';");
	КомандаЗаголовок				= ПолучитьСвойствоКомандыДействиеНаКлиенте(Команда.Имя, "Заголовок");
	//	имя команды, разобранное в структуру 
	ПараметрыКоманды				= ПолучитьПараметрыКомандыНаКлиенте(Команда);
	
	//	Заполнить таблицы, отмеченными элементами и заполнить параметры формы.
	ОтобратьОтмеченныеЭлементыНаКлиенте(,ПараметрыКоманды);
	
	//	параметры расчета
	ОбрабатываемаяЛокальнаяСмета	= ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте();
	ПараметрыРасчета				= СМ_ПолучитьПараметрыРасчетаНаКлиенте(ОбрабатываемаяЛокальнаяСмета);
	
	//
	Если НЕ Параметры.ЭтоОбработкаЛокальнойСметы Тогда
		ДоступнаОбработкаКоманды		= Ложь;
	КонецЕсли;
	
	//
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		ДоступнаОбработкаКоманды		= Ложь;
	КонецЕсли;
	
	//
	Если НетОтмеченныхЭлементовНаКлиенте() Тогда
		ДоступнаОбработкаКоманды		= Ложь;
		ТекстПредупреждения				= НСтр("ru='Нет отмеченных элементов!';");
	КонецЕсли;
	
	//	Индивидуальная проверка.
	Если ПараметрыКоманды["Тип"] = "РЕСУРСЫ" Тогда
		Если НЕ СМ_ДоступнаОбработкаРесурсыНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения, ПараметрыРасчета) Тогда
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	ИначеЕсли ПараметрыКоманды["Тип"] = "ПОПРАВКИ" Тогда
		Если НЕ СМ_ДоступнаОбработкаПоправкиНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения) Тогда
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	ИначеЕсли ПараметрыКоманды["Тип"] = "НАЧИСЛЕНИЯ" Тогда
		Если НЕ СМ_ДоступнаОбработкаНачисленияНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения) Тогда
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	ИначеЕсли ПараметрыКоманды["Тип"] = "ИНДЕКСЫ" Тогда
		Если НЕ СМ_ДоступнаОбработкаИндексыНаКлиенте(Команда, ПараметрыКоманды["Операция"], ТекстПредупреждения) Тогда	
			ДоступнаОбработкаКоманды	= Ложь;
		КонецЕсли;
	КонецЕсли;
	
	
	//
	Если ДоступнаОбработкаКоманды Тогда
		Возврат Истина;
	Иначе
		
		ПоказатьПредупреждение(Новый ОписаниеОповещения("НеДоступнаОбработкаКомандыНаКлиенте", ЭтаФорма), ТекстПредупреждения,, "Обработка команды """ + КомандаЗаголовок + """");
		Возврат Ложь;
			
	КонецЕсли;	
	
КонецФункции //Функция СМ_ДоступнаОбработкаЛокальнаяСметаНаКлиенте(Команда, Тип = "", Операция = "")

#Область Расценки

Функция СМ_ДоступнаОбработкаПеренестиКопироватьНаКлиенте(ЭлементПриемник, ТекстПредупреждения = "")

	//
	ДоступнаОбработкаКоманды	= Истина;
	
	//
	Если ЭлементПриемник = Неопределено Тогда
		//	отмена действия
	ИначеЕсли ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		
		ДоступнаОбработкаКоманды	= Ложь;
		ТекстПредупреждения			= НСтр("ru='Позиция, не может быть родителем!';");
		
	ИначеЕсли (Параметры["Операция"] = "ОбработкаРаздела" ИЛИ Параметры["Операция"] = "ОбработкаПозиции") Тогда
		
		Если ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета")
			И Параметры["ЕстьПозицииБезБыбранногоРаздела"] Тогда
		
			ДоступнаОбработкаКоманды	= Ложь;
			ТекстПредупреждения			= НСтр("ru='Есть отмеченные позиции, которые нельзя переносить в локальную смету!';");
			
		ИначеЕсли ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
			
			ДоступнаОбработкаКоманды	= Ложь;
			ТекстПредупреждения			= НСтр("ru='Разделы/позиции, нельзя переносить в объектную смету!';");
			
		ИначеЕсли ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда	
			
			ДоступнаОбработкаКоманды	= Ложь;
			ТекстПредупреждения			= НСтр("ru='Разделы/позиции, нельзя переносить в сводную смету!';");
	
		КонецЕсли;
		
	ИначеЕсли Параметры["Операция"] = "ОбработкаЛокальнойСметы"
		И ТипЗнч(ЭлементПриемник) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		
		ДоступнаОбработкаКоманды	= Ложь;
		ТекстПредупреждения			= НСтр("ru='Локальную смету, нельзя переносить в другую локальную смету!';");
		
	КонецЕсли;
	
	//
	Возврат ДоступнаОбработкаКоманды;
	
КонецФункции //Функция СМ_ДоступнаОбработкаПеренестиКопироватьНаКлиенте(ТекстПредупреждения = "")

#КонецОбласти //#Область Расценки/#Область ОповещениеПользователя

#Область Ресурсы

&НаКлиенте
Функция СМ_ДоступнаОбработкаРесурсыНаКлиенте(Команда, Операция, ТекстПредупреждения = "", ПараметрыРасчета = Неопределено)
	
	//
	ДоступнаОбработкаКоманды	= Истина;
	ОбрабатываемыеРесурсы		= ПолучитьОбрабатываемыеРесурсыНаКлиенте();	
	ТекстПредупреждения			= НСтр("ru='Ошибка! При попытке обработки команды.';");
	
	//
	Если НЕ ОбрабатываемыеРесурсы.Количество() Тогда
		ДоступнаОбработкаКоманды		= Ложь;
		ТекстПредупреждения				= НСтр("ru='Не выделена строка, с обрабатываемым ресурсом!';");
	КонецЕсли;
	
	////	проверим текущие данные дерева значений
	//Для Каждого Строка Из ОбрабатываемыеРесурсы Цикл
	//	
	//	Если Строка.ЭтоНеучтенный
	//		ИЛИ Строка.ЭтоОборудование Тогда
	//		ДоступнаОбработкаКоманды	= Ложь;
	//		ТекстПредупреждения			= НСтр("ru='Возможна обработка, только учтенных ресурсов, а не отдельных сметных позиций!';");
	//		Прервать;	
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	//	
	Если Операция["ВБ"] Тогда
		Если Не ЗначениеЗаполнено(ПараметрыРасчета.ФайлСборникаТекущихЦен) Тогда
			ДоступнаОбработкаКоманды	= Ложь;
			ТекстПредупреждения			= НСтр("ru='Не выбран, сборник текущих цен!';");
		КонецЕсли;
	КонецЕсли;
	
	//	проверим, есть ли отредактированные цены
	Если Операция["Редактировать"] Тогда
		Если НЕ ТабличнаяЧастьРесурсы.НайтиСтроки(Новый Структура("Модифицированность", Истина)).Количество() Тогда
		    ДоступнаОбработкаКоманды	= Ложь;
			ТекстПредупреждения			= НСтр("ru='Нет изменений в ценах'");
		КонецЕсли;
	КонецЕсли;
	
	//
	Возврат ДоступнаОбработкаКоманды;
	
КонецФункции //Функция СМ_ДоступнаОбработкаРесурсыНаКлиенте(Команда, Операция, ТекстПредупреждения = "", ПараметрыРасчета = Неопределено)

#КонецОбласти //#Область Ресурсы/#Область ОповещениеПользователя

#Область ТабличнаяЧастьПоправки

//
//
&НаКлиенте
Функция СМ_ДоступнаОбработкаПоправкиНаКлиенте(Команда, Операция, ТекстПредупреждения = "")
	
	//
	ДоступнаОбработкаКоманды	= Истина;
	
	Если Операция["Редактировать"] Тогда
		ДоступнаОбработкаКоманды	= СМ_ДоступнаОбработкаПоправкиРедактироватьНаКлиенте(Команда, ТекстПредупреждения);
	КонецЕсли;
		
	//
	Возврат ДоступнаОбработкаКоманды;
	
КонецФункции //Функция СМ_ДоступнаОбработкаПоправкиНаКлиенте(Команда, Операция, ТекстПредупреждения = "")

//
//
&НаКлиенте
Функция СМ_ДоступнаОбработкаПоправкиРедактироватьНаКлиенте(Команда, ТекстПредупреждения = "")
	
	//
	Если НЕ ТабличнаяЧастьПоправки.НайтиСтроки(Новый Структура("Модифицированность", Истина)).Количество() Тогда
		
		ТекстПредупреждения		= НСтр("ru='Нет изменений в поправках'");
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции //Функция СМ_ДоступнаОбработкаПоправкиРедактироватьНаКлиенте(Команда, ТекстПредупреждения = "")

#КонецОбласти //#Область Поправки/#Область ОповещениеПользователя

#Область ТабличнаяЧастьНачисления

&НаКлиенте
Функция СМ_ДоступнаОбработкаНачисленияНаКлиенте(Команда, Операция, ТекстПредупреждения = "")
	
	//
	ДоступнаОбработкаКоманды	= Истина;
	
	//
	Возврат ДоступнаОбработкаКоманды;
	
КонецФункции //Функция СМ_ДоступнаОбработкаНачисленияНаКлиенте(Команда, Операция, ТекстПредупреждения = "")

#КонецОбласти //#Область Начисления/#Область ОповещениеПользователя

#Область ТабличнаяЧастьИндексы

// Проверяем отмеченные позиции на возможность выполнения операций, если что то не подходит, возвращаем ложь.
//
&НаКлиенте
Функция СМ_ДоступнаОбработкаИндексыНаКлиенте(Команда, Операция, ТекстПредупреждения = "")
	
	ДоступнаОбработкаКоманды	= Истина;
	ОбрабатываемыеПозиции		= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	Если Операция["Редактировать"] Тогда
		
		//	Нет отмеченных
		НайденныеИндексы = ТабличнаяЧастьИндексы.НайтиСтроки(Новый Структура("Пометка", Истина));
		Если НЕ НайденныеИндексы.Количество() Тогда
			ТекстПредупреждения			= НСтр("ru='Нет отмеченных индексов'");
			Возврат Ложь;
		КонецЕсли;          
		
		//	Нет изменений
		НайденныеИндексы = ТабличнаяЧастьИндексы.НайтиСтроки(Новый Структура("Модифицированность", Истина));
		Если НЕ НайденныеИндексы.Количество() Тогда
			ТекстПредупреждения			= НСтр("ru='Нет изменений в значениях и формулах'");
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	// Для уровня индексов "Раздел".
	// Проверка чтобы был отмечен раздел по выбранным позициям.
	Для Каждого ОтмеченнаяПозиция Из ОбрабатываемыеПозиции Цикл
		
		НаименованиеПозиции	= ЭлементыДеревоЗначений.НайтиПоИдентификатору(ОтмеченнаяПозиция["Идентификатор"]).Наименование; //
		
		НайденныеРазделы = ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("СсылкаНаОбъект", ОтмеченнаяПозиция.Родитель));
		Если НЕ НайденныеРазделы.Количество() Тогда
			ТекстПредупреждения			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Уровень применения индексов не позволяет изменять индексы по выбранным позициям: ""%1"".'"), НаименованиеПозиции);	
			ДоступнаОбработкаКоманды	= Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДоступнаОбработкаКоманды;
	
КонецФункции //Функция СМ_ДоступнаОбработкаИндексыНаКлиенте(Команда, Операция, ТекстПредупреждения = "")

#КонецОбласти //#Область Индексы/#Область ОповещениеПользователя

//	СОБЫТИЕ (после показа предупреждения)

//
//
&НаКлиенте
Процедура НеДоступнаОбработкаКомандыНаКлиенте(ПараметрыОповещения) Экспорт
	
	Текст = "Заглушка для оповещения";
	
КонецПроцедуры

#Область ДоступнаСменаКоманды

&НаКлиенте
Процедура ДоступнаСменаКомандыВопросНаКлиенте(Команда = Неопределено, ТекстВопроса = "")
	
	//
	Если НЕ ЗначениеЗаполнено(ТекстВопроса) Тогда
		ТекстВопроса	= НСтр("ru='Сменить действие?'");
	КонецЕсли;
	
	//	имя команды, разобранное в структуру 
	ПараметрыКоманды	= ПолучитьПараметрыКомандыНаКлиенте(Команда);
	
	ПараметрыОповещения	= Новый Структура();
	ПараметрыОповещения.Вставить("Команда"	, Команда);
	ПараметрыОповещения.Вставить("Тип"		, ПараметрыКоманды["Тип"]);
	ПараметрыОповещения.Вставить("Операция"	, ПараметрыКоманды["Операция"]);
	
	ВопросКнопки		= Новый СписокЗначений;
	ВопросКнопки.Добавить(КодВозвратаДиалога.Отмена	, "Отмена");
	ВопросКнопки.Добавить(КодВозвратаДиалога.ОК		, "Продолжить");
	
	//
	Если ПараметрыКоманды["Тип"] = "РАСЦЕНКИ" Тогда
		ДоступнаСменаКоманды	= СМ_ДоступнаСменаКомандыРасценкиНаКлиенте(ПараметрыКоманды, ТекстВопроса);
	ИначеЕсли ПараметрыКоманды["Тип"] = "РЕСУРСЫ" Тогда
		ДоступнаСменаКоманды	= СМ_ДоступнаСменаКомандыРесурсыНаКлиенте(ПараметрыКоманды, ТекстВопроса);
	ИначеЕсли ПараметрыКоманды["Тип"] = "ПОПРАВКИ" Тогда
		ДоступнаСменаКоманды	= СМ_ДоступнаСменаКомандыПоправкиНаКлиенте(ПараметрыКоманды, ТекстВопроса);
	ИначеЕсли ПараметрыКоманды["Тип"] = "НАЧИСЛЕНИЯ" Тогда
		ДоступнаСменаКоманды	= СМ_ДоступнаСменаКомандыНачисленияНаКлиенте(ПараметрыКоманды, ТекстВопроса);
	ИначеЕсли ПараметрыКоманды["Тип"] = "ИНДЕКСЫ" Тогда
		ДоступнаСменаКоманды	= СМ_ДоступнаСменаКомандыИндексыНаКлиенте(ПараметрыКоманды, ТекстВопроса);
	Иначе
		ДоступнаСменаКоманды	= Ложь;
	КонецЕсли;
	
	//
	Если ДоступнаСменаКоманды Тогда
		ДоступнаСменаКомандыНаКлиенте(КодВозвратаДиалога.ОК, ПараметрыОповещения);
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ДоступнаСменаКомандыНаКлиенте", ЭтаФорма, ПараметрыОповещения), ТекстВопроса, ВопросКнопки);
	КонецЕсли;
	
КонецПроцедуры //Процедура ДоступнаСменаКомандыВопросНаКлиенте(Команда = Неопределено, ТекстВопроса = "")

//
//
&НаКлиенте
Процедура ДоступнаСменаКомандыНаКлиенте(КодВозврата, ПараметрыОповещения) Экспорт
	
	Если НЕ КодВозврата = КодВозвратаДиалога.ОК Тогда
		Возврат;		
	КонецЕсли;
		
	//	установить значение
	Если ПараметрыОповещения["Команда"] = Неопределено Тогда
		ПараметрыКоманды	= ПараметрыОповещения;	
	Иначе
		ПараметрыКоманды	= ПолучитьПараметрыКомандыНаКлиенте(ПараметрыОповещения["Команда"]);
	КонецЕсли;
	
	//	установить значение
	Действие				= ПараметрыКоманды["Действие"];
	
	//	изменить форму
	Если ПараметрыОповещения.Тип = "РЕСУРСЫ" Тогда
		УстановитьВидимостьДоступностьЭлементовРесурсыНаКлиенте(ПараметрыКоманды);
	ИначеЕсли ПараметрыОповещения.Тип = "ПОПРАВКИ" Тогда
		
		УстановитьВидимостьДоступностьЭлементовПоправкиНаКлиенте(ПараметрыКоманды);
		
		ОбработатьСменуКомандыПоправкиНаКлиенте(ПараметрыКоманды);
		
		ПоправкиОтобразитьПустуюТаблицуНаКлиенте(ПараметрыКоманды);
		
	ИначеЕсли ПараметрыОповещения.Тип = "НАЧИСЛЕНИЯ" Тогда
		УстановитьВидимостьДоступностьЭлементовНачисленияНаКлиенте(ПараметрыКоманды);
	ИначеЕсли ПараметрыОповещения.Тип = "ИНДЕКСЫ" Тогда
		УстановитьВидимостьДоступностьЭлементовИндексыНаКлиенте(ПараметрыКоманды);
	КонецЕсли;
		
КонецПроцедуры //Процедура ДоступнаСменаКомандыНаКлиенте(КодВозврата, ПараметрыОповещения) Экспорт

&НаКлиенте
Процедура ОбработатьСменуКомандыПоправкиНаКлиенте(ПараметрыКоманды)
	
	Если ПараметрыКоманды["Операция"]["Добавить"] Тогда
		ТабличнаяЧастьПоправки.Очистить();
	КонецЕсли;
	
	Если НЕ ПараметрыКоманды["Операция"]["Добавить"] Тогда
		СменаКомандыПоправкиЗаполнитьТабличнаяЧастьНаКлиенте();		
	КонецЕсли;
	
КонецПроцедуры //Процедура ОбработатьСменуКомандыПоправкиНаКлиенте(ПараметрыКоманды)

&НаКлиенте
Процедура СменаКомандыПоправкиЗаполнитьТабличнаяЧастьНаКлиенте()
	
	//
	ОбрабатываемыеПозиции	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип, УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")), Истина));
	
	//
	ЗаполнитьТабличнаяЧастьПоправкиНаКлиенте(ОбрабатываемыеПозиции);

КонецПроцедуры //Процедура СменаКомандыПоправкиЗаполнитьТабличнаяЧастьНаКлиенте()

//
//
&НаКлиенте
Функция СМ_ДоступнаСменаКомандыРасценкиНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")
	
	//
	Возврат Истина;
	
КонецФункции //Функция СМ_ДоступнаСменаКомандыРасценкиНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")

//
//
&НаКлиенте
Функция СМ_ДоступнаСменаКомандыРесурсыНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")
	
	//
	Возврат Истина;
	
КонецФункции //Функция СМ_ДоступнаСменаКомандыРесурсыНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")

//
//
&НаКлиенте
Функция СМ_ДоступнаСменаКомандыПоправкиНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")
	
	//
	Если ПараметрыКоманды["Операция"]["Добавить"] Тогда
		ТекстВопроса	= НСтр("ru='Табличная часть будет очищена!'");
		Возврат Истина;
	КонецЕсли;
	
	//
	Если НЕ ПараметрыКоманды["Операция"]["Добавить"] Тогда
		ТекстВопроса	= НСтр("ru='Добавленные строки, будут удалены!'");
		Возврат НЕ ТабличнаяЧастьПоправки.НайтиСтроки(Новый Структура("ЭтоНоваяСтрока", Истина)).Количество();
	КонецЕсли;
	
	//	
	Возврат Истина;
	
КонецФункции //Функция СМ_ДоступнаСменаКомандыПоправкиНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")

//
//
&НаКлиенте
Функция СМ_ДоступнаСменаКомандыНачисленияНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")
	
	//
	Возврат Истина;
	
КонецФункции //Функция СМ_ДоступнаСменаКомандыНачисленияНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")

//
//
&НаКлиенте
Функция СМ_ДоступнаСменаКомандыИндексыНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")
	
	//
	Возврат Истина;
	
КонецФункции //Функция СМ_ДоступнаСменаКомандыИндексыНаКлиенте(ПараметрыКоманды, ТекстВопроса = "")

#КонецОбласти //#Область ДоступнаСменаКоманды

// оповещение, завершение выполнения команды
&НаСервере
Процедура СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(КомандаИмя, ТекстСообщенияПользователю = "")
	
	//
	Если НЕ Команды.Найти(КомандаИмя) = Неопределено Тогда
		НаименованиеКоманды	= Команды[КомандаИмя].Заголовок
	Иначе
		НаименованиеКоманды	= КомандаИмя;	
	КонецЕсли;
	
	//
	Если НЕ ЗначениеЗаполнено(ТекстСообщенияПользователю) Тогда
		ТекстСообщенияПользователю	= НСтр("ru='[" + Формат(ТекущаяДата(), "DT") + "] Обработка действия """ + НаименованиеКоманды + """ - выполнена!'");	
	КонецЕсли;
	
	//
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияПользователю);
	
	ТабличнаяЧастьРесурсы.Очистить();
КонецПроцедуры //Процедура СообщитьПользователюУспешноеВыполнениеКомандыНаСервере(КомандаИмя, ТекстСообщенияПользователю = "")

&НаКлиенте
Процедура ОтобразитьИнформационноеСообщениеНаКлиенте(Отобразить)

	//
	Элементы.ГруппаРесурсыИнформационноеСообщение.Видимость		= Отобразить;
	Элементы.ГруппаПоправкиИнформационноеСообщение.Видимость	= Отобразить;
	Элементы.ГруппаНачисленияИнформационноеСообщение.Видимость	= Отобразить;
	Элементы.ГруппаИндексыИнформационноеСообщение.Видимость		= Отобразить;
	Элементы.ГруппаСвойстваИнформационноеСообщение.Видимость	= Отобразить;
	
КонецПроцедуры //Процедура ОтобразитьИнформационноеСообщениеНаКлиенте(Отобразить)

#КонецОбласти //#Область ОповещениеПользователя

#Область ПолучитьЗначение

&НаКлиенте
Функция НетОтмеченныхЭлементовНаКлиенте()
	
	//
	Возврат НЕ ОбрабатываемыеЭлементы.Количество();
	
КонецФункции //Функция НетОтмеченныхЭлементовНаКлиенте()


&НаСервере
Функция НаборДополнительныхРеквизитовИСведенийНаСервере()
	
	Если Элементы.СтраницыСвойстваТипы.ТекущаяСтраница = Элементы.СтраницаСводнаяСмета Тогда
		Возврат Неопределено;
	ИначеЕсли Элементы.СтраницыСвойстваТипы.ТекущаяСтраница = Элементы.СтраницаОбъектнаяСмета Тогда
		Возврат Неопределено;
	ИначеЕсли Элементы.СтраницыСвойстваТипы.ТекущаяСтраница = Элементы.СтраницаЛокальнаяСмета Тогда
		Возврат Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ЛокальнаяСмета;
	ИначеЕсли Элементы.СтраницыСвойстваТипы.ТекущаяСтраница = Элементы.СтраницаРаздел Тогда
		Возврат Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_РазделЛокальнойСметы;
	ИначеЕсли Элементы.СтраницыСвойстваТипы.ТекущаяСтраница = Элементы.СтраницаПозиция Тогда
		Возврат Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ПозицияЛокальнойСметы;
	КонецЕсли;
	
КонецФункции //Функция НаборДополнительныхРеквизитовИСведенийНаСервере()

&НаСервере
Функция ПолучитьТаблицуСвойствНаСервере(СписокОбъектов)
	
	НаборыСвойств	= Новый СписокЗначений;
	НаборыСвойств.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ЛокальнаяСмета);
	НаборыСвойств.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_РазделЛокальнойСметы);
	НаборыСвойств.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ПозицияЛокальнойСметы);
	
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ВЗ_ДополнительныеРеквизиты.Свойство,
	      	               |	ВЗ_ДополнительныеРеквизиты.ТекстоваяСтрока,
	      	               |	ПРЕДСТАВЛЕНИЕ(НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство) КАК Заголовок,
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	      	               |	ВЗ_ДополнительныеРеквизиты.Значение,
	      	               |	ВЗ_ДополнительныеРеквизиты.Ссылка КАК Позиция
	      	               |ИЗ
	      	               |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	      	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	      	               |			СМ_ЛокальнаяСметаДополнительныеРеквизиты.Свойство КАК Свойство,
	      	               |			СМ_ЛокальнаяСметаДополнительныеРеквизиты.Значение КАК Значение,
	      	               |			ВЫРАЗИТЬ(СМ_ЛокальнаяСметаДополнительныеРеквизиты.ТекстоваяСтрока КАК СТРОКА(150)) КАК ТекстоваяСтрока,
	      	               |			ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ЛокальнаяСмета) КАК Набор,
	      	               |			СМ_ЛокальнаяСметаДополнительныеРеквизиты.Ссылка КАК Ссылка
	      	               |		ИЗ
	      	               |			Документ.СМ_ЛокальнаяСмета.ДополнительныеРеквизиты КАК СМ_ЛокальнаяСметаДополнительныеРеквизиты
	      	               |		ГДЕ
	      	               |			СМ_ЛокальнаяСметаДополнительныеРеквизиты.Ссылка В(&СписокОбъектов)
	      	               |		
	      	               |		ОБЪЕДИНИТЬ ВСЕ
	      	               |		
	      	               |		ВЫБРАТЬ
	      	               |			СМ_РазделЛокальнойСметыДополнительныеРеквизиты.Свойство,
	      	               |			СМ_РазделЛокальнойСметыДополнительныеРеквизиты.Значение,
	      	               |			ВЫРАЗИТЬ(СМ_РазделЛокальнойСметыДополнительныеРеквизиты.ТекстоваяСтрока КАК СТРОКА(150)),
	      	               |			ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_РазделЛокальнойСметы),
	      	               |			СМ_РазделЛокальнойСметыДополнительныеРеквизиты.Ссылка
	      	               |		ИЗ
	      	               |			Документ.СМ_РазделЛокальнойСметы.ДополнительныеРеквизиты КАК СМ_РазделЛокальнойСметыДополнительныеРеквизиты
	      	               |		ГДЕ
	      	               |			СМ_РазделЛокальнойСметыДополнительныеРеквизиты.Ссылка В(&СписокОбъектов)
	      	               |		
	      	               |		ОБЪЕДИНИТЬ ВСЕ
	      	               |		
	      	               |		ВЫБРАТЬ
	      	               |			СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Свойство,
	      	               |			СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Значение,
	      	               |			ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.ТекстоваяСтрока КАК СТРОКА(150)),
	      	               |			ЗНАЧЕНИЕ(Справочник.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ПозицияЛокальнойСметы),
	      	               |			СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Ссылка
	      	               |		ИЗ
	      	               |			Документ.СМ_ПозицияЛокальнойСметы.ДополнительныеРеквизиты КАК СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты
	      	               |		ГДЕ
	      	               |			СМ_ПозицияЛокальнойСметыДополнительныеРеквизиты.Ссылка В(&СписокОбъектов)) КАК ВЗ_ДополнительныеРеквизиты
	      	               |		ПО НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство = ВЗ_ДополнительныеРеквизиты.Свойство
	      	               |			И НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка = ВЗ_ДополнительныеРеквизиты.Набор
	      	               |ГДЕ
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка В(&НаборыСвойств)
	      	               |	И НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("СписокОбъектов"	, СписокОбъектов);
	Запрос.УстановитьПараметр("НаборыСвойств"	, НаборыСвойств);
	
	Результат	= Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции //Функция ПолучитьТаблицуСвойствНаСервере()

&НаСервере
Функция ПолучитьТаблицуДополнительныхРеквизитовНаСервере()
	
	НаборыСвойств	= Новый СписокЗначений;
	НаборыСвойств.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ЛокальнаяСмета);
	НаборыСвойств.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_РазделЛокальнойСметы);
	НаборыСвойств.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_СМ_ПозицияЛокальнойСметы);
	
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.ТипЗначения КАК ТипЗначения,
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.ЗаполнятьОбязательно КАК ЗаполнятьОбязательно,
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство,
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Свойство.Заголовок КАК Заголовок,
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка КАК Набор,
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка.Наименование,
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка.ИмяПредопределенныхДанных
	      	               |ИЗ
	      	               |	Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты
	      	               |ГДЕ
	      	               |	НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.Ссылка В(&НаборыСвойств)
	      	               |	И НаборыДополнительныхРеквизитовИСведенийДополнительныеРеквизиты.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("НаборыСвойств"	, НаборыСвойств);
	
	Результат	= Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции //Функция ПолучитьТаблицуСвойствНаСервере()

//&НаСервере
//Функция ПолучитьПараметрыОбработкиРесурсыНаСервере(ЛокальнаяСмета)
//	
//	Структура	= Новый Структура();
//	
//	Если ЛокальнаяСмета.МетодикаТСН Тогда
//		Структура.Вставить("ПрименитьЗУНормамМат"		, ЛокальнаяСмета.ПрименитьЗУНормамМат);
//		Структура.Вставить("ПрименитьЗУНормамМаш"		, ЛокальнаяСмета.ПрименитьЗУНормамМаш);
//		Структура.Вставить("ПрименитьЗУТрудРабочих"		, ЛокальнаяСмета.ПрименитьЗУТрудРабочих);
//		Структура.Вставить("ПрименитьЗУТрудМашинистов"	, ЛокальнаяСмета.ПрименитьЗУТрудМашинистов);
//		Структура.Вставить("ТипСтроительстваРемонт"		, ЛокальнаяСмета.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт);
//	Иначе
//		Структура.Вставить("ПрименитьЗУНормамМат"		, Ложь);
//		Структура.Вставить("ПрименитьЗУНормамМаш"		, Ложь);
//		Структура.Вставить("ПрименитьЗУТрудРабочих"		, Ложь);
//		Структура.Вставить("ПрименитьЗУТрудМашинистов"	, Ложь);
//		Структура.Вставить("ТипСтроительстваРемонт"		, Ложь);
//	КонецЕсли;
//	
//	
//	Возврат Структура;
//		
//КонецФункции 

&НаКлиенте
Функция СтруктураВладельцыНаКлиенте(СсылкаНаОбъект, СтрокаДерева)
	
	Структура	= Новый Структура;
	Структура.Вставить("СсылкаНаОбъект"	, СсылкаНаОбъект);
	Структура.Вставить("СтрокаДерева"	, СтрокаДерева);
	
	Возврат Структура;
	
КонецФункции //Функция СтруктураВладельцыНаКлиенте(СсылкаНаОбъект, СтрокаДерева)

//	Получить значение заголовка элемента формы (Элементы.Документ)
//
//	ВозвращаемоеЗначение	- Строка	- 
//
&НаСервереБезКонтекста
Функция ПолучитьЭлементыДокументЗаголовок(ОбрабатываемыйОбъект)
	
	Возврат Строка(ТипЗнч(ОбрабатываемыйОбъект));
	
КонецФункции //Функция ПолучитьЭлементыДокументЗаголовок(ОбрабатываемыйОбъект)

&НаСервере
Функция ПолучитьИтогПоСмете()
	
	ИтогПоСмете		= ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ИтогСметыДляДерева");
	Если Не ИтогПоСмете = Неопределено
		И ИтогПоСмете.Пустая() Тогда
		ИтогПоСмете = Справочники.СМ_ИтогиПоГлавам.НайтиПоРеквизиту("Идентификатор","ИП4");
	КонецЕсли;
	
	Возврат ИтогПоСмете;
	
КонецФункции

//&НаСервере
//Функция ПолучитьЛокальнуюСмету()
//	
//	Если ТипЗнч(ЭтаФорма.Документ) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
//		Возврат ЭтаФорма.Документ;
//	ИначеЕсли ТипЗнч(ЭтаФорма.Документ) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
//		Возврат ЭтаФорма.Документ.ЛокальнаяСмета;
//	КонецЕсли;	
//	
//КонецФункции //Функция ПолучитьЛокальнуюСмету()

&НаСервере
Функция ПолучитьЛокальныеСметыНаСервере(ВыбранноеЗначение)
	
	//
	Массив	= Новый Массив();
	
	//
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") тогда
		Массив.Добавить(ВыбранноеЗначение.ЛокальнаяСмета);	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_СводнаяСмета") тогда
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СМ_ОбъектнаяСметаЛокальныеСметы.ЛокальнаяСмета КАК ЛокальнаяСмета
		|ПОМЕСТИТЬ ВТсмет
		|ИЗ
		|	Документ.СМ_ОбъектнаяСмета.ЛокальныеСметы КАК СМ_ОбъектнаяСметаЛокальныеСметы
		|ГДЕ
		|	СМ_ОбъектнаяСметаЛокальныеСметы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СМ_ЛокальнаяСмета.Ссылка КАК ЛокальнаяСмета
		|ИЗ
		|	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
		|ГДЕ
		|	СМ_ЛокальнаяСмета.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТсмет.ЛокальнаяСмета
		|			ИЗ
		|				ВТсмет КАК ВТсмет)";
		Запрос.УстановитьПараметр("Ссылка",ВыбранноеЗначение);
		ТабЛС 		= Запрос.Выполнить().Выгрузить();
		Массив	= ТабЛС.ВыгрузитьКолонку("ЛокальнаяСмета");	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") тогда
		Массив.Добавить(ВыбранноеЗначение);	
	КонецЕсли;
	
	//
	Возврат Массив;
		
КонецФункции //Функция ПолучитьЛокальныеСметыНаСервере(ВыбранноеЗначение)

&НаКлиенте
Функция СМ_ПолучитьПараметрыРасчетаНаКлиенте(СсылкаНаОбъект)
	
	//
	СтрокиЛокальнаяСмета	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("СсылкаНаОбъект", СсылкаНаОбъект));
	
	//	всегда, должны находить, только одну строку
	Если СтрокиЛокальнаяСмета.Количество() Тогда
		Возврат	СтрокиЛокальнаяСмета[0]["Параметры"];	
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции //Функция СМ_ПолучитьПараметрыРасчетаНаКлиенте(СсылкаНаОбъект)

&НаКлиенте
Функция ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте()
	
	//
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))));
	
	//
	Если ОбрабатываемыеЛокальныеСметы.Количество() Тогда
		Возврат ОбрабатываемыеЛокальныеСметы[0]["СсылкаНаОбъект"];	
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции //Функция ПолучитьОбрабатываемуюЛокальнуюСметуНаКлиенте()

&НаСервере
Функция ПолучитьОбрабатываемуюЛокальнуюСметуНаСервере()
	
	//
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета"))));
	
	//
	Если ОбрабатываемыеЛокальныеСметы.Количество() Тогда
		Возврат ОбрабатываемыеЛокальныеСметы[0]["СсылкаНаОбъект"];	
	Иначе
		Возврат Неопределено;	
	КонецЕсли;
	
КонецФункции //Функция ПолучитьОбрабатываемуюЛокальнуюСметуНаСервере()

&НаСервере
Функция ПолноеНаименованиеНаСервере(Префикс = "ВТ_", НаименованиеТаблицы = "")
	
	//
	Возврат Префикс + НаименованиеТаблицы;
	
КонецФункции //Функция ПолноеНаименованиеНаСервере(Префикс = "ВТ_", НаименованиеТаблицы = "")


#Область ПараметрыКоманды

&НаКлиенте
Функция ПолучитьПараметрыКомандыНаКлиенте(Команда, Свойство = Неопределено)
	
	//
	Массив	= СтрРазделить(Команда.Имя, "_");

	//
	Если НЕ Массив.Количество() = 5 Тогда
		Возврат Неопределено;
	Иначе
		
		//
		Операция	= Новый Структура();
		Операция.Вставить("Копировать"		, Булево(СтрНайти(Массив[4], "Копировать")));
		Операция.Вставить("Перенести"		, Булево(СтрНайти(Массив[4], "Перенести")));
		Операция.Вставить("Редактировать"	, Булево(СтрНайти(Массив[4], "Редактировать")));
		Операция.Вставить("Заменить"		, Булево(СтрНайти(Массив[4], "Заменить")));
		Операция.Вставить("Удалить"			, Булево(СтрНайти(Массив[4], "Удалить")));
		Операция.Вставить("Добавить"		, Булево(СтрНайти(Массив[4], "Добавить")));
		Операция.Вставить("ВБ"				, Булево(СтрНайти(Массив[4], "ВБ")));
		Операция.Вставить("НРиСП"			, Булево(СтрНайти(Массив[4], "НРиСП")));
		
		//
		Структура	= Новый Структура();
		Структура.Вставить("Команда"	, Команда.Имя);
		Структура.Вставить("Действие"	, Массив[4]);
		Структура.Вставить("Тип"		, Массив[0]);
		Структура.Вставить("Операция"	, Операция);
		
		//
		Если Свойство = Неопределено Тогда
			Возврат Структура;
		Иначе
			Возврат Структура[Свойство];	
		КонецЕсли;
		
	КонецЕсли;
		
КонецФункции

&НаКлиенте
Функция ПолучитьСвойствоКомандыДействиеНаКлиенте(КомандаИмя, Свойство)
	
	//
	НайденнаяКоманда	= ДействиеКоманды.НайтиСтроки(Новый Структура("Команда", КомандаИмя));
	
	//
	Если НайденнаяКоманда = Неопределено Тогда
		Возврат "";
	Иначе
		Возврат НайденнаяКоманда[0][Свойство];
	КонецЕсли;
		
КонецФункции //Функция ПолучитьСвойствоКомандыДействиеНаКлиенте(КомандаИмя, Свойство)

&НаКлиенте
Функция ПолучитьКомандаИмяНаКлиенте(ДействиеОбрабатываемое)
	
	//
	НайденныеКоманды	= ДействиеКоманды.НайтиСтроки(Новый Структура("Действие", ДействиеОбрабатываемое));
	
	Если НайденныеКоманды.Количество() Тогда
		Возврат НайденныеКоманды[0]["Команда"];	
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции //Функция ПолучитьКомандаИмяНаКлиенте(ДействиеОбрабатываемое)

#КонецОбласти //#Область ПараметрыКоманды/#Область ПолучитьЗначение

#КонецОбласти //#Область ПолучитьЗначение

#Область ПроверкаУсловия

&НаСервере
Функция СодержитИндексыПоЭлементам(ВыбранноеЗначение)
	
	//
	СодержитИндексыПоЭлементам	= ЛОЖЬ;
	СписокЛокальныеСметы		= ПолучитьЛокальныеСметыНаСервере(ВыбранноеЗначение);
	
	//	
	Для каждого Строка из СписокЛокальныеСметы цикл
		Попытка
			Если Строка.СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат тогда
				СодержитИндексыПоЭлементам	= Истина;
				Прервать;
			КонецЕсли;
		Исключение
			СодержитИндексыПоЭлементам	= ЛОЖЬ;
		КонецПопытки;
	КонецЦикла;
	
	//
	Возврат СодержитИндексыПоЭлементам;
	
КонецФункции //Функция СодержитБазисноИндексныйУровеньРасценка(ВыбранноеЗначение)

&НаСервере
Функция СодержитБазисноИндексныйУровеньРасценка(ВыбранноеЗначение)
	
	//
	СодержитБазисноИндексныйУровеньРасценка	= ЛОЖЬ;
	СписокЛокальныеСметы					= ПолучитьЛокальныеСметыНаСервере(ВыбранноеЗначение);
	
	//	
	Для каждого Строка из СписокЛокальныеСметы цикл
		Попытка
			Если Строка.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный И Строка.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Расценка тогда
				СодержитБазисноИндексныйУровеньРасценка	= Истина;
				Прервать;
			КонецЕсли;
		Исключение
			СодержитБазисноИндексныйУровеньРасценка	= ЛОЖЬ;
		КонецПопытки;
	КонецЦикла;
	
	//
	Возврат СодержитБазисноИндексныйУровеньРасценка;
	
КонецФункции //Функция СодержитБазисноИндексныйУровеньРасценка(ВыбранноеЗначение)

&НаСервере
Функция СодержитБазисноИндексныйУровеньРаздел(ВыбранноеЗначение)
	
	//
	СодержитБазисноИндексныйУровеньРаздел	= ЛОЖЬ;
	СписокЛокальныеСметы					= ПолучитьЛокальныеСметыНаСервере(ВыбранноеЗначение);
	
	//	
	Для каждого Строка из СписокЛокальныеСметы цикл
		Попытка
			Если Строка.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный И Строка.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел тогда
				СодержитБазисноИндексныйУровеньРаздел	= Истина;
				Прервать;
			КонецЕсли;
		Исключение 
			СодержитБазисноИндексныйУровеньРаздел	= ЛОЖЬ;
		КонецПопытки;
	КонецЦикла;
	
	//
	Возврат СодержитБазисноИндексныйУровеньРаздел;
	
КонецФункции //Функция СодержитБазисноИндексныйУровеньРаздел(ВыбранноеЗначение)

&НаСервере
Функция СодержитФайлСборникаТекущихЦен(ВыбранноеЗначение)
	
	//
	СодержитФайлСборникаТекущихЦен	= Ложь;
	СписокЛокальныеСметы			= ПолучитьЛокальныеСметыНаСервере(ВыбранноеЗначение);
	
	//	
	Для Каждого Строка Из СписокЛокальныеСметы Цикл
		Попытка
			Если ЗначениеЗаполнено(Строка.ФайлСборникаТекущихЦен) Тогда
				СодержитФайлСборникаТекущихЦен	= Истина;
				Прервать;
			КонецЕсли;
		Исключение 
			СодержитФайлСборникаТекущихЦен	= ЛОЖЬ;
		КонецПопытки;
	КонецЦикла;
	
	//
	Возврат СодержитФайлСборникаТекущихЦен;
	
КонецФункции //Функция СодержитФайлСборникаТекущихЦен(ВыбранноеЗначение)

#КонецОбласти //#Область ПроверкаУсловия

#Область ДокументМенеджер

&НаСервере
Процедура ДокументПерерасчетНаСервере(СсылкаНаОбъект = Неопределено,Перенос = Ложь)
	
	//
	ОбрабатываемыеЛокальныеСметы	= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип,УчастиеРодитель", Строка(Тип("ДокументСсылка.СМ_ЛокальнаяСмета")),Истина));
	ОбрабатываемыеРазделы			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип,УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")),Истина));
	ОбрабатываемыеПозиции			= ОбрабатываемыеЭлементы.НайтиСтроки(Новый Структура("Тип,УчастиеПометка", Строка(Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")),Истина));
		
	//
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		СМ_СметаВызовСервера.УдалитьДвижения(СсылкаНаОбъект);
		Документы.СМ_АктВыполненныхРабот.Перерасчет(СсылкаНаОбъект, Ложь);
		Возврат;
	КонецЕсли;
	
	//	Перерасчет позиций.
	Для Каждого Строка Из ОбрабатываемыеПозиции Цикл
		
		Если Перенос И Строка.УчастиеПометка Тогда
			СМ_СметаВызовСервера.УдалитьДвижения(Строка["СсылкаНаОбъект"]);
		КонецЕсли;
		
		Документы.СМ_ПозицияЛокальнойСметы.Перерасчет(Строка["СсылкаНаОбъект"], Истина);
		
	КонецЦикла;
	
	//	Перерасчет разделов, иерархически.
	Для Каждого Строка Из ОбрабатываемыеРазделы Цикл
		
		Если Перенос Тогда
			СМ_СметаВызовСервера.УдалитьДвижения(Строка["СсылкаНаОбъект"]);
		КонецЕсли;
		
		Документы.СМ_РазделЛокальнойСметы.Перерасчет(Строка["СсылкаНаОбъект"], Истина, Истина);
		
	КонецЦикла;
	
	//	Перерасчет локальных смет.
	Для Каждого Строка Из ОбрабатываемыеЛокальныеСметы Цикл
		
		Если Перенос Тогда
			СМ_СметаВызовСервера.УдалитьДвижения(Строка["СсылкаНаОбъект"]);
		КонецЕсли;   
		
		Документы.СМ_ЛокальнаяСмета.Перерасчет(Строка["СсылкаНаОбъект"], Истина);	
		
	КонецЦикла;	
	
КонецПроцедуры //Процедура ДокументПерерасчетНаСервере(СсылкаНаОбъект = Неопределено)

// Присваивает порядковый номер объекту текущей строки.
//
Процедура ПрисвоитьНомерОбъекту(Объект, счетчикНомер, счетчикПорНомер)

	Если НЕ Объект = Неопределено
		И (	ТипЗнч(Объект) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")
			ИЛИ ТипЗнч(Объект) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")) Тогда
		
		ПрисваиваемыйПорНомер	= ?(Объект.Расчет,счетчикПорНомер,0);
		ПрисваиваемыйНомер		= счетчикНомер;
		
		Если НЕ Объект.ПорНомер = ПрисваиваемыйПорНомер
			ИЛИ НЕ Объект.НомерВПределахСметы = ПрисваиваемыйНомер
			ИЛИ НЕ Объект.НомерВДереве = ПрисваиваемыйНомер Тогда
			
			Объект.НомерВПределахСметы	= ПрисваиваемыйНомер;
			Объект.ПорНомер				= ПрисваиваемыйПорНомер;
			Объект.НомерВДереве			= ПрисваиваемыйНомер;
			Объект.Записать(?(Объект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
			
		КонецЕсли;
		
		счетчикНомер = счетчикНомер + 1; 
		Если Объект.Расчет Тогда 
			счетчикПорНомер = счетчикПорНомер + 1;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти //#Область ДокументМенеджерФункциии

#Область УстановитьПометка

// Устанавливаем либо снимаем пометки у всех строк СтрокиДерева.
//
&НаКлиенте
Процедура УстановитьСнятьПометкаНаКлиенте(СтрокаДерева, Знач Пометка)
	
	// Свойство "Связанная" - может иметь, как владелец, так и подчиненная позиция.
	// Если отмечаем владельца, значит отмечаем все связанные.
	Если СтрокаДерева.Связанная
		И НЕ ЗначениеЗаполнено(СтрокаДерева.СвязаннаяВладелец) Тогда
		УстановитьСнятьПометкаСвязанныеНаКлиенте(СтрокаДерева, Пометка);
	КонецЕсли;
	
	// Устанавливаем отметку детей
	УстановитьСнятьПометкаРебенокНаКлиенте(СтрокаДерева.ПолучитьЭлементы(), Пометка);
	
	// Устанавливаем отметку родителей
	УстановитьСнятьПометкаРодительНаКлиенте(СтрокаДерева, Пометка);
	
	// Отмечаем 
	УстановитьСнятьПометкаКорневойЭлементНаКлиенте(ЭлементыДеревоЗначений.ПолучитьЭлементы());
	
КонецПроцедуры //Процедура УстановитьСнятьПометкаНаКлиенте(СтрокаДерева, Пометка)	

// Устанавливаем либо снимаем пометки у всех родителей строки СтрокиДерева.
//
&НаКлиенте
Процедура УстановитьСнятьПометкаРебенокНаКлиенте(СтрокиДерева, Пометка)
	
	Для Каждого Строка Из СтрокиДерева Цикл
		
		// Если НЕ Строка.Доступность тогда
		//	Продолжить;
		// КонецЕсли;
			
		//
		Строка.Пометка = Пометка;
	
		//	рекурсия
		УстановитьСнятьПометкаРебенокНаКлиенте(Строка.ПолучитьЭлементы(), Пометка);
		
	КонецЦикла;	
	
КонецПроцедуры //Процедура УстановитьСнятьПометкаРебенокНаКлиенте(СтрокаДерева, Пометка)

// Устанавливаем либо снимаем пометки у всех родителей строки СтрокиДерева.
//
&НаКлиенте
Процедура УстановитьСнятьПометкаРодительНаКлиенте(СтрокаДерева, Пометка)
	
	//
	Родитель	= СтрокаДерева.ПолучитьРодителя();
	
	//
	Пока НЕ Родитель = Неопределено Цикл
		
		Отмеченные	= Новый Массив();
		
		//	(!) только для отмеченных родителей
		Если НЕ Родитель.Пометка Тогда
			Родитель	= Родитель.ПолучитьРодителя();
			Продолжить;
		КонецЕсли;
		
		//
		СтрокиДерева	= Родитель.ПолучитьЭлементы();
	
		//
		Для Каждого Строка Из СтрокиДерева Цикл
			Если Строка.Пометка = 1 Тогда
				Отмеченные.Добавить(Строка);	
			КонецЕсли;
		КонецЦикла;
		
		//	если нет отмеченных, тогда "стандартная" = 1
		Если НЕ Отмеченные.Количество() Тогда
			Родитель.Пометка	= 0;
		ИначеЕсли Отмеченные.Количество() = СтрокиДерева.Количество() Тогда
			Родитель.Пометка	= 1;
		ИначеЕсли НЕ Отмеченные.Количество() = СтрокиДерева.Количество() Тогда
			Родитель.Пометка	= 2;
		КонецЕсли;
		
		//
		Родитель		= Родитель.ПолучитьРодителя();
		
	КонецЦикла;
	
КонецПроцедуры //Процедура УстановитьСнятьПометкаРодительНаКлиенте(СтрокаДерева, Пометка)

//
//
&НаКлиенте
Процедура УстановитьСнятьПометкаКорневойЭлементНаКлиенте(СтрокиДерева, ЕстьОтмеченные = Ложь, ЕстьНеОтмеченные = Ложь)
	
	//
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		//
		Если СтрокаДерева.Пометка = 0 Тогда
			ЕстьНеОтмеченные	= Истина;
		Иначе
			ЕстьОтмеченные		= Истина;
		КонецЕсли;
		
		//
		Если ЕстьОтмеченные И ЕстьНеОтмеченные Тогда
			Прервать;
		КонецЕсли;

		//
		УстановитьСнятьПометкаКорневойЭлементНаКлиенте(СтрокаДерева.ПолучитьЭлементы(), ЕстьОтмеченные, ЕстьНеОтмеченные);
		
	КонецЦикла;
	
	//
	КорневыеСтрокиДерева	= ЭлементыДеревоЗначений.ПолучитьЭлементы();
	
	//
	Для Каждого СтрокаДерева Из КорневыеСтрокиДерева Цикл
		
		Если НЕ ЕстьОтмеченные И ЕстьНеОтмеченные Тогда
			СтрокаДерева.Пометка	= 0;
		ИначеЕсли ЕстьОтмеченные И НЕ ЕстьНеОтмеченные Тогда
			СтрокаДерева.Пометка	= 1;
		ИначеЕсли ЕстьОтмеченные И ЕстьНеОтмеченные Тогда
			СтрокаДерева.Пометка	= 2;
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры //Процедура УстановитьСнятьПометкаКорневойЭлементНаКлиенте(СтрокаДерева, ЕстьОтмеченные = Ложь, ЕстьНеОтмеченные = Ложь)


// Устанавливаем либо снимаем пометки у всех строк СтрокиДерева
// согласно переданного отбора.
&НаКлиенте
Процедура УстановитьСнятьПометкаОтборНаКлиенте(СтрокаДерева, Пометка, Отбор)
	
	Для Каждого ЭлСтроки Из СтрокаДерева Цикл
		
		Если НЕ Пометка Тогда
			ЭлСтроки.Пометка = Пометка;
		КонецЕсли;
		
		Если ТипЗнч(ЭлСтроки.Элемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
			
			Если Отбор.Количество() = 0 Тогда
				Если НЕ Пометка Тогда
					ПопадаетВОтбор = Пометка;	
				КонецЕсли;
			Иначе	
				ПопадаетВОтбор = ПроверитьУсловияОтбора(ЭлСтроки.Элемент, Отбор, ЭлСтроки.Шифр, ЭлСтроки.СтатусРедактирования);
			КонецЕсли;
			
			Если Пометка Тогда
				Если НЕ ЭлСтроки.Пометка Тогда
					ЭлСтроки.Пометка = ПопадаетВОтбор;	
				КонецЕсли;
			Иначе
				ЭлСтроки.Пометка = ПопадаетВОтбор;
			КонецЕсли;
			
			УстановитьСнятьПометкаРодительНаКлиенте(ЭлСтроки, Пометка);
			

		КонецЕсли;	
			
		УстановитьСнятьПометкаОтборНаКлиенте(ЭлСтроки.ПолучитьЭлементы(), Пометка, Отбор);

	КонецЦикла;
	
КонецПроцедуры //Процедура УстановитьСнятьПометкаОтборНаКлиенте(СтрокаДерева, Пометка, Отбор)	

// В случае, если отмечают привязанную позицию, либо позицию - владельца, отмечаем все связанные позиции, и владельца.
//
&НаКлиенте
Процедура УстановитьСнятьПометкаСвязанныеНаКлиенте(СтрокаДерева, Пометка)
	
	//	связанные - всегда размещены на том же уровне
	УровеньРазмещенияПривязанных	= СтрокаДерева.ПолучитьРодителя().ПолучитьЭлементы();
	
	//
	Если ЗначениеЗаполнено(СтрокаДерева.СвязаннаяВладелец) Тогда
		ЗначениеСравнения	= СтрокаДерева.СвязаннаяВладелец;
	Иначе
		ЗначениеСравнения	= СтрокаДерева.Элемент;
	КонецЕсли;
	
	//
	Для Каждого Строка Из УровеньРазмещенияПривязанных Цикл
		
		//
		Если НЕ Строка.Элемент = ЗначениеСравнения
			И НЕ Строка.СвязаннаяВладелец = ЗначениеСравнения Тогда
			Продолжить;
		КонецЕсли;
		
		//	если владелец связанной
		Если Строка.Связанная И НЕ ЗначениеЗаполнено(Строка.СвязаннаяВладелец) Тогда
			Строка.Пометка	= Пометка;
		КонецЕсли;
		
		//	если связанная
		Если Строка.Связанная И ЗначениеЗаполнено(Строка.СвязаннаяВладелец) Тогда
			Строка.Пометка	= Пометка;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //Процедура УстановитьСнятьПометкаСвязанныеНаКлиенте(СтрокаДерева, Пометка)	


&НаКлиенте
Процедура УстановитьСнятьПометкаТаблицаНаКлиенте(Таблица, ОтборСтрок = Неопределено, Пометка = Ложь)
	
	//
	Для Каждого Строка Из Таблица Цикл
		
		ВходитВОтбор	= Истина;
			
		//	Отбор строк.
		Если НЕ ОтборСтрок = Неопределено Тогда
			Для Каждого КлючИЗначение Из ОтборСтрок Цикл
				Если НЕ Строка[КлючИЗначение.Ключ] = КлючИЗначение.Значение Тогда
					ВходитВОтбор	= Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//
		Строка.Пометка = Пометка И ВходитВОтбор;
		
	КонецЦикла;
	
КонецПроцедуры //Процедура УстановитьСнятьПометкаТаблицаНаКлиенте(Таблица, Пометка = Ложь)

#КонецОбласти //#Область УстановитьПометка

// вычисляем номер копии, и устанавливаем его в наименование
#Область СледующееНаименование

&НаСервереБезКонтекста
Функция СледующийИндексЗапросВыбратьНаСервереБезКонтекста(ЧастьСтрокиВключить, ЧастьСтрокиИсключить, Родитель, ЛокальнаяСмета, СсылкаНаОбъект)
	
	//
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		ТекстЗапроса	= ПолучитьТекстЗапросаСледующийИндексОбъектнаяСметаНаСервереБезКонтекста();	
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		ТекстЗапроса	= ПолучитьТекстЗапросаСледующийИндексЛокальнаяСметаНаСервереБезКонтекста();	
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
		ТекстЗапроса	= ПолучитьТекстЗапросаСледующийИндексРазделНаСервереБезКонтекста();	
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		ТекстЗапроса	= ПолучитьТекстЗапросаСледующийИндексПозицияНаСервереБезКонтекста();	
	КонецЕсли;
	
	//
	Запрос	= Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Родитель"			, Родитель);
	Запрос.УстановитьПараметр("ЧастьСтрокиВключить"	, ЧастьСтрокиВключить);
	Запрос.УстановитьПараметр("ЧастьСтрокиИсключить", ЧастьСтрокиИсключить); //	иначе, всегда будет попадать в выборку
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")
		ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		Запрос.УстановитьПараметр("ЛокальнаяСмета"	, ЛокальнаяСмета);					   
	КонецЕсли;
	
	//
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции //Функция СледующийИндексЗапросВыбратьНаСервереБезКонтекста()

&НаСервереБезКонтекста
Функция СледующийИндексЗапросВыбратьПерваяКопияНаСервереБезКонтекста(ЧастьСтрокиВключить, Родитель, ЛокальнаяСмета, СсылкаНаОбъект)
	
	//
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		ТекстЗапроса	= ПолучитьТекстЗапросаСледующийИндексОбъектнаяСметаНаСервереБезКонтекста(Ложь);	
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		ТекстЗапроса	= ПолучитьТекстЗапросаСледующийИндексЛокальнаяСметаНаСервереБезКонтекста(Ложь);	
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
		ТекстЗапроса	= ПолучитьТекстЗапросаСледующийИндексРазделНаСервереБезКонтекста(Ложь);	
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		ТекстЗапроса	= ПолучитьТекстЗапросаСледующийИндексПозицияНаСервереБезКонтекста(Ложь);	
	КонецЕсли;
	
	//
	Запрос	= Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Родитель"			, Родитель);
	Запрос.УстановитьПараметр("ЧастьСтрокиВключить"	, ЧастьСтрокиВключить);
		
	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")
		ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		Запрос.УстановитьПараметр("ЛокальнаяСмета"	, ЛокальнаяСмета);					   
	КонецЕсли;
	
	//
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции //Функция СледующийИндексЗапросВыбратьПерваяКопияНаСервереБезКонтекста()

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаСледующийИндексОбъектнаяСметаНаСервереБезКонтекста(Исключить = Истина)
	
	Возврат "";
	
КонецФункции //Функция ПолучитьТекстЗапросаСледующийИндексОбъектнаяСметаНаСервереБезКонтекста()

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаСледующийИндексЛокальнаяСметаНаСервереБезКонтекста(Исключить = Истина)
	
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	СМ_ЛокальнаяСмета.Ссылка,
	        |	СМ_ЛокальнаяСмета.Наименование
	        |ИЗ
	        |	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	        |ГДЕ
	        |	СМ_ЛокальнаяСмета.ИДРодителя = &Родитель
	        |	И СМ_ЛокальнаяСмета.Наименование ПОДОБНО ""%"" + &ЧастьСтрокиВключить + ""%""
	        |	И НЕ СМ_ЛокальнаяСмета.Наименование ПОДОБНО ""%"" + &ЧастьСтрокиИсключить
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	СМ_ЛокальнаяСмета.Номер УБЫВ";
	
КонецФункции //Функция ПолучитьТекстЗапросаСледующийИндексЛокальнаяСметаНаСервереБезКонтекста()

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаСледующийИндексРазделНаСервереБезКонтекста(Исключить = Истина)
	
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	СМ_РазделЛокальнойСметы.Ссылка,
	        |	ВЫРАЗИТЬ(СМ_РазделЛокальнойСметы.НаименованиеДляПечати КАК СТРОКА(1024)) КАК Наименование
	        |ИЗ
	        |	Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	        |ГДЕ
	        |	СМ_РазделЛокальнойСметы.ИДСметы = &ЛокальнаяСмета
	        |	И СМ_РазделЛокальнойСметы.ИДРодителя = &Родитель
	        |	И СМ_РазделЛокальнойСметы.НаименованиеДляПечати ПОДОБНО ""%"" + &ЧастьСтрокиВключить + ""%""
	        |	И НЕ СМ_РазделЛокальнойСметы.НаименованиеДляПечати ПОДОБНО ""%"" + &ЧастьСтрокиИсключить
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	СМ_РазделЛокальнойСметы.Номер УБЫВ";
	
КонецФункции //Функция ПолучитьТекстЗапросаСледующийИндексРазделНаСервереБезКонтекста()

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаСледующийИндексПозицияНаСервереБезКонтекста(Исключить = Истина)
	
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	СМ_ПозицияЛокальнойСметы.Ссылка,
	        |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметы.Наименование КАК СТРОКА(1024)) КАК Наименование
	        |ИЗ
	        |	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	        |ГДЕ
	        |	СМ_ПозицияЛокальнойСметы.ИДСметы = &ЛокальнаяСмета
	        |	И СМ_ПозицияЛокальнойСметы.ИДРодителя = &Родитель
	        |	И СМ_ПозицияЛокальнойСметы.Наименование ПОДОБНО ""%"" + &ЧастьСтрокиВключить + ""%""
	        |	" + ?(Исключить, "И НЕ СМ_ПозицияЛокальнойСметы.Наименование ПОДОБНО ""%"" + &ЧастьСтрокиИсключить", "") + "
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Наименование УБЫВ";
	
КонецФункции //Функция ПолучитьТекстЗапросаСледующийИндексПозицияНаСервереБезКонтекста()

&НаСервереБезКонтекста
Функция СледующийИндексНаСервереБезКонтекста(Значение, БезЧисла = "")
	
	//
	ЧислоНайдено	= Ложь;
	Текст			= Значение;
	ЧислоТекст		= "";
	Цифра			= Прав(Текст, 1);
	
	Пока НЕ ЧислоНайдено Цикл
		
		//
		Попытка
			Число			= Число(Цифра);
			ЧислоТекст		= Цифра + ЧислоТекст;
			Текст			= Лев(Текст, СтрДлина(Текст)-1);
			Цифра			= Прав(Текст, 1);
		Исключение
			ЧислоНайдено	= Истина;
		КонецПопытки;
		
	КонецЦикла;
	
	//
	БезЧисла	= Сред(Значение, 1, СтрДлина(Значение) - СтрДлина(ЧислоТекст));
	
	//
	Если ЗначениеЗаполнено(ЧислоТекст) Тогда
		Число	= Число(ЧислоТекст) + 1;
	Иначе
		Число	= 1;
	КонецЕсли;
	
	//
	Возврат Число;
	
КонецФункции //Функция СледующийИндексНаСервереБезКонтекста(Значение, БезЧисла = "")

#КонецОбласти //#Область СледующееНаименование/#Область ВспомогательныеФункции

#КонецОбласти //#Область ВспомогательныеФункции

#Область НаУдаление

// ***************************************************************************
//// Заполнение СтруктурыПараметров из списка Форма.Параметры.ОтборПоУмолчанию
//&НаСервере
//Функция Удалить_ПолучитьПараметрыПоУмолчаниюОтборНаСервере()
//	
//	Структура	= Новый Структура();
//	
//	Структура.Вставить("Определитель"			, Новый Структура("ВидСравнения, Значение"));
//	Структура.Вставить("ВидРасценки"			, Новый Структура("ВидСравнения, Значение"));
//	Структура.Вставить("ТипНормативныхСборников", Новый Структура("ВидСравнения, Значение"));
//	Структура.Вставить("НомерСборника"			, Новый Структура("ВидСравнения, Значение"));
//	Структура.Вставить("ОбработкаДемонтажа"		, Новый Структура("ВидСравнения, Значение"));
//		
//	Для Каждого Элемент Из ЭтаФорма.Параметры.ПоУмолчаниюОтбор Цикл
//		Структура.Вставить(Элемент.Представление, Элемент.Значение);
//	КонецЦикла;	
//	
//	Возврат Структура;
//	
//КонецФункции 


// ***************************************************************************
//&НаКлиенте
//Процедура Удалить_ЗапомнитьТекущиеЗначенияНаКлиенте(Действие)
//	
//	ДоступностьОбновитьТекущиеЦены		= Булево(Найти(Действие, "РедактироватьЦены"));
//	ДоступностьПоправкиРедактировать	= Булево(Найти(Действие, "Редактировать"));
//	ДоступностьНачисленияРедактировать	= Булево(Найти(Действие, "Редактировать"));
//	ДоступностьИндексыРедактировать		= Булево(Найти(Действие, "Редактировать"));
//	
//	//	РЕСУРСЫ
//	Если ДоступностьОбновитьТекущиеЦены тогда
//		
//		// Запомним старые значения.
//		Для Каждого СтрокаРесурсы Из ТабличнаяЧастьРесурсы Цикл
//			СтрокаРесурсы.ЦенаБазиснаяСтарая 	= СтрокаРесурсы.ЦенаБазисная;
//			СтрокаРесурсы.ЦенаТекущаяСтарая 	= СтрокаРесурсы.ЦенаТекущая;
//			СтрокаРесурсы.ЦенаЗМБазиснаяСтарая 	= СтрокаРесурсы.ЦенаЗМБазисная;
//			СтрокаРесурсы.ЦенаТекущаяЗМСтарая 	= СтрокаРесурсы.ЦенаТекущаяЗМ;
//		КонецЦикла;		
//		
//	КонецЕсли;
//	
//		
//	//	ИНДЕКСЫ
//	Если ДоступностьИндексыРедактировать тогда
//		
//		//	Запомним старые значения.
//		Для Каждого СтрокаРесурсы Из ТабличнаяЧастьИндексы Цикл
//			СтрокаРесурсы.КоэффОснЗарплатыСтарая 		= СтрокаРесурсы.КоэффОснЗарплаты;
//			СтрокаРесурсы.КоэффСтоимЭксплМашинСтарая 	= СтрокаРесурсы.КоэффСтоимЭксплМашин;
//			СтрокаРесурсы.КоэффСтоимЗарплатеМашинСтарая = СтрокаРесурсы.КоэффСтоимЗарплатеМашин;
//			СтрокаРесурсы.КоэффСтоимМатериаловСтарая 	= СтрокаРесурсы.КоэффСтоимМатериалов;
//			СтрокаРесурсы.КоэффОборудСтарая 			= СтрокаРесурсы.КоэффОборуд;
//			СтрокаРесурсы.КоэффПолнСтоимРаботСтарая 	= СтрокаРесурсы.КоэффПолнСтоимРабот;
//		КонецЦикла;		
//		
//	КонецЕсли;
//КонецПроцедуры 


// ***************************************************************************
//&НаСервере
//Процедура Удалить_ТестСхемыЗапроса()
//	
//	//
//	Стройка				= Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка();
//	ПоискПоСтроке		= "";
//	БезПомеченных		= Истина;//Параметры.БезПомеченных;
//	БезАктов			= Истина;//Параметры.БезАктов;
//	ЭлементКорня		= Неопределено;//Объект.ЭлементКорня;
//	ВключатьРазделы		= Истина;//Параметры.ВключатьРазделы;
//	ВключатьОС			= Ложь;//Объект.ВключатьОС;
//	ВключатьСС			= Ложь;//Объект.ВключатьСС
//	ВключатьЛС			= Истина;//Объект.ВключатьЛС
//	ТекОбъект			= Стройка;
//	СписокИсключений	= Новый СписокЗначений;//Объект.СписокИсключений;
//	
//	//
//	СхемаЗапроса = Новый СхемаЗапроса;
//	
//	//
//	СхемаЗапроса.УстановитьТекстЗапроса("ВЫБРАТЬ
//										|	АктВыполненныхРабот.ЛокальнаяСмета,
//										|	СУММА(1) КАК КоличествоАктов
//										|ПОМЕСТИТЬ ВТ_АктыСметы
//										|ИЗ
//										|	Документ.СМ_АктВыполненныхРабот КАК АктВыполненныхРабот
//										|ГДЕ
//										|	АктВыполненныхРабот.ПометкаУдаления = ЛОЖЬ 
//										|СГРУППИРОВАТЬ ПО
//										|	АктВыполненныхРабот.ЛокальнаяСмета
//										|;
//										|
//										|////////////////////////////////////////////////////////////////////////////////
//										|ВЫБРАТЬ
//										|	ВТ_АктыСметы.ЛокальнаяСмета,
//										|	ВЫБОР
//										|		КОГДА ВТ_АктыСметы.КоличествоАктов > 1
//										|			ТОГДА 2
//										|		ИНАЧЕ 1
//										|	КОНЕЦ КАК КартинкаАкт
//										|ПОМЕСТИТЬ ВТ_СметыКартинкиАкты
//										|ИЗ
//										|	ВТ_АктыСметы КАК ВТ_АктыСметы
//										|;");
//	
//	//	при создании схема содержит один пакет и один оператор в пакете.
//	Пакет		= СхемаЗапроса.ПакетЗапросов[0];
//	Оператор	= Пакет.Операторы[0];
//	
//	Если ЗначениеЗаполнено(Стройка) Тогда
//		Оператор.Отбор.Добавить("АктВыполненныхРабот.Стройка В (&ОбъектСтроительства)");			
//	КонецЕсли;
//	
//	//	ЗАПРОС (Документ.СМ_ЛокальнаяСмета)
//	
//	ПакетВТ_Сметы		= СхемаЗапроса.ПакетЗапросов.Добавить();
//	//	ПОМЕСТИТЬ (временная таблица)
//	ПакетВТ_Сметы.ТаблицаДляПомещения	= "ВТ_Сметы";
//	
//	Если ВключатьЛС Тогда
//	
//		//	по умолчанию, создается один оператор, проверяем его на "пусто"
//		Если НЕ ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1].Источники.Количество() тогда
//			ОператорЛокальнаяСмета	= ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1];
//		Иначе
//			ОператорЛокальнаяСмета	= ПакетВТ_Сметы.Операторы.Добавить();
//		КонецЕсли;
//		
//		//	ИЗ
//		СметыКартинкиАкты	= ОператорЛокальнаяСмета.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("ВТ_СметыКартинкиАкты"), "ВТ_СметыКартинкиАкты");
//		СМ_ЛокальнаяСмета	= ОператорЛокальнаяСмета.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("Документ.СМ_ЛокальнаяСмета"), "ДокументЛокальнаяСмета");
//		
//		//	ВЫБРАТЬ (поля)
//		СМ_ЛокальнаяСметаСсылка			= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ДокументЛокальнаяСмета.Ссылка", 0);
//		СМ_ЛокальнаяСметаИД				= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ДокументЛокальнаяСмета.ИД", 1);
//		СМ_ЛокальнаяСметаИДРодителя		= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ВЫБОР
//			|	КОГДА ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
//			|			ИЛИ ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
//			|			ИЛИ (НЕ ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_ОбъектнаяСмета.ПустаяСсылка)
//			|				ИЛИ НЕ ДокументЛокальнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
//			|				И НЕ &ВключатьОС)
//			|	ТОГДА НЕОПРЕДЕЛЕНО
//			|	ИНАЧЕ ДокументЛокальнаяСмета.ИДРодителя
//			|КОНЕЦ", 2);
//		СМ_ЛокальнаяСметаНаименование	= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ДокументЛокальнаяСмета.Наименование", 3);
//		СМ_ЛокальнаяСметаНомерСметы		= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ДокументЛокальнаяСмета.НомерСметы", 4);
//		СМ_ЛокальнаяСметаТип			= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("""ЛокальнаяСмета""", 5);
//		СМ_ЛокальнаяСметаКартинкаАкты	= ОператорЛокальнаяСмета.ВыбираемыеПоля.Добавить("ЕСТЬNULL(ВТ_СметыКартинкиАкты.КартинкаАкт, 0)", 6);
//		
//		//	СВЯЗИ
//		//СМ_ЛокальнаяСмета.Соединения.Добавить(СметыКартинкиАкты, "ВТ_СметыКартинкиАкты.ЛокальнаяСмета = ДокументЛокальнаяСмета.Ссылка");
//		СметыКартинкиАктыСоединение	= СметыКартинкиАкты.Соединения[0];
//		СметыКартинкиАктыСоединение.ТипСоединения	= ТипСоединенияСхемыЗапроса.ПравоеВнешнее;
//		
//		//	УСЛОВИЯ
//		ОператорЛокальнаяСмета.Отбор.Добавить("НЕ ДокументЛокальнаяСмета.Ссылка В (&СписокИсключений)");
//		
//		Если БезПомеченных Тогда
//			ОператорЛокальнаяСмета.Отбор.Добавить("ДокументЛокальнаяСмета.ПометкаУдаления = ЛОЖЬ");
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(Стройка) Тогда
//			ОператорЛокальнаяСмета.Отбор.Добавить("ДокументЛокальнаяСмета.Стройка В (&ОбъектСтроительства)");			
//		КонецЕсли;

//		Если ЗначениеЗаполнено(ПоискПоСтроке) Тогда
//			ОператорЛокальнаяСмета.Отбор.Добавить("(ДокументЛокальнаяСмета.НомерСметы Подобно &СтрокаПоиска ИЛИ ДокументЛокальнаяСмета.Наименование Подобно &СтрокаПоиска)");			
//		КонецЕсли;

//		Если БезАктов Тогда
//			ОператорЛокальнаяСмета.Отбор.Добавить("ЕСТЬNULL(ВТ_СметыКартинкиАкты.КартинкаАкт, 0)=0");
//		КонецЕсли;

//		Если НЕ ЭлементКорня = Неопределено Тогда
//			ОператорЛокальнаяСмета.Отбор.Добавить("ДокументЛокальнаяСмета.Ссылка = &Ссылка ИЛИ ДокументЛокальнаяСмета.ИДРодителя = &Ссылка ИЛИ ДокументЛокальнаяСмета.ИДРодителя.ИДРодителя = &Ссылка");
//		КонецЕсли;
//	
//	КонецЕсли;
//	
//	//	РАЗДЕЛЫ
//	Если ВключатьРазделы Тогда
//		
//		//	по умолчанию, создается один оператор, проверяем его на "пусто"
//		Если НЕ ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1].Источники.Количество() тогда
//			ОператорРазделЛокальнойСметы	= ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1];
//		Иначе
//			ОператорРазделЛокальнойСметы	= ПакетВТ_Сметы.Операторы.Добавить();
//		КонецЕсли;
//		
//		//	ИЗ
//		СМ_РазделЛокальнойСметы			= ОператорРазделЛокальнойСметы.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("Документ.СМ_РазделЛокальнойСметы"), "ДокументРазделЛокальнойСметы");
//		
//		//	ВЫБРАТЬ (поля)
//		СМ_РазделЛокальнойСметыСсылка		= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.Ссылка", 0);
//		СМ_РазделЛокальнойСметыИД			= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.ИД", 1);
//		СМ_РазделЛокальнойСметыИДРодителя	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.ИДРодителя", 2);
//		СМ_РазделЛокальнойСметыНаименование	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.НаименованиеДляПечати", 3);
//		СМ_РазделЛокальнойСметыНомерСметы	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("ДокументРазделЛокальнойСметы.ПорНомер", 4);
//		СМ_РазделЛокальнойСметыТип			= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("""РазделЛокальнойСметы""", 5);
//		СМ_РазделЛокальнойСметыКартинкаАкты	= ОператорРазделЛокальнойСметы.ВыбираемыеПоля.Добавить("0", 6);
//		
//		//	УСЛОВИЯ
//		ОператорРазделЛокальнойСметы.Отбор.Добавить("НЕ ДокументРазделЛокальнойСметы.Ссылка В (&СписокИсключений)");
//		
//		Если НЕ ЭлементКорня = Неопределено Тогда
//			ОператорРазделЛокальнойСметы.Отбор.Добавить("ДокументРазделЛокальнойСметы.ИДСметы = &Ссылка ИЛИ
//															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя = &Ссылка ИЛИ
//															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя = &Ссылка");
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(Стройка) Тогда
//			ОператорРазделЛокальнойСметы.Отбор.Добавить("ДокументРазделЛокальнойСметы.ИДСметы.Стройка В (&ОбъектСтроительства) ИЛИ
//															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.Стройка В (&ОбъектСтроительства) ИЛИ
//															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя.Стройка В (&ОбъектСтроительства)");			
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ПоискПоСтроке) Тогда
//			ОператорРазделЛокальнойСметы.Отбор.Добавить("((ДокументРазделЛокальнойСметы.ИДСметы.НомерСметы Подобно &СтрокаПоиска ИЛИ
//															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.НомерСметы Подобно &СтрокаПоиска ИЛИ
//															|	ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя.НомерСметы Подобно &СтрокаПоиска) ИЛИ
//															|	(	ДокументРазделЛокальнойСметы.ИДСметы.Наименование Подобно &СтрокаПоиска ИЛИ
//															|		ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.Наименование Подобно &СтрокаПоиска ИЛИ
//															|		ДокументРазделЛокальнойСметы.ИДСметы.ИДРодителя.ИДРодителя.Наименование Подобно &СтрокаПоиска))");			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если ВключатьОС Тогда
//		
//		//	по умолчанию, создается один оператор, проверяем его на "пусто"
//		Если НЕ ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1].Источники.Количество() тогда
//			ОператорОбъектнаяСмета	= ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1];
//		Иначе
//			ОператорОбъектнаяСмета	= ПакетВТ_Сметы.Операторы.Добавить();
//		КонецЕсли;
//		
//		//	ИЗ
//		СМ_ОбъектнаяСмета		= ОператорОбъектнаяСмета.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("Документ.СМ_ОбъектнаяСмета"), "ДокументОбъектнаяСмета");
//		
//		//	ВЫБРАТЬ (поля)
//		СМ_ОбъектнаяСметаСсылка			= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ДокументОбъектнаяСмета.Ссылка", 0);
//		СМ_ОбъектнаяСметаИД				= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ДокументОбъектнаяСмета.ИД", 1);
//		СМ_ОбъектнаяСметаИДРодителя		= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ВЫБОР
//		|	КОГДА ДокументОбъектнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
//		|			ИЛИ (НЕ ДокументОбъектнаяСмета.ИДРодителя = ЗНАЧЕНИЕ(Документ.СМ_СводнаяСмета.ПустаяСсылка)
//		|				И НЕ &ВключатьСС)
//		|	ТОГДА НЕОПРЕДЕЛЕНО
//		|	ИНАЧЕ ДокументОбъектнаяСмета.ИДРодителя
//		|КОНЕЦ", 2);
//		СМ_ОбъектнаяСметаНаименование	= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ДокументОбъектнаяСмета.Наименование", 3);
//		СМ_ОбъектнаяСметаНомерСметы		= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("ДокументОбъектнаяСмета.НомерСметы", 4);
//		СМ_ОбъектнаяСметаТип			= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("""ОбъектнаяСмета""", 5);
//		СМ_ОбъектнаяСметаКартинкаАкты	= ОператорОбъектнаяСмета.ВыбираемыеПоля.Добавить("0", 6);
//		
//		//	УСЛОВИЯ
//		ОператорОбъектнаяСмета.Отбор.Добавить("НЕ ДокументОбъектнаяСмета.Ссылка В (&СписокИсключений)");
//		
//		Если БезПомеченных Тогда
//			ОператорОбъектнаяСмета.Отбор.Добавить("ДокументОбъектнаяСмета.ПометкаУдаления = ЛОЖЬ ");
//		КонецЕсли;

//		Если ЗначениеЗаполнено(Стройка) Тогда
//			ОператорОбъектнаяСмета.Отбор.Добавить("ДокументОбъектнаяСмета.Стройка В (&ОбъектСтроительства)");			
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ПоискПоСтроке) Тогда
//			ОператорОбъектнаяСмета.Отбор.Добавить("(ДокументОбъектнаяСмета.НомерСметы Подобно &СтрокаПоиска ИЛИ ДокументОбъектнаяСмета.Наименование Подобно &СтрокаПоиска)");			
//		КонецЕсли;
//		
//		Если НЕ ЭлементКорня = Неопределено Тогда
//			ОператорОбъектнаяСмета.Отбор.Добавить("ДокументОбъектнаяСмета.Ссылка = &Ссылка ИЛИ ДокументОбъектнаяСмета.ИДРодителя = &Ссылка");
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если ВключатьСС Тогда
//		
//		//	по умолчанию, создается один оператор, проверяем его на "пусто"
//		Если НЕ ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1].Источники.Количество() тогда
//			ОператорСводнаяСмета	= ПакетВТ_Сметы.Операторы[ПакетВТ_Сметы.Операторы.Количество()-1];
//		Иначе
//			ОператорСводнаяСмета	= ПакетВТ_Сметы.Операторы.Добавить();
//		КонецЕсли;
//		
//		//	ИЗ
//		СМ_СводнаяСмета			= ОператорСводнаяСмета.Источники.Добавить(ПакетВТ_Сметы.ДоступныеТаблицы.Найти("Документ.СМ_СводнаяСмета"), "ДокументСводнаяСмета");
//		
//		//	ВЫБРАТЬ (поля)
//		СМ_СводнаяСметаСсылка		= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("ДокументСводнаяСмета.Ссылка", 0);
//		СМ_СводнаяСметаИД			= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("ДокументСводнаяСмета.ИД", 1);
//		СМ_СводнаяСметаИДРодителя	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("НЕОПРЕДЕЛЕНО", 2);
//		СМ_СводнаяСметаНаименование	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("ДокументСводнаяСмета.Наименование", 3);
//		СМ_СводнаяСметаНомерСметы	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("ДокументСводнаяСмета.НомерСметы", 4);
//		СМ_СводнаяСметаТип			= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("""СводнаяСмета""", 5);
//		СМ_СводнаяСметаКартинкаАкты	= ОператорСводнаяСмета.ВыбираемыеПоля.Добавить("0", 6);
//		
//		//	УСЛОВИЯ
//		ОператорСводнаяСмета.Отбор.Добавить("НЕ ДокументСводнаяСмета.Ссылка В (&СписокИсключений)");
//		
//		Если БезПомеченных Тогда
//			ОператорСводнаяСмета.Отбор.Добавить("ДокументСводнаяСмета.ПометкаУдаления = ЛОЖЬ ");
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(Стройка) Тогда
//			ОператорСводнаяСмета.Отбор.Добавить("ДокументСводнаяСмета.Стройка В (&ОбъектСтроительства)");			
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(ПоискПоСтроке) Тогда
//			ОператорСводнаяСмета.Отбор.Добавить("(ДокументСводнаяСмета.НомерСметы Подобно &СтрокаПоиска ИЛИ ДокументСводнаяСмета.Наименование Подобно &СтрокаПоиска)");			
//		КонецЕсли;

//		Если НЕ ЭлементКорня = Неопределено Тогда
//			ОператорСводнаяСмета.Отбор.Добавить("ДокументСводнаяСмета.Ссылка = &Ссылка");
//		КонецЕсли;
//		
//	КонецЕсли;
//		
//	//	ОБЪЕДИНЕНИЯ/ПСЕВДОНИМЫ	
//	ПакетВТ_Сметы.Колонки[0].Псевдоним	= "Ссылка";
//	ПакетВТ_Сметы.Колонки[1].Псевдоним	= "ИД";
//	ПакетВТ_Сметы.Колонки[2].Псевдоним	= "ИДРодителя";
//	ПакетВТ_Сметы.Колонки[3].Псевдоним	= "Наименование";
//	ПакетВТ_Сметы.Колонки[4].Псевдоним	= "НомерСметы";
//	ПакетВТ_Сметы.Колонки[5].Псевдоним	= "Тип";
//	ПакетВТ_Сметы.Колонки[6].Псевдоним	= "КартинкаАкты";
//	
//	//	ВЫБРАТЬ
//	ПакетСметы		= СхемаЗапроса.ПакетЗапросов.Добавить();
//	ОператорСметы	= ПакетСметы.Операторы[0];
//	
//	//	ИЗ
//	Сметы			= ОператорСметы.Источники.Добавить(ПакетСметы.ДоступныеТаблицы.Найти("ВТ_Сметы"), "Сметы");
//		
//	//	ВЫБРАТЬ (поля)
//	СметыСсылка			= ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.Ссылка");
//	СметыИД				= ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.ИД");
//	СметыИДРодителя		= ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.ИДРодителя");
//	СметыНаименование	= ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.Наименование");
//	СметыНомерСметы		= ОператорСметы.ВыбираемыеПоля.Добавить("Сметы.НомерСметы");
//	СметыТип			= ОператорСметы.ВыбираемыеПоля.Добавить("Тип");
//	СметыКартинкаАкты	= ОператорСметы.ВыбираемыеПоля.Добавить("КартинкаАкты");
//	
//	ПараметрыЗапроса	= СхемаЗапроса.НайтиПараметры();
//	ТекстЗапроса		= СхемаЗапроса.ПолучитьТекстЗапроса();
//	Запрос				= Новый Запрос(ТекстЗапроса);
//	
//	Если НЕ ПараметрыЗапроса.Найти("Ссылка") = Неопределено Тогда
//		Запрос.УстановитьПараметр("Ссылка"				, ЭлементКорня);
//	КонецЕсли;
//	
//	Если НЕ ПараметрыЗапроса.Найти("СтрокаПоиска") = Неопределено Тогда
//		Запрос.УстановитьПараметр("СтрокаПоиска"		, ПоискПоСтроке+"%");		   
//	КонецЕсли;
//	
//	Если НЕ ПараметрыЗапроса.Найти("ОбъектСтроительства") = Неопределено Тогда
//		Запрос.УстановитьПараметр("ОбъектСтроительства"	, ТекОбъект);		   
//	КонецЕсли;
//	
//	Если НЕ ПараметрыЗапроса.Найти("СписокИсключений") = Неопределено Тогда
//		Запрос.УстановитьПараметр("СписокИсключений"	, СписокИсключений);
//	КонецЕсли;
//	
//	Если НЕ ПараметрыЗапроса.Найти("ВключатьЛС") = Неопределено Тогда
//		Запрос.УстановитьПараметр("ВключатьЛС"			, ВключатьЛС);
//	КонецЕсли;
//	
//	Если НЕ ПараметрыЗапроса.Найти("ВключатьОС") = Неопределено Тогда
//		Запрос.УстановитьПараметр("ВключатьОС"			, ВключатьОС);
//	КонецЕсли;
//	
//	Если НЕ ПараметрыЗапроса.Найти("ВключатьСС") = Неопределено Тогда
//		Запрос.УстановитьПараметр("ВключатьСС"			, ВключатьСС);
//	КонецЕсли;
//	
//	РезультатЗапроса	= Запрос.Выполнить().Выгрузить();
//	
//	РезультатЗапросаОтобранные = РезультатЗапроса.НайтиСтроки(Новый Структура("ИДРодителя", Неопределено));
//	
//	//	
//	//ПостроитьДеревоПоТаблице(ДеревоЗначений, РезультатЗапроса);

//КонецПроцедуры


// ***************************************************************************
//&НаСервереБезКонтекста
//Функция Удалить_СледующееНаименованиеКопииНаСервереБезКонтекста(СсылкаНаОбъект, Наименование, ПараметрыСменыРодителя = Неопределено, Текст = "копия")
//	
//	
//	ПродолжитьНумерацию			= Ложь;
//	ПродолжитьНумерациюКопия	= Ложь;
//	ЗначениеНаименования		= СокрЛП(Наименование);
//	НаименованиеБезНомера		= "";
//	ТекстДополнительный			= "(" + Текст + ")";
//	
//	// если не задан "следующий номер", вычисляем его из копируемого объекта
//	СледующийНомер				= ПолучитьСледующийНомерНаСервереБезКонтекста(СсылкаНаОбъект, ЗначениеНаименования, ПараметрыСменыРодителя, Текст, НаименованиеБезНомера, ПродолжитьНумерацию, ПродолжитьНумерациюКопия);
//		
//	//	продолжить нумерацию
//	Если ПродолжитьНумерацию Тогда
//		Если ПродолжитьНумерациюКопия Тогда
//			//	Если добавлен дополнительный текст, тогда продолжим его нумерацию.
//			НаименованиеКопии	= НаименованиеБезНомера + " (" + Текст + " " + СледующийНомер + ")";
//		Иначе
//			//	Продолжить нумерацию наименования (наименования с числом в конце).
//			НаименованиеКопии	= НаименованиеБезНомера + Строка(СледующийНомер);
//		КонецЕсли;
//	Иначе
//		//	Сформировать наименование, с дополнительным текстом в конце.
//		НаименованиеКопии		= СокрП(Наименование) + " " + ТекстДополнительный;
//	КонецЕсли;
//	
//	Возврат НаименованиеКопии;
//КонецФункции 


// ***************************************************************************
//&НаСервере
//Процедура Удалить_ДеревоЗначенийЗаполнитьСтрокуПозицияАктВыполненныхРаботНаСервере(СтрокаДерева, Строка, ПараметрыОбновления)
//	
//	// Находим строку позиции в ТЧ позиций акта, если есть.
//	МассивСтрок = ПараметрыОбновления["ОбъектАкт"].Позиции.НайтиСтроки(Новый Структура("Позиция", СтрокаДерева.Элемент));
//	
//	Если МассивСтрок.Количество() > 0 Тогда
//		ТекущаяСтрокаПозиции = МассивСтрок[0]; 	
//	Иначе	
//		ТекущаяСтрокаПозиции = Неопределено;
//	КонецЕсли;
//	
//	Если ПараметрыОбновления["ЭтоГрупповаяОбработкаПозиций"] Тогда
//		
//		Если НЕ ТекущаяСтрокаПозиции = Неопределено тогда
//		
//			СтрокаДерева.ОбъемПоАкту			= ТекущаяСтрокаПозиции.ФактОбъем;
//			
//			Попытка
//				СтрокаДерева.ОбъемВсего			= СтрокаДерева.ОбъемВсего + СтрокаДерева.ОбъемПоАкту;
//			Исключение
//			КонецПопытки;
//			
//			Попытка
//				СтрокаДерева.ОбъемВсегоПроцент	= ?(ПараметрыОбновления["ОбъемРабот"]=0,100,(СтрокаДерева.ОбъемВсего/ПараметрыОбновления["ОбъемРабот"])*100);
//			Исключение
//			КонецПопытки;
//			
//		КонецЕсли;
//		
//	ИначеЕсли ПараметрыОбновления["_"]["ПроцентоватьАкт"] Тогда
//		
//		Если  Не ПараметрыОбновления.Свойство("МассивПозиций") ИЛИ ПараметрыОбновления["МассивПозиций"]=Неопределено 
//			или НЕ ПараметрыОбновления["МассивПозиций"].Найти(СтрокаДерева.Элемент)=Неопределено Тогда
//			СтрокаДерева.ОбъемПоАкту = Строка.ОбъемРабот * ПараметрыОбновления["Процент"] / 100;
//		ИначеЕсли ТекущаяСтрокаПозиции <> Неопределено Тогда
//			СтрокаДерева.ОбъемПоАкту = ТекущаяСтрокаПозиции.ФактОбъем;
//		КонецЕсли;
//		СтрокаДерева.ОбъемВсего = СтрокаДерева.ОбъемВсего+СтрокаДерева.ОбъемПоАкту;
//		СтрокаДерева.ОбъемВсегоПроцент = ?(ПараметрыОбновления["ОбъемРабот"]=0,100,(СтрокаДерева.ОбъемВсего/ПараметрыОбновления["ОбъемРабот"])*100);
//		
//	ИначеЕсли ПараметрыОбновления["_"]["ЗаполнитьПоОстаткам"] Тогда
//		
//		Если ПараметрыОбновления["ВыполнениеСметы"].Количество() = 0 Тогда
//			Если ТекущаяСтрокаПозиции = Неопределено Тогда
//				СтрокаДерева.ОбъемПоАкту = Строка.ОбъемРабот;
//				СтрокаДерева.ОбъемВсего = СтрокаДерева.ОбъемВсего+СтрокаДерева.ОбъемПоАкту;
//				СтрокаДерева.ОбъемВсегоПроцент = ?(ПараметрыОбновления["ОбъемРабот"]=0,100,(СтрокаДерева.ОбъемВсего/ПараметрыОбновления["ОбъемРабот"])*100);
//			Иначе
//				СтрокаДерева.ОбъемПоАкту = ТекущаяСтрокаПозиции.ФактОбъем;
//				СтрокаДерева.ОбъемВсего = СтрокаДерева.ОбъемВсего+СтрокаДерева.ОбъемПоАкту;
//				СтрокаДерева.ОбъемВсегоПроцент = ?(ПараметрыОбновления["ОбъемРабот"]=0,100,(СтрокаДерева.ОбъемВсего/ПараметрыОбновления["ОбъемРабот"])*100);
//			КонецЕсли;
//		Иначе
//			Если Не ПараметрыОбновления.Свойство("МассивПозиций") ИЛИ ПараметрыОбновления["МассивПозиций"] = Неопределено Тогда
//				СтрокаДерева.ОбъемПоАкту = 0;
//			ИначеЕсли Не ТекущаяСтрокаПозиции = Неопределено Тогда
//				СтрокаДерева.ОбъемПоАкту = ТекущаяСтрокаПозиции.ФактОбъем;
//			КонецЕсли;
//			НайденнаяСтрока = ПараметрыОбновления["ВыполнениеСметы"].Найти(СтрокаДерева.Элемент);
//			Если НайденнаяСтрока <> Неопределено Тогда
//				СтрокаДерева.ОбъемПоАкту = НайденнаяСтрока.ФактОбъем;	
//			КонецЕсли;
//			СтрокаДерева.ОбъемВсего = СтрокаДерева.ОбъемВсего+СтрокаДерева.ОбъемПоАкту;
//			СтрокаДерева.ОбъемВсегоПроцент = ?(ПараметрыОбновления["ОбъемРабот"]=0,100,(СтрокаДерева.ОбъемВсего/ПараметрыОбновления["ОбъемРабот"])*100);    
//		КонецЕсли;
//		
//	Иначе	
//		
//		Если НЕ ТекущаяСтрокаПозиции = Неопределено тогда
//			
//			СтрокаДерева.ОбъемПоАкту		= ТекущаяСтрокаПозиции.ФактОбъем;
//			СтрокаДерева.ОбъемВсего			= СтрокаДерева.ОбъемВсего + СтрокаДерева.ОбъемПоАкту;
//			СтрокаДерева.ОбъемВсегоПроцент	= ?(ПараметрыОбновления["ОбъемРабот"] = 0, 100, (СтрокаДерева.ОбъемВсего / ПараметрыОбновления["ОбъемРабот"]) * 100);
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если НЕ ПараметрыОбновления["ЭтоГрупповаяОбработкаПозиций"] тогда
//	
//		Если Строка.ОбъемРабот = 0 Тогда
//			СтрокаДерева.ОбъемПоАктуПроцент = 0;					
//		Иначе
//			СтрокаДерева.ОбъемПоАктуПроцент = СтрокаДерева.ОбъемПоАкту * 100 / Строка.ОбъемРабот;
//		КонецЕсли;
//		
//		Если (НЕ ПараметрыОбновления["_"]["НеИзменятьАкт"]) Тогда
//		
//			//	Копируем индексы позиции и заполняем ТЧ позиции в акте.
//			ОбновитьТЧПозицииАкта(ПараметрыОбновления["КопироватьИндексы"], ПараметрыОбновления["Документ"], ПараметрыОбновления["ОбъектАкт"], СтрокаДерева, ТекущаяСтрокаПозиции);

//			//	Заполнение табличной части "РесурсыПозицийАкта".
//			ОбновитьТЧРесурсыПозицийАкта(	ПараметрыОбновления["ОбъектАкт"],
//											СтрокаДерева,
//											ПараметрыОбновления["_"]["ПроцентоватьАкт"],
//											ПараметрыОбновления["Процент"],
//											?(ПараметрыОбновления.Свойство("МассивПозиций"), ПараметрыОбновления["МассивПозиций"], Неопределено));
//			
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//КонецПроцедуры


// ***************************************************************************
//&НаСервере
//Процедура Удалить_ЗапросНаСервере()
//	
//	Выборка	= Документы.СМ_АктВыполненныхРабот.Выбрать();
//	Выборка.Следующий();
//	
//	Запрос	 = Новый Запрос("ВЫБРАТЬ
//	      	                |	СМ_АктВыполненныхРаботПозиции.Ссылка,
//	      	                |	СМ_АктВыполненныхРаботПозиции.Позиция
//	      	                |ИЗ
//	      	                |	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_АктВыполненныхРаботПозиции
//	      	                |ГДЕ
//	      	                |	СМ_АктВыполненныхРаботПозиции.Ссылка.ЛокальнаяСмета = &Ссылка
//	      	                |	И СМ_АктВыполненныхРаботПозиции.Ссылка <> &АктВыполненныхРабот");
//	Запрос.УстановитьПараметр("Ссылка"				, Выборка.Ссылка.ЛокальнаяСмета);
//	Запрос.УстановитьПараметр("АктВыполненныхРабот"	, Выборка.Ссылка);
//	ТаблицаЗначений	= Запрос.Выполнить().Выгрузить();
//	
//КонецПроцедуры


// ***************************************************************************
// Копирование индексов расздела и обновление ТЧ "Разделы" акта.
//Процедура Удалить_ОбновитьТЧРазделыАкта(ОбъектАкт,СтрокаДерева)
//	
//	СтруктураОтбора = Новый Структура;
//	СтруктураОтбора.Вставить("Раздел",СтрокаДерева.Элемент);
//	
//	МассивСтрок = ОбъектАкт.Разделы.НайтиСтроки(СтруктураОтбора);
//	Если МассивСтрок.Количество() = 0 Тогда
//	
//		НоваяСтрока	= ОбъектАкт.Разделы.Добавить();
//		НоваяСтрока.Раздел	 				= СтрокаДерева.Элемент;
//		НоваяСтрока.КоэффОснЗарплаты        = СтрокаДерева.Элемент.КоэффОснЗарплаты;
//		НоваяСтрока.КоэффСтоимЭксплМашин    = СтрокаДерева.Элемент.КоэффСтоимЭксплМашин;
//		НоваяСтрока.КоэффСтоимЗарплатеМашин = СтрокаДерева.Элемент.КоэффСтоимЗарплатеМашин;
//		НоваяСтрока.КоэффСтоимМатериалов    = СтрокаДерева.Элемент.КоэффСтоимМатериалов;
//		НоваяСтрока.КоэффОборуд             = СтрокаДерева.Элемент.КоэффОборуд;
//		НоваяСтрока.КоэффПолнСтоимРабот     = СтрокаДерева.Элемент.КоэффПолнСтоимРабот;
//	КонецЕсли;
//КонецПроцедуры


// ***************************************************************************
//&НаСервере
//Процедура Удалить_СообщитьПользователюВыполнениеКомандыЗавершеноСОшибкойНаСервере(КомандаИмя)
//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Обработка команды """ + Команды[КомандаИмя].Заголовок + """ - завершена с ошибкой!'"));
//КонецПроцедуры


// ***************************************************************************
//Процедура Удалить_тестПр()
//	
//	// ДействияПрименить115
//	ПараметрыОтбора = Новый Структура();
//	ПараметрыОтбора.Вставить("ОбработкаДемонтажа"		, Новый Структура("ВидСравнения, Значение", "НеРавно", Истина));
//	ПараметрыОтбора.Вставить("НомераСборника"			, Новый Структура("ВидСравнения, Значение", "НеРавно", 46));
//	ПараметрыОтбора.Вставить("ТипНормативныхСборников"	, ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.СтроительныеРаботы"));	

//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "Поправка115");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, ПараметрыОтбора);

//	// ОбновитНРиСП
//	ПараметрыОтбора = Новый Структура();
//	ПараметрыОтбора.Вставить("ВидРасценки", Новый Структура("ВидСравнения, Значение", "Равно", ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Работа")));	

//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "ОбновитьНРиСП");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, ПараметрыОтбора);

//	// ИзменитьОбъем
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "ИзменитьОбъем");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, Новый Структура());

//	// ИзменитьОпределители
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "ИзменитьОпределители");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, Новый Структура());

//	// УстановитьНеИндексировать
//	ПараметрыОтбора = Новый Структура();
//	ПараметрыОтбора.Добавить("ВидРасценки", Новый Структура("ВидСравнения, Значение", "Равно", ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Материал")));	

//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "УстановитьНеИндексировать");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, ПараметрыОтбора);

//	// РассчитатьПоБазису
//	ПараметрыОтбора = Новый Структура();
//	ПараметрыОтбора.Добавить("ВидРасценки", Новый Структура("ВидСравнения, Значение", "Равно", ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Работа")));	

//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "РассчитатьПоБазису");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, ПараметрыОтбора);

//	// РассчитатьПоТек
//	ПараметрыОтбора = Новый Структура();
//	ПараметрыОтбора.Добавить("ВидРасценки", Новый Структура("ВидСравнения, Значение", "Равно", ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Работа")));	

//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "РассчитатьПоТек");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, ПараметрыОтбора);

//	// ВключитьВРасчет
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "ВключитьВРасчет");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, Новый Структура());

//	// ИсключитьИзРасчета
//	ПараметрыОткрытия = Новый Структура();
//	ПараметрыОткрытия.Вставить("Документ"					, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОбластьОбработки", "РАСЦЕНКИ");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие"		, "ИсключитьИзРасчета");
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюОтбор"			, Новый Структура());

//	// СкопироватьПоСтроке
//	ПараметрыОткрытия = Новый  Структура;
//	ПараметрыОткрытия.Вставить("Документ"			, Объект.Ссылка);
//	ПараметрыОткрытия.Вставить("ТекущийЭлемент"		, ТекущиеДанные.Элемент);
//	ПараметрыОткрытия.Вставить("ПоУмолчаниюДействие", "Копировать");
//	
//КонецПроцедуры


// ***************************************************************************
//// Функция возвращает индекс картинки для акта или сметы.
//Функция Удалить_ПолучитьКартинкуСтрокиАктаСметы(ТекЭлемент)
//	
//	// 0. Смета.
//	// 1. Раздел.
//	// 2. Позиция.
//	// 3. Привязанная позиция.
//	// 4. Лим. затрата (пока в дереве ее нет, но сюда добавил).
//	// 5. Удаленная смета.
//	// 6. Удаленный раздел.
//	// 7. Удаленная позиция.
//	// 8. Удаленная привязанная позиция.
//	// 9. Удаленная лим. затрата (пока в дереве ее нет, но сюда добавил).
//
//	Если ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
//		ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,5,0);
//		Возврат ТекКартинка;
//	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
//		ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,6,1);
//		Возврат ТекКартинка;
//	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
//		// Позиция привязана.
//		Если ЗначениеЗаполнено(ТекЭлемент.СвязаннаяВладелец) Тогда
//			ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,8,3);
//		// Позиция не привязана.	
//		Иначе	
//			ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,7,2);
//		КонецЕсли;
//		Возврат ТекКартинка;
//	ИначеЕсли ТипЗнч(ТекЭлемент) = Тип("СправочникСсылка.СМ_ЛимитированныеЗатраты") Тогда
//		ТекКартинка = ?(ТекЭлемент.ПометкаУдаления,9,4);
//		Возврат ТекКартинка;
//	КонецЕсли;	
//		
//КонецФункции


// ***************************************************************************
//&НаСервере
//Функция Удалить_ПолучитьОбъемРаботНаСервере(Строка, ПараметрыОбновления)
//	
//	//	ОбъемРабот
//	Если Найти(ПараметрыОбновления["Действие"], "СметаНаОстаток") тогда
//		Возврат Строка.ОбъемПоАкту;
//	Иначе
//		Возврат 1;
//	КонецЕсли;
//	
//КонецФункции 


// ***************************************************************************
//&НаКлиенте
//Функция Удалить_СМ_ДоступнаОбработкаСводнаяСметаНаКлиенте(Команда, Идентификаторы = Неопределено)
//	
//	ДоступнаОбработкаКоманды	= Ложь;
//	ТекстПредупреждения			= НСтр("ru='Обработка команды, не возможна!';");
//	// имя команды, разобранное в структуру 
//	ПараметрыКоманды				= ПолучитьПараметрыКомандыНаКлиенте(Команда);
//	
//	// заполнить таблицы, отмеченными элементами и заполнить параметры формы
//	ОтобратьОтмеченныеЭлементыНаКлиенте(Идентификаторы);
//	
//	Если ДоступнаОбработкаКоманды Тогда
//		Возврат Истина;
//	Иначе
//		ПоказатьПредупреждение(Новый ОписаниеОповещения("НеДоступнаОбработкаКомандыНаКлиенте", ЭтаФорма), ТекстПредупреждения);
//		Возврат Ложь;
//	КонецЕсли;	
//	
//КонецФункции


// ***************************************************************************
//// Приводит значение к формату, в зависимости от выбранной ссылки (по признаку "ОкруглятьДоРублей").
//&НаСервере
//Функция Удалить_СМ_ФорматОкругленияНаСервере(Значение, Ссылка)
//	
//	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
//		Округлять = Ссылка.ЛокальнаяСмета.ОкруглятьДоРублей;
//	Иначе	
//		Округлять = Ссылка.ОкруглятьДоРублей;
//	КонецЕсли;
//	
//	Если Округлять тогда
//		Возврат Формат(Окр(Значение, 0), "ЧДЦ=0");
//	Иначе
//		Возврат Значение;	
//	КонецЕсли;
//	
//КонецФункции


// ***************************************************************************
//// Формирует обоснование сметной стоимости
//Функция Удалить_СформироватьОбоснованиеСметнойСтоимости(СтрокаУровня, ОтображатьПрефиксы)
//	
//	Если ТипЗнч(СтрокаУровня.Ссылка) <> Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
//		Возврат "";
//	КонецЕсли;
//	
//	Результат = СтрокаУровня.ШифрРасценки;
//	
//	Если ОтображатьПрефиксы Тогда
//		
//		Запрос = Новый Запрос;
//		Запрос.Текст = "ВЫБРАТЬ
//		               |	ПрефиксыРасценок.Наименование КАК Префикс
//		               |ИЗ
//		               |	Справочник.СМ_ПрефиксыРасценок КАК ПрефиксыРасценок
//		               |ГДЕ
//		               |	ПрефиксыРасценок.ТипНормативногоСборника = &ТипНормативногоСборника
//		               |	И ПрефиксыРасценок.РегиональнаяБаза = &РегиональнаяБаза";
//		Запрос.УстановитьПараметр("ТипНормативногоСборника",	СтрокаУровня.Ссылка.ТипНормативныхСборников);			   
//		Запрос.УстановитьПараметр("РегиональнаяБаза",			СтрокаУровня.Ссылка.РегиональнаяБаза);
//		
//		Выборка = запрос.Выполнить().Выбрать();
//		Если выборка.Следующий() Тогда
//			Результат = Сокрлп(Выборка.Префикс) + Результат;
//		Иначе
//			Запрос = Новый Запрос;
//			Запрос.Текст = "ВЫБРАТЬ
//			               |	ПрефиксыРасценок.Наименование КАК Префикс
//			               |ИЗ
//			               |	Справочник.СМ_ПрефиксыРасценок КАК ПрефиксыРасценок
//			               |ГДЕ
//			               |	ПрефиксыРасценок.ТипНормативногоСборника = &ТипНормативногоСборника";
//			Запрос.УстановитьПараметр("ТипНормативногоСборника",	СтрокаУровня.Ссылка.ТипНормативныхСборников);			   
//			Выборка = запрос.Выполнить().Выбрать();
//			Если выборка.Следующий() Тогда
//				Результат = Сокрлп(Выборка.Префикс) + Результат;
//			КонецЕсли;	
//		КонецЕсли;	
//	КонецЕсли;	
//	
//	Возврат Результат;
//	
//КонецФункции


// *********************************************************************************
// Копирование индексов позиции и обновление ТЧ "Позиции" акта.
//
//Процедура ОбновитьТЧПозицииАкта(КопироватьИндексы,ОбъектСмета,ОбъектАкт,СтрокаДерева,ТекущаяСтрокаПозиции)
//	
//	//Если СтрокаДерева.ОбъемПоАкту <> 0 Тогда
//		
//		Если ТекущаяСтрокаПозиции = Неопределено Тогда
//			НоваяСтрока = ОбъектАкт.Позиции.Добавить();
//		Иначе
//			НоваяСтрока	= ТекущаяСтрокаПозиции;
//		КонецЕсли;
//		
//		// Заполнение строки ТЧ "Позиции" основными показателями.
//		Если (НоваяСтрока.ФактОбъем <> СтрокаДерева.ОбъемПоАкту) ИЛИ (НоваяСтрока.Позиция <> СтрокаДерева.Элемент) Тогда
//			НоваяСтрока.ФактОбъем 					= СтрокаДерева.ОбъемПоАкту;
//			НоваяСтрока.Позиция 					= СтрокаДерева.Элемент;
//			// НоваяСтрока.ФормулаОбъема            = СтрокаДерева.Элемент.ФормулаОбъема;
//			НоваяСтрока.ТекущаяЦена					= СтрокаДерева.Элемент.ТекущаяЦена;
//			НоваяСтрока.ТекущаяЗарплатаМашинистов	= СтрокаДерева.Элемент.ТекущаяЗарплатаМашинистов;
//		КонецЕсли;
//		
//		// Заполнение строки ТЧ "Позиции" значениями коэффифиентов.
//		КоличествоИндексовПересчета = СтрокаДерева.Элемент.КоэффициентыПересчета.Количество(); 
//		Если КопироватьИндексы И КоличествоИндексовПересчета > 0
//			И ОбъектСмета.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Расценка Тогда
//			ТекСтрокаТЧ 							= СтрокаДерева.Элемент.КоэффициентыПересчета[0];
//			НоваяСтрока.ВидРабот                    = ТекСтрокаТЧ.ВидРабот;
//			НоваяСтрока.КоэффОснЗарплаты        	= ТекСтрокаТЧ.КоэффОснЗарплаты;
//			НоваяСтрока.КоэффСтоимЭксплМашин    	= ТекСтрокаТЧ.КоэффСтоимЭксплМашин;
//			НоваяСтрока.КоэффСтоимЗарплатеМашин 	= ТекСтрокаТЧ.КоэффСтоимЗарплатеМашин;
//			НоваяСтрока.КоэффСтоимМатериалов    	= ТекСтрокаТЧ.КоэффСтоимМатериалов;
//			НоваяСтрока.КоэффОборуд             	= ТекСтрокаТЧ.КоэффОборуд;
//			НоваяСтрока.КоэффПолнСтоимРабот     	= ТекСтрокаТЧ.КоэффПолнСтоимРабот;			
//		КонецЕсли;
//		
//		// Если в локальной смете включен флаг "методика ТСН".
//		// происходит заполнение строки ТЧ "Позиции" значениями НР, СП, зимнего удорожания. 
//		Если ОбъектСмета.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_МетодикаТСНГородаМосква Тогда
//		//Если ОбъектСмета.МетодикаТСН Тогда
//			ТекЭлементДерева 							= СтрокаДерева.Элемент;
//			НоваяСтрока.ЗимнееУдорож					= ТекЭлементДерева.ЗимнееУдорож;
//			НоваяСтрока.ЗимнееУдорожМатериал            = ТекЭлементДерева.ЗимнееУдорожМатериал;
//			НоваяСтрока.ЗимнееУдорожМатериалРемонт      = ТекЭлементДерева.ЗимнееУдорожМатериалРемонт;
//			НоваяСтрока.ЗимнееУдорожРемонт              = ТекЭлементДерева.ЗимнееУдорожРемонт;
//			НоваяСтрока.НРТСНБазисРемонт                = ТекЭлементДерева.НРТСНБазисРемонт;
//			НоваяСтрока.НРТСНТекущиеРемонт              = ТекЭлементДерева.НРТСНТекущиеРемонт;
//			НоваяСтрока.СПТСНБазисРемонт                = ТекЭлементДерева.СПТСНБазисРемонт;
//			НоваяСтрока.СПТСНТекущиеРемонт              = ТекЭлементДерева.СПТСНТекущиеРемонт;
//			НоваяСтрока.НакладныеРасходыБазисные        = ТекЭлементДерева.НакладныеРасходыБазисные;
//			НоваяСтрока.НакладныеРасходыТекущие         = ТекЭлементДерева.НакладныеРасходыТекущие;
//			НоваяСтрока.СметнаяПрибыльБазисные          = ТекЭлементДерева.СметнаяПрибыльБазисные;
//			НоваяСтрока.СметнаяПрибыльТекущие           = ТекЭлементДерева.СметнаяПрибыльТекущие;
//		КонецЕсли;
//		 
//	//КонецЕсли;
//	
//КонецПроцедуры


// *********************************************************************
// Обновление табличной части "РесурсыПозицийАкта".
//
//Процедура ОбновитьТЧРесурсыПозицийАкта(ОбъектАкт,СтрокаДерева,ПроцентоватьАкт,Процент,МассивПозиций=Неопределено)
//	
//	Для Каждого ТекСтрока Из СтрокаДерева.Элемент.РесурсыПозицииЛокальнойСметы Цикл
//		
//		СтруктураОтбора = Новый Структура;
//		СтруктураОтбора.Вставить("Позиция",СтрокаДерева.Элемент);
//		СтруктураОтбора.Вставить("Ресурс",ТекСтрока.Ресурс);
//		СтруктураОтбора.Вставить("СметныйКодРесурса",ТекСтрока.СметныйКодРесурса);
//		
//		МассивСтрок = ОбъектАкт.РесурсыПозицийАкта.НайтиСтроки(СтруктураОтбора);
//		Если МассивСтрок.Количество() > 0 Тогда
//			НоваяСтрока = МассивСтрок[0];	
//		Иначе
//			НоваяСтрока 					= ОбъектАкт.РесурсыПозицийАкта.Добавить();
//			НоваяСтрока.Позиция 			= СтрокаДерева.Элемент;
//			ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекСтрока);
//		КонецЕсли;
//		НормаРасходаСПоправками = РассчитатьКоличество(ТекСтрока,СтрокаДерева.Элемент);
//		Если ПроцентоватьАкт Тогда
//			ИзменятьФактОбъем = (НоваяСтрока.ФактРасходаОбъем = НоваяСтрока.НормаРасходаОбъем);
//			Если  МассивПозиций=Неопределено  или НЕ МассивПозиций.Найти(СтрокаДерева.Элемент)=Неопределено Тогда
//				НоваяСтрока.НормаРасходаОбъем = НормаРасходаСПоправками * СтрокаДерева.Элемент.ОбъемРабот * Процент / 100;
//			КонецЕсли;
//			НоваяСтрока.ФактРасходаОбъем = ?(ИзменятьФактОбъем, НоваяСтрока.НормаРасходаОбъем, НоваяСтрока.ФактРасходаОбъем);
//			
//		ИначеЕсли (НоваяСтрока.НормаРасходаОбъем <> ТекСтрока.НормаРасхода * СтрокаДерева.ОбъемПоАкту) Тогда
//			ИзменятьФактОбъем = (НоваяСтрока.ФактРасходаОбъем = НоваяСтрока.НормаРасходаОбъем);
//			НоваяСтрока.НормаРасходаОбъем = ТекСтрока.НормаРасхода * СтрокаДерева.ОбъемПоАкту;
//			НоваяСтрока.ФактРасходаОбъем = ?(ИзменятьФактОбъем, НоваяСтрока.НормаРасходаОбъем, НоваяСтрока.ФактРасходаОбъем);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//КонецПроцедуры


// **************************************************************************
//&НаСервереБезКонтекста
//Функция ПолучитьСледующийНомерНаСервереБезКонтекста(СсылкаНаОбъект, Значение, ПараметрыСменыРодителя, Текст = "копия", НаименованиеБезНомера = "", ПродолжитьНумерацию = Ложь, ПродолжитьНумерациюКопия = Ложь)
//	
//	//	1. Если наименование, содержит число в конце, тогда продолжаем нумерацию.
//	Попытка
//		Число				= Число(Прав(Значение, 1));
//		ПродолжитьНумерацию	= Истина;
//		Возврат СледующийИндексНаСервереБезКонтекста(Значение, НаименованиеБезНомера);	
//	Исключение
//	КонецПопытки;
//	
//	
//	//
//	ТекстИндекс					= СтрНайти(Значение, "(" + Текст, НаправлениеПоиска.СКонца);
//	Если Булево(ТекстИндекс) Тогда
//		ЗначениеБезТекста		= Лев(Значение, ТекстИндекс-1);
//		НаименованиеБезНомера	= ЗначениеБезТекста;
//	Иначе
//		ЗначениеБезТекста		= Значение;
//		НаименованиеБезНомера	= ЗначениеБезТекста;
//	КонецЕсли;
//	
//	ЗначениеКопияБезНомера		= ЗначениеБезТекста + " " + "(" + Текст;
//	
//	// Текст, передаваемый в параметры
//	Выборка				= СледующийИндексЗапросВыбратьНаСервереБезКонтекста(ЗначениеКопияБезНомера, "(" + Текст + ")", ПараметрыСменыРодителя["Родитель"], ПараметрыСменыРодителя["ЛокальнаяСмета"], СсылкаНаОбъект);
//	ВыборкаПерваяКопия	= СледующийИндексЗапросВыбратьПерваяКопияНаСервереБезКонтекста(ЗначениеКопияБезНомера, ПараметрыСменыРодителя["Родитель"], ПараметрыСменыРодителя["ЛокальнаяСмета"], СсылкаНаОбъект);
//	
//	// Проверяем, если в месте копирования, уже созданы копии, тогда продолжить нумерацию.
//	Если ВыборкаПерваяКопия.Следующий() Тогда
//		
//		// Если есть, созданная копия с индексом
//		Если Выборка.Следующий() Тогда
//			
//			ПродолжитьНумерацию			= Истина;
//			ПродолжитьНумерациюКопия	= Истина;
//			ЗначениеНаименования		= Лев(Выборка["Наименование"], СтрДлина(Выборка["Наименование"])-1); //	отнимем скобку
//			
//			Возврат СледующийИндексНаСервереБезКонтекста(ЗначениеНаименования);	
//			
//		Иначе
//			ПродолжитьНумерацию			= Истина;
//			ПродолжитьНумерациюКопия	= Истина;
//			Возврат 1;
//		КонецЕсли;
//			
//	Иначе
//		Возврат 0; //	первая копия
//	КонецЕсли;
//	
//КонецФункции 

#КонецОбласти