////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Процедуры форм ведомостей на выплату заработной платы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМ

// Обработчик события ПриСозданииНаСервере
// 	Устанавливает первоначальные значения реквизитов объекта
//	Инициализирует реквизиты формы
//
// Параметры:
// 	Форма - УправляемаяФорма - форма, которая создаётся.
// 	Отказ - Булево - признак отказа от создания формы.
// 	СтандартнаяОбработка - Булево - признак выполнения стандартной обработки события.
// 	ЗначенияДляЗаполнения - структура с дополнительными заполняемыми реквизитами
//		Имя элемента структуры идентифицирует значение, которое необходимо заполнить
//		Значение элемента структуры - путь к реквизиту формы, значение которого необходимо заполнить
//		Необязательный параметр.
//		По умолчанию заполняются:
//			ПериодРегистрации
//			Организация
//			Подразделение
//			Ответственный
//			ГлавныйБухгалтер
//			Руководитель
//			ДолжностьРуководителя
//
Процедура ВедомостьПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ЗначенияДляЗаполнения = Неопределено) Экспорт
	ВзаиморасчетыССотрудникамиФормыБазовый.ВедомостьПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка, ЗначенияДляЗаполнения)
КонецПроцедуры

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМ

// Обработка сообщений пользователю для форм ведомостей
// 	Привязывает сообщения объекта к полям формы
//
// Параметры:
// 	Форма - УправляемаяФорма.
//
Процедура ВедомостьОбработатьСообщенияПользователю(Форма) Экспорт
	ВзаиморасчетыССотрудникамиФормыБазовый.ВедомостьОбработатьСообщенияПользователю(Форма)	
КонецПроцедуры

// Устанавливает доступность элементов формы ведомости
// 	Документ ввода начальных остатков, или по ведомость, по которой есть выплаты
//	доступны только для просмотра.
//
// Параметры:
// 	Форма - УправляемаяФорма - форма, которая создаётся.
//
Процедура ВедомостьУстановитьДоступностьЭлементов(Форма) Экспорт
	ВзаиморасчетыССотрудникамиФормыБазовый.ВедомостьУстановитьДоступностьЭлементов(Форма);
КонецПроцедуры
