
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	УправлениеЭлементами();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_НаборКонстант" Тогда
		// Изменены настройки программы в панелях администрирования
		УправлениеЭлементами();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьСтатьиРасходов(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.СтатьиРасходов.Форма.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСтатьиДоходов(Команда)
	
	ОткрытьФорму("ПланВидовХарактеристик.СтатьиДоходов.Форма.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПравилаРаспределенияРасходов(Команда)
	
	ОткрытьФорму("Справочник.ПравилаРаспределенияРасходов.Форма.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрочиеРасходы(Команда)
	
	ОткрытьФорму("Справочник.ПрочиеРасходы.Форма.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаправленияДеятельности(Команда)
	
	ОткрытьФорму("Справочник.НаправленияДеятельности.Форма.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСпособыРаспределенияПоНаправлениямДеятельности(Команда)
	
	ОткрытьФорму("Справочник.СпособыРаспределенияПоНаправлениямДеятельности.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиРаспределенияПоНаправлениямДеятельности(Команда)
	
	ОткрытьФорму("РегистрСведений.НастройкаРаспределенияПоНаправлениямДеятельности.ФормаСписка", , ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеЭлементами()
	
	Элементы.ГруппаУчетПрочихДоходовИРасходов.Видимость =
		ПолучитьФункциональнуюОпцию("ИспользоватьУчетПрочихДоходовРасходов");
		
	Элементы.ГруппаУчетПоНаправлениямДеятельности.Видимость =
		ПолучитьФункциональнуюОпцию("ФормироватьФинансовыйРезультат");
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти
