// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

Процедура ПроверитьДокументОснование(ДокументОснование, Отказ) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") ТОГДА
		Если ДокументОснование.ВидОплаты<>Перечисления.ВидыДенежныхСредств.Наличные Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заявка должна быть иметь Вид оплаты 'Наличными'", ДокументОснование, "ВидОплаты", "Объект", Отказ);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры)=Тип("Структура") И Параметры.Свойство("Основание") Тогда
		Отказ = Ложь;
		ПроверитьДокументОснование(Параметры.Основание, Отказ);
		Если Отказ Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = Метаданные.ОбщиеФормы.ФормаНеОткрывать;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры