
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Отменяет утверждение календарного плана-графика.
//
// Параметры:
//  ДокументСсылка  – ссылка на план-график;
//  Отказ           – признак наличия ошибок.
//
Процедура ОтменитьПризнакУтверждения(ДокументСсылка, Отказ = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДокументСсылка = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ТаблицаЗаписей = ПолучитьТаблицуЗаписей(ДокументСсылка);	
	
	Для Каждого мДанныеЗаписи Из ТаблицаЗаписей Цикл
		
		НаборЗаписей = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(мДанныеЗаписи.Период); 		
		НаборЗаписей.Отбор.Работа.Установить(мДанныеЗаписи.Работа);
		НаборЗаписей.Отбор.ВидПланирования.Установить(мДанныеЗаписи.ВидПланирования);
		НаборЗаписей.Отбор.Утверждена.Установить(Истина);
		
		// Очищаем утвержденные записи
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		
		НаборЗаписей = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Период.Установить(мДанныеЗаписи.Период); 		
		НаборЗаписей.Отбор.Работа.Установить(мДанныеЗаписи.Работа);
		НаборЗаписей.Отбор.ВидПланирования.Установить(мДанныеЗаписи.ВидПланирования);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, мДанныеЗаписи);
		НоваяЗапись.Утверждена = Ложь;
		
		Попытка
			НаборЗаписей.Записать();
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось отменить утверждение календарного план-графика %Ссылка% по причине: %Причина%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ДокументСсылка);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
			Метаданные.Документы.УСОERP_УтверждениеКалендарногоПланаГрафика, ДокументСсылка, ТекстСообщения);
			
		КонецПопытки;

	КонецЦикла;

КонецПроцедуры

Функция  ПолучитьТаблицуЗаписей(ДокументСсылка) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.Работа
	|ПОМЕСТИТЬ СписокРабот
	|ИЗ
	|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Работы КАК УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы
	|ГДЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Период,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа КАК Работа,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ВидПланирования,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Утверждена,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаОбъема,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОкончаниеРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ДлительностьПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаДлительности,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.АвторИзменения
	|ИЗ
	|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
	|			,
	|			Работа.Владелец.Владелец = &ОбъектСтроительства
	|				И Работа.Владелец = &СценарийПланирования
	|				И Утверждена
	|				И Работа В
	|					(ВЫБРАТЬ
	|						СписокРабот.Работа
	|					ИЗ
	|						СписокРабот КАК СписокРабот)) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Период,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ВидПланирования,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Утверждена,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОбъемРаботы,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаОбъема,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОкончаниеРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ДлительностьПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ЕдиницаДлительности,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.АвторИзменения";
	
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	ДокументСсылка.ОбъектСтроительства);
	Запрос.УстановитьПараметр("СценарийПланирования", 	ДокументСсылка.СценарийПланирования);
	Запрос.УстановитьПараметр("Ссылка", 				ДокументСсылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецЕсли