&НаКлиенте
Перем ФормаДлительнойОперации;
&НаКлиенте
Перем ПараметрыОбработчика;

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.Свойства
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	//УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	Параметры.ИсходныйЭлемент = Параметры.ЗначениеКопирования;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    //УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура НастройкаОбъекта(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат
	КонецЕсли;
	СтруктураПараметров = ПолучитьДанныеНастройки(Объект.Ссылка);
	Если СтруктураПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ОткрытьФорму("ОбщаяФорма.СМ_НастройкиСметыПообъектно",СтруктураПараметров,,ЭтаФорма.УникальныйИдентификатор);
КонецПроцедуры
 
&НаСервере
Функция ПолучитьДанныеНастройки(ТекОбъект)
	Если ТекОбъект.ЭтоГруппа Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПараметрыФормы = Новый Структура("ТекОбъект", ТекОбъект);
	Возврат ПараметрыФормы;
КонецФункции

&НаКлиенте
Процедура ПутьПроектMSPНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог 				= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ФильтрДляДиалога 	= "MPP (*.mpp)|*.mpp";
	ФильтрДляДиалога 	= ФильтрДляДиалога + "|Все файлы (*.*)|*.*";
	Диалог.Фильтр 		= ФильтрДляДиалога;
	
	// Синхронный вызов
	//Если Диалог.Выбрать() Тогда
	//	Объект.ПутьПроектMSP = Диалог.ПолноеИмяФайла;
	//КонецЕсли;

	// Замена на асинхронный вызов
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтаФорма);
	Диалог.Показать(ОповещениеВыбора);
	
КонецПроцедуры    

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(ВыбранныеФайлы,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		Для Каждого ТекЭлемент Из ВыбранныеФайлы Цикл
			Объект.ПутьПроектMSP = ТекЭлемент;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Параметры.ИсходныйЭлемент)
		И Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Копировать сметные документы?';"
		+ " en = 'Do you want to continue?'"), Режим, 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, ПараметрыВопроса) Экспорт
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Параметры.МожноЗакрыть = Истина;
		Закрыть();
        Возврат;
	КонецЕсли;
	
	ФоновоеЗадание = Ложь;
	СкопироватьСметыНаСервере(ФоновоеЗадание);
	Если ФоновоеЗадание Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеСкопироватьСметы", 1, Истина);
		ПараметрыОбработчика.МаксимальныйИнтервал = 5;
		ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ФоновоеЗаданиеИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкопироватьСметыНаСервере(ФоновоеЗадание = Ложь)

	ПараметрыВызоваСервера = Новый Структура();
	ПараметрыВызоваСервера.Вставить("Стройка", Параметры.ИсходныйЭлемент);
	ПараметрыВызоваСервера.Вставить("НоваяСтройка", Объект.Ссылка);
	
	РезультатФоновогоЗадания = ДлительныеОперации.ЗапуститьВыполнениеВФоне(УникальныйИдентификатор, 
	"Справочники.СМ_ОбъектыСтроительства.СкопироватьСметы",
	ПараметрыВызоваСервера, 
	НСтр("ru = 'Подсистема Смета: Выполнение серверного метода копирования смет'"));
	
	Если РезультатФоновогоЗадания.ЗаданиеВыполнено Тогда
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
		СтруктураХранилище = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураХранилище.ТекстСообщения);
		Параметры.МожноЗакрыть = Истина;
		Закрыть();
	Иначе
		ФоновоеЗадание = Истина;
		ФоновоеЗаданиеИдентификатор  = РезультатФоновогоЗадания.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатФоновогоЗадания.АдресХранилища;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФоновоеЗаданиеСкопироватьСметы()
	Результат = ФоновоеЗаданиеПолучитьРезультат();
	Если Результат.ФоновоеЗаданиеВыполнено Тогда
		Если ФормаДлительнойОперации.Открыта() 
			И ФормаДлительнойОперации.ИдентификаторЗадания = ФоновоеЗаданиеИдентификатор Тогда
				ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		КонецЕсли;
		СтруктураХранилище = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураХранилище.ТекстСообщения);
		Параметры.МожноЗакрыть = Истина;
		Оповестить("ОбновитьДеревоСмет",Новый Структура("Стройка",Объект.Ссылка));
		Закрыть();
	Иначе
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
		ПодключитьОбработчикОжидания("ФоновоеЗаданиеСкопироватьСметы", ПараметрыОбработчика.ТекущийИнтервал, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ФоновоеЗаданиеПолучитьРезультат()
	Результат = Новый Структура;
	Результат.Вставить("ФоновоеЗаданиеВыполнено", Ложь);
	Результат.ФоновоеЗаданиеВыполнено = ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ИсходныйЭлемент)
		И Не Параметры.МожноЗакрыть Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

