////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает ссылку на объект по полному имени метаданных и заданному идентификатору
// Объекты, которые предполагают идентификацию должны содержать реквизит "ИдентификаторОбъекта"
// Если объекта с заданным идентификатором нет, возвращает пустую ссылку соответствующего типа
//
Функция СсылкаНаОбъектПоИдентификатору(ПолноеИмяОбъекта, ИдентификаторОбъекта) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Объекты.Ссылка КАК Ссылка
	|ИЗ
	|	#ПолноеИмяОбъекта КАК Объекты
	|ГДЕ
	|	Объекты.ИдентификаторОбъекта = &ИдентификаторОбъекта");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяОбъекта", ПолноеИмяОбъекта);
	Запрос.УстановитьПараметр("ИдентификаторОбъекта", ИдентификаторОбъекта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ПолноеИмяОбъекта).ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

// Возвращает ссылку на головную организацию
Функция ГоловнаяОрганизация(Организация) Экспорт
	//* Возврат РегламентированнаяОтчетность.ГоловнаяОрганизация(Организация);
	Возврат Организация;
КонецФункции

// Функция определяет является ли организация юридическим лицом 
// 
Функция ЭтоЮридическоеЛицо(Организация) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ЮридическоеФизическоеЛицо") <> Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
КонецФункции

// Возвращает ссылку на "Регистрацию в налоговом органе"
Функция ПолучитьРегистрациюОрганизацииВНалоговомОргане(Организация) Экспорт
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "РегистрацияВНалоговомОргане");	
КонецФункции	

