
&НаКлиенте
Процедура ВыполнитьОбменАвтоматически()
	
	Объект.ВидОбмена = "Справочники";
	Получатель = ПолучитьУзелУПП();
	АвтоматическаяСинхронизация = Истина;
	ОбменДаннымиКлиент.ВыполнитьОбменДаннымиОбработкаКоманды(Получатель, ЭтотОбъект,, АвтоматическаяСинхронизация);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыполнитьОбмен_ДокументыАвтоматически()
	
	Объект.ВидОбмена = "Документы";
	Получатель = ПолучитьУзелУПП_Документы();
	АвтоматическаяСинхронизация = Истина;
	ОбменДаннымиКлиент.ВыполнитьОбменДаннымиОбработкаКоманды(Получатель, ЭтотОбъект,, АвтоматическаяСинхронизация);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьУзелУПП()
	
	Получатель = ПланыОбмена.ОбменУправлениеПредприятиемCУПП_Справочники.НайтиПоКоду("US");//УПП
	Возврат Получатель;
	
КонецФункции // ПолучитьУзел()


&НаСервере
Функция ПолучитьУзелУПП_Документы()
	
	Получатель = ПланыОбмена.ОбменУправлениеПредприятиемCУПП.НайтиПоКоду("US");//УПП
	
	Возврат Получатель;
	
КонецФункции // ПолучитьУзел()


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если    ИмяСобытия = "ВыполненОбменДанными"
		ИЛИ ИмяСобытия = "Запись_СценарииОбменовДанными"
		ИЛИ ИмяСобытия = "Запись_УзелПланаОбмена"
		ИЛИ ИмяСобытия = "ЗакрытаФормаПомощникаСопоставленияОбъектов"
		ИЛИ ИмяСобытия = "ЗакрытаФормаПомощникаСозданияОбменаДанными"
		ИЛИ ИмяСобытия = "ЗакрытаФормаРезультатовОбменаДанными" Тогда
		
		ТекстСообщения = "Обмен выполнен";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Если ЗавершатьРаботу1С И Объект.ВидОбмена="Документы" Тогда
			
			ТекстСообщения = "Готов завершить работу 1С";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ЗавершитьРаботуСистемы(Ложь, Ложь);
			Возврат;
		КонецЕсли; 
		
		// Работает Код возврата =0 сразу а это не подходит если запускать 1cestart	
		//ТекстКоманды = 	"""C:\Program Files\1cv8\common\1cestart.exe"" ENTERPRISE  /RunModeOrdinaryApplication /S ""localhost\Work"" /N ОбменЕРПCправочники /P 111"; 
		Если Объект.ВидОбмена="Справочники" Тогда
			ТекстКоманды = 	"""C:\Program Files\1cv8\8.3.19.1150\bin\1cv8.exe"" ENTERPRISE  /RunModeOrdinaryApplication /S ""localhost\Work"" /N ОбменЕРПCправочники /P 111";
		Иначе
			ТекстКоманды = 	"""C:\Program Files\1cv8\8.3.19.1150\bin\1cv8.exe"" ENTERPRISE  /RunModeOrdinaryApplication /S ""localhost\Work"" /N ОбменЕРП /P 111"; 
		КонецЕсли;
		
		КодВозврата = Неопределено;
		ЗапуститьПриложение(ТекстКоманды, КаталогПрограммы(), Истина, КодВозврата);
		Если (КодВозврата = Неопределено Или КодВозврата > 0) И Объект.ВидОбмена="Документы" Тогда
			ТекстСообщения = "НЕ Завершена 1С УПП";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			ЗавершитьРаботуСистемы(Ложь, Ложь);
		Иначе    
			Если Объект.ВидОбмена="Справочники" Тогда
				
				ТекстСообщения = "Завершена 1С УПП";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				ЗавершатьРаботу1С=Ложь;	
				ВыполнитьОбменАвтоматически();
				
				ВыполнитьОбмен_ДокументыАвтоматически();
				
			Иначе
				
				ТекстСообщения = "Завершена 1С УПП";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
				ЗавершатьРаботу1С=Истина;	
				ВыполнитьОбмен_ДокументыАвтоматически();
				
			КонецЕсли;
			
		Конецесли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗавершатьРаботу1С=Ложь;	
	ВыполнитьОбменАвтоматически();	
КонецПроцедуры
