
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Отказ = Не СМ_СметаВызовСервера.КонтрольУникальности("СМ_ЕдиницыИзмеренияСмета", "Наименование", ТекущийОбъект.Наименование, ТекущийОбъект.Ссылка);     
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Единица %1 не уникальна, она не сохранена в справочнике!!!'"), ТекущийОбъект.Наименование));	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АльтернативныеЕдиницы(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЕдиницаИзмерения",Объект.Ссылка);
	ОткрытьФорму("РегистрСведений.СМ_АльтернативныеНазванияЕдиницИзмеренияСмета.Форма.ФормаСписка",СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти
