
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Макет = ПланыОбмена.ОбменУправлениеПредприятиемБухгалтерия20.ПолучитьМакет("ПодробнаяИнформация");
	ПолеHTMLДокумента = Макет.ПолучитьТекст();
	
	Заголовок = НСтр("ru='Информация о синхронизации данных конфигураций BAS ERP ред. 2.5 и Бухгалтерия ред. 2.1';uk='Інформація про синхронізацію даних конфігурацій BAS ERP ред. 2.5 і Бухгалтерія ред. 2.1'");

КонецПроцедуры
