
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ДСКасса.Записывать = Истина;
	
	Для Каждого Строка Из  ОстаткиКасс Цикл   
		Движение 						= Движения.ДСКасса.Добавить();  
		Движение.Касса                  = Строка.Касса; 
		Движение.Период 				= Дата;
		Движение.ВидДвижения			= ВидДвиженияНакопления.Приход;
		Движение.Сумма 					= Строка.Остаток;
		Движение.СуммаКомиссииФА 		= Строка.Комиссия;
	КонецЦикла;   
	
	Константы.ДатаНачалаУчетаСтоимостиНаличных.Установить(Дата);  
	
	Набор = РегистрыСведений.ДатаПоследовательностиКассы.СоздатьНаборЗаписей();
	Набор.Записать();
	
	//Если НЕ Отказ Тогда 
	//	ДопМодуль.ОбновитьПоследовательностьКассы(Ссылка);
	//КонецЕсли;
	
КонецПроцедуры      

Процедура ОбработкаУдаленияПроведения(Отказ) 
	Константы.ДатаНачалаУчетаСтоимостиНаличных.Установить('00010101'); 
	Набор = РегистрыСведений.ДатаПоследовательностиКассы.СоздатьНаборЗаписей();
	Набор.Записать();
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Дата= НачалоДня(Дата);
КонецПроцедуры

