
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.уатПутевойЛист") Тогда
		Водитель = ДанныеЗаполнения.Водитель1;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		Организация = ДанныеЗаполнения.Организация;
		Колонна = уатОбщегоНазначения.МестонахождениеТС(ДанныеЗаполнения.ТранспортноеСредство, ТекущаяДата()).Колонна;
		ТС = ДанныеЗаполнения.ТранспортноеСредство;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти