#Область ПрограммныйИнтерфейс

// Формирует (выводит пользователю) предварительно настроенную справку-расчет с данными за месяц.
//
// Параметры:
//  ИмяОтчета	 - Строка - имя формируемого отчета
//  Месяц		 - Дата - любая дата, относящаяся к месяцу, за который нужно сформировать отчет
//  Организация	 - СправочникСсылка.Организации - организация, по которой нужно сформировать отчет
//  Владелец     - УправляемаяФорма, ГруппаФормы, ТаблицаФормы, ПолеФормы, КнопкаФормы - владелец открываемой формы.
//
Процедура СформироватьОтчетПоРезультатамМесяца(ИмяОтчета, Месяц, Организация, Владелец) Экспорт
	
	ИмяФормы = "Отчет." + ИмяОтчета + ".Форма";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СформироватьПриОткрытии",   Истина);
	ПараметрыФормы.Вставить("Организация",               Организация);
	ПараметрыФормы.Вставить("НачалоПериода",             НачалоМесяца(Месяц));
	ПараметрыФормы.Вставить("КонецПериода",              КонецМесяца(Месяц));
	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, Владелец, Истина);
	// Поиск формы по ключу уникальности не выполняется,
	// так как после открытия формы пользователь может поменять реквизиты контекста - 
	// то есть, для него эта форма уже не будет как-либо связана с регламентной операцией
	// и ее переформирование может оказаться неожиданным.
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы // включая события элементов формы и обработчики команд

Процедура НачатьВыборПериода(Форма, СтандартнаяОбработка, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод) Экспорт
	
	СтандартнаяОбработка = Ложь;
	ПериодНачатьВыбор(Форма, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод);
	
КонецПроцедуры

Процедура НачатьВыборИнтервала(Форма, ОбработчикВыбора) Экспорт
	
	// По аналогии с ПериодНачатьВыбор, однако используется другая форма и обработка выбора реализована непосредственно в форме.
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("НачалоПериода",    Форма.Отчет.НачалоПериода);
	ПараметрыВыбора.Вставить("КонецПериода",     Форма.Отчет.КонецПериода);
	ПараметрыВыбора.Вставить("ОграничениеСнизу", Форма.ДатаРегистрацииОрганизации);
	ПараметрыВыбора.Вставить("Кратность",        ПредопределенноеЗначение("Перечисление.Периодичность.Месяц"));
	
	ОткрытьФорму(
		"ОбщаяФорма.ВыборСтандартногоПериода",
		ПараметрыВыбора,
		Форма,
		, // Уникальность
		, // Окно
		, // НавигационнаяСсылка
		ОбработчикВыбора);
	
КонецПроцедуры

Процедура УстановитьТекущийПериод(Форма, СтандартнаяОбработка, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ИзменениеПериодаМесяц(Форма, ОбщегоНазначенияКлиент.ДатаСеанса(), ОбработчикНастроитьЭлементИнформацияНалоговыйПериод);
	
КонецПроцедуры

Процедура СНачалаГодаПриИзменении(Форма, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод) Экспорт
	
	СправкиРасчетыКлиентСервер.ОтметитьОтчетНеАктуальный(Форма);
	
	НастроитьПериодМесяц(Форма, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод);
	
КонецПроцедуры

Функция НастроитьПериодИнтервал(Форма, ЦелыйИнтервал = Неопределено) Экспорт
	
	// Возвращаемое значение определяет,
	// требуется ли передача управления на сервер и вызов СправкиРасчеты.НастроитьЭлементИнформацияНалоговыйПериод().
			
	// Определим начало периода отчета.
	ИнформацияНалоговыйПериод = СправкиРасчетыКлиентСервер.ОпределитьПериодОтчета(Форма, ЦелыйИнтервал);
	
	// Отобразим информацию о налоговом периоде
	УдалосьНастроитьНаКлиенте = ИнформированиеНалоговыйПериодКлиент.НастроитьЭлементИнформацияНалоговыйПериод(
		Форма.Элементы,
		ИнформацияНалоговыйПериод);
		
	Если УдалосьНастроитьНаКлиенте Тогда
		Возврат Неопределено;
	Иначе
		Возврат ИнформацияНалоговыйПериод;
		// Требуется передача управления на сервер и вызов ИнформированиеНалоговыйПериод.НастроитьЭлементИнформирования.
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область НалоговыйПериод

Процедура ПериодНачатьВыбор(Форма, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод)
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("НачалоПериода",    Форма.Отчет.НачалоПериода);
	ПараметрыВыбора.Вставить("КонецПериода",     Форма.Отчет.КонецПериода);
	ПараметрыВыбора.Вставить("ВидПериода",       СправкиРасчетыКлиентСервер.ВидПериодаМесяц());
	ПараметрыВыбора.Вставить("ОграничениеСнизу", Форма.ДатаРегистрацииОрганизации);
	
	ПараметрыОбработчика = ПараметрыОбработчикаВыборПериода(
		Форма,
		ОбработчикНастроитьЭлементИнформацияНалоговыйПериод);
	
	ОткрытьФорму(
		"ОбщаяФорма.ВыборСтандартногоПериодаМесяц",
		ПараметрыВыбора,
		Форма,
		, // Уникальность
		, // Окно
		, // НавигационнаяСсылка
		Новый ОписаниеОповещения("ВыборПериода", СправкиРасчетыКлиент, ПараметрыОбработчика));
	
	// См. далее ВыборПериода()
	
КонецПроцедуры

Процедура ВыборПериода(РезультатВыбора, ПараметрыОбработчика) Экспорт // Обработчик оповещения
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Фактически, результат выбора периода - это одна дата. Обработаем ее.
	ИзменениеПериодаМесяц(
		ПараметрыОбработчика.Форма,
		РезультатВыбора.КонецПериода,
		ПараметрыОбработчика.ОбработчикНастроитьЭлементИнформацияНалоговыйПериод);
	
КонецПроцедуры

Функция ПараметрыОбработчикаВыборПериода(Форма, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод)
	
	ПараметрыОбработчика = Новый Структура;
	ПараметрыОбработчика.Вставить("Форма", Форма);
	ПараметрыОбработчика.Вставить(
		"ОбработчикНастроитьЭлементИнформацияНалоговыйПериод",
		ОбработчикНастроитьЭлементИнформацияНалоговыйПериод);
		
	Возврат ПараметрыОбработчика;
	
КонецФункции

Процедура ИзменениеПериодаМесяц(Форма, Период, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод)
	
	СправкиРасчетыКлиентСервер.ОтметитьОтчетНеАктуальный(Форма);
	
	Форма.Отчет.КонецПериода = КонецМесяца(Период);
	
	СправкиРасчетыКлиентСервер.НастроитьДиалогВыбораПериода(Форма);
	
	// Настроим период, определяемый двумя датами.
	НастроитьПериодМесяц(Форма, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод);
	
КонецПроцедуры

Процедура НастроитьПериодМесяц(Форма, ОбработчикНастроитьЭлементИнформацияНалоговыйПериод)
	
	ИнформацияНалоговыйПериодДляПередачиНаСервер = НастроитьПериодИнтервал(Форма);
	
	Если ИнформацияНалоговыйПериодДляПередачиНаСервер = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	// Передает управление на сервер и вызывает там СправкиРасчеты.НастроитьЭлементИнформацияНалоговыйПериод().
	ВыполнитьОбработкуОповещения(ОбработчикНастроитьЭлементИнформацияНалоговыйПериод, ИнформацияНалоговыйПериодДляПередачиНаСервер);
	
КонецПроцедуры

#КонецОбласти
