#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	МеждународнаяОтчетностьСервер.ПриКомпоновкеРезультата(СхемаКомпоновкиДанных, КомпоновщикНастроек, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
	ОбластьИтога = ДокументРезультат.НайтиТекст(НСтр("ru='Дебетовый оборот';uk='Дебетовий оборот'"));
	Область = ДокументРезультат.НайтиТекст(НСтр("ru='Валюта отчета';uk='Валюта звіту'"));
	Если Область <> Неопределено И ОбластьИтога <> Неопределено Тогда
		Для НомерКолонки = Область.Лево + 1 По ОбластьИтога.Лево - 1 Цикл
			Колонка = "C"+Строка(НомерКолонки);
			ИмяОбласти = "R"+Строка(Область.Верх)+Колонка+":R"+Строка(ДокументРезультат.ФиксацияСверху)+Колонка;
			ШапкаКорСчета = ДокументРезультат.Область(ИмяОбласти);
			ШапкаКорСчета.Объединить();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
