// Механизм расчета статусов оформления документов ВЕТИС.
//

#Область СлужебныйПрограммныйИнтерфейс

// Позволяет переопределить имена реквизитов документа-основания для документа ВЕТИС.
//
// Параметры:
//	МетаданныеДокументаОснования - ОбъектМетаданных:Документ - метаданные документа из ОпределяемыйТип.Основание<Имя документа ВЕТИС>
//	МетаданныеДокументаВЕТИС 	 - ОбъектМетаданных:Документ - метаданные документа из ОпределяемыйТип.ДокументыВЕТИСПоддерживающиеСтатусыОформления
//	Реквизиты 					 - Структура - имена реквизитов
//		Ключ 	 - служебное имя реквизита в ВЕТИС
//		Значение - имя реквизита документа-основания, которое при необходимости надо переопределить
//			Подробнее см. описание РасчетСтатусовОформленияВЕТИС.СтруктураРеквизитовДляРасчетаСтатусаОформленияДокументовВЕТИС	
//
Процедура ПриОпределенииИменРеквизитовДокументаДляРасчетаСтатусаОформленияДокументаВЕТИС(
			Знач МетаданныеДокументаОснования, Знач МетаданныеДокументаВЕТИС, Реквизиты) Экспорт
	
	//++ НЕ ГОСИС
	РасчетСтатусовОформленияВЕТИСУТ.ПриОпределенииИменРеквизитовДокументаДляРасчетаСтатусаОформленияДокументаВЕТИС(
		МетаданныеДокументаОснования,
		МетаданныеДокументаВЕТИС,
		Реквизиты);
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

// Позволяет переопределить текст запроса выборки данных из документов-основания для расчета статуса оформления.
//
// Параметры:
//	МетаданныеДокументаОснования - ОбъектМетаданных:Документ - метаданные документа из ОпределяемыйТип.Основание<Имя документа ВЕТИС>
//	МетаданныеДокументаВЕТИС 	 - ОбъектМетаданных:Документ - метаданные документа из ОпределяемыйТип.ДокументыВЕТИСПоддерживающиеСтатусыОформления
//	ТекстЗапроса 				 - Строка - текст запроса выборки данных, который надо переопределить
//		Требования к тексту запроса:
//		- результат запроса обязательно должен содержать следующие поля:
//			- Ссылка 			- ОпределяемыйТип.Основание<Имя документа ВЕТИС> - ссылка на документ-основание
//			- ЭтоДвижениеПриход - Булево - вид движения ТМЦ (Истина - приход, Ложь - расход)
//			- Номенклатура 		- ОпределяемыйТип.Номенклатура - номенклатура
//			- Характеристика 	- ОпределяемыйТип.ХарактеристикаНоменклатуры - характеристика номенклатуры
//			- Серия 			- ОпределяемыйТип.СерияНоменклатуры - серия номенклатуры
//			- Количество 		- Число - количество номенклатуры в ее основной единице измерения
//		- в результат запроса нужно включать только подконтрольную номенклатуру ВЕТИС
//		- для отбора документов-основания в запросе нужно использовать отбор "В (&МассивДокументов)"
//		- выбранные данные необходимо поместить во временную таблицу,
//			см. РасчетСтатусовОформленияВЕТИС.ИмяВременнойТаблицыДляВыборкиДанныхДокумента
//		Если данные из документа выбирать не требуется, то данному параметру надо присвоить значение "" (пустая строка).
//	ДополнительныеПараметрыЗапроса - Структура - дополнительные параметры запроса,
//	 	требуемые для выполнения запроса конкретного документа; при необходимости можно дополнить данную структуру
//		- Ключ 	   - имя параметры
//		- Значение - значение параметра
//
Процедура ПриОпределенииТекстаЗапросаДляРасчетаСтатусаОформленияДокументаВЕТИС(
			Знач МетаданныеДокументаОснования, Знач МетаданныеДокументаВЕТИС, ТекстЗапроса, ДополнительныеПараметрыЗапроса) Экспорт
	
	//++ НЕ ГОСИС
	РасчетСтатусовОформленияВЕТИСУТ.ПриОпределенииТекстаЗапросаДляРасчетаСтатусаОформленияДокументаВЕТИС(
		МетаданныеДокументаОснования,
		МетаданныеДокументаВЕТИС,
		ТекстЗапроса,
		ДополнительныеПараметрыЗапроса);
	//-- НЕ ГОСИС
	Возврат;
	
КонецПроцедуры

#КонецОбласти
