
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СуммаПБУ2_2008", СуммаПБУ2_2008) ИЛИ НЕ Параметры.Свойство("СуммаВыполнено", СуммаВыполнено) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаВыполнено(Команда)
	
	Результат = Новый Структура("Сумма, ВыборПользователя", СуммаВыполнено, "ПТО");
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаПБУ2_2008(Команда)
	
	Результат = Новый Структура("Сумма, ВыборПользователя", СуммаПБУ2_2008, "ПТО");
	Закрыть(Результат);
	
КонецПроцедуры
