
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ДокСсылка;
Перем СметнаяПрограмма;
Перем ФорматВыгрузки;
Перем ТекущаяСмета;
Перем ТекущийРаздел;
Перем ТекущаяПозицияЛС;
Перем ТекКонтрагент;
Перем Форма;
Перем ПрефиксыПрограммы;

#КонецОбласти

#Область ПроцедурыИФункцииЭкспорта

// Основная процедура выгрузки документов в файл в формате KENML. 
// Вызывается из модуля формы обработки по кнопке "Выгрузить".
// 
//  Параметры:
//   ФорматВыгрузки		- Формат выгрузки указанный на форме.
//   ДокументВыгрузки	- Строка таблицы смет.
// 
Процедура ВыгрузитьВФайлKENML(ДокументВыгрузки,АдресФайлаВоВременномХранилище,ИмяВременногоФайла) Экспорт 
	
	СметнаяПрограмма = ?(СметнаяПрограммаВыбор.Пустая(),Справочники.СМ_СметныеПрограммы.Смета30,СметнаяПрограммаВыбор);
		
	ФайлВыгрузки = ДокументВыгрузки.Файл;
	
	АдресФайлаВоВременномХранилище = Новый Соответствие;
	
	ЗаписьXML 		= Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла,"UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ДОКУМЕНТ");
	ЗаписьXML.ЗаписатьАтрибут("ВерсияФормата","01.00");
	ЗаписьXML.ЗаписатьАтрибут("Тип","1");
	ЗаписьXML.ЗаписатьАтрибут("ГЕНЕРАТОР","SANA-2015");
	ЗаписьXML.ЗаписатьАтрибут("Дата",Формат(ДокументВыгрузки.Смета.Дата,"ДФ=dd.MM.yyyy"));
	ЗаписьXML.ЗаписатьАтрибут("Время",Формат(ДокументВыгрузки.Смета.Дата,"ДЛФ=T"));
	ЗаписьXML.ЗаписатьАтрибут("ВерсияСНБ","");
	ЗаписьXML.ЗаписатьАтрибут("Версия","");
	ЗаписьXML.ЗаписатьАтрибут("УникальныйИдентификатор","");
	ЗаписьXML.ЗаписатьАтрибут("НаименованиеСтройки","");
	ЗаписьXML.ЗаписатьАтрибут("ШифрСтройки","");
	ЗаписьXML.ЗаписатьАтрибут("СтадияПроектирования","");
	ЗаписьXML.ЗаписатьАтрибут("Руководитель","");
	ЗаписьXML.ЗаписатьАтрибут("ГИП","");
	ЗаписьXML.ЗаписатьАтрибут("НачальникСметногоОтдела","");
	ЗаписьXML.ЗаписатьАтрибут("Валюта","");
	ЗаписьXML.ЗаписатьАтрибут("КодВалюты","");
	ЗаписьXML.ЗаписатьАтрибут("НомерРегиона","");
	ЗаписьXML.ЗаписатьАтрибут("НомерРайона","");
	ЗаписьXML.ЗаписатьАтрибут("НомерЗоны","");
	ЗаписьXML.ЗаписатьАтрибут("НомерЗоныКСЦ","");
	ЗаписьXML.ЗаписатьАтрибут("КодОрганизации","");
	ЗаписьXML.ЗаписатьАтрибут("ВидСтроительства","");
	ЗаписьXML.ЗаписатьАтрибут("ПоказательНК2","");
	ЗаписьXML.ЗаписатьАтрибут("ПоказательСП","");
	ЗаписьXML.ЗаписатьАтрибут("УровеньЦен","");
	ЗаписьXML.ЗаписатьАтрибут("ОкруглениеЕдиницы","");
	ЗаписьXML.ЗаписатьАтрибут("ОкруглениеВсего","");
	ЗаписьXML.ЗаписатьАтрибут("ОкруглениеТрудЕдиницы","");
	ЗаписьXML.ЗаписатьАтрибут("ОкруглениеТрудВсего","");
	ЗаписьXML.ЗаписатьАтрибут("Глава","");
	ЗаписьXML.ЗаписатьАтрибут("НаименованиеОбъекта","");
	ЗаписьXML.ЗаписатьАтрибут("НаименованиеДок","");
	ЗаписьXML.ЗаписатьАтрибут("ШифрОбъекта","");
	ЗаписьXML.ЗаписатьАтрибут("ШифрСметы","");
	ЗаписьXML.ЗаписатьАтрибут("СписокЧертежей","");
	ЗаписьXML.ЗаписатьАтрибут("СтроительныйОбъем","");
	ЗаписьXML.ЗаписатьАтрибут("Измеритель","");
	ЗаписьXML.ЗаписатьАтрибут("НомерДокумента",ДокументВыгрузки.Смета.НомерСметы);
	ЗаписьXML.ЗаписатьАтрибут("СписокРабот","");
	ЗаписьXML.ЗаписатьАтрибут("Составил","");
	ЗаписьXML.ЗаписатьАтрибут("Проверил","");
	ЗаписьXML.ЗаписатьАтрибут("ВводДанных","");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СТРУКТУРА");
	
	ДеревоРасценок = Новый ДеревоЗначений;
	ДеревоРасценок.Колонки.Добавить("НомерПозиции");
	ДеревоРасценок.Колонки.Добавить("Позиция");
	ДеревоРасценок.Колонки.Добавить("ЕдИзм");
	ДеревоРасценок.Колонки.Добавить("Объем");
	ДеревоРасценок.Колонки.Добавить("ТипПозиции");
	ДеревоРасценок.Колонки.Добавить("Ид");
	ДеревоРасценок.Колонки.Добавить("ИдРодителя");
	ДеревоРасценок.Колонки.Добавить("Расчет");	
	
	Если ДокументВыгрузки.Смета.Метаданные().Имя  = "АктВыполненныхРабот" Тогда
		ДеревоРасценок.Колонки.Добавить("НомерПоСмете");	
	КонецЕсли; 
			
	ПараметрыДокумента 	= Новый Структура("ВыводитьЗаголовокСметы,ЗаполнитьАктСметой,ВыводитьРесурсы,Документ",истина, ложь, ложь, истина);
	ДокСсылка 			= СоберемТаблицыДокумента(ДокументВыгрузки.Смета);
	
	ДокЗаполнитьДеревоДокумента(ДокументВыгрузки.Смета, ДеревоРасценок, ПодготовитьТаблицуРеквизитов(ДокументВыгрузки.Смета, ДеревоРасценок), ПараметрыДокумента, ДокСсылка);
	ОбходСтрокДереваДокументов(ЗаписьXML,ДокументВыгрузки.Смета,ДеревоРасценок.Строки, ДокСсылка, ФорматВыгрузки); 
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // СТРУКТУРА
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИТОГДОК");
	ЗаписьXML.ЗаписатьАтрибут("ID","");
	ЗаписьXML.ЗаписатьАтрибут("Строительные","");
	ЗаписьXML.ЗаписатьАтрибут("Монтажные","");
	ЗаписьXML.ЗаписатьАтрибут("ИнженерноеОБ","0");
	ЗаписьXML.ЗаписатьАтрибут("ТехнологическоеОБ","0");
	ЗаписьXML.ЗаписатьАтрибут("МебельИнвентарь","0");
	ЗаписьXML.ЗаписатьАтрибут("Прочие","");
	ЗаписьXML.ЗаписатьАтрибут("Всего","");
	ЗаписьXML.ЗаписатьАтрибут("ЗатратыПодрядчика","");
	ЗаписьXML.ЗаписатьАтрибут("ЗатратыЗаказчика","");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // ИТОГДОК
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("ИТОГРЕСУРС");
	ЗаписьXML.ЗаписатьКонецЭлемента(); // ИТОГРЕСУРС
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); // ДОКУМЕНТ

	Попытка
		ЗаписьXML.Закрыть();
		ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
		АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, Новый УникальныйИдентификатор);
		АдресФайлаВоВременномХранилище.Вставить(ФайлВыгрузки,АдресФайла);

	Исключение
		СтруктураСообщения 	= Новый Структура;
		СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
		СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
		СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не удалось записать в файл: %1'"), ФайлВыгрузки));
		СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
		
		СообщенияДляЖурнала	= Новый СписокЗначений();
		СообщенияДляЖурнала.Добавить(СтруктураСообщения);
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
	КонецПопытки;
		
КонецПроцедуры //  ВыгрузитьВФайлKENML()

// Процедура формирует строку информации о разделах, позициях и поправках.
// В АРПС 1.10 - Тип 10 - Заголовок раздела документа, Тип 20 - Позиция документа,
// Тип 25 - поправочные коэффициенты.
// Записи раздела используются для задания структуры документа. 
// Записи позиций задают состав работ документа.
// Записи поправок задают состав и значения поправочных коэффициентов, 
// примененных к ближайшей предшествующей позиции документа.
// 
//  Параметры:
//   ТекстВыгрузки 			 - ТекстовыйДокумент - формируемый текст выгрузки.
//   Документ 				 - ДокументСсылка,ДокументОбъект - документ Локальная смета или Акт выполненных работ.
//   СтрокиДерева 			 - КоллекцияСтрокДереваЗначений - строки дерева документов,
//   						                                  по которым будет формироваться рекурсивно записи о структуре.
//   ТЗРазделыЛС  			 - ТаблицаЗначений - таблица разделов локальной сметы.
//   ТЗПозицииЛС  			 - ТаблицаЗначений - таблица позиций локальной сметы.
//   ТЗВидСтоимостиНаЕдиницу - ТаблицаЗначений - таблица информации о стоимостных показателях
//   						   					 позиций локальной сметы.
//   ТаблицаПоправок 		- ТаблицаЗначений - таблица поправочных коэффициентов.
//   РазрешеныПоправки 		- Булево - определяет формирование поправочных коэффициентов.
// 
Процедура ОбходСтрокДереваДокументов(ЗаписьXML,ДокументСсылка,СтрокиДерева, ДокСсылка, ФорматВыгрузки)
	
	МетодРасчета = ДокументСсылка.МетодРасчета;
	
	Для Каждого СтрокаДерева Из СтрокиДерева Цикл
		
		//  Выгрузка раздела
		Если СтрокаДерева.ТипПозиции = "Раздел" И СтрокаДерева.Расчет Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("РАЗДЕЛ");
			
			НомерРаздела 		= СтрокаДерева.НомерПозиции;
			НаименованиеРаздела = СтрокаДерева.Позиция.НаименованиеДляПечати;
			ТекущийРаздел		= СтрокаДерева.Позиция; 
			ТекУровень 			= СтрокаДерева.Уровень();
					
			ЗаписьXML.ЗаписатьАтрибут("Тип",?(СтрокаДерева.Позиция.ИДРодителя = СтрокаДерева.Позиция.ИДСметы,"3","4"));
			ЗаписьXML.ЗаписатьАтрибут("ID",XMLСтрока(НомерРаздела));
			ЗаписьXML.ЗаписатьАтрибут("Наименование",НаименованиеРаздела);
			ЗаписьXML.ЗаписатьАтрибут("Измеритель","");
			ЗаписьXML.ЗаписатьАтрибут("Примечание","");
			

						
			мСтрокиРасценок = Новый ТаблицаЗначений();
			Если НЕ СтрокаДерева.Строки.Количество() = 0 Тогда
				мСтрокиРасценок = МассивРасценок(СтрокаДерева.Строки[0].ИДРодителя);
			Иначе
				мСтрокиРасценок.Очистить();
			КонецЕсли;	
			
			Для Каждого СтрокаРасценки Из мСтрокиРасценок Цикл
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ПОЗИЦИЯ");
				
				КодПозиции				= СтрокаРасценки.Шифр;						// строкаРасценки.Позиция.Ид;
				НомерСтрокиВДокументе	= СтрокаРасценки.НомерВПределахСметы;
				ЕдИзм					= Строка(СтрокаРасценки.ЕдИзм);
				КомментарийРасценки     = СокрЛП(СтрокаРасценки.Комментарий);
				ОбъемРабот        		= СтрокаРасценки.Объем;
				ТекПозицияЛС 			= СтрокаРасценки.Позиция;

				Если ЗначениеЗаполнено(СтрокаРасценки.СобственноеНаименование) Тогда
					НаименованиеПозиции = СтрокаРасценки.СобственноеНаименование; 
				Иначе
					НаименованиеПозиции = СтрокаРасценки.Позиция.ПолноеНаименование;
				КонецЕсли;
			
				//  Вид затрат
				ТекВидРабот	= ТекПозицияЛС.Определитель.ВидРабот;
				ТекТипПозиции = "0";
				Если ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СтроительныеРаботы Тогда
					ТекТипПозиции = "0";	
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.РемонтноСтроительныеРаботы Тогда
					ТекТипПозиции = "0";
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.МонтажныеРаботы Тогда
					ТекТипПозиции = "0";
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.ПусконаладочныеРаботы Тогда
					ТекТипПозиции = "0";	
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.Транспортировка Тогда
					ТекТипПозиции = "6";	
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы Тогда
					ТекТипПозиции = "1";	
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаЭксплуатациюМашин Тогда
					ТекТипПозиции = "3";	
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.Калькуляция Тогда
					ТекТипПозиции = "0";	
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.УкрупненныеСметныеНормы Тогда
					ТекТипПозиции = "0";
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.ПрейскурантОптовыхЦенНаМатериалыИОборудование Тогда
					ТекТипПозиции = "1";
				ИначеЕсли ТекПозицияЛС.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.РеставрационноВосстановительныеРаботы Тогда
					ТекТипПозиции = "0";	
				КонецЕсли;
				
				ЗаписьXML.ЗаписатьАтрибут("ID",XMLСтрока(НомерСтрокиВДокументе));
				ЗаписьXML.ЗаписатьАтрибут("Тип",ТекТипПозиции);
				ЗаписьXML.ЗаписатьАтрибут("GUID","");
				ЗаписьXML.ЗаписатьАтрибут("КодСНБ",КодПозиции);
				ЗаписьXML.ЗаписатьАтрибут("КодЛокальный","");
				ЗаписьXML.ЗаписатьАтрибут("Наименование",НаименованиеПозиции);  
				ЗаписьXML.ЗаписатьАтрибут("КомментКод","");
				ЗаписьXML.ЗаписатьАтрибут("КомментНаим","");
				ЗаписьXML.ЗаписатьАтрибут("Объем",XMLСтрока(ОбъемРабот));
				ЗаписьXML.ЗаписатьАтрибут("ОбъемФормула","");
				ЗаписьXML.ЗаписатьАтрибут("Измеритель",СтрокаРасценки.Позиция.Измеритель);
				Если ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы Тогда
					ЗаписьXML.ЗаписатьАтрибут("ВидЗатрат","М");
				ИначеЕсли ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы Тогда
					ЗаписьXML.ЗаписатьАтрибут("ВидЗатрат","С");	
				ИначеЕсли ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.Оборудование Тогда
					ЗаписьXML.ЗаписатьАтрибут("ВидЗатрат","О");	
				Иначе
					ЗаписьXML.ЗаписатьАтрибут("ВидЗатрат","ПР");	
				КонецЕсли;
				ЗаписьXML.ЗаписатьАтрибут("ВидРабот","");
				
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("СТОИМОСТЬ");
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ЕДИНИЦА");
				ЗаписьXML.ЗаписатьАтрибут("ПЗ",Формат(СтрокаРасценки.ПрямЗатраты,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("МТ",Формат(СтрокаРасценки.СтоимМатериалов,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("ЗП",Формат(СтрокаРасценки.ОснЗарплата,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("СР","0.0");
				ЗаписьXML.ЗаписатьАтрибут("ЗМ",Формат(СтрокаРасценки.ЗарплМашинистов,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("ЕМ",Формат(СтрокаРасценки.ЭксплМашин,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));  
				ЗаписьXML.ЗаписатьАтрибут("МАССА","0.0");
				ЗаписьXML.ЗаписатьАтрибут("МТВ",Формат(СтрокаРасценки.ВозвратМатер,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("ОТП",Формат(СтрокаРасценки.Оборудование,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("ТР","0.0");
				ЗаписьXML.ЗаписатьАтрибут("ЗГС","0.0");  
				ЗаписьXML.ЗаписатьАтрибут("ЗГСП","0.0");
				ЗаписьXML.ЗаписатьКонецЭлемента(); // ЕДИНИЦА
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("ВСЕГО");
				ЗаписьXML.ЗаписатьАтрибут("ПЗ",Формат(СтрокаРасценки.ПрямЗатраты*ОбъемРабот,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("МТ",Формат(СтрокаРасценки.СтоимМатериалов*ОбъемРабот,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("ЗП",Формат(СтрокаРасценки.ОснЗарплата*ОбъемРабот,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("СР","0.0");
				ЗаписьXML.ЗаписатьАтрибут("ЗМ",Формат(СтрокаРасценки.ЗарплМашинистов*ОбъемРабот,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("ЕМ",Формат(СтрокаРасценки.ЭксплМашин*ОбъемРабот,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));  
				ЗаписьXML.ЗаписатьАтрибут("МТВ",Формат(СтрокаРасценки.ВозвратМатер*ОбъемРабот,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("МТМ","0.0");
				ЗаписьXML.ЗаписатьАтрибут("МТК","0.0");
				ЗаписьXML.ЗаписатьАтрибут("ПУСК","0.0");
				ЗаписьXML.ЗаписатьАтрибут("ОБ","0.0");
				ЗаписьXML.ЗаписатьАтрибут("ОТП",Формат(СтрокаРасценки.Оборудование*ОбъемРабот,"ЧЦ=20; ЧДЦ=2; ЧРД=.; ЧГ=0"));
				ЗаписьXML.ЗаписатьАтрибут("ТР","0.0");
				ЗаписьXML.ЗаписатьАтрибут("ЗГС","0.0");  
				ЗаписьXML.ЗаписатьАтрибут("НК1","0.0");
				ЗаписьXML.ЗаписатьАтрибут("НК2","0.0");
				ЗаписьXML.ЗаписатьАтрибут("СП","0.0");
				ЗаписьXML.ЗаписатьАтрибут("ВСЕГО","0.0");
				ЗаписьXML.ЗаписатьКонецЭлемента(); // ВСЕГО
				
				ЗаписьXML.ЗаписатьКонецЭлемента(); // СТОИМОСТЬ
				
				//Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
				//ИначеЕсли МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
				//	ПоказателиСтоимостиРес = ПолучитьРесурснуюСтроимостьПозиции(ДокументСсылка,ТекущийРаздел,ТекПозицияЛС);
				//	Если ПоказателиСтоимостиРес.Количество() > 0 Тогда
				//		ТекПоказатель = ПоказателиСтоимостиРес[0];
				//	КонецЕсли;
				//КонецЕсли;
			
				//ПоказателиСтроимости = ПолучитьСтоимостиПозицииСНачислениямиИПоправками(ДокументСсылка,ТекПозицияЛС,ТекущийРаздел);
				//Если ПоказателиСтроимости.Количество() > 0 Тогда
				//	ТекПоказатель = ПоказателиСтроимости[0];
				//КонецЕсли; 
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("КОЭФФИЦИЕНТЫ");
				//ЗаполнитьКоэффициентыВыгрузки(ЗаписьXML, ДокументСсылка, строкаРасценки,ДокСсылка,,);
				ЗаписьXML.ЗаписатьКонецЭлемента(); // КОЭФФИЦИЕНТЫ
				
				ИдентификацияРесурсов(ЗаписьXML,ДокументСсылка,строкаРасценки, ФорматВыгрузки);										

				ЗаписьXML.ЗаписатьКонецЭлемента(); // ПОЗИЦИЯ
			КонецЦикла;
			
			ОбходСтрокДереваДокументов(ЗаписьXML,ДокументСсылка,СтрокаДерева.Строки,  ДокСсылка, ФорматВыгрузки);
			
			ЗаписьXML.ЗаписатьКонецЭлемента(); // РАЗДЕЛ
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры //  ОбходСтрокДереваДокументов()

// Процедура формирует строку информации о ресурсе.
//  В АРПС 1.10 - Тип 30 - Ресурс.
//  Записи задают состав и количество ресурсов, необходимых для выполнения 
//  позиций документа. 
// 
//  Параметры:
//   ТекстВыгрузки 	- ТекстовыйДокумент - формируемый текст выгрузки.
//   Документ 		- ДокументСсылка,ДокументОбъект - документ Локальная смета или Акт выполненных работ.
//   Позиция  		- ДокументСсылка.ПозицияЛокальнойСметы - ссылка на позицию локальной сметы. 
// 
Процедура ИдентификацияРесурсов(ЗаписьXML, Документ, СтрокаРасценки, ФорматВыгрузки)
	
	мРесурсов = ДокСсылка[2].Выгрузить();
	мРесурсов = мРесурсов.НайтиСтроки(Новый Структура("Ссылка, Расчет", СтрокаРасценки.Позиция, Истина));
	
	Для Каждого СтрокаРесурса Из мРесурсов Цикл
		
		//  Не выгружать ресурсы с признаком «не учтенный» и «по проекту»
		Если СтрокаРесурса.ТипМатериала = Перечисления.СМ_ТипыМатериалов.НеУчтенный
			ИЛИ СтрокаРесурса.ТипМатериала = Перечисления.СМ_ТипыМатериалов.ПоПроекту Тогда
			Продолжить;
		КонецЕсли;
		ЗаписьXML.ЗаписатьНачалоЭлемента("РЕСУРС");
		
		Если Не СметнаяПрограммаВыбор.Пустая() Тогда
			КодРесурса = НайтиРесурсСметы(СтрокаРесурса.Позиция.Код,СтрокаРесурса.Позиция);
		Иначе
			КодРесурса = ?(ПустаяСтрока(СтрокаРесурса.Позиция.Код),СтрокаРесурса.СметныйКодРесурса,СтрокаРесурса.Позиция.Код);
		КонецЕсли;
		
		ПризнакТипа = "1";
		Если СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
			ПризнакТипа = "1";		
		ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
			ПризнакТипа = "2";
		ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
			ПризнакТипа = "3";
		ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Оборудование Тогда
			ПризнакТипа = "4";
		КонецЕсли;	

		ЗаписьXML.ЗаписатьАтрибут("ID",XMLСтрока(СтрокаРесурса.НомерПозиции));
		ЗаписьXML.ЗаписатьАтрибут("Наименование",СтрокаРесурса.НаименованиеРесурса);
		ЗаписьXML.ЗаписатьАтрибут("Тип",ПризнакТипа);
		ЗаписьXML.ЗаписатьАтрибут("КодСНБ",КодРесурса);
		ЗаписьXML.ЗаписатьАтрибут("КодЛокальный",КодРесурса);
		ЗаписьXML.ЗаписатьАтрибут("Цена",XMLСтрока(СтрокаРесурса.ТекущаяЦена)); 
		ЗаписьXML.ЗаписатьАтрибут("ЗМ",XMLСтрока(СтрокаРесурса.ТекущаяЗарплатаМашинистов));
		ЗаписьXML.ЗаписатьАтрибут("СР","0.0");
		ЗаписьXML.ЗаписатьАтрибут("ОТП","0.0");
		ЗаписьXML.ЗаписатьАтрибут("ТР","0.0");
		ЗаписьXML.ЗаписатьАтрибут("ЗГС","0.0");
		ЗаписьXML.ЗаписатьАтрибут("ЗГСП","0.0");
		ЗаписьXML.ЗаписатьАтрибут("Норма",XMLСтрока(СтрокаРесурса.Количество));
		ЗаписьXML.ЗаписатьАтрибут("Измеритель",СтрокаРесурса.ЕдиницаИзмеренияРесурса);
		ЗаписьXML.ЗаписатьАтрибут("Масса","0.0");
		ЗаписьXML.ЗаписатьАтрибут("Статус","");
		ЗаписьXML.ЗаписатьАтрибут("IDЗамены","");
		ЗаписьXML.ЗаписатьАтрибут("Поставка",?(СтрокаРесурса.СтатусРесурса = Перечисления.СМ_ОбеспечениеРесурса.Подрядчика,"П","З"));
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); // РЕСУРС
	КонецЦикла;
	
КонецПроцедуры //  ИдентификацияРесурсов()

Функция МассивРасценок(ДокументСсылка)
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "ВЫБРАТЬ
	             	  |	СМ_НумерацияПозицийЛокальныхСмет.Раздел,
	             	  |	СМ_НумерацияПозицийЛокальныхСмет.Позиция,
	             	  |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	             	  |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы,
	             	  |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер
	             	  |ПОМЕСТИТЬ Номера
	             	  |ИЗ
	             	  |	РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	             	  |ГДЕ
	             	  |	СМ_НумерацияПозицийЛокальныхСмет.Раздел = &ДокументСсылка
	             	  |;
	             	  |
	             	  |////////////////////////////////////////////////////////////////////////////////
	             	  |ВЫБРАТЬ
	             	  |	ПозицияЛокальнойСметы.ЕдиницаИзмерения КАК ЕдИзм,
	             	  |	ПозицияЛокальнойСметы.Ссылка КАК Позиция,
	             	  |	ПозицияЛокальнойСметы.ВерсияДанных,
	             	  |	ПозицияЛокальнойСметы.ПометкаУдаления,
	             	  |	ПозицияЛокальнойСметы.Номер,
	             	  |	ПозицияЛокальнойСметы.Дата,
	             	  |	ПозицияЛокальнойСметы.Проведен,
	             	  |	ПозицияЛокальнойСметы.ВозвратМатер КАК ВозвратМатер,
	             	  |	ПозицияЛокальнойСметы.Демонтаж,
	             	  |	ПозицияЛокальнойСметы.ЗарплМашинистов КАК ЗарплМашинистов,
	             	  |	ПозицияЛокальнойСметы.ЗатратыТрудаМашинистов КАК ЗатратыТрудаМашинистов,
	             	  |	ПозицияЛокальнойСметы.ЗатратыТрудаРабочих КАК ЗатратыТрудаРабочих,
	             	  |	ПозицияЛокальнойСметы.ИД,
	             	  |	ПозицияЛокальнойСметы.ИДПозицииВладельца,
	             	  |	ПозицияЛокальнойСметы.ИДРодителя,
	             	  |	ПозицияЛокальнойСметы.ИДСметы,
	             	  |	ПозицияЛокальнойСметы.Измеритель,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКНРАЭСБазисный,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКНРАЭСТекущий,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКНРНаРемонтБазисный,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКНРНаРемонтТекущий,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКНРУСНБазисный,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКНРУСНТекущий,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКСПАЭСБазисный,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКСПАЭСТекущий,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКСПНаРемонтБазисный,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКСПНаРемонтТекущий,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКСПУСНБазисный,
	             	  |	ПозицияЛокальнойСметы.КоэффициентКСПУСНТекущий,
	             	  |	ПозицияЛокальнойСметы.Наименование КАК СобственноеНаименование,
	             	  |	ПозицияЛокальнойСметы.НакладныеРасходыБазисные,
	             	  |	ПозицияЛокальнойСметы.НакладныеРасходыТекущие,
	             	  |	ПозицияЛокальнойСметы.НеПрименятьИндексы,
	             	  |	Номера.НомерВПределахСметы,
	             	  |	Номера.НомерВДереве,
	             	  |	Номера.ПорНомер КАК НомерПозиции,
	             	  |	ПозицияЛокальнойСметы.Оборудование,
	             	  |	ПозицияЛокальнойСметы.ОбъемРабот КАК Объем,
	             	  |	ПозицияЛокальнойСметы.Определитель,
	             	  |	ПозицияЛокальнойСметы.ОснЗарплата КАК ОснЗарплата,
	             	  |	ПозицияЛокальнойСметы.ПоправочныйКоэффициентКНРБазисный,
	             	  |	ПозицияЛокальнойСметы.ПоправочныйКоэффициентКНРТекущий,
	             	  |	ПозицияЛокальнойСметы.ПоправочныйКоэффициентКСПБазисный,
	             	  |	ПозицияЛокальнойСметы.ПоправочныйКоэффициентКСПТекущий,
	             	  |	ПозицияЛокальнойСметы.Применительно,
	             	  |	ПозицияЛокальнойСметы.Примечание КАК Комментарий,
	             	  |	ПозицияЛокальнойСметы.ПрямЗатраты КАК ПрямЗатраты,
	             	  |	ПозицияЛокальнойСметы.Расчет,
	             	  |	ПозицияЛокальнойСметы.РегиональнаяБаза,
	             	  |	ПозицияЛокальнойСметы.СметнаяПрибыльБазисные,
	             	  |	ПозицияЛокальнойСметы.СметнаяПрибыльТекущие,
	             	  |	ПозицияЛокальнойСметы.СтоимМатериалов КАК СтоимМатериалов,
	             	  |	ПозицияЛокальнойСметы.СуммаНРБазисная,
	             	  |	ПозицияЛокальнойСметы.СуммаНРТекущая,
	             	  |	ПозицияЛокальнойСметы.СуммаСПБазисная,
	             	  |	ПозицияЛокальнойСметы.СуммаСПТекущая,
	             	  |	ПозицияЛокальнойСметы.ТекущаяЗарплатаМашинистов,
	             	  |	ПозицияЛокальнойСметы.ТекущаяЦена,
	             	  |	ПозицияЛокальнойСметы.ТипНормативныхСборников,
	             	  |	ПозицияЛокальнойСметы.ФормулаВМ,
	             	  |	ПозицияЛокальнойСметы.ФормулаЗМ,
	             	  |	ПозицияЛокальнойСметы.ФормулаОб,
	             	  |	ПозицияЛокальнойСметы.ФормулаОбъема,
	             	  |	ПозицияЛокальнойСметы.ФормулаОЗ,
	             	  |	ПозицияЛокальнойСметы.ФормулаПЗ,
	             	  |	ПозицияЛокальнойСметы.ФормулаСМ,
	             	  |	ПозицияЛокальнойСметы.ФормулаТМ,
	             	  |	ПозицияЛокальнойСметы.ФормулаТР,
	             	  |	ПозицияЛокальнойСметы.ФормулаЭМ,
	             	  |	ПозицияЛокальнойСметы.ШифрРасценки КАК Шифр,
	             	  |	ПозицияЛокальнойСметы.ЭксплМашин,
	             	  |	ПозицияЛокальнойСметы.Представление,
	             	  |	ПозицияЛокальнойСметы.МоментВремени,
	             	  |	""Расценка"" КАК ТипПозиции
	             	  |ИЗ
	             	  |	Документ.СМ_ПозицияЛокальнойСметы КАК ПозицияЛокальнойСметы
	             	  |		ЛЕВОЕ СОЕДИНЕНИЕ Номера КАК Номера
	             	  |		ПО (Номера.Позиция = ПозицияЛокальнойСметы.Ссылка)
	             	  |			И (Номера.Раздел = ПозицияЛокальнойСметы.ИДРодителя)
	             	  |ГДЕ
	             	  |	ПозицияЛокальнойСметы.ИДРодителя = &ДокументСсылка
	             	  |
	             	  |УПОРЯДОЧИТЬ ПО
	             	  |	Номера.ПорНомер";
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);			   
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	 
	Возврат ТабРезультат;
	
КонецФункции	

Функция ПодготовитьТаблицуРеквизитов(ДокументСсылка, Дерево)

	СтруктураРеквизитов  	= Новый Соответствие;
	ТЧ			    	 	= Новый Соответствие;
    мРеквизитов = Новый Массив;
	Для каждого Колонка Из  Дерево.Колонки Цикл
	
		мРеквизитов.Добавить(Колонка.Имя);

	
	КонецЦикла; 

	ТЧ.Вставить("Разделы",мРеквизитов);
    СтруктураРеквизитов.Вставить(ДокументСсылка.Метаданные().Имя,ТЧ);
    Возврат СтруктураРеквизитов;
	
КонецФункции

// Заполняет дерево документов полным фаршем при открытии.
// Выводит необходимые таблицы на форму.
//
// Параметры:
// 	Документ 			- ДокументСсылка - ссылка на документ в системе.
// 	Дерево 				- ДеревоЗначений - формируемое дерево значений.
// 	ТаблицаРеквизитов 	- ТаблицаЗначений - содержит значения реквизитов документов.
// 	Параметры 			- Структура - содержит дополнительные параметры.
// 	ДокСсылка 			- ДокументСсылка - ссылка на документ.
//
Процедура докЗаполнитьДеревоДокумента(Документ, Дерево, ТаблицаРеквизитов, Параметры, ДокСсылка)  
	
	Если ТипЗнч(Документ.Метаданные().Реквизиты.Найти("МетодРасчета")) = Тип("неопределено") Тогда
	   РасчетДокументаВБазисныхЦенах = Документ.МетодРасчета;
	Иначе
	   РасчетДокументаВБазисныхЦенах = ложь;
	КонецЕсли; 
	
	Параметры.Вставить("РасчетДокументаВБазисныхЦенах", РасчетДокументаВБазисныхЦенах);
	
	СтруктураТаблиц = ТаблицаРеквизитов[Документ.Метаданные().Имя];	
	РеквизитыТаблиц = СтруктураТаблиц["Разделы"];
	
	Если Документ.Метаданные().ТабличныеЧасти.Найти("Разделы") <> Неопределено Тогда
		ТабРазделов = Документ["Разделы"];
	Иначе
		ТабРазделов = ДокСсылка[0].Выгрузить();
	КонецЕсли; 
	
	Если Документ.Метаданные().ТабличныеЧасти.Найти("Позиции") <> Неопределено Тогда
		ТабПозиции = Документ["Позиции"];
	Иначе
		ТабПозиции = ДокСсылка[1].Выгрузить();
	КонецЕсли; 
	
	Если Документ.Метаданные().ТабличныеЧасти.Найти("РесурсыПозицийАкта") <> Неопределено И Параметры["ВыводитьРесурсы"] Тогда
		ТабРесурсов = Документ["РесурсыПозцийАкта"];
	Иначе
 		ТабРесурсов = ДокСсылка[2].Выгрузить();
	КонецЕсли;
	
	//  Во 2-й смете была отдельная ТЧ. 
	//  Возможно будет добавлено и в 3-ей. Пока не будем убирать функционал.
	ТабДопЗатрат = Неопределено; 
	// Дерево.Строки.Очистить();
	Если ТабРазделов.Количество() > 0 Тогда
		ДокДобавитьСтрокиВДеревоРеверс(Документ, Документ.Ссылка, Дерево, Дерево, ТабРазделов, ТабПозиции, ТабРесурсов, ТабДопЗатрат, РеквизитыТаблиц, Параметры, ДокСсылка);
	КонецЕсли;
	
	Если РеквизитыТаблиц.Найти("КодСтрокиСортировки") <> Неопределено Тогда
	   Дерево.Строки.Сортировать("КодСтрокиСортировки",истина);
    КонецЕсли;
   
КонецПроцедуры

Функция СоберемТаблицыДокумента(Документ)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Разделы.Ссылка,
	               |	Разделы.ВерсияДанных,
	               |	Разделы.ПометкаУдаления,
	               |	Разделы.Номер,
	               |	Разделы.Дата,
	               |	Разделы.Проведен,
	               |	Разделы.ВидРабот,
	               |	Разделы.ИД,
	               |	Разделы.ИДРодителя,
	               |	Разделы.ИДСметы,
	               |	Разделы.КоэффОборуд,
	               |	Разделы.КоэффОснЗарплаты,
	               |	Разделы.КоэффПолнСтоимРабот,
	               |	Разделы.КоэффСтоимЗарплатеМашин,
	               |	Разделы.КоэффСтоимМатериалов,
	               |	Разделы.КоэффСтоимЭксплМашин,
	               |	Разделы.НаименованиеДляПечати,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВПределахСметы,
	               |	СМ_НумерацияПозицийЛокальныхСмет.ПорНомер КАК НомерПозиции,
	               |	Разделы.Раздел КАК Позиция,
	               |	Разделы.Расчет,
	               |	Разделы.СуммаНРТекущая,
	               |	Разделы.СуммаСПТекущая,
	               |	СМ_НумерацияПозицийЛокальныхСмет.НомерВДереве,
	               |	Разделы.Представление,
	               |	Разделы.МоментВремени,
	               |	""Раздел"" КАК ТипПозиции,
	               |	"""" КАК ЕдИзм,
	               |	"""" КАК Объем
	               |ИЗ
	               |	Документ.СМ_РазделЛокальнойСметы КАК Разделы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НумерацияПозицийЛокальныхСмет КАК СМ_НумерацияПозицийЛокальныхСмет
	               |		ПО Разделы.Ссылка = СМ_НумерацияПозицийЛокальныхСмет.Раздел
	               |			И Разделы.ИДСметы = СМ_НумерацияПозицийЛокальныхСмет.Смета
	               |ГДЕ
	               |	Разделы.ИДСметы = &ИДРодителя
	               |	И СМ_НумерацияПозицийЛокальныхСмет.Позиция = ЗНАЧЕНИЕ(Документ.СМ_ПозицияЛокальнойСметы.ПустаяСсылка)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерПозиции
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Расценка.Ссылка КАК Позиция,
	               |	Расценка.ВерсияДанных,
	               |	Расценка.ПометкаУдаления,
	               |	Расценка.Номер,
	               |	Расценка.Дата,
	               |	Расценка.Проведен,
	               |	Расценка.Версия,
	               |	Расценка.ВозвратМатер,
	               |	Расценка.Демонтаж,
	               |	Расценка.ЕдиницаИзмерения КАК ЕдИзм,
	               |	Расценка.ЗарплМашинистов,
	               |	Расценка.ЗатратыТрудаМашинистов,
	               |	Расценка.ЗатратыТрудаРабочих,
	               |	Расценка.ИД,
	               |	Расценка.ИДПозицииВладельца,
	               |	Расценка.ИДРодителя,
	               |	Расценка.ИДСметы,
	               |	Расценка.Измеритель,
	               |	Расценка.КоэффициентКНРАЭСБазисный,
	               |	Расценка.КоэффициентКНРАЭСТекущий,
	               |	Расценка.КоэффициентКНРНаРемонтБазисный,
	               |	Расценка.КоэффициентКНРНаРемонтТекущий,
	               |	Расценка.КоэффициентКНРУСНБазисный,
	               |	Расценка.КоэффициентКНРУСНТекущий,
	               |	Расценка.КоэффициентКСПАЭСБазисный,
	               |	Расценка.КоэффициентКСПАЭСТекущий,
	               |	Расценка.КоэффициентКСПНаРемонтБазисный,
	               |	Расценка.КоэффициентКСПНаРемонтТекущий,
	               |	Расценка.КоэффициентКСПУСНБазисный,
	               |	Расценка.КоэффициентКСПУСНТекущий,
	               |	Расценка.МассаБрутто,
	               |	Расценка.МассаНетто,
	               |	Расценка.Наименование,
	               |	Расценка.НакладныеРасходыБазисные,
	               |	Расценка.НакладныеРасходыТекущие,
	               |	Расценка.НеПрименятьИндексы,
	               |	Расценка.НомерВПределахСметы,
	               |	Расценка.Оборудование,
	               |	Расценка.ОбъемРабот КАК Объем,
	               |	Расценка.Определитель,
	               |	Расценка.ОснЗарплата,
	               |	Расценка.ПоправочныйКоэффициентКНРБазисный,
	               |	Расценка.ПоправочныйКоэффициентКНРТекущий,
	               |	Расценка.ПоправочныйКоэффициентКСПБазисный,
	               |	Расценка.ПоправочныйКоэффициентКСПТекущий,
	               |	Расценка.ПорНомер КАК НомерПозиции,
	               |	Расценка.Применительно,
	               |	Расценка.Примечание,
	               |	Расценка.ПрямЗатраты,
	               |	Расценка.Расчет,
	               |	Расценка.РегиональнаяБаза,
	               |	Расценка.СметнаяПрибыльБазисные,
	               |	Расценка.СметнаяПрибыльТекущие,
	               |	Расценка.СтоимМатериалов,
	               |	Расценка.СуммаНРБазисная,
	               |	Расценка.СуммаНРТекущая,
	               |	Расценка.СуммаСПБазисная,
	               |	Расценка.СуммаСПТекущая,
	               |	Расценка.ТекущаяЗарплатаМашинистов,
	               |	Расценка.ТекущаяЦена,
	               |	Расценка.ТипНормативныхСборников,
	               |	Расценка.ФормулаВМ,
	               |	Расценка.ФормулаЗМ,
	               |	Расценка.ФормулаОб,
	               |	Расценка.ФормулаОбъема,
	               |	Расценка.ФормулаОЗ,
	               |	Расценка.ФормулаПЗ,
	               |	Расценка.ФормулаСМ,
	               |	Расценка.ФормулаТМ,
	               |	Расценка.ФормулаТР,
	               |	Расценка.ФормулаЭМ,
	               |	Расценка.ШифрРасценки,
	               |	Расценка.ЭксплМашин,
	               |	Расценка.НомерВДереве,
	               |	Расценка.Представление,
	               |	Расценка.МоментВремени,
	               |	""Позиция"" КАК ТипПозиции
	               |ИЗ
	               |	Документ.СМ_ПозицияЛокальнойСметы КАК Расценка
	               |ГДЕ
	               |	Расценка.ИДСметы = &ИДРодителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Ресурсы.Ссылка,
	               |	Ресурсы.НомерСтроки КАК НомерПозиции,
	               |	Ресурсы.СметныйКодРесурса,
	               |	Ресурсы.Ресурс КАК Позиция,
	               |	Ресурсы.ВидРесурса,
	               |	Ресурсы.ТипМатериала,
	               |	Ресурсы.НормаРасхода КАК Количество,
	               |	Ресурсы.КоэффициентКРасходуРесурсов,
	               |	Ресурсы.БазиснаяЦена,
	               |	Ресурсы.БазиснаяЗарплатаМашинистов,
	               |	Ресурсы.ТекущаяЦена,
	               |	Ресурсы.ТекущаяЗарплатаМашинистов,
	               |	Ресурсы.Заменен,
	               |	Ресурсы.Удален,
	               |	Ресурсы.Добавлен,
	               |	""Ресурс"" КАК ТипПозиции,
	               |	Ресурсы.Ссылка.Ссылка КАК Объект,
	               |	"""" КАК ИД,
	               |	"""" КАК ИДРодителя,
	               |	ИСТИНА КАК Расчет,
	               |	Ресурсы.Ресурс.ЕдиницаИзмерения КАК ЕдИзм,
	               |	Ресурсы.Ссылка.ОбъемРабот КАК Объем,
	               |	Ресурсы.НаименованиеРесурса,
	               |	Ресурсы.ЕдиницаИзмеренияРесурса,
	               |	Ресурсы.СтатусРесурса
	               |ИЗ
	               |	Документ.СМ_ПозицияЛокальнойСметы.РесурсыПозицииЛокальнойСметы КАК Ресурсы
	               |ГДЕ
	               |	Ресурсы.Ссылка.ИДСметы = &ИДРодителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДопЗатраты.Ссылка КАК Объект,
	               |	ДопЗатраты.НомерСтроки КАК НомерПозиции,
	               |	ДопЗатраты.ЛимитированнаяЗатрата КАК Позиция,
	               |	ДопЗатраты.ЗначениеЛимЗатраты,
	               |	ДопЗатраты.ФормулаЛимЗатраты,
	               |	ДопЗатраты.БазисноеЗначениеЛимЗатраты,
	               |	ДопЗатраты.ФормулаБазисногоЗначениеЛимЗатраты,
	               |	ДопЗатраты.КоэффициентСметнойЗарплаты,
	               |	ДопЗатраты.КоэффициентТрудоемкости,
	               |	ДопЗатраты.Примечание,
	               |	ДопЗатраты.Расчет,
	               |	""Ресурс"" КАК ТипПозиции
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета.ЛимитированныеЗатраты КАК ДопЗатраты
	               |ГДЕ
	               |	ДопЗатраты.Ссылка.Ссылка = &ИДРодителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Поправки.Ссылка КАК Позиция,
	               |	Поправки.НомерСтроки КАК НомерПозиции,
	               |	Поправки.Применить,
	               |	Поправки.УсловияПрименения,
	               |	Поправки.Обоснование КАК Основание,
	               |	Поправки.КоэффПЗ,
	               |	Поправки.КоэффОЗ,
	               |	Поправки.КоэффЭМ,
	               |	Поправки.КоэффЗМ,
	               |	Поправки.ВариантРасчета,
	               |	Поправки.КоэффСМ,
	               |	Поправки.КоэффТР,
	               |	Поправки.КоэффТМ,
	               |	Поправки.ДобавПЗ,
	               |	Поправки.ДобавОЗ,
	               |	Поправки.ДобавЭМ,
	               |	Поправки.ДобавЗМ,
	               |	Поправки.ДобавСМ,
	               |	Поправки.ДобавТР,
	               |	Поправки.Справка,
	               |	Поправки.ДобавТ
	               |ИЗ
	               |	Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК Поправки
	               |ГДЕ
	               |	Поправки.Ссылка.ИДСметы = &ИДРодителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Начисления.Ссылка КАК Позиция,
	               |	Начисления.НомерСтроки КАК НомерПозиции,
	               |	Начисления.ЧисловойПараметр,
	               |	Начисления.Значение,
	               |	Начисления.Формула
	               |ИЗ
	               |	Документ.СМ_ПозицияЛокальнойСметы.НачисленияПозиции КАК Начисления
	               |ГДЕ
	               |	Начисления.Ссылка.ИДСметы = &ИДРодителя
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка КАК Позиция,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.НомерСтроки,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОснЗарплаты,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЭксплМашин,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЗарплатеМашин,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимМатериалов,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОборуд,
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффПолнСтоимРабот
	               |ИЗ
	               |	Документ.СМ_ПозицияЛокальнойСметы.КоэффициентыПересчета КАК ПозицияЛокальнойСметыКоэффициентыПересчета
	               |ГДЕ
	               |	ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка.ИДСметы = &ИДРодителя";
				   
	Запрос.УстановитьПараметр("ИДРодителя", Документ.Ссылка);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции	

// Реверсивная функция заполнения.
Процедура ДокДобавитьСтрокиВДеревоРеверс(Документ, Позиция, СтрокаДерева, Дерево, ТабРазделов, ТабПозиции, ТабРесурсы, ТабДопЗатрат, РеквизитыТаблиц,Параметры, ДокСсылка)
	
	ЮК_ИмяДокумента	= Документ.Метаданные().Имя;
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ИДСметы",Позиция);
	МасСтрокПозиций = ТабРазделов.НайтиСтроки(СтруктураОтбора);
	Для Каждого Эл Из масСтрокПозиций Цикл
		
		Если ТипЗнч(Эл.ИДРодителя) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
			НайденнаяСтрока = СтрокаДерева.Строки.Найти(Эл.ИДРодителя,"Позиция");	
			Если НайденнаяСтрока <> Неопределено Тогда
				НоваяПодСтрока = НайденнаяСтрока.Строки.Добавить();
			Иначе
				НоваяПодСтрока = СтрокаДерева.Строки.Добавить();
			КонецЕсли;
		Иначе
			НоваяПодСтрока = СтрокаДерева.Строки.Добавить();
		КонецЕсли;
		
		Если Параметры = Неопределено  Тогда
			ЗаполнитьРеквизиты(НоваяПодСтрока, эл, РеквизитыТаблиц, Параметры, "Раздел");
		Иначе
			Если Параметры["ВыводитьЗаголовокСметы"] Тогда
				ЗаполнитьРеквизиты(НоваяПодСтрока, эл, РеквизитыТаблиц, Параметры,"Раздел");
			Иначе
				НоваяПодСтрока 						= СтрокаДерева;
				СтрокаДерева.Ид 					= эл.Ид;
				Параметры["ВыводитьЗаголовокСметы"] = истина;
			КонецЕсли; 
		КонецЕсли;
		
		Если Не Параметры = Неопределено Тогда
			Если Параметры.Свойство("ЗаполнитьАктСметой") Тогда
				Если Параметры.ЗаполнитьАктСметой Тогда
					НоваяПодСтрока.НомерПоСмете = эл.НомерПозиции;
				ИначеЕсли ЮК_ИмяДокумента = "СМ_АктВыполненныхРабот" Тогда
					НоваяПодСтрока.НомерПоСмете = эл.НомерПоСмете;			 
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
		
		//  Добавляем расценки по разделам
		Если ТабПозиции <> неопределено И ТабПозиции.Количество() Тогда
			масСтрокРасценок = ТабПозиции.НайтиСтроки(Новый Структура("ИдРодителя",эл.Ссылка));
			Для каждого элРасценки Из масСтрокРасценок Цикл
				НоваяСтрокаРасценки = НоваяПодСтрока.Строки.Добавить();
				ЗаполнитьРеквизиты(НоваяСтрокаРасценки, элРасценки, РеквизитыТаблиц, Параметры, "Расценка");
				Если Не Параметры = Неопределено Тогда
					Если Параметры.Свойство("ЗаполнитьАктСметой") Тогда
						Если Параметры.ЗаполнитьАктСметой Тогда
							НоваяСтрокаРасценки.НомерПоСмете = элРасценки.НомерПозиции;			 
						ИначеЕсли ЮК_ИмяДокумента="СМ_АктВыполненныхРабот" Тогда
							НоваяСтрокаРасценки.НомерПоСмете = элРасценки.НомерПоСмете;			 
						КонецЕсли; 
					КонецЕсли; 
				КонецЕсли; 
				ДокДобавитьСтрокуРесурсов(НоваяСтрокаРасценки, ТабРесурсы, РеквизитыТаблиц, элРасценки.Позиция,  Параметры) ; 
				ДобавитьСтрокуДопЗатрат(Документ, НоваяСтрокаРасценки,ТабДопЗатрат,РеквизитыТаблиц,Параметры);
			КонецЦикла; 
		КонецЕсли;
		ДобавитьСтрокуДопЗатрат(Документ, НоваяПодСтрока,ТабДопЗатрат,РеквизитыТаблиц,Параметры);
	КонецЦикла; 
			   
КонецПроцедуры

Процедура ДобавитьСтрокуДопЗатрат(Документ, СтрокаДерева,ТабДопЗатрат,РеквизитыТаблиц, Параметры)
	
	ВыводитьДЗ = истина;
	 Если Параметры<> неопределено И Параметры.свойство("ВыводитьДЗ") Тогда
	     ВыводитьДЗ = Параметры["ВыводитьДЗ"];
	 КонецЕсли; ;
	 Если ТабДопЗатрат <> неопределено И ТабДопЗатрат.Количество() И  ВыводитьДЗ  Тогда
		МассивДопЗатрат = ТабДопЗатрат.НайтиСтроки(Новый Структура("ИдРодителя",СтрокаДерева.Ид));
		Для каждого элЗатраты Из МассивДопЗатрат Цикл
			СуммаБазисная = 0;

			Если ТипЗнч(Документ) = Тип("ДокументОбъект.СМ_ЛокальнаяСмета") ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.СМ_АктВыполненныхРабот") Тогда
				НоваяСтрокаЗатраты = СтрокаДерева.Строки.Добавить();
				Если НЕ Параметры.Свойство("Документ") Тогда
					НоваяСтрокаЗатраты.ВсегоНаОбъем = СуммаБазисная;
				КонецЕсли;
			КонецЕсли;
			Если ТипЗнч(Документ) = Тип("ДокументОбъект.СМ_ОбъектнаяСмета") ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.СМ_СводнаяСмета") Тогда
				НоваяСтрокаЗатраты = СтрокаДерева.Строки.Добавить();
				НоваяСтрокаЗатраты.Всего = СуммаБазисная;
			КонецЕсли;
			
			Если НЕ НоваяСтрокаЗатраты = Неопределено Тогда
				// Был последний параметр ПланыВидовХарактеристик.Разделы.ДопЗатрата.
				//	Такого в смете 3 нет. Поставил Неопределено.
				ЗаполнитьРеквизиты(НоваяСтрокаЗатраты, элЗатраты, РеквизитыТаблиц, Параметры, Неопределено);
			КонецЕсли;	
			
		КонецЦикла; 
	 КонецЕсли; 

КонецПроцедуры

Процедура ДокДобавитьСтрокуРесурсов(НоваяСтрокаРасценки, ТабРесурсов,РеквизитыТаблиц, ИдРодителя, Параметры)  
	 
	Если ТабРесурсов <> неопределено И ТабРесурсов.Количество() Тогда
		масСтрокРесурсов = ТабРесурсов.НайтиСтроки(Новый Структура("Объект", ИдРодителя));
		Для каждого элРесурса Из масСтрокРесурсов Цикл
			Если (НЕ элРесурса.ТипМатериала  = Перечисления.СМ_ТипыМатериалов.НеУчтенный ИЛИ элРесурса.ТипМатериала  = Перечисления.СМ_ТипыМатериалов.ПоПроекту) Тогда 
				НоваяСтрокаРесурса = НоваяСтрокаРасценки.Строки.Добавить();
				ЗаполнитьРеквизиты(НоваяСтрокаРесурса, элРесурса, РеквизитыТаблиц, Параметры, "Ресурс");
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры

// Заполняем колонками реквизитами дерева.
//
// Параметры:
// 		НоваяСтрока 	- заполняемая строка дерева значений.
// 		СтрокаТаблицы 	- текущая строка табилцы с данными.
//  	РеквизитыТаблиц - массив с именами реквизитов дерева.
// 		Параметры 		- структура с дополнительными параметрами.
// 		ТипПозиции 		- тип позиции (позиция, ресурс).
//
Процедура ЗаполнитьРеквизиты(НоваяСтрока, СтрокаТаблицы, РеквизитыТаблиц, Параметры, ТипПозиции) 
	
	Если Параметры <> неопределено И (Параметры.Свойство("ЗаполнитьАктСметой") И Параметры["ЗаполнитьАктСметой"]) Тогда
		
		НоваяСтрока.СметнаяСтоимость 	= СтрокаТаблицы.ВсегоНаОбъем;
		НоваяСтрока.ИдСтрокиЛС      	= СтрокаТаблицы.Ид; 
		НоваяСтрока.НомерПоСмете    	= СтрокаТаблицы.НомерПозиции;			
		НоваяСтрока.КодСтроки 			= Параметры.Документ.ИндексПоследнейСтроки + 1;

		Если ТипПозиции = "Ресурс" Тогда
		   НоваяСтрока.СметныйОбъем = СтрокаТаблицы.Количество;
        Иначе
		   НоваяСтрока.СметныйОбъем = СтрокаТаблицы.Объем;
		КонецЕсли; 
		 
		Для Каждого Реквизит Из Параметры["РеквизитыСметыДляАкта"] Цикл
			НоваяСтрока[Реквизит] =  СтрокаТаблицы[Реквизит];
		КонецЦикла;
		
		Параметры.Документ.ИндексПоследнейСтроки = НоваяСтрока.КодСтроки;
		 
	ИначеЕсли Параметры <> неопределено И (Параметры.Свойство("ЗаполнитьМ29Актом") И Параметры["ЗаполнитьМ29Актом"]) Тогда
		
		НоваяСтрока.СметныйОбъем = СтрокаТаблицы.Объем;
		Для Каждого Реквизит Из Параметры["РеквизитыСметыДляАкта"] Цикл
			НоваяСтрока[Реквизит] = СтрокаТаблицы[Реквизит];
		КонецЦикла;

	Иначе
		
		Для каждого Реквизит Из РеквизитыТаблиц Цикл
			Если ТипПозиции = "Ресурс" Тогда
				Если Параметры.Свойство("ПоляРесурсов") И Параметры["ПоляРесурсов"].Найти(Реквизит) <> Неопределено  Тогда
					Если  Реквизит  = "МатериалыНаОбъем"  И (СтрокаТаблицы.ТипМатериала  = Перечисления.СМ_ТипыМатериалов.НеУчтенный ИЛИ СтрокаТаблицы.ТипМатериала  = Перечисления.СМ_ТипыМатериалов.ПоПроекту ) Тогда
						Если Параметры.РасчетДокументаВБазисныхЦенах Тогда
						    НоваяСтрока[Реквизит] =  СтрокаТаблицы["СтоимостьБазис"];
						Иначе	
						    НоваяСтрока[Реквизит] =  СтрокаТаблицы["Стоимость"];
						КонецЕсли; 
					ИначеЕсли Реквизит  = "Объем" Тогда
						НоваяСтрока[Реквизит] =  СтрокаТаблицы["Количество"];
					ИначеЕсли Реквизит  = "СметныйОбъем" Тогда
						НоваяСтрока[Реквизит] =  СтрокаТаблицы["СметноеКоличество"];
					Иначе
						НоваяСтрока[Реквизит] =  СтрокаТаблицы[Реквизит];
					КонецЕсли;
				КонецЕсли; 
			Иначе
				НоваяСтрока[Реквизит] = СтрокаТаблицы[Реквизит];
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
   	Если ТипПозиции = "Раздел" Тогда
		НоваяСтрока.Позиция = СтрокаТаблицы.Ссылка;  
	КонецЕсли;

КонецПроцедуры

Функция НайтиРесурсСметы(КодРесурса,Ресурс)
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СМ_АРПС_СоответствияШифров.ШифрАРПС
	               |ИЗ
	               |	РегистрСведений.СМ_АРПС_СоответствияШифров КАК СМ_АРПС_СоответствияШифров
	               |ГДЕ
	               |	СМ_АРПС_СоответствияШифров.СметнаяПрограмма = &СметнаяПрограмма
	               |	И (СМ_АРПС_СоответствияШифров.Ресурс = &Ресурс
	               |			ИЛИ СМ_АРПС_СоответствияШифров.Шифр = &КодРесурса)";
	Запрос.УстановитьПараметр("КодРесурса",КодРесурса);
	Запрос.УстановитьПараметр("Ресурс",Ресурс);
	Запрос.УстановитьПараметр("СметнаяПрограмма",СметнаяПрограмма);
    Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ШифрАРПС;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииИмпорта

Функция ЗапуститьЗагрузкаKENML(СведенияФайлов,Организация,Район,ТекФорма, ТабДокументов, ТабРазделов, ТабПозиций, ТабКоэффициентов, ТабРесурсов, ТабЛимЗатраты, ТабКомментарии) Экспорт
	СтруктураТекФорма = Новый Структура();
	СтруктураТекФорма.Вставить("АнализФайла",ТекФорма.АнализФайла);
	СтруктураТекФорма.Вставить("СоответствияРесурсов",ТекФорма.СоответствияРесурсов.Выгрузить());
	СтруктураТекФорма.Вставить("СоответствияПрефиксов",ТекФорма.СоответствияПрефиксов.Выгрузить());
	СтруктураТекФорма.Вставить("СоответствияЛЗ",ТекФорма.СоответствияЛЗ.Выгрузить());
	СтруктураТекФорма.Вставить("СметнаяПрограмма",ТекФорма.СметнаяПрограмма);
	СтруктураТекФорма.Вставить("КаталогЗагрузки",ТекФорма.КаталогЗагрузки);
	СтруктураТекФорма.Вставить("ИзФайла",ТекФорма.ИзФайла);
	СтруктураТекФорма.Вставить("Стройка",ТекФорма.Стройка);
	СтруктураТекФорма.Вставить("ОбъектСтроительства",ТекФорма.ОбъектСтроительства);
	СтруктураТекФорма.Вставить("НаименованиеСНБазы",ТекФорма.НаименованиеСНБазы);
	СтруктураТекФорма.Вставить("НомерРегиона",ТекФорма.НомерРегиона);
	СтруктураТекФорма.Вставить("НомерРайона",ТекФорма.НомерРайона);
	СтруктураТекФорма.Вставить("ДатаУровняЦен",ТекФорма.ДатаУровняЦен);
	СтруктураТекФорма.Вставить("ТипНСБазы",ТекФорма.ТипНСБазы);
	СтруктураТекФорма.Вставить("СпособРасчета",ТекФорма.СпособРасчета);
	СтруктураТекФорма.Вставить("СоздаватьНовыеЭлементы",ТекФорма.СоздаватьНовыеЭлементы);
	СтруктураТекФорма.Вставить("СметноНормативнаяБаза",ТекФорма.СметноНормативнаяБаза);
	СтруктураТекФорма.Вставить("ТекСтройка",ТекФорма.ТекСтройка);

                          
	ПараметрыЗадания = Новый Структура();
	ПараметрыЗадания.Вставить("СведенияФайлов",СведенияФайлов);
	ПараметрыЗадания.Вставить("ТекФорма",СтруктураТекФорма);
	ПараметрыЗадания.Вставить("ТабДокументов",ТабДокументов);
	ПараметрыЗадания.Вставить("ТабРазделов",ТабРазделов);
	ПараметрыЗадания.Вставить("ТабПозиций",ТабПозиций);
	ПараметрыЗадания.Вставить("ТабКоэффициентов",ТабКоэффициентов);
	ПараметрыЗадания.Вставить("ТабРесурсов",ТабРесурсов);
	ПараметрыЗадания.Вставить("ТабЛимЗатраты",ТабЛимЗатраты);
	ПараметрыЗадания.Вставить("ТабКомментарии",ТабКомментарии);
	ПараметрыЗадания.Вставить("Организация",Организация);
	ПараметрыЗадания.Вставить("Район",Район);
	
	Для Каждого ТекФайл Из СведенияФайлов Цикл
		Запись = РегистрыСведений.СМ_Файлы.СоздатьМенеджерЗаписи();
		Запись.ИмяФайла = ТекФайл.Загрузка_ПолныйПуть;
		Запись.Файл = Новый ХранилищеЗначения(ПолучитьИЗВременногоХранилища(ТекФайл.Загрузка_АдресВременногоХранилища));
		Запись.Записать();
	КонецЦикла;
	УИН = ТекФорма.УникальныйИдентификатор;
	АдресХранилища = Неопределено;
	Попытка
		ЗагрузитьKENML(ПараметрыЗадания,АдресХранилища,УИН);		
	Исключение
		ПредставлениеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Событие = НСтр("ru = 'Загрузка KENML'");
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка, , , ПредставлениеОшибки);
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат АдресХранилища;

КонецФункции

Процедура ЗагрузитьKENML(СтруктураПараметровЗадания,АдресХранилища,УИН) Экспорт
	Перем ДокСсылка;
	Перем СметнаяПрограмма;
	Перем ФорматВыгрузки;
	Перем ТекущаяСмета;
	Перем ТекущийРаздел;
	Перем ТекущаяПозицияЛС;
	Перем ТекКонтрагент;
	Перем Форма;
	Перем ПрефиксыПрограммы;

	Форма = СтруктураПараметровЗадания.ТекФорма;
	ТабДокументов = СтруктураПараметровЗадания.ТабДокументов;
	ТабРазделов = СтруктураПараметровЗадания.ТабРазделов;
	ТабПозиций = СтруктураПараметровЗадания.ТабПозиций;
	ТабКоэффициентов = СтруктураПараметровЗадания.ТабКоэффициентов;
	ТабРесурсов = СтруктураПараметровЗадания.ТабРесурсов;
	ТабЛимЗатраты = СтруктураПараметровЗадания.ТабЛимЗатраты;
	ТабКомментарии = СтруктураПараметровЗадания.ТабКомментарии;
	Организация = СтруктураПараметровЗадания.Организация;
	Район = СтруктураПараметровЗадания.Район;
    СведенияФайлов = СтруктураПараметровЗадания.СведенияФайлов;
	Если Не Форма.АнализФайла Тогда
		Если Форма.СоответствияПрефиксов.Количество()>0 Тогда
			Для Каждого стр Из Форма.СоответствияПрефиксов Цикл
				РС_Шифр = РегистрыСведений.СМ_АРПС_ПрефиксыОбъектов.СоздатьМенеджерЗаписи();
				РС_Шифр.СметнаяПрограмма = стр.СметнаяПрограмма;
				РС_Шифр.СтрокаПрефикса = стр.СтрокаПрефикса;
				РС_Шифр.ТипНормативногоСборника = стр.ТипНормативногоСборника;
				РС_Шифр.Определитель = стр.Определитель;
				РС_Шифр.ВидРесурса = стр.ВидРесурса;
				РС_Шифр.СоздаватьЗаписиВСправочнике = стр.СоздаватьЗаписиВСправочнике;
				РС_Шифр.НеОтбрасыватьПрефикс = стр.НеОтбрасыватьПрефикс;
				РС_Шифр.РедактироваласьПользователем = Истина;
				РС_Шифр.Записать(Ложь);
			КонецЦикла;
		КонецЕсли;
		Если Форма.СоответствияРесурсов.Количество()>0 Тогда
			Для Каждого стр Из Форма.СоответствияРесурсов Цикл
				Если стр.СсылкаВБазе.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				РС_Шифр = РегистрыСведений.СМ_АРПС_СоответствияШифров.СоздатьМенеджерЗаписи();
				РС_Шифр.СметнаяПрограмма = стр.СметнаяПрограмма;
				РС_Шифр.ШифрАРПС = стр.КодРесурса;
				РС_Шифр.Шифр = стр.СсылкаВБазе.Код;
				РС_Шифр.Ресурс = стр.СсылкаВБазе;
				РС_Шифр.РедактироваласьПользователем = Истина;
				РС_Шифр.Записать(Ложь);
			КонецЦикла;
		КонецЕсли;
		Если Форма.СоответствияЛЗ.Количество()>0 Тогда		
			Для Каждого стр Из Форма.СоответствияЛЗ Цикл
				Если стр.НеЯвляетсяЛимЗатратой Тогда
					РС_ЛимЗатрат = РегистрыСведений.СМ_АРПС_Итоги.СоздатьМенеджерЗаписи();
					РС_ЛимЗатрат.НаименованиеЛимзатратыАРПС = стр.НаименованиеЛЗ;
					РС_ЛимЗатрат.РедактироваласьПользователем = Истина;
					РС_ЛимЗатрат.Записать(Ложь);
					Продолжить;
				КонецЕсли;
				Если стр.СсылкаВБазе.Пустая() Тогда
					Продолжить;
				КонецЕсли;
				РС_ЛимЗатрат = РегистрыСведений.СМ_АРПС_СоответствияЛимЗатрат.СоздатьМенеджерЗаписи();
				РС_ЛимЗатрат.СметнаяПрограмма = стр.СметнаяПрограмма;
				РС_ЛимЗатрат.НаименованиеЛимзатратыАРПС = стр.НаименованиеЛЗ;
				РС_ЛимЗатрат.ИдентификаторЛимЗатраты = стр.СсылкаВБазе.Идентификатор;
				РС_ЛимЗатрат.ЛимЗатрата =  стр.СсылкаВБазе;
				РС_ЛимЗатрат.НаименованиеЛимзатраты = стр.СсылкаВБазе.Наименование;
				РС_ЛимЗатрат.РедактироваласьПользователем = Истина;
				РС_ЛимЗатрат.Записать(Ложь);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

    СметнаяПрограмма = Справочники.СМ_СметныеПрограммы.ПустаяСсылка();
	
	//  ******************************************
	
	Если НЕ ЗначениеЗаполнено(Форма.КаталогЗагрузки) Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Каталог / файл загрузки не указан!'"));
		
		// Запись сообщений в журнал регистрации
		СтруктураСообщения 	= Новый Структура;
		СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
		СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
		СтруктураСообщения.Вставить("Комментарий",НСтр("ru='Каталог / файл загрузки не указан!'"));
		СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
		
		СообщенияДляЖурнала	= Новый СписокЗначений();
		СообщенияДляЖурнала.Добавить(СтруктураСообщения);
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = "";
	НачатьТранзакцию();
	Если Форма.ИзФайла Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",СведенияФайлов[0].Загрузка_ПолныйПуть)); 
		Запись.Следующий();
		ДвоичныеДанные = Запись.Файл.Получить();
		ДвоичныеДанные.Записать(ИмяВременногоФайла);

		//  Чтение файла
		Стр 		= "пустая";
		сч=1;
		КодВерхнейСтроки = "";
		ВерхнийРаздел = Неопределено;
		ТекущаяПозицияВладелецЛС = Неопределено;
		
		СтрокаПрограммы = СведенияФайлов[0];
		СметнаяПрограмма = СтрокаПрограммы.Загрузка_СведенияОПрограмме;
		ПрефиксыПрограммы = СМ_АРПС_ОбменВызовСервера.ПолучитьПрефиксы(СметнаяПрограмма);

		Чтение = Новый ЧтениеXML;
		Чтение.ОткрытьФайл(ИмяВременногоФайла);
		Пока Чтение.Прочитать() Цикл 
			ИмяУзла = Чтение.Имя; 
			Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
				Если ИмяУзла = "ДОКУМЕНТ" Тогда
					ЗагрузитьЭлементМассива(СтрокаПрограммы,Организация,Район,ТекущаяСмета,ТекущийРаздел,ТекущаяПозицияЛС,ТекКонтрагент,Форма,ПрефиксыПрограммы,СметнаяПрограмма,Чтение,ТабПозиций,ТабДокументов,ТабРазделов,ТабКоэффициентов,ТабРесурсов,ТабКомментарии,ТабЛимЗатраты,КодВерхнейСтроки,ВерхнийРаздел,ТекущаяПозицияВладелецЛС,ТекстОшибки);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если Не Форма.АнализФайла Тогда
			Попытка
				СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(ТекущаяСмета);
				Документы.СМ_ЛокальнаяСмета.Перерасчет(ТекущаяСмета, Ложь);
			Исключение
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='ЛС не рассчитана: %1, %2, %3'"), ТекущаяСмета.Номер, ТекущаяСмета.Дата, ТекущаяСмета.Наименование));
				
				// Запись сообщений в журнал регистрации
				СтруктураСообщения 	= Новый Структура;
				СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
				СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
				СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='ЛС не рассчитана: %1, %2, %3'"), ТекущаяСмета.Номер, ТекущаяСмета.Дата, ТекущаяСмета.Наименование));
				СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
				
				СообщенияДляЖурнала	= Новый СписокЗначений();
				СообщенияДляЖурнала.Добавить(СтруктураСообщения);
				ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
			КонецПопытки;
		КонецЕсли;
	Иначе
	
		Для Каждого ТекФайл Из СведенияФайлов Цикл

			ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
			Запись = РегистрыСведений.СМ_Файлы.Выбрать(Новый Структура("ИмяФайла",ТекФайл.Загрузка_ПолныйПуть)); 
			Запись.Следующий();
			ДвоичныеДанные = Запись.Файл.Получить();
			ДвоичныеДанные.Записать(ИмяВременногоФайла);
			
			//  Чтение файла
			Стр = "пустая";
			сч=1;
			КодВерхнейСтроки = "";
			ВерхнийРаздел = Неопределено;
			ТекущаяПозицияВладелецЛС = Неопределено;
			
			СтрокаПрограммы = СведенияФайлов.Найти(ТекФайл.Загрузка_ПолныйПуть,"Загрузка_ПолныйПуть");
			СметнаяПрограмма = СтрокаПрограммы.Загрузка_СведенияОПрограмме;
			ПрефиксыПрограммы = СМ_АРПС_ОбменВызовСервера.ПолучитьПрефиксы(СметнаяПрограмма);
			
			Чтение = Новый ЧтениеXML;
			Чтение.ОткрытьФайл(ИмяВременногоФайла);
			Пока Чтение.Прочитать() Цикл 
				ИмяУзла = Чтение.Имя; 
				Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
					Если ИмяУзла = "ДОКУМЕНТ" Тогда
						ЗагрузитьЭлементМассива(СтрокаПрограммы,Организация,Район,ТекущаяСмета,ТекущийРаздел,ТекущаяПозицияЛС,ТекКонтрагент,Форма,ПрефиксыПрограммы,СметнаяПрограмма,Чтение,ТабПозиций,ТабДокументов,ТабРазделов,ТабКоэффициентов,ТабРесурсов,ТабКомментарии,ТабЛимЗатраты,КодВерхнейСтроки,ВерхнийРаздел,ТекущаяПозицияВладелецЛС,ТекстОшибки);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если Не Форма.АнализФайла Тогда
				Попытка
					СМ_СметныйСоставВызовСервера.ПеренумероватьДерево(ТекущаяСмета);
					Документы.СМ_ЛокальнаяСмета.Перерасчет(ТекущаяСмета, Ложь);
				Исключение
					//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='ЛС не рассчитана: %1, %2, %3'"), Форма.ТекущаяСмета.Номер, Форма.ТекущаяСмета.Дата, Форма.ТекущаяСмета.Наименование));
					
					// Запись сообщений в журнал регистрации
					СтруктураСообщения 	= Новый Структура;
					СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
					СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
					СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='ЛС не рассчитана: %1, %2, %3'"), Форма.ТекущаяСмета.Номер, Форма.ТекущаяСмета.Дата, Форма.ТекущаяСмета.Наименование));
					СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
					
					СообщенияДляЖурнала	= Новый СписокЗначений();
					СообщенияДляЖурнала.Добавить(СтруктураСообщения);
					ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТекстОшибки = "" Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		Для Каждого ТекСтрока Из СведенияФайлов Цикл
			ТекСтрока.Загрузка_СозданныйДокумент = "";
		КонецЦикла;
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
		// Запись сообщений в журнал регистрации
		СтруктураСообщения 	= Новый Структура;
		СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
		СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
		СтруктураСообщения.Вставить("Комментарий",ТекстОшибки);
		СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
		
		СообщенияДляЖурнала	= Новый СписокЗначений();
		СообщенияДляЖурнала.Добавить(СтруктураСообщения);
		ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
		
		ОтменитьТранзакцию();
	КонецЕсли;
		
	СтруктураПараметровЗадания.ТекФорма = Форма;
	СтруктураПараметровЗадания.ТабДокументов = ТабДокументов;
	СтруктураПараметровЗадания.ТабРазделов = ТабРазделов;
	СтруктураПараметровЗадания.ТабПозиций = ТабПозиций;
	СтруктураПараметровЗадания.ТабКоэффициентов = ТабКоэффициентов;
	СтруктураПараметровЗадания.ТабРесурсов = ТабРесурсов;
	СтруктураПараметровЗадания.ТабЛимЗатраты = ТабЛимЗатраты;
	СтруктураПараметровЗадания.ТабКомментарии = ТабКомментарии;
	СтруктураПараметровЗадания.СведенияФайлов = СведенияФайлов;
	АдресХранилища = ПоместитьВоВременноеХранилище(СтруктураПараметровЗадания, УИН); 
	
КонецПроцедуры

Процедура ЗагрузитьЭлементМассива(СтрокаПрограммы,Организация,Район,ТекущаяСмета,ТекущийРаздел,ТекущаяПозицияЛС,ТекКонтрагент,Форма,ПрефиксыПрограммы,СметнаяПрограмма,Чтение,ТабПозиций,ТабДокументов,ТабРазделов,ТабКоэффициентов,ТабРесурсов,ТабКомментарии,ТабЛимЗатраты,КодВерхнейСтроки,ВерхнийРаздел,ТекущаяПозицияВладелецЛС,ТекстОшибки)
	Комментарий = "";
	
	СтруктураРеквизитовСмета = Новый Структура;
	
	СтрокаСметы = Неопределено;
	СтрокаРаздела = Неопределено;
	СтрокаПозиции = Неопределено;
	СтрокаРесурса = Неопределено;
	
	НоваяСтрока = ТабДокументов.Добавить();
	СтрокаСметы = НоваяСтрока; 
	Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл 
		
		ТипУзла 		= Чтение.ТипУзла; 
		ИмяПараметра 	= Чтение.Имя; 
		Значение 		= Чтение.Значение; 
		
		Если ИмяПараметра = "ВерсияФормата" Тогда
			Формат = Значение;
		ИначеЕсли Врег(ИмяПараметра) = "ГЕНЕРАТОР" Тогда
			НаименованиеПрограммыИсточника = Значение; 
		ИначеЕсли ИмяПараметра = "НаименованиеСтройки" Тогда
			НаименованиеСтройки = Значение;
			Форма.Стройка 	= НаименованиеСтройки;
		ИначеЕсли ИмяПараметра = "ШифрСтройки" Тогда
			КодСтройки = Значение;
		ИначеЕсли ИмяПараметра = "НаименованиеОбъекта" Тогда
			НаименованиеОбъекта = Значение;
			Форма.ОбъектСтроительства 	= НаименованиеОбъекта;
		ИначеЕсли ИмяПараметра = "ШифрОбъекта" Тогда
			КодОбъекта = Значение;
		ИначеЕсли ИмяПараметра = "ШифрСметы" Тогда
			НоваяСтрока.НомерДокумента = Значение;
		ИначеЕсли ИмяПараметра = "НаименованиеДок" Тогда
			НоваяСтрока.НаименованиеДокумента = Значение;
		ИначеЕсли ИмяПараметра = "Глава" Тогда
			Глава = Значение;
		ИначеЕсли ИмяПараметра = "НомерРегиона" Тогда
			Форма.НомерРегиона = Значение;
		ИначеЕсли ИмяПараметра = "НомерРайона" Тогда
			Форма.НомерРайона = Значение;
		ИначеЕсли ИмяПараметра = "ВерсияСНБ" Тогда
			Форма.НаименованиеСНБазы = Значение;
		ИначеЕсли ИмяПараметра = "Версия" Тогда
			Версия = Значение;
		ИначеЕсли ИмяПараметра = "Дата" Тогда
			Дата = Значение;
		ИначеЕсли ИмяПараметра = "Время" Тогда
			Время = Значение;
		ИначеЕсли ИмяПараметра = "ПоказательНК2" Тогда
			СтруктураРеквизитовСмета.Вставить("ПоказательНК2",Значение);
		ИначеЕсли ИмяПараметра = "ПоказательСП" Тогда
			СтруктураРеквизитовСмета.Вставить("ПоказательСП",Значение);
		ИначеЕсли ИмяПараметра = "УровеньЦен" Тогда
			СтруктураРеквизитовСмета.Вставить("УровеньЦен",Значение);
		КонецЕсли;
		
		
	КонецЦикла;
	
	Если НЕ Форма.АнализФайла Тогда
		
		Если Не ПустаяСтрока(Форма.НомерРегиона) Тогда
			
			КодРегиона = Число(Форма.НомерРегиона);
			КодРегиона = Формат(КодРегиона,"ЧЦ=4; ЧДЦ=2; ЧРД=.; ЧВН=");
			ПоискРайон = Справочники.СМ_ТерриториальныеРайоны.НайтиПоКоду(КодРегиона);
			Если Не ПоискРайон.Пустая() Тогда
				Район = ПоискРайон;
			КонецЕсли;
			
		КонецЕсли;
		
		ТекущаяСмета = ПолучитьСоздатьДокументЛС(Организация,Район,Форма,НоваяСтрока,СтруктураРеквизитовСмета);
		Если Не ЗначениеЗаполнено(СтрокаПрограммы.Загрузка_СозданныйДокумент) Тогда
			СтрокаПрограммы.Загрузка_СозданныйДокумент = ТекущаяСмета;
		КонецЕсли;
	КонецЕсли;

	НомерРаздела = 0;
	сч = 0;
	ОсновнойРаздел = Неопределено;
	Пока Чтение.Прочитать() Цикл 
		
		ИмяУзла = Чтение.Имя; 
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			
			Если ИмяУзла = "СТРУКТУРА" Тогда
				ВерхнийРаздел = ТекущаяСмета;
			ИначеЕсли ИмяУзла = "РАЗДЕЛ" Тогда
				ЭтоПодраздел = Ложь;
				НомерРаздела = НомерРаздела + 1;
				НоваяСтрока = ТабРазделов.Добавить();
				СтрокаРаздела = НоваяСтрока;
				НоваяСтрока.НомерРаздела = НомерРаздела;
				НоваяСтрока.ИдРаздела = НомерРаздела;
				
				
				Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл
					
					ТипУзла 		= Чтение.ТипУзла; 
					ИмяПараметра 	= Чтение.Имя; 
					Значение 		= Чтение.Значение; 
					
					Если ИмяПараметра = "ID" Тогда
						НоваяСтрока.НомерРаздела = ?(ПустаяСтрока(Значение),НоваяСтрока.НомерРаздела,Значение);
					ИначеЕсли ИмяПараметра = "Наименование" Тогда
						НоваяСтрока.НаименованиеРаздела = Значение;
					ИначеЕсли ИмяПараметра = "Тип" Тогда
						ЭтоПодраздел = Значение = "4";
					КонецЕсли;
						
				КонецЦикла;
				
				Если НЕ Форма.АнализФайла Тогда
					ТекущийРаздел = ПолучитьСоздатьДокументРаздел(ТекущаяСмета,НоваяСтрока.НомерРаздела,НоваяСтрока.НаименованиеРаздела,?(ЭтоПодраздел,ВерхнийРаздел,Неопределено));
					
					Если ОсновнойРаздел = Неопределено Тогда
						ОсновнойРаздел = ТекущийРаздел;
					КонецЕсли;

					НоваяСтрока.Ссылка = ТекущийРаздел;
					ВерхнийРаздел = ТекущийРаздел; 
				КонецЕсли;

			ИначеЕсли ИмяУзла = "ПОЗИЦИЯ" Тогда
				
				НоваяСтрока = ТабПозиций.Добавить();
				СтрокаПозиции = НоваяСтрока;
				НоваяСтрока.ПризнакПодчиненности = Ложь;
				КодЛокальный = "";
				Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл
					
					ТипУзла 		= Чтение.ТипУзла; 
					ИмяПараметра 	= Чтение.Имя; 
					Значение 		= Чтение.Значение; 
					
					Если ИмяПараметра = "ID" Тогда
						НоваяСтрока.НомерПозицииВСмете = Значение;
					ИначеЕсли ИмяПараметра = "Наименование" Тогда
						НоваяСтрока.НаименованиеПозиции = Значение;
					ИначеЕсли ИмяПараметра = "КодСНБ" Тогда
						НоваяСтрока.ШифрПозиции = Значение;
					ИначеЕсли ИмяПараметра = "Объем" Тогда
						НоваяСтрока.ОбъемРабот = Значение;
					ИначеЕсли ИмяПараметра = "Измеритель" Тогда
						НоваяСтрока.ЕдиницаИзмерения = Значение;
					ИначеЕсли ИмяПараметра = "Тип" Тогда
						НоваяСтрока.ТипПозиции = Значение;
					ИначеЕсли ИмяПараметра = "ВидЗатрат" Тогда
						НоваяСтрока.ВидЗатрат = Значение;
					ИначеЕсли ИмяПараметра = "НК1" Тогда
						НоваяСтрока.НК1 = Значение;
					ИначеЕсли ИмяПараметра = "КодЛокальный" Тогда
						КодЛокальный = Значение;
					КонецЕсли;
					
				КонецЦикла;
				
				Если Не ЗначениеЗаполнено(НоваяСтрока.ШифрПозиции) И Не ПустаяСтрока(КодЛокальный) Тогда
					НоваяСтрока.ШифрПозиции = КодЛокальный;
				КонецЕсли;

			ИначеЕсли ИмяУзла = "СТОИМОСТЬ" Тогда
				
				ЗаполнитьСтоимостьПозиции(Чтение,СтрокаПозиции);
				
				Определитель = Неопределено;
				ТСН = Неопределено; 
				НужнаяСтрока = Неопределено;
				Если ПрефиксыПрограммы<>Неопределено И ПрефиксыПрограммы.Количество()>0 Тогда
					НужнаяСтрока = СМ_АРПС_ОбменВызовСервера.НайтиСтрокуПоПрефиксу(СтрокаПозиции.ШифрПозиции,ПрефиксыПрограммы);
					Если НЕ НужнаяСтрока = Неопределено Тогда
						СтрокаПозиции.ШифрПозиции = ?(НужнаяСтрока.НеОтбрасыватьПрефикс,СтрокаПозиции.ШифрПозиции,НужнаяСтрока.ШифрБезПрефикса);
						Определитель = НужнаяСтрока.Определитель;
						ТНС = НужнаяСтрока.ТНС; 
					КонецЕсли;
				КонецЕсли;
				
				Если НЕ Форма.АнализФайла Тогда
					ТекущаяПозицияЛС = ПолучитьСоздатьДокументПозицияЛС(ТекущаяПозицияВладелецЛС,ТекущаяСмета,ТекущийРаздел,Форма,СтрокаПозиции,Определитель,ТНС,СметнаяПрограмма);
				Иначе
					Если НужнаяСтрока = Неопределено Тогда
						АнализДокументПозицияЛС(СтрокаПрограммы,Форма,СтрокаПозиции,Определитель,ТНС);
					КонецЕсли;
				КонецЕсли;

			ИначеЕсли ИмяУзла = "РЕСУРС" Тогда
				
				НоваяСтрока = ТабРесурсов.Добавить();
				СтрокаРесурса = НоваяСтрока;
				Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл
					
					ТипУзла 		= Чтение.ТипУзла; 
					ИмяПараметра 	= Чтение.Имя; 
					Значение 		= Чтение.Значение; 
					КодЛокальный = "";
					Если ИмяПараметра = "ID" Тогда
						НоваяСтрока.ДопКодРесурса = СтрокаПозиции.НомерПозицииВСмете+"-"+Значение;
					ИначеЕсли ИмяПараметра = "Наименование" Тогда
						НоваяСтрока.Наименование = Значение;
					ИначеЕсли ИмяПараметра = "КодСНБ" Тогда
						НоваяСтрока.КодРесурса = Значение;
					ИначеЕсли ИмяПараметра = "Тип" Тогда
						НоваяСтрока.ПризнакТипа = Значение;
					ИначеЕсли ИмяПараметра = "Цена" Тогда
						НоваяСтрока.ЦенаЕдиницыТекущая = Значение;
					ИначеЕсли ИмяПараметра = "Измеритель" Тогда
						НоваяСтрока.ЕдиницаИзмерения = Значение;
					ИначеЕсли ИмяПараметра = "Норма" Тогда
						НоваяСтрока.НормаРасхода = Значение;
					ИначеЕсли ИмяПараметра = "Статус" Тогда
						НоваяСтрока.Статус = Значение;
					ИначеЕсли ИмяПараметра = "ЗМ" Тогда
						НоваяСтрока.ЗПМашинистовТекущая = Значение;
					ИначеЕсли ИмяПараметра = "КодЛокальный" Тогда
						КодЛокальный = Значение;
					КонецЕсли;
					
					Если Не ЗначениеЗаполнено(НоваяСтрока.КодРесурса) И Не ПустаяСтрока(КодЛокальный) Тогда
						НоваяСтрока.КодРесурса = КодЛокальный;
					КонецЕсли;

				КонецЦикла;
				
				
				
				ВидРесурса = Неопределено; 
				РесурсРС = Неопределено;
				НужнаяСтрока = Неопределено;
				Если ПрефиксыПрограммы<>Неопределено И ПрефиксыПрограммы.Количество()>0 Тогда
					НужнаяСтрока = СМ_АРПС_ОбменВызовСервера.НайтиСтрокуПоПрефиксу(НоваяСтрока.КодРесурса,ПрефиксыПрограммы);
					Если НЕ НужнаяСтрока = Неопределено Тогда
						НоваяСтрока.КодРесурса = ?(НужнаяСтрока.НеОтбрасыватьПрефикс,НоваяСтрока.КодРесурса,НужнаяСтрока.ШифрБезПрефикса);
						ВидРесурса = ?(ЗначениеЗаполнено(НужнаяСтрока.ВидРесурса),НужнаяСтрока.ВидРесурса,Неопределено);
						РесурсРС = СМ_АРПС_ОбменВызовСервера.НайтиРесурсАРПС(СметнаяПрограмма,НоваяСтрока);
					КонецЕсли;
				КонецЕсли;
				
				ПолучитьСоздатьРесурс(НужнаяСтрока,СтрокаПрограммы,ТекущаяПозицияЛС,Форма,НоваяСтрока,ВидРесурса,РесурсРС,ТекстОшибки);

			ИначеЕсли ИмяУзла = "КОЭФФИЦИЕНТ" Тогда
				
				НоваяСтрока = ТабКоэффициентов.Добавить();
				НоваяСтрока.НомерПозицииВСмете = СтрокаПозиции.НомерПозицииВСмете;
				Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл
					
					ТипУзла 		= Чтение.ТипУзла; 
					ИмяПараметра 	= Чтение.Имя; 
					Значение 		= Чтение.Значение; 
					
					Если ИмяПараметра = "Наименование" Тогда
						НоваяСтрока.НаименованиеКоэффициента = Значение;
					ИначеЕсли ИмяПараметра = "Тип" Тогда
						НоваяСтрока.ТипПоправки = Значение;
					ИначеЕсли ИмяПараметра = "СписокПозиций" Тогда
						НоваяСтрока.СписокПозиций = Значение;
					ИначеЕсли ИмяПараметра = "Ссылка" Тогда
						НоваяСтрока.ОснованиеКоэффициента = Значение;
					ИначеЕсли ИмяПараметра = "Ктруд" Тогда
						НоваяСтрока.Ктруд = Значение;
					ИначеЕсли ИмяПараметра = "Кзп" Тогда
						НоваяСтрока.Кзп = Значение;
					ИначеЕсли ИмяПараметра = "Кмаш" Тогда
						НоваяСтрока.Кмаш = Значение;
					ИначеЕсли ИмяПараметра = "Ктрудмаш" Тогда
						НоваяСтрока.Ктрудмаш = Значение;
					ИначеЕсли ИмяПараметра = "Кзпмашин" Тогда
						НоваяСтрока.Кзпмашин = Значение;
					ИначеЕсли ИмяПараметра = "Кматериалов" Тогда
						НоваяСтрока.Кматериалов = Значение;
					ИначеЕсли ИмяПараметра = "Кстмт" Тогда
						НоваяСтрока.Кстмт = Значение;
					ИначеЕсли ИмяПараметра = "Ктрпрц" Тогда
						НоваяСтрока.Ктрпрц = Значение;
					ИначеЕсли ИмяПараметра = "Кзгспрц" Тогда
						НоваяСтрока.Кзгспрц = Значение;
					ИначеЕсли ИмяПараметра = "КНК1" Тогда
						НоваяСтрока.КНК1 = Значение;
					ИначеЕсли ИмяПараметра = "КНК2" Тогда
						НоваяСтрока.КНК2 = Значение;
					ИначеЕсли ИмяПараметра = "КСП" Тогда
						НоваяСтрока.КСП = Значение;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
			
			Если ИмяУзла = "РАЗДЕЛ" Тогда
				Если НомерРаздела>1 Тогда
					
					сч=сч+1;
					ТекНомер = НомерРаздела-сч;
					Если ТекНомер = 1 Тогда
						ВерхнийРаздел = ОсновнойРаздел;
						ТекущийРаздел = ОсновнойРаздел;
					Иначе
						СтрокаРаздела = ТабРазделов.Найти(ТекНомер,"ИдРаздела");
						Если Не СтрокаРаздела = Неопределено Тогда
							ВерхнийРаздел = СтрокаРаздела.Ссылка;
							ТекущийРаздел = ВерхнийРаздел;
						КонецЕсли;
					КонецЕсли;
					
				ИначеЕсли  НомерРаздела = 1 И ЭтоПодраздел Тогда
					
					сч=сч+1;
					ТекНомер = НомерРаздела-сч;
					Если ТекНомер = 1 Тогда
						ВерхнийРаздел = ОсновнойРаздел;
						ТекущийРаздел = ОсновнойРаздел;
					Иначе
						СтрокаРаздела = ТабРазделов.Найти(ТекНомер,"ИдРаздела");
						Если Не СтрокаРаздела = Неопределено Тогда
							ВерхнийРаздел = СтрокаРаздела.Ссылка;
							ТекущийРаздел = ВерхнийРаздел;
						КонецЕсли;
					КонецЕсли;

				КонецЕсли;
			ИначеЕсли ИмяУзла = "ПОЗИЦИЯ" Тогда 
				
				Если НЕ Форма.АнализФайла Тогда
					ОбработатьПозицию(СтрокаПозиции,ТекущаяПозицияЛС,ТабКоэффициентов);
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;


КонецПроцедуры

Процедура ЗаполнитьСтоимостьПозиции(Чтение,НоваяСтрока)
	Пока Чтение.Прочитать() Цикл 
		
		ИмяУзла = Чтение.Имя; 
		
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ИмяУзла = "ЕДИНИЦА" Тогда
				
				Если Чтение.КоличествоАтрибутов()>0 Тогда
					
					Пока Чтение.ПрочитатьАтрибут() Цикл
						
						ТипУзла 		= Чтение.ТипУзла; 
						ИмяПараметра 	= Чтение.Имя; 
						Значение 		= Чтение.Значение; 
						
						Если ИмяПараметра = "ПЗ" Тогда
							НоваяСтрока.ПрямыеЗатраты = Значение;
						ИначеЕсли ИмяПараметра = "МТ" Тогда
							НоваяСтрока.СтоимостьМатериалов = Значение;
						ИначеЕсли ИмяПараметра = "ЗП" Тогда
							НоваяСтрока.ОсновнаяЗП = Значение;
						ИначеЕсли ИмяПараметра = "Цена" Тогда
							НоваяСтрока.ПрямыеЗатраты = Значение;
						ИначеЕсли ИмяПараметра = "ЗМ" Тогда
							НоваяСтрока.ЗарплатаМашинистов = Значение;
						ИначеЕсли ИмяПараметра = "ЕМ" Тогда
							НоваяСтрока.ЭксплМашин = Значение;
						ИначеЕсли ИмяПараметра = "МТВ" Тогда
							НоваяСтрока.ВозвратМатериалов = Значение;
						ИначеЕсли ИмяПараметра = "ОТП" Тогда
							НоваяСтрока.Оборудование = Значение;
						КонецЕсли;
						
					КонецЦикла;
					
				Иначе
					
					Пока Чтение.Прочитать() Цикл
						
						ТипУзла 		= Чтение.ТипУзла; 
						Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
							ИмяПараметра 	= Чтение.Имя; 
							Продолжить;
						ИначеЕсли ТипУзла = ТипУзлаXML.Текст Тогда
							Значение 		= Чтение.Значение;
						ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
							Если Чтение.Имя = "ЕДИНИЦА" Тогда
								Прервать;
							Иначе
								Продолжить;
							КонецЕсли;
						КонецЕсли;
						
						Если ИмяПараметра = "ПЗ" Тогда
							НоваяСтрока.ПрямыеЗатраты = Значение;
						ИначеЕсли ИмяПараметра = "МТ" Тогда
							НоваяСтрока.СтоимостьМатериалов = Значение;
						ИначеЕсли ИмяПараметра = "ЗП" Тогда
							НоваяСтрока.ОсновнаяЗП = Значение;
						ИначеЕсли ИмяПараметра = "Цена" Тогда
							НоваяСтрока.ПрямыеЗатраты = Значение;
						ИначеЕсли ИмяПараметра = "ЗМ" Тогда
							НоваяСтрока.ЗарплатаМашинистов = Значение;
						ИначеЕсли ИмяПараметра = "ЕМ" Тогда
							НоваяСтрока.ЭксплМашин = Значение;
						ИначеЕсли ИмяПараметра = "МТВ" Тогда
							НоваяСтрока.ВозвратМатериалов = Значение;
						ИначеЕсли ИмяПараметра = "ОТП" Тогда
							НоваяСтрока.Оборудование = Значение;
							//ИначеЕсли ИмяПараметра = "ТР" Тогда
							//	НоваяСтрока.КодРесурса = Значение;
							//ИначеЕсли ИмяПараметра = "ЗГС" Тогда
							//	НоваяСтрока.Наименование = Значение;
							//ИначеЕсли ИмяПараметра = "ЗГСП" Тогда
							//	НоваяСтрока.КодРесурса = Значение;
						КонецЕсли;
						
					КонецЦикла;
				КонецЕсли;
				
				// ИначеЕсли ИмяУзла = "ВСЕГО" Тогда
				//	
				//	Пока (Чтение.ТипУзла <> ТипУзлаXML.КонецЭлемента) И Чтение.ПрочитатьАтрибут() Цикл
				//		
				//		ТипУзла 		= Чтение.ТипУзла; 
				//		ИмяПараметра 	= Чтение.Имя; 
				//		Значение 		= Чтение.Значение; 
				//		
				//		
				//		Если ИмяПараметра = "ПЗ" Тогда
				//			НоваяСтрока.ДопКодРесурса = СтрокаПозиции.НомерПозицииВСмете+"-"+Значение;
				//		ИначеЕсли ИмяПараметра = "МТ" Тогда
				//			НоваяСтрока.Наименование = Значение;
				//		ИначеЕсли ИмяПараметра = "ЗП" Тогда
				//			НоваяСтрока.КодРесурса = Значение;
				//		ИначеЕсли ИмяПараметра = "СР" Тогда
				//			НоваяСтрока.Наименование = Значение;
				//		ИначеЕсли ИмяПараметра = "ЗМ" Тогда
				//			НоваяСтрока.КодРесурса = Значение;
				//		ИначеЕсли ИмяПараметра = "ЕМ" Тогда
				//			НоваяСтрока.КодРесурса = Значение;
				//		ИначеЕсли ИмяПараметра = "МТВ" Тогда
				//			НоваяСтрока.Наименование = Значение;
				//		ИначеЕсли ИмяПараметра = "ОБ" Тогда
				//			НоваяСтрока.КодРесурса = Значение;
				//		ИначеЕсли ИмяПараметра = "ТР" Тогда
				//			НоваяСтрока.КодРесурса = Значение;
				//		ИначеЕсли ИмяПараметра = "НК1" Тогда
				//			НоваяСтрока.Наименование = Значение;
				//		ИначеЕсли ИмяПараметра = "НК2" Тогда
				//			НоваяСтрока.КодРесурса = Значение;
				//		ИначеЕсли ИмяПараметра = "СП" Тогда
				//			НоваяСтрока.КодРесурса = Значение;
				//		КонецЕсли;
				//		
				//	КонецЦикла;
				//	
				// КонецЕсли;
				//
			КонецЕсли;
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			
			Если ИмяУзла = "СТОИМОСТЬ" Тогда
				Прервать;
			КонецЕсли;
			
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПолучитьСоздатьРесурс(НужнаяСтрока,СтрокаПрограммы,ТекущаяПозицияЛС,Форма,ТекСтрока,ВидРесурса,РесурсРС,ТекстОшибки)
	НоваяСтрокаПрефикс = Неопределено;
	СоздаватьРесурсы = Ложь;
	Если НужнаяСтрока <> Неопределено И НужнаяСтрока.СоздаватьЗаписиВСправочнике Тогда
		СоздаватьРесурсы = Истина;
	КонецЕсли;
	Если РесурсРС = Неопределено Тогда
		Если НужнаяСтрока = Неопределено Тогда
			Префикс = СМ_АРПС_ОбменВызовСервера.ПолучитьПрефиксИзСтроки(ТекСтрока.КодРесурса);
			Если ЗначениеЗаполнено(Префикс) Тогда
				НоваяСтрокаПрефикс = Форма.СоответствияПрефиксов.Найти(Префикс,"СтрокаПрефикса");
				Если НоваяСтрокаПрефикс = Неопределено Тогда
					НоваяСтрокаПрефикс	= Форма.СоответствияПрефиксов.Добавить();
					НоваяСтрокаПрефикс.СтрокаПрефикса = Префикс;
				КонецЕсли;
				НоваяСтрокаПрефикс.СметнаяПрограмма = СтрокаПрограммы.Загрузка_СведенияОПрограмме;
			КонецЕсли;
		КонецЕсли;
		ТекРесурс = Справочники.СМ_Ресурсы.НайтиПоКоду(ТекСтрока.КодРесурса);	
	Иначе
		ТекРесурс = РесурсРС;
	КонецЕсли;
	Каталог = Справочники.СМ_Ресурсы[Форма.СметноНормативнаяБаза.ГруппаРесурсов.ИмяПредопределенныхДанных];
	Если ТекРесурс = Справочники.СМ_Ресурсы.ПустаяСсылка() Тогда
		МассивРодителей = Новый СписокЗначений;   			
		СМ_СметаЗагрузкаВызовСервера.ПолучитьВсехРодителей(Каталог,МассивРодителей);
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Ресурсы.Ссылка
		|ИЗ
		|	Справочник.СМ_Ресурсы КАК Ресурсы
		|ГДЕ
		|	Ресурсы.Ссылка В (&Каталог)
		|	И Ресурсы.Код = &КодРесурса
		|	И Ресурсы.ЭтоГруппа = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("КодРесурса", ТекСтрока.КодРесурса);
		Запрос.УстановитьПараметр("Каталог", МассивРодителей);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
			ТекРесурс = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Если Не Форма.АнализФайла И СоздаватьРесурсы И Форма.СоздаватьНовыеЭлементы И ТекРесурс.Пустая() Тогда
		Если СМ_СметаВызовСервера.НедоступнаРаботаСПрайсами() Тогда
			ТекстОшибки = ТекстОшибки + "Не найден ресурс: " + ТекСтрока.Наименование + ". Загрузка отменена." + Символы.ПС;
			Возврат;
		КонецЕсли;
		ТекРесурсОб = Справочники.СМ_Ресурсы.СоздатьЭлемент();
		Если ТекСтрока.ПризнакТипа = "0" Тогда
			ТекРесурсОб.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих;		
		ИначеЕсли ТекСтрока.ПризнакТипа = "1" Тогда
			ТекРесурсОб.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы;
		ИначеЕсли ТекСтрока.ПризнакТипа = "2" Тогда
			ТекРесурсОб.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы;
		ИначеЕсли ТекСтрока.ПризнакТипа = "3" Тогда
			ТекРесурсОб.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов;
		КонецЕсли;	
		Если НЕ ВидРесурса = Неопределено Тогда
			ТекРесурсОб.ВидРесурса = ВидРесурса;
		КонецЕсли;
		ТекРесурсОб.Код = ТекСтрока.КодРесурса;
		ТекРесурсОб.Наименование = ТекСтрока.Наименование;
		ТекРесурсОб.ДлинноеНаименование = ТекСтрока.Наименование;
		ТекРесурсОб.Родитель = СМ_СметаЗагрузкаВызовСервера.СоздатьПолучитьПапкуРесурсов(""+ТекРесурсОб.ВидРесурса,Каталог);
		ТекРесурсОб.ЕдиницаИзмерения = НайтиЕдиницуИзмеренияСметномуКоду(ТекСтрока.ЕдиницаИзмерения);
		ТекРесурсОб.ГодВыпуска = ?(ЗначениеЗаполнено(Форма.СметноНормативнаяБаза.ГодВыпуска),Форма.СметноНормативнаяБаза.ГодВыпуска,Перечисления.СМ_ГодыВыпускаБазы.г2009);
		ТекРесурсОб.Записать();
		ТекРесурс = ТекРесурсОб.Ссылка;
	КонецЕсли;
	Если Форма.АнализФайла Тогда
		Если ТекРесурс = Справочники.СМ_Ресурсы.ПустаяСсылка() И СоздаватьРесурсы Тогда
			НоваяСтрока 					= Форма.СоответствияРесурсов.Добавить();
			НоваяСтрока.НаименованиеРесурса = ТекСтрока.Наименование;
			НоваяСтрока.КодРесурса          = ТекСтрока.КодРесурса;
			НоваяСтрока.СметнаяПрограмма 	= СтрокаПрограммы.Загрузка_СведенияОПрограмме;
			
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ресурс не найден в справочнике: %1, %2'"), ТекСтрока.КодРесурса, ТекСтрока.Наименование));
			
			// Запись сообщений в журнал регистрации
			СтруктураСообщения 	= Новый Структура;
			СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
			СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
			СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ресурс не найден в справочнике: %1, %2'"), ТекСтрока.КодРесурса, ТекСтрока.Наименование));
			СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
			
			СообщенияДляЖурнала	= Новый СписокЗначений();
			СообщенияДляЖурнала.Добавить(СтруктураСообщения);
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
		КонецЕсли;
	Иначе	
		Если ТекРесурс = Справочники.СМ_Ресурсы.ПустаяСсылка() И СоздаватьРесурсы Тогда
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("НаименованиеРесурса",ТекСтрока.Наименование);
	    	МассивСтрок = Форма.СоответствияРесурсов.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда
				ТекРесурс = МассивСтрок[0].СсылкаВБазе;
			Иначе
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ресурс: %1, %2 - не задано соответствие в таблице'"), ТекСтрока.КодРесурса, ТекСтрока.Наименование));	
				
				// Запись сообщений в журнал регистрации
				СтруктураСообщения 	= Новый Структура;
				СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
				СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
				СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Ресурс: %1, %2 - не задано соответствие в таблице'"), ТекСтрока.КодРесурса, ТекСтрока.Наименование));
				СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
				
				СообщенияДляЖурнала	= Новый СписокЗначений();
				СообщенияДляЖурнала.Добавить(СтруктураСообщения);
				ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		//  Создаем новую строку ресурса в ТЧ
		ТекОбъект 						= ТекущаяПозицияЛС.ПолучитьОбъект();
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("СметныйКодРесурса", ?(ЗначениеЗаполнено(ТекРесурс),ТекРесурс.Код,ТекСтрока.КодРесурса));
		ПараметрыОтбора.Вставить("ЕдиницаИзмеренияРесурса", ТекСтрока.ЕдиницаИзмерения);
		ПараметрыОтбора.Вставить("НаименованиеРесурса", ?(ЗначениеЗаполнено(ТекРесурс),ТекРесурс.Наименование,ТекСтрока.Наименование));

		НайденныеСтроки = ТекОбъект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество()=0 Тогда
			НоваяСтрока 					= ТекОбъект.РесурсыПозицииЛокальнойСметы.Добавить();
			НоваяСтрока.Ресурс              = ТекРесурс.Ссылка;
			НоваяСтрока.СметныйКодРесурса	= ?(ЗначениеЗаполнено(НоваяСтрока.Ресурс),ТекРесурс.Код,ТекСтрока.КодРесурса);
			НоваяСтрока.НаименованиеРесурса = ?(ЗначениеЗаполнено(ТекРесурс),ТекРесурс.Наименование,ТекСтрока.Наименование);
			НоваяСтрока.ЕдиницаИзмеренияРесурса = ТекСтрока.ЕдиницаИзмерения;
			
			
			Если ТекСтрока.ПризнакТипа = "1" Тогда
				НоваяСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих;		
			ИначеЕсли ТекСтрока.ПризнакТипа = "2" Тогда
				НоваяСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы;
			ИначеЕсли ТекСтрока.ПризнакТипа = "3" Тогда
				НоваяСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы;
			ИначеЕсли ТекСтрока.ПризнакТипа = "4" ИЛИ ТекСтрока.ПризнакТипа = "5" Тогда
				НоваяСтрока.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Оборудование;
			КонецЕсли;	
			Если НЕ ВидРесурса = Неопределено Тогда
				НоваяСтрока.ВидРесурса = ВидРесурса;
			КонецЕсли;
			
			НоваяСтрока.ВидРесурса = ?(ЗначениеЗаполнено(ТекРесурс),ТекРесурс.ВидРесурса,НоваяСтрока.ВидРесурса);
			
			НоваяСтрока.НормаРасхода                    = ТекСтрока.НормаРасхода;
			НоваяСтрока.БазиснаяЦена                    = ТекСтрока.ЦенаЕдиницыБазовая;
			НоваяСтрока.БазиснаяЗарплатаМашинистов	  	= ТекСтрока.ЗПМашинистовБазовая;
			НоваяСтрока.ТекущаяЦена                     = ТекСтрока.ЦенаЕдиницыТекущая;
			Если НоваяСтрока.ТекущаяЦена = 0 Тогда
				НоваяСтрока.ТекущаяЦена                     = ТекСтрока.ЦенаЕдиницыФактическая;
			КонецЕсли;
			НоваяСтрока.ТекущаяЗарплатаМашинистов       = ТекСтрока.ЗПМашинистовТекущая;
			НоваяСтрока.ТипМатериала                  	= Перечисления.СМ_ТипыМатериалов.Учтенный;
		Иначе
			НоваяСтрока 					            = НайденныеСтроки[0];
			НоваяСтрока.НормаРасхода                    = НоваяСтрока.НормаРасхода+ТекСтрока.НормаРасхода;
		КонецЕсли;

		ТекОбъект.Записать();
		
	КонецЕсли;
	Если Не НоваяСтрокаПрефикс = Неопределено Тогда 
		НоваяСтрокаПрефикс.ВидРесурса = ВидРесурса;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьПозицию(СтрокаПозиции,ТекущаяПозицияЛС,ТабКоэффициентов)
	
	ТекОбъект = ТекущаяПозицияЛС.ПолучитьОбъект();
	
	Если Не ТабКоэффициентов = Неопределено Тогда
		МассивКоэффициентов = ТабКоэффициентов.НайтиСтроки(Новый Структура("НомерПозицииВСмете",СтрокаПозиции.НомерПозицииВСмете));
		Для Каждого ТекСтрока Из МассивКоэффициентов Цикл
			ПолучитьСоздатьПоправочныйКоэффициентПоВсем(ТекСтрока,ТекущаяПозицияЛС,ТекОбъект);
		КонецЦикла;	
	КонецЕсли;
	

	// перемножаем.
	Если ТекОбъект.ПоправкиПозиции.количество() > 0 Тогда
		ТаблицаСтрок = ТекОбъект.ПоправкиПозиции.Выгрузить(,"Применить,УсловияПрименения,Обоснование,ВариантРасчета,Справка,ТипПоправки,ДобавПЗ,ДобавОЗ,ДобавЭМ,ДобавЗМ,ДобавСМ,ДобавТР,ДобавТ");
		ТаблицаСтрок.Свернуть("Применить,УсловияПрименения,Обоснование,ВариантРасчета,Справка,ТипПоправки","ДобавПЗ,ДобавОЗ,ДобавЭМ,ДобавЗМ,ДобавСМ,ДобавТР,ДобавТ");
		
		Итоговая = ТекОбъект.ПоправкиПозиции.Выгрузить().СкопироватьКолонки();
		
		Для Каждого Поправка Из ТаблицаСтрок Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Применить",Поправка.Применить);
			Отбор.Вставить("УсловияПрименения",Поправка.УсловияПрименения);
			Отбор.Вставить("Обоснование",Поправка.Обоснование);
			Отбор.Вставить("ВариантРасчета",Поправка.ВариантРасчета);
			Отбор.Вставить("Справка",Поправка.Справка);
			Отбор.Вставить("ТипПоправки",Поправка.ТипПоправки);
			МассивПоправок = ТекОбъект.ПоправкиПозиции.НайтиСтроки(Отбор);
			
			НовСтр = Итоговая.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Поправка);
			
			Для каждого Поп Из МассивПоправок Цикл
				НовСтр.КоэффПЗ = ?(НовСтр.КоэффПЗ=0,Поп.КоэффПЗ,НовСтр.КоэффПЗ * ?(Поп.КоэффПЗ=0,1,НовСтр.КоэффПЗ)); 
				НовСтр.КоэффОЗ = ?(НовСтр.КоэффОЗ=0,Поп.КоэффОЗ,НовСтр.КоэффОЗ * ?(Поп.КоэффОЗ=0,1,НовСтр.КоэффОЗ)); 
				НовСтр.КоэффЭМ = ?(НовСтр.КоэффЭМ=0,Поп.КоэффЭМ,НовСтр.КоэффЭМ * ?(Поп.КоэффЭМ=0,1,НовСтр.КоэффЭМ)); 
				НовСтр.КоэффЗМ = ?(НовСтр.КоэффЗМ=0,Поп.КоэффЗМ,НовСтр.КоэффЗМ * ?(Поп.КоэффЗМ=0,1,НовСтр.КоэффЗМ)); 
				НовСтр.КоэффСМ = ?(НовСтр.КоэффСМ=0,Поп.КоэффСМ,НовСтр.КоэффСМ * ?(Поп.КоэффСМ=0,1,НовСтр.КоэффСМ)); 
				НовСтр.КоэффТР = ?(НовСтр.КоэффТР=0,Поп.КоэффТР,НовСтр.КоэффТР * ?(Поп.КоэффТР=0,1,НовСтр.КоэффТР)); 
				НовСтр.КоэффТМ = ?(НовСтр.КоэффТМ=0,Поп.КоэффТМ,НовСтр.КоэффТМ * ?(Поп.КоэффТМ=0,1,НовСтр.КоэффТМ)); 
			КонецЦикла;
			
		КонецЦикла;
		ТекОбъект.ПоправкиПозиции.Загрузить(Итоговая);
	КонецЕсли;
	// перемножаем.
	
	Если Не ЗначениеЗаполнено(СтрокаПозиции.НК1) Тогда
		Документы.СМ_ПозицияЛокальнойСметы.ОбновитьНРиСП(ТекОбъект);
	КонецЕсли;

	ЗатратыТрудаРабочих = 0;
	ЗатратыТрудаМашинистов = 0;
	
	МассивРаб = ТекОбъект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(Новый Структура("ВидРесурса",Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих));
	Для Каждого эл Из МассивРаб Цикл
		ЗатратыТрудаРабочих = ЗатратыТрудаРабочих + эл.НормаРасхода;
	КонецЦикла;
	
	МассивМаш = ТекОбъект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(Новый Структура("ВидРесурса",Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов));
	Для Каждого эл Из МассивМаш Цикл
		ЗатратыТрудаМашинистов = ЗатратыТрудаМашинистов + эл.НормаРасхода;
	КонецЦикла;
	
	ТекОбъект.ЗатратыТрудаРабочих = ЗатратыТрудаРабочих;
	ТекОбъект.ЗатратыТрудаМашинистов = ЗатратыТрудаМашинистов;
	
	ТекОбъект.Записать();
	
КонецПроцедуры

Процедура ПолучитьСоздатьПоправочныйКоэффициентПоВсем(ТекСтрока,ТекущаяПозицияЛС,ТекОбъект)

	// Тип поправки 1.0
	// 1 – Условия производства работ, 
	// 2 – Условия применения, 
	// 3 – Начисления на оборудование, 
	// 4 – Коэффициенты к показателям для расчета накладных и прибыли,
	// 5 – Не определен.		
	
	//  **************************************************
	//  Поправки позиции и начисления позиции.
	//  Все грузим в ТЧ "Поправки позиции".
	НоваяСтрока 			= ТекОбъект.ПоправкиПозиции.Добавить();	
	НоваяСтрока.Применить 	= Ложь;
	НоваяСтрока.Обоснование = ТекСтрока.ОснованиеКоэффициента;
	НоваяСтрока.УсловияПрименения		= ТекСтрока.НаименованиеКоэффициента;
	
	Если ТекСтрока.ТипПоправки = "1" Тогда
		НоваяСтрока.ТипПоправки	= Перечисления.СМ_ТипыПоправок.УсловияПроизводстваРаботМДС;
	Иначе
		НоваяСтрока.ТипПоправки	= Перечисления.СМ_ТипыПоправок.ТехчастиСборников;
	КонецЕсли;
	
	НоваяСтрока.КоэффОЗ	= ТекСтрока.Кзп;
	НоваяСтрока.КоэффЭМ	= ТекСтрока.Кмаш;	
	НоваяСтрока.КоэффСМ	= ТекСтрока.Кстмт;	
	НоваяСтрока.КоэффЗМ	= ТекСтрока.Кзпмашин;	
	НоваяСтрока.КоэффТР	= ТекСтрока.Ктруд;	
	НоваяСтрока.КоэффТМ = ТекСтрока.Ктрудмаш;	
	//НоваяСтрока.КоэффПЗ = ТекСтрока.ПоправочныйКоэффициент;
		
КонецПроцедуры

Процедура АнализДокументПозицияЛС(СтрокаПрограммы,Форма,ТекСтрока,Определитель,ТНС)
	НоваяСтрокаПрефикс = Неопределено;
	ШифрРасценки = ТекСтрока.ШифрПозиции;
	Префикс = СМ_АРПС_ОбменВызовСервера.ПолучитьПрефиксИзСтроки(ШифрРасценки);
	Если ЗначениеЗаполнено(Префикс) Тогда
		НоваяСтрокаПрефикс = Форма.СоответствияПрефиксов.Найти(Префикс,"СтрокаПрефикса");
		Если НоваяСтрокаПрефикс = Неопределено Тогда
			НоваяСтрокаПрефикс	= Форма.СоответствияПрефиксов.Добавить();
			НоваяСтрокаПрефикс.СтрокаПрефикса = Префикс;
		КонецЕсли;
		НоваяСтрокаПрефикс.СметнаяПрограмма = СтрокаПрограммы.Загрузка_СведенияОПрограмме;
	КонецЕсли;

	Если Не НоваяСтрокаПрефикс = Неопределено Тогда
		Если Определитель = Неопределено Тогда	
			Если ТекСтрока.ТипПозиции = "0" Тогда // работа
				Определитель = Справочники.СМ_Определители.НайтиПоКоду(1);
			ИначеЕсли ТекСтрока.ТипПозиции = "2" И ТекСтрока.ВидЗатрат = "О" Тогда // оборудование
				Определитель = Справочники.СМ_Определители.НайтиПоКоду(14);
				ТНС = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы;
			ИначеЕсли ТекСтрока.ТипПозиции = "1"
				ИЛИ ТекСтрока.ТипПозиции = "2"
				ИЛИ ТекСтрока.ТипПозиции = "4"
				ИЛИ ТекСтрока.ТипПозиции = "5" Тогда // материал
				Определитель = Справочники.СМ_Определители.НайтиПоКоду(19);
				ТНС = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы;
			ИначеЕсли ТекСтрока.ТипПозиции = "3"  Тогда // оборудование
				Определитель = Справочники.СМ_Определители.НайтиПоКоду(14);
				ТНС = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы;
			ИначеЕсли ТекСтрока.ТипПозиции = "6"  Тогда // перевозки
				Определитель = Справочники.СМ_Определители.НайтиПоКоду(12);
				ТНС = Перечисления.СМ_ТипыНормативныхСборников.Транспортировка;
			Иначе
				Определитель = Справочники.СМ_Определители.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		
		Если ТНС = Неопределено И ТекСтрока.ТипПозиции = "0" Тогда 
			Если ТекСтрока.ВидЗатрат = "С" Тогда
				ТНС = Перечисления.СМ_ТипыНормативныхСборников.СтроительныеРаботы;	
			ИначеЕсли ТекСтрока.ВидЗатрат = "М" Тогда
				ТНС = Перечисления.СМ_ТипыНормативныхСборников.МонтажныеРаботы;
			ИначеЕсли ТекСтрока.ВидЗатрат = "П" Тогда
				ТНС = Перечисления.СМ_ТипыНормативныхСборников.ПусконаладочныеРаботы;	
			ИначеЕсли ТекСтрока.ВидЗатрат = "ПР" Тогда
			ИначеЕсли ТекСтрока.ВидЗатрат = "О" Тогда
			КонецЕсли;
		КонецЕсли;	
		НоваяСтрокаПрефикс.ТипНормативногоСборника = ТНС;
		НоваяСтрокаПрефикс.Определитель = Определитель;
	КонецЕсли;
КонецПроцедуры	

Функция ПолучитьСоздатьДокументПозицияЛС(ТекущаяПозицияВладелецЛС,ТекущаяСмета,ТекущийРаздел,Форма,ТекСтрока,Определитель,ТНС,СметнаяПрограмма)
	
	СообщенияДляЖурнала	= Новый СписокЗначений();
	
	//  Поиск существующей в базе позиции по реквизиту "Наименование"
	ТекНаименование = ТекСтрока.НаименованиеПозиции;
	Если НЕ ЗначениеЗаполнено(ТекНаименование) Тогда
		ТекНаименование = НСтр("ru='Позиция ЛС'");		
	КонецЕсли;

	Если ТекСтрока.ТипПозиции = "0" Тогда // работа
		
		Если ТекСтрока.ВидЗатрат = "С" Тогда
			ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(1);
			ТНС = Перечисления.СМ_ТипыНормативныхСборников.СтроительныеРаботы;
		ИначеЕсли ТекСтрока.ВидЗатрат = "М" Тогда
			ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(6);
			ТНС = Перечисления.СМ_ТипыНормативныхСборников.МонтажныеРаботы;
		ИначеЕсли ТекСтрока.ВидЗатрат = "П" Тогда
			ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(0);
			ТНС = Перечисления.СМ_ТипыНормативныхСборников.ПусконаладочныеРаботы;
		ИначеЕсли ТекСтрока.ВидЗатрат = "ПР" Тогда
			ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(1);
			ТНС = Перечисления.СМ_ТипыНормативныхСборников.Калькуляция;
		КонецЕсли;

		
	ИначеЕсли (ТекСтрока.ТипПозиции = "2" ИЛИ ТекСтрока.ТипПозиции = "3")
		И ТекСтрока.ВидЗатрат = "О" Тогда// оборудование
		ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(14);
		ТНС = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы;
	ИначеЕсли ТекСтрока.ТипПозиции = "1" 
		ИЛИ ТекСтрока.ТипПозиции = "4"
		ИЛИ ТекСтрока.ТипПозиции = "5" Тогда // материал
		ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(19);
		ТНС = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаМатериалы;
	ИначеЕсли ТекСтрока.ТипПозиции = "6"  Тогда // перевозки
		ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(12);
		ТНС = Перечисления.СМ_ТипыНормативныхСборников.Транспортировка;
	Иначе
		СтруктураСообщения 	= Новый Структура;
		СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
		СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Предупреждение'"));
		СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Определитель не распознан, вид затрат: %1, тип позиции: %2'"), ТекСтрока.ВидЗатрат, ТекСтрока.ТипПозиции));
		СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
		СообщенияДляЖурнала.Добавить(СтруктураСообщения);
	КонецЕсли;


	//  Создание нового документа "ПозицияЛС"
	НовДок					= СМ_СметаВызовСервера.СоздатьНовуюПозицию();
	НовДок.Наименование 	= ТекНаименование;
	НовДок.Дата				= ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(ТекущийРаздел) Тогда
		НовДок.ИДРодителя = ТекущийРаздел;	
	Иначе                    			
		ТекущийРаздел 	 	= ПолучитьСоздатьДокументРаздел(ТекущаяСмета,"",ТекущаяСмета.Наименование);
		НовДок.ИДРодителя 	= ТекущийРаздел;
	КонецЕсли;

	НовДок.ИДСметы 			= ТекущаяСмета;
	НовДок.ШифрРасценки 	= ТекСтрока.ШифрПозиции;
	НовДок.Расчет 			= Истина;
	
	//  Поиск / создание единицы измерения
	ТекЕдИзм = Справочники.СМ_ЕдиницыИзмеренияСмета.НайтиПоНаименованию(ТекСтрока.ЕдиницаИзмерения);
	НовДок.ЕдиницаИзмерения			= ТекЕдИзм;
	Если (Не ЗначениеЗаполнено(НовДок.ЕдиницаИзмерения)) Тогда
		НовДок.ЕдиницаИзмерения = СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСтроке(ТекСтрока.ЕдиницаИзмерения);
	КонецЕсли;
				
	НовДок.Измеритель				= ТекСтрока.ЕдиницаИзмерения;
	
	НовДок.ОбъемРабот				= ПреобразоватьВЧисло(ТекСтрока.ОбъемРабот);
	
	Если ТНС = Неопределено И ТекСтрока.ТипПозиции = "0" Тогда 
		Если ТекСтрока.ВидЗатрат = "С" Тогда
			НовДок.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СтроительныеРаботы;	
		ИначеЕсли ТекСтрока.ВидЗатрат = "М" Тогда
			НовДок.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.МонтажныеРаботы;
		ИначеЕсли ТекСтрока.ВидЗатрат = "П" Тогда
			НовДок.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.ПусконаладочныеРаботы;	
		ИначеЕсли ТекСтрока.ВидЗатрат = "ПР" Тогда
			НовДок.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.Калькуляция;
		ИначеЕсли ТекСтрока.ВидЗатрат = "О" Тогда
		Иначе
			НовДок.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СтроительныеРаботы;	
		КонецЕсли;
	Иначе
		НовДок.ТипНормативныхСборников = ТНС;
	КонецЕсли;	

	Если ТекСтрока.ТипПозиции = "0" Тогда
		НовДок.ПрямЗатраты              = ПреобразоватьВЧисло(ТекСтрока.ПрямыеЗатраты);
		НовДок.СтоимМатериалов          = ПреобразоватьВЧисло(ТекСтрока.СтоимостьМатериалов);
		НовДок.ОснЗарплата              = ПреобразоватьВЧисло(ТекСтрока.ОсновнаяЗП);
		НовДок.ЭксплМашин               = ПреобразоватьВЧисло(ТекСтрока.СтоимостьЭМиМех);
		НовДок.ЗарплМашинистов          = ПреобразоватьВЧисло(ТекСтрока.ЗарплатаМашинистов);
	ИначеЕсли (ТекСтрока.ТипПозиции = "2" ИЛИ ТекСтрока.ТипПозиции = "3")
		И ТекСтрока.ВидЗатрат = "О" Тогда
		НовДок.Оборудование          = ПреобразоватьВЧисло(ТекСтрока.Оборудование);
		НовДок.ТекущаяЦена          = ПреобразоватьВЧисло(ТекСтрока.Оборудование);
	ИначеЕсли ТекСтрока.ТипПозиции = "1" 
		ИЛИ ТекСтрока.ТипПозиции = "2" 
		ИЛИ ТекСтрока.ТипПозиции = "4"
		ИЛИ ТекСтрока.ТипПозиции = "5" Тогда
		НовДок.НормаРасходаРесурса = 1;
		НовДок.КоличествоРесурса = 1;
		НовДок.ПрямЗатраты = ПреобразоватьВЧисло(ТекСтрока.ПрямыеЗатраты);
		НовДок.СтоимМатериалов          = ПреобразоватьВЧисло(ТекСтрока.ПрямыеЗатраты);
		НовДок.ТекущаяЦена          = ПреобразоватьВЧисло(ТекСтрока.ПрямыеЗатраты);
	ИначеЕсли ТекСтрока.ТипПозиции = "6"	 Тогда
		НовДок.ПрямЗатраты          = ПреобразоватьВЧисло(ТекСтрока.ПрямыеЗатраты);
		НовДок.ТекущаяЦена          = ПреобразоватьВЧисло(ТекСтрока.ПрямыеЗатраты);
	КонецЕсли;
	

	НовДок.СпособСоздания			= Перечисления.СМ_ИсточникиДобавленияПозиций.Загружена;
	НовДок.ИсточникСоздания			= СметнаяПрограмма.Наименование + "#KENML";	
	
	Если ТекСтрока.ПризнакПодчиненности Тогда
		Если ЗначениеЗаполнено(ТекущаяПозицияВладелецЛС) Тогда
			НовДок.ИДПозицииВладельца = ТекущаяПозицияВладелецЛС;
			// Ищем ресурсы неучтенные.
			ТекОбъект 						= ТекущаяПозицияВладелецЛС.ПолучитьОбъект();
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("СметныйКодРесурса", ТекСтрока.ШифрПозиции);
			ПараметрыОтбора.Вставить("ЕдиницаИзмеренияРесурса", ТекСтрока.ЕдиницаИзмерения);
			ПараметрыОтбора.Вставить("НаименованиеРесурса", ТекСтрока.НаименованиеПозиции);
			
			НайденныеСтроки = ТекОбъект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаРесурс ИЗ НайденныеСтроки Цикл			
				СтрокаРесурс.ТипМатериала = Перечисления.СМ_ТипыМатериалов.НеУчтенный;
			КонецЦикла;
			Если НайденныеСтроки.Количество()>0 Тогда
				ТекОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	НовДок.Определитель = ?(Определитель = Неопределено,ТекОпределитель,Определитель);
	
	// Если определитель еще не нашли - ищем по косвенным признакам
	Если Не ЗначениеЗаполнено(НовДок.Определитель) Тогда
		Если (НовДок.СтоимМатериалов<>0) И ((НовДок.ОснЗарплата+НовДок.ЭксплМашин+НовДок.СтоимМатериалов) = 0) Тогда
			ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(19);
		ИначеЕсли (НовДок.Оборудование<>0) Тогда
			ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(14);
		Иначе
			ТекОпределитель = Справочники.СМ_Определители.НайтиПоКоду(1);
		КонецЕсли;
	КонецЕсли;
	
	//  Определение сметно-нормативной базы
	Если ЗначениеЗаполнено(Форма.СметноНормативнаяБаза) Тогда
		НовДок.РегиональнаяБаза = Форма.СметноНормативнаяБаза;
	Иначе	
		НайденныйЭлемент 		= Справочники.СМ_СметноНормативныеБазы.НайтиПоНаименованию(Форма.НаименованиеСНБазы);
		НовДок.РегиональнаяБаза = НайденныйЭлемент;
	КонецЕсли;
	
	//  Опеределение "ТипПозиции" = "Тип нормативного сборника"
	
	Документы.СМ_ПозицияЛокальнойСметы.ЗаполнитьНачисленияПозицииПоУмолчанию(НовДок);
	
	//Документы.СМ_ПозицияЛокальнойСметы.ОбновитьНРиСП(НовДок);
	Если ЗначениеЗаполнено(ТекСтрока.НК1) Тогда
		НовДок.НакладныеРасходыБазисные = ТекСтрока.НК1;
		НовДок.НакладныеРасходыТекущие = ТекСтрока.НК1;
	КонецЕсли;
	
	НовДок.Записать();
	ТекПозиция = НовДок.Ссылка;
	
	Если НЕ ТекСтрока.ПризнакПодчиненности Тогда
		ТекущаяПозицияВладелецЛС = ТекПозиция;
	КонецЕсли;	

	//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый документ позиция ЛС: %1, %2, %3'"), НовДок.Номер, НовДок.Дата, НовДок.Наименование));
	
	СтруктураСообщения 	= Новый Структура;
	СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
	СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Информация'"));
	СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый документ позиция ЛС: %1, %2, %3'"), НовДок.Номер, НовДок.Дата, НовДок.Наименование));
	СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
	СообщенияДляЖурнала.Добавить(СтруктураСообщения);
	
	// Запись сообщений в журнал регистрации
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
	
	Возврат ТекПозиция;
	
КонецФункции	

Функция ПолучитьСоздатьКонтрагента(Форма,НаименованиеКонтрагента,ТипКонтрагента);
	
	НаименованиеКонтрагента = СокрЛП(НаименованиеКонтрагента);
	Если НЕ ЗначениеЗаполнено(НаименованиеКонтрагента) Тогда
		Если ТипКонтрагента = 1 Тогда
			НаименованиеКонтрагента	= НСтр("ru='Основной заказчик'");			
		ИначеЕсли ТипКонтрагента = 2 Тогда
			НаименованиеКонтрагента	= НСтр("ru='Основной подрядчик'");
		КонецЕсли;
	КонецЕсли;
	
	ТекКонтрагент = Справочники.Контрагенты.НайтиПоНаименованию(НаименованиеКонтрагента,Истина);
	Если ТекКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		Если Форма.СоздаватьНовыеЭлементы Тогда
			НовыйОбъект 				= Справочники.Контрагенты.СоздатьЭлемент();
			НовыйОбъект.Наименование 	= НаименованиеКонтрагента;
			НовыйОбъект.Записать();
			
			// Запись сообщений в журнал регистрации
			СтруктураСообщения 	= Новый Структура;
			СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
			СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Информация'"));
			СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый контрагент: %1, %2'"), НовыйОбъект.Код, НовыйОбъект.Наименование));
			СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
			
			СообщенияДляЖурнала	= Новый СписокЗначений();
			СообщенияДляЖурнала.Добавить(СтруктураСообщения);
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
			
			Возврат НовыйОбъект.Ссылка;
		Иначе
			
			// Запись сообщений в журнал регистрации
			СтруктураСообщения 	= Новый Структура;
			СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
			СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Предупреждение'"));
			СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден контрагент: %1'"), НаименованиеКонтрагента));
			СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
			
			СообщенияДляЖурнала	= Новый СписокЗначений();
			СообщенияДляЖурнала.Добавить(СтруктураСообщения);
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
		КонецЕсли;
	Иначе
		Возврат ТекКонтрагент;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСоздатьДоговор(Форма,Контрагент,НаименованиеДоговора,НомерДоговора,ДатаДоговора);
	
	НаименованиеДоговора = СокрЛП(НаименованиеДоговора);
	Если НЕ ЗначениеЗаполнено(НаименованиеДоговора) Тогда
		НаименованиеДоговора = НСтр("ru='Основной договор'");			
	КонецЕсли;
	
	ТекДоговор = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию(НаименованиеДоговора,Истина,Контрагент);
	Если ТекДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		Если Форма.СоздаватьНовыеЭлементы Тогда
			НовыйОбъект 				= Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			НовыйОбъект.Наименование 	= НаименованиеДоговора;
			НовыйОбъект.Контрагент		= Контрагент;
			НовыйОбъект.Записать();
			
			// Запись сообщений в журнал регистрации
			СтруктураСообщения 	= Новый Структура;
			СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
			СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Информация'"));
			СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый договор: %1, %2'"), НовыйОбъект.Код, НовыйОбъект.Наименование));
			СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
			
			СообщенияДляЖурнала	= Новый СписокЗначений();
			СообщенияДляЖурнала.Добавить(СтруктураСообщения);
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
			
			Возврат НовыйОбъект.Ссылка;
		Иначе
			
			// Запись сообщений в журнал регистрации
			СтруктураСообщения 	= Новый Структура;
			СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
			СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Предупреждение'"));
			СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден договор: %1, %2'"), НомерДоговора, НаименованиеДоговора));
			СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
			
			СообщенияДляЖурнала	= Новый СписокЗначений();
			СообщенияДляЖурнала.Добавить(СтруктураСообщения);
			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
		КонецЕсли;
	Иначе
		Возврат ТекДоговор;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСоздатьДокументЛС(Организация,Район,Форма,ТекСтрока,СтруктураРеквизитовСмета)

	ТекЗаказчик 	= ПолучитьСоздатьКонтрагента(Форма,ТекСтрока.Заказчик,1);
	ТекПодрядчик 	= ПолучитьСоздатьКонтрагента(Форма,ТекСтрока.Подрядчик,2);
	
	Если ЗначениеЗаполнено(ТекЗаказчик) И ТекЗаказчик <> Справочники.Контрагенты.ПустаяСсылка() Тогда
		ТекДоговор = ПолучитьСоздатьДоговор(Форма,ТекЗаказчик, ТекСтрока.НаименованиеДоговора, ТекСтрока.НомерДоговора, ТекСтрока.ДатаДоговора);	
	КонецЕсли;
	
	НовДок 					= Документы.СМ_ЛокальнаяСмета.СоздатьДокумент();
	НовДок.Автор 			= ПользователиКлиентСервер.АвторизованныйПользователь();
	НовДок.Наименование 	= ТекСтрока.НаименованиеДокумента;
	НовДок.ДатаТекущихЦен	= ТекСтрока.ДатаЦен;
	НовДок.Основание		= ТекСтрока.ПроектнаяДокументация;
	НовДок.НомерСметы		= ТекСтрока.НомерДокумента;
	НовДок.Договор			= ТекДоговор;
	НовДок.Заказчик 		= ТекЗаказчик;
	НовДок.Подрядчик    	= ТекПодрядчик;
	НовДок.Дата				= ТекущаяДатаСеанса();
	НовДок.Организация		= Организация;
	НовДок.Район			= Район;
	
	Если Форма.НаименованиеСНБазы = "СН РК 2002-2004" Тогда
		НовДок.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный;
		НовДок.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета;
		НовДок.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_КЗ_РСНБ;
		НовДок.СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости;
	Иначе
		НовДок.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный;
		НовДок.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_КЗ_РСНБ
	КонецЕсли;

	СМ_АРПС_ОбменВызовСервера.ЗаполнитьИзНастроекПользователяПоУмолчанию(НовДок);
	
	Если ЗначениеЗаполнено(Форма.ТекСтройка) Тогда
		НовДок.Стройка = Форма.ТекСтройка;
	КонецЕсли;
	
	Если СтруктураРеквизитовСмета.Свойство("ПоказательНК2") Тогда
		НовДок.НР2_ВС = СтруктураРеквизитовСмета.ПоказательНК2;
	КонецЕсли;
	
	Если СтруктураРеквизитовСмета.Свойство("ПоказательСП") Тогда
		НовДок.СП_ВС = СтруктураРеквизитовСмета.ПоказательСП;
	КонецЕсли;
	
	Если СтруктураРеквизитовСмета.Свойство("УровеньЦен") Тогда
		ДатаЦен = СтруктураРеквизитовСмета.УровеньЦен;
		Попытка
			ДатаТекущихЦен = Дата(Лев(ДатаЦен,4),Прав(ДатаЦен,1),1);
		Исключение
			ДатаТекущихЦен = Дата(1,1,1);
		КонецПопытки;
		НовДок.ДатаТекущихЦен = ДатаТекущихЦен;
	КонецЕсли;


	НовДок.ПечататьСетку = Истина;
	НовДок.ПечататьЗаголовкиРазделов = Истина;
	НовДок.ПечататьИтогиПоРазделам = Перечисления.СМ_ПечатьИтоговРаздела.ПечататьПервые;
	НовДок.РасшифроватьСостав = Истина;
	НовДок.РегионДляВыбораЦен = Форма.СметноНормативнаяБаза;
	
	НовДок.АвтозагрузкаЦен = Истина;
	НовДок.РегионДляВыбораЦен = Справочники.СМ_СметноНормативныеБазы.НайтиПоКоду("RK");

	НовДок.Записать();
	
	ТекСмета = НовДок.Ссылка;
	
	// Запись сообщений в журнал регистрации
	СтруктураСообщения 	= Новый Структура;
	СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
	СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Информация'"));
	СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый документ ЛС: %1, %2, %3'"), НовДок.Номер, НовДок.Дата, НовДок.Наименование));
	СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
	
	СообщенияДляЖурнала	= Новый СписокЗначений();
	СообщенияДляЖурнала.Добавить(СтруктураСообщения);
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
		
	Возврат ТекСмета.Ссылка;
	
КонецФункции

Функция ПолучитьСоздатьДокументРаздел(ТекущаяСмета,НомерРаздела,ТекНаименованиеРаздела,ВерхнийРаздел = Неопределено)

	//  Поиск существующего документа раздел в базе по типовому номеру документа.
	Если ЗначениеЗаполнено(НомерРаздела) Тогда
		ДлинаСтроки	 	= СтрДлина(СокрЛП(НомерРаздела));
		ДлинаНомера  	= 9;
		ДлинаОстатка 	= ДлинаНомера-ДлинаСтроки;
		ТекНомерРаздела = "";
		Для Сч = 1 По ДлинаОстатка Цикл
			ТекНомерРаздела = ТекНомерРаздела + "0";	
		КонецЦикла;
		ТекНомерРаздела = ТекНомерРаздела + СокрЛП(НомерРаздела);
	КонецЕсли;
	
	
	Если НЕ ЗначениеЗаполнено(ТекНаименованиеРаздела) Тогда
		НаименованиеРаздела = ТекущаяСмета.Наименование;
	Иначе
		НаименованиеРаздела	= ТекНаименованиеРаздела;
	КонецЕсли;
	
	//  Создание нового документа "Раздел ЛС". 
	НовДок							= СМ_СметаВызовСервера.СоздатьНовыйРаздел();
	НовДок.НаименованиеДляПечати 	= НаименованиеРаздела;
	НовДок.Дата						= ТекущаяДатаСеанса();
	НовДок.ИДРодителя   			= ?(ВерхнийРаздел = Неопределено,ТекущаяСмета.Ссылка,ВерхнийРаздел);
	НовДок.ИДСметы      			= ТекущаяСмета.Ссылка;
	НовДок.Расчет					= Истина;
	
	НовДок.Записать();
	ТекРаздел = НовДок.Ссылка;

	// Запись сообщений в журнал регистрации
	СтруктураСообщения 	= Новый Структура;
	СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
	СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Информация'"));
	СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Создан новый документ раздел: %1, %2, %3'"), НовДок.Номер, НовДок.Дата, НаименованиеРаздела));
	СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
	
	СообщенияДляЖурнала	= Новый СписокЗначений();
	СообщенияДляЖурнала.Добавить(СтруктураСообщения);
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
	
	Возврат ТекРаздел;
	
КонецФункции	

Функция ПреобразоватьВЧисло(ТекСтрока)
	
	Если ЗначениеЗаполнено(ТекСтрока) Тогда
		Попытка
			ТекЧисло = Число(ТекСтрока);
		Исключение
			ТекЧисло = 0;
		КонецПопытки;
	Иначе
		ТекЧисло = 0;
	КонецЕсли;
	
	Возврат ТекЧисло;
	
КонецФункции

// Поиск единицы измерения.
//
Функция НайтиЕдиницуИзмеренияСметномуКоду(Код)
	
	ЕдиницаИзмерения = СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСтроке(Код);
	Если ЕдиницаИзмерения.Пустая() Тогда
		Единица = Справочники.СМ_ЕдиницыИзмеренияСмета.СоздатьЭлемент();
		Единица.Наименование = Код;
		Единица.ОбменДанными.Загрузка = Истина;;
		Единица.Записать();
		ЕдиницаИзмерения = Единица.Ссылка;
	КонецЕсли;
	Возврат(ЕдиницаИзмерения);  
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Служебное для регистрации в подключаемых обработках.
//
// Возвращаемое значение:
//     Структура - содержит сведения об обработке.
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	РегистрационныеДанные.Вставить("Наименование", "Обмен в формате KENML");
	РегистрационныеДанные.Вставить("БезопасныйРежим", Ложь);
	РегистрационныеДанные.Вставить("Версия", "1.0.1");
    РегистрационныеДанные.Вставить("Вид", "ДополнительнаяОбработка");
	РегистрационныеДанные.Вставить("Информация", "");
	
	///////////// команды /////////////////////////
	тзКоманд = Новый ТаблицаЗначений;
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	
	строкаКоманды = тзКоманд.Добавить();
	строкаКоманды.Идентификатор = "1";
	строкаКоманды.Представление = "Обмен в формате KENML";
	строкаКоманды.Использование = "ОткрытиеФормы";
	строкаКоманды.ПоказыватьОповещение = Истина;
		
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область НаУдаление

// ****************************************************************************
//Процедура ЗаполнитьНормативНРиСП(ТекОбъект,НаименованиеНорматива,ТекКоэффициент)
//	
//	Если ЗначениеЗаполнено(ТекКоэффициент) Тогда
//		ТекКоэффициент = Число(ТекКоэффициент);
//	Иначе
//		ТекКоэффициент = 0;			
//	КонецЕсли;
//	
//	ТекОбъект[НаименованиеНорматива] = ТекКоэффициент * 100;	
//	
//КонецПроцедуры


// ****************************************************************************
//Функция ДобавитьСтрокуПоправочногоКоэффициента(ТекОбъект,ТекСтрока)
//	
//	НоваяСтрока 			= ТекОбъект.ПоправкиПозиции.Добавить();	
//	НоваяСтрока.Применить 	= Истина;
//	НоваяСтрока.Обоснование = ТекСтрока.ОснованиеКоэффициента;
//	НоваяСтрока.Справка		= ТекСтрока.НаименованиеКоэффициента;
//	НоваяСтрока.ТипПоправки = Перечисления.СМ_ТипыПоправок.ТехчастиСборников;
//	
//	Возврат НоваяСтрока;
//	
//КонецФункции


// ****************************************************************************
//Процедура ПолучитьСоздатьЛимЗатрата(СтрокаПрограммы,ТекущаяСмета,Форма,ТекСтрока,ЛимЗатрата)
//	
//	Если ЛимЗатрата = Неопределено Тогда
//		ТекЛимЗатрата = Справочники.СМ_ЛимитированныеЗатраты.НайтиПоНаименованию(ТекСтрока.Наименование);
//	Иначе
//		ТекЛимЗатрата = ЛимЗатрата;
//	КонецЕсли;
//	
//	Если Форма.АнализФайла Тогда
//		Если ТекЛимЗатрата = Справочники.СМ_ЛимитированныеЗатраты.ПустаяСсылка() Тогда
//			НоваяСтрока 				= Форма.СоответствияЛЗ.Добавить();
//			НоваяСтрока.НаименованиеЛЗ 	= ТекСтрока.Наименование;
//			НоваяСтрока.СметнаяПрограмма = СтрокаПрограммы.Загрузка_СведенияОПрограмме;
//			
//			// Запись сообщений в журнал регистрации
//			СтруктураСообщения 	= Новый Структура;
//			СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
//			СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
//			СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Лимитированная затрата: %1 не найдена в справочнике.'"), ТекСтрока.Наименование));
//			СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
//			
//			СообщенияДляЖурнала	= Новый СписокЗначений();
//			СообщенияДляЖурнала.Добавить(СтруктураСообщения);
//			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
//		КонецЕсли;
//	Иначе	
//		Если ТекЛимЗатрата = Справочники.СМ_ЛимитированныеЗатраты.ПустаяСсылка() Тогда
//			СтруктураОтбора = Новый Структура;
//			СтруктураОтбора.Вставить("НаименованиеЛЗ",ТекСтрока.Наименование);
//			МассивСтрок = Форма.СоответствияЛЗ.НайтиСтроки(СтруктураОтбора);
//			Если МассивСтрок.Количество() > 0 Тогда
//				ТекЛимЗатрата = МассивСтрок[0].СсылкаВБазе;			
//			КонецЕсли;
//		КонецЕсли;
//		
//		Если ТекЛимЗатрата = Справочники.СМ_ЛимитированныеЗатраты.ПустаяСсылка() Тогда
//			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Лимитированная затрата: %1, не загружена - не задано соответствие в таблице'"), ТекСтрока.Наименование));		
//			
//			// Запись сообщений в журнал регистрации
//			СтруктураСообщения 	= Новый Структура;
//			СтруктураСообщения.Вставить("ИмяСобытия",НСтр("ru='Обмен данными в формате KENML'"));
//			СтруктураСообщения.Вставить("ПредставлениеУровня",НСтр("ru='Ошибка'"));
//			СтруктураСообщения.Вставить("Комментарий",СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Лимитированная затрата: %1, не загружена - не задано соответствие в таблице'"), ТекСтрока.Наименование));
//			СтруктураСообщения.Вставить("ДатаСобытия",ТекущаяДатаСеанса());
//			
//			СообщенияДляЖурнала	= Новый СписокЗначений();
//			СообщенияДляЖурнала.Добавить(СтруктураСообщения);
//			ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СообщенияДляЖурнала);
//
//			Возврат;
//		КонецЕсли;
//		
//		ТекОбъект 										= ТекущаяСмета.ПолучитьОбъект();
//		НоваяСтрока 									= ТекОбъект.ЛимитированныеЗатраты.Добавить();
//		НоваяСтрока.ЛимитированнаяЗатрата               = ТекЛимЗатрата;
//		НоваяСтрока.КоэффициентСметнойЗарплаты 	    	= ТекЛимЗатрата.КоэффициентСметнойЗарплаты;
//		НоваяСтрока.КоэффициентТрудоемкости     		= ТекЛимЗатрата.КоэффициентТрудоемкости;
//		НоваяСтрока.Примечание                          = ТекЛимЗатрата.Обоснование;
//		НоваяСтрока.Расчет 								= Истина;
//		
//		Попытка
//			ТекКоэффициент = Число(?(ТекСтрока.Коэффициент="",0,ТекСтрока.Коэффициент));
//		Исключение
//			ТекКоэффициент = 0;
//		КонецПопытки;
//		
//		Если ТекЛимЗатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс
//			ИЛИ ТекЛимЗатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Коэффициент Тогда
//			НоваяСтрока.ЗначениеЛимЗатраты = ТекКоэффициент;
//		ИначеЕсли ТекЛимЗатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент Тогда	
//			Если ТекКоэффициент < 1 Тогда
//				НоваяСтрока.ЗначениеЛимЗатраты = ТекКоэффициент * 100;
//			Иначе
//			 	НоваяСтрока.ЗначениеЛимЗатраты = (ТекКоэффициент - 1) * 100;
//			КонецЕсли;
//	    ИначеЕсли ТекЛимЗатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Сумма Тогда	
//			НоваяСтрока.ЗначениеЛимЗатраты = ТекСтрока.СуммаЗатрат;
//		КонецЕсли;
//		
//		НоваяСтрока.БазисноеЗначениеЛимЗатраты = НоваяСтрока.ЗначениеЛимЗатраты;
//
//		ТекОбъект.Записать();
//	КонецЕсли;
//КонецПроцедуры


// *********************************************************************************
//Процедура ЗаполнитьКоэффициентыВыгрузки(ТекстВыгрузки,Документ, СтрокаРасценки,ДокСсылка, ЭтоНеучтенныйМатериал = Ложь, ЭтоПрочиеЗатраты = Ложь)
//	
//	//  0 - Разделы локальной сметы.
//	//  1 - Позиции локальной сметы.
//	//  2 - Ресурсы.
//	//  3 - Лимитированные затраты.
//	//  4 - Поправки позиции.
//	//  5 - НачисленияПозиции.
//	//  6 - КоэффициентыПересчета.
//	
//	//  Должны быть:
//	//  + Ресурсы - выгрузка по строке 30.
//	//  + Лимитированные затраты - выгрузка по строке 50.
//	
//	//  - ПоправкиПозиции.
//	//  - НачисленияПозиции.
//	//  - КоэффициентыПересчета.
//	
//	//  *************************************************************
//	//  Заполнение поправок позиции ЛС
//
//	Поправки = ДокСсылка[4].Выгрузить();
//	
//	СтруктураОтбора = Новый Структура;
//	СтруктураОтбора.Вставить("Позиция",СтрокаРасценки.Позиция);
//	СтруктураОтбора.Вставить("Применить",Истина);
//	
//	//  Заполнение поправок позиции ЛС
//	мПоправки = Поправки.НайтиСтроки(СтруктураОтбора);
//	Для Каждого Поправка Из мПоправки Цикл
//		
//		Если Поправка.КоэффПЗ Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,10,0,Поправка.КоэффПЗ,Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//			
//		Если Поправка.КоэффОЗ Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,0,0,Поправка.КоэффОЗ,Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//			
//		Если Поправка.КоэффЭМ  Тогда                                                     
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,1,0,Поправка.КоэффЭМ,Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//		
//		Если Поправка.КоэффЗМ  Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,3,0,Поправка.КоэффЗМ,Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//		
//		Если Поправка.КоэффСМ  Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,2,0,Поправка.КоэффСМ,Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//		
//		Если Поправка.КоэффТМ Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,5,0,Поправка.КоэффТМ,Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//		
//		Если Поправка.КоэффТР  Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,4,0,Поправка.КоэффТР,Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//		
//		Если Поправка.ДобавПЗ Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,10,?(Поправка.ДобавПЗ > 0, 2, 3),Поправка.ДобавПЗ ,Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//		
//		Если Поправка.ДобавОЗ Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,0,?(Поправка.ДобавОЗ > 0, 2, 3),Поправка.ДобавОЗ, Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//			
//		Если Поправка.ДобавЭМ Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,1,?(Поправка.ДобавЭМ > 0, 2, 3),Поправка.ДобавЭМ, Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//			
//		Если Поправка.ДобавЗМ  Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,3,?(Поправка.ДобавЗМ > 0, 2, 3),Поправка.ДобавЗМ, Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//			
//		Если Поправка.ДобавСМ Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,2,?(Поправка.ДобавСМ > 0, 2, 3),Поправка.ДобавСМ, Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;	
//		
//		Если Поправка.ДобавТР  Тогда
//			Идентификатор = СформироватьИдентификаторПоправки(25,8,4,?(Поправка.ДобавТР > 0, 2, 3),Поправка.ДобавТР, Поправка.УсловияПрименения,Поправка.Основание);
//			ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		КонецЕсли;						
//			
//	КонецЦикла;
//
//	//  *************************************************************
//	//  Заполнение начислений позиции ЛС (Числовые параметры позиции)
//	ВидРабот = "";
//	ТабЧисловыеПараметры = ДокСсылка[5].Выгрузить();
//	
//	СтруктураОтбора = Новый Структура;
//	СтруктураОтбора.Вставить("Позиция",СтрокаРасценки.Позиция);
//	
//	//  Заполнение поправок позиции ЛС
//	МассивЧисловыхПарамеров = ТабЧисловыеПараметры.НайтиСтроки(СтруктураОтбора);
//	Для Каждого ТекСтрока Из МассивЧисловыхПарамеров Цикл
//		
//		//  Выгружаем только числовые параметры, у которых значение в ТЧ "Начисления" отличается от стандартного значения.
//		Если ТекСтрока.Значение = ТекСтрока.ЧисловойПараметр.СтандартноеЗначение Тогда
//			Продолжить;
//		КонецЕсли;
//		
//		// 0 - заработная плата основных рабочих. 
//		// 1 - эксплуатация машин и механизмов. 
//		// 2 - стоимость материалов.
//		// 3 - заработная плата механизаторов.
//		// 4 - трудозатраты основных рабочих.
//		// 5 - трудозатраты механизаторов.
//		// 10 - прямые затраты.
//		
//		Для Каждого СтрокаЧП Из ТекСтрока.ЧисловойПараметр.Источник Цикл
//			
//			ТекЗначение = ТекСтрока.Значение;
//			Если ТекСтрока.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент Тогда
//				ТекЗначение = (100 + ТекСтрока.Значение)/100;
//			КонецЕсли;
//			
//			Если СтрокаЧП.ПрямЗатраты Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25,8,10,0,ТекЗначение,ТекСтрока.ЧисловойПараметр.Наименование,"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//			
//			Если СтрокаЧП.ОснЗарплата Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25,8,0,0,ТекЗначение,ТекСтрока.ЧисловойПараметр.Наименование,"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//			
//			Если СтрокаЧП.ЭксплМашин Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25,8,1,0,ТекЗначение,ТекСтрока.ЧисловойПараметр.Наименование,"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//	
//			Если СтрокаЧП.ЗарплМашинистов Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25,8,3,0,ТекЗначение,ТекСтрока.ЧисловойПараметр.Наименование,"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//	
//			Если СтрокаЧП.СтоимМатериалов Тогда	
//				Идентификатор = СформироватьИдентификаторПоправки(25,8,2,0,ТекЗначение,ТекСтрока.ЧисловойПараметр.Наименование,"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//
//			Если СтрокаЧП.Оборудование Тогда	
//				Идентификатор = СформироватьИдентификаторПоправки(25,8,10,0,ТекЗначение,ТекСтрока.ЧисловойПараметр.Наименование,"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//
//			Если СтрокаЧП.ЗатратыТрудаРабочих Тогда	
//				Идентификатор = СформироватьИдентификаторПоправки(25,8,4,0,ТекЗначение,ТекСтрока.ЧисловойПараметр.Наименование,"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//
//			Если СтрокаЧП.ЗатратыТрудаМашинистов Тогда		
//				Идентификатор = СформироватьИдентификаторПоправки(25,8,5,0,ТекЗначение,ТекСтрока.ЧисловойПараметр.Наименование,"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;	
//			
//		КонецЦикла;
//
//	КонецЦикла;
//		
//	//  *************************************************************
//	//  Заполнение коэффициентов пересчета по позиции ЛС
//	Если Документ.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
//		
//		ТабКоэффициенты = ДокСсылка[6].Выгрузить();
//		
//		СтруктураОтбора = Новый Структура;
//		СтруктураОтбора.Вставить("Позиция",СтрокаРасценки.Позиция);
//		МассивСтрокКП = ТабКоэффициенты.НайтиСтроки(СтруктураОтбора);
//		
//		Для Каждого КоэфПересчета Из МассивСтрокКП Цикл
//			
//			Если КоэфПересчета.КоэффОснЗарплаты  Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25, 0, 0, 0, КоэфПересчета.КоэффОснЗарплаты, НСтр("ru='Коэффициент пересчета к основной зарплате'"),"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;						
//			
//			Если КоэфПересчета.КоэффСтоимЭксплМашин  Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25, 0, 1, 0, КоэфПересчета.КоэффСтоимЭксплМашин, НСтр("ru='Коэффициент пересчета к стоимости эклсплуатации машин'"),"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;						
//			
//			Если КоэфПересчета.КоэффСтоимЗарплатеМашин  Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25, 0, 3, 0, КоэфПересчета.КоэффСтоимЗарплатеМашин, НСтр("ru='Коэффициент пересчета к зарплате машинистов'"),"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;						
//			
//			Если КоэфПересчета.КоэффСтоимМатериалов Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25, 0, 2, 0, КоэфПересчета.КоэффСтоимМатериалов, НСтр("ru='Коэффициент пересчета к стоимости материалов'"),"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;	
//			
//			Если КоэфПересчета.КоэффОборуд Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25, 10, 10, 0, КоэфПересчета.КоэффСтоимМатериалов, НСтр("ru='Коэффициент пересчета к стоимости оборудования'"),"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//			
//			Если КоэфПересчета.КоэффПолнСтоимРабот Тогда
//				Идентификатор = СформироватьИдентификаторПоправки(25, 10, 10, 0, КоэфПересчета.КоэффСтоимМатериалов, НСтр("ru='Коэффициент пересчета к полной стоимости работ'"),"");
//				ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//	КонецЕсли;
//	
//	//  *************************************************************
//	//  Выгрузка коэффициентов из реквизитов позиции ЛС
//	
//	ТекПозиция = СтрокаРасценки.Позиция;
//	
//	// КоэффициентКНРАЭСБазисный.
//	// КоэффициентКНРНаРемонтБазисный.
//	// КоэффициентКНРУСНБазисный.
//	// ПоправочныйКоэффициентКНРБазисный.
//	// тип поправки -10, к чему относится - 20, действие - 0 (умножение)
//
//	Если ТекПозиция.КоэффициентКНРАЭСБазисный > 0 И ТекПозиция.КоэффициентКНРАЭСБазисный <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 20, 0, ТекПозиция.КоэффициентКНРАЭСБазисный, НСтр("ru='Коэффициент пересчета к  нормативу накладных расходов АЭС (базисный)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКНРНаРемонтБазисный > 0 И ТекПозиция.КоэффициентКНРНаРемонтБазисный <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 20, 0, ТекПозиция.КоэффициентКНРНаРемонтБазисный, НСтр("ru='Коэффициент пересчета к  нормативу накладных расходов на ремонт (базисный)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;		
//	
//	Если ТекПозиция.КоэффициентКНРУСНБазисный > 0 И ТекПозиция.КоэффициентКНРУСНБазисный <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 20, 0, ТекПозиция.КоэффициентКНРУСНБазисный, НСтр("ru='Коэффициент пересчета к нормативу накладных расходов УСН (базисный)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;		
//	
//	Если ТекПозиция.ПоправочныйКоэффициентКНРБазисный > 0 И ТекПозиция.ПоправочныйКоэффициентКНРБазисный <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 20, 0, ТекПозиция.ПоправочныйКоэффициентКНРБазисный, НСтр("ru='Поправочный коэффициент к  нормативу накладных расходов (базисный)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	// ПоправочныйКоэффициентКНРТекущий.	
//	// КоэффициентКНРАЭСТекущий.
//	// КоэффициентКНРНаРемонтТекущий.
//	// КоэффициентКНРУСНТекущий.
//	// тип поправки -10, к чему -21, действие - 0.
//	
//	Если ТекПозиция.ПоправочныйКоэффициентКНРТекущий > 0 И ТекПозиция.ПоправочныйКоэффициентКНРТекущий <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 21, 0, ТекПозиция.ПоправочныйКоэффициентКНРТекущий, НСтр("ru='Поправочный коэффициент к  нормативу накладных расходов (текущий)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКНРАЭСТекущий > 0 И ТекПозиция.КоэффициентКНРАЭСТекущий <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 21, 0, ТекПозиция.КоэффициентКНРАЭСТекущий, НСтр("ru='Коэффициент пересчета к  нормативу накладных расходов АЭС (текущий)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКНРНаРемонтТекущий > 0 И ТекПозиция.КоэффициентКНРНаРемонтТекущий <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 21, 0, ТекПозиция.КоэффициентКНРНаРемонтТекущий, НСтр("ru='Коэффициент пересчета к  нормативу накладных расходов на ремонт (текущий)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКНРУСНТекущий > 0 И ТекПозиция.КоэффициентКНРУСНТекущий <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 21, 0, ТекПозиция.КоэффициентКНРУСНТекущий, НСтр("ru='Коэффициент пересчета к  нормативу накладных расходов УСН (текущий)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;		
//	
//	
//	// ПоправочныйКоэффициентКСПБазисный.
//	// КоэффициентКСПАЭСБазисный.
//	// КоэффициентКСПНаРемонтБазисный.
//	// КоэффициентКСПУСНБазисный.
//	// тип-10, к чему - 22, действие - 0.
//	
//	Если ТекПозиция.ПоправочныйКоэффициентКСПБазисный > 0 И ТекПозиция.ПоправочныйКоэффициентКСПБазисный <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 22, 0, ТекПозиция.ПоправочныйКоэффициентКСПБазисный, НСтр("ru='Поправочный коэффициент к сметной прибыли (базисный)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКСПАЭСБазисный > 0 И ТекПозиция.КоэффициентКСПАЭСБазисный <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 22, 0, ТекПозиция.КоэффициентКСПАЭСБазисный, НСтр("ru='Коэффициент пересчета к сметной прибыли АЭС (базисный)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКСПНаРемонтБазисный > 0 И ТекПозиция.КоэффициентКСПНаРемонтБазисный <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 22, 0, ТекПозиция.КоэффициентКСПНаРемонтБазисный, НСтр("ru='Коэффициент пересчета к сметной прибыли на ремонт (базисный)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКСПУСНБазисный > 0 И ТекПозиция.КоэффициентКСПУСНБазисный <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 22, 0, ТекПозиция.КоэффициентКСПУСНБазисный, НСтр("ru='Коэффициент пересчета к сметной прибыли УСН (базисный)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;		
//	
//	// ПоправочныйКоэффициентКСПТекущий.
//	// КоэффициентКСПАЭСТекущий.
//	// КоэффициентКСПНаРемонтТекущий.
//	// КоэффициентКСПУСНТекущий.
//	// тип -10, к чему -23, действие - 0.
//
//	Если ТекПозиция.ПоправочныйКоэффициентКСПТекущий > 0 И ТекПозиция.ПоправочныйКоэффициентКСПТекущий <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 23, 0, ТекПозиция.ПоправочныйКоэффициентКСПТекущий, НСтр("ru='Поправочный коэффициент пересчета к сметной прибыли (текущий)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКСПАЭСТекущий > 0 И ТекПозиция.КоэффициентКСПАЭСТекущий <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 23, 0, ТекПозиция.КоэффициентКСПАЭСТекущий, НСтр("ru='Коэффициент пересчета к сметной АЭС оборудовани (текущий)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКСПНаРемонтТекущий > 0 И ТекПозиция.КоэффициентКСПНаРемонтТекущий <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 23, 0, ТекПозиция.КоэффициентКСПНаРемонтТекущий, НСтр("ru='Коэффициент пересчета к сметной прибыли на ремонт (текущий)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.КоэффициентКСПУСНТекущий > 0 И ТекПозиция.КоэффициентКСПУСНТекущий <> 1 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 10, 23, 0, ТекПозиция.КоэффициентКСПУСНТекущий, НСтр("ru='Коэффициент пересчета к сметной прибыли УСН (текущий)'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;		
//	
//	
//	//  *************************************************************
//	//  Выгрузка нормативов НР И СП.
//	
//	//  4 - норматив накладных расходов в базовых ценах (реквизит позиции «НакладныеРасходыБазисные»). 
//	//  5 - норматив сметной прибыли в базовых ценах (реквизит позиции «СметнаяПрибыльБазисные»). 
//	//  6 - норматив накладных расходов в текущих ценах  (реквизит позиции «НакладныеРасходыТекущие»). 
//	//  7 - норматив сметной прибыли в текущих ценах (реквизит позиции «СметнаяПрибыльТекущие»).
//	
//	//  Для каждого типа поправки - к чему относится поправка.
//	//  0 - основная зарплата.
//	//  3 - зарплата механизаторов.
//	//  Для НР 2 записи - к 0 и к 3, для СП - тоже 2 записи - к 0 и к 3
//	//  т.к. НР и СП считаются от ФОТ (зарплата рабочих+зарплата машинистов).
//	
//	Если ТекПозиция.НакладныеРасходыБазисные > 0 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 4, 0, 0,ТекПозиция.НакладныеРасходыБазисные/100, НСтр("ru='Норматив накладных расходов в базовых ценах'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		Идентификатор = СформироватьИдентификаторПоправки(25, 4, 3, 0,ТекПозиция.НакладныеРасходыБазисные/100, НСтр("ru='Норматив накладных расходов в базовых ценах'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.СметнаяПрибыльБазисные > 0 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 5, 0, 0, ТекПозиция.СметнаяПрибыльБазисные/100, НСтр("ru='Норматив сметной прибыли в базовых ценах'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		Идентификатор = СформироватьИдентификаторПоправки(25, 5, 3, 0, ТекПозиция.СметнаяПрибыльБазисные/100, НСтр("ru='Норматив сметной прибыли в базовых ценах'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//	
//	Если ТекПозиция.НакладныеРасходыТекущие > 0 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 6, 0, 0, ТекПозиция.НакладныеРасходыТекущие/100, НСтр("ru='Норматив накладных расходов в текущих ценах'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		Идентификатор = СформироватьИдентификаторПоправки(25, 6, 3, 0, ТекПозиция.НакладныеРасходыТекущие/100, НСтр("ru='Норматив накладных расходов в текущих ценах'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;
//	
//	Если ТекПозиция.СметнаяПрибыльТекущие > 0 Тогда
//		Идентификатор = СформироватьИдентификаторПоправки(25, 7, 0, 0, ТекПозиция.СметнаяПрибыльТекущие/100, НСтр("ru='Норматив сметной прибыли в текущих ценах'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//		Идентификатор = СформироватьИдентификаторПоправки(25, 7, 3, 0, ТекПозиция.СметнаяПрибыльТекущие/100, НСтр("ru='Норматив сметной прибыли в текущих ценах'"),"");
//		ТекстВыгрузки.ДобавитьСтроку(СформироватьСтрокуСРазделителями(Идентификатор));
//	КонецЕсли;	
//			
//КонецПроцедуры


// *************************************************************
//Функция ИтогиПоЛимЗатратам(Документ)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	СМ_ИтогиПоГлавам.Смета,
//	               |	СМ_ИтогиПоГлавам.Итог КАК ЛимЗатрата,
//	               |	СУММА(СМ_ИтогиПоГлавам.ТекПрямЗатраты) КАК ТекПрямЗатраты
//	               |ИЗ
//	               |	РегистрСведений.СМ_ИтогиПоГлавам КАК СМ_ИтогиПоГлавам
//	               |ГДЕ
//	               |	СМ_ИтогиПоГлавам.Смета = &Смета
//	               |	И СМ_ИтогиПоГлавам.Итог.Ссылка ССЫЛКА Справочник.СМ_ЛимитированныеЗатраты
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	СМ_ИтогиПоГлавам.Смета,
//	               |	СМ_ИтогиПоГлавам.Итог";
//	
//	Запрос.УстановитьПараметр("Смета",Документ.Ссылка);
//	
//	ТабРезультат = Запрос.Выполнить().Выгрузить();
//	
//	Возврат ТабРезультат;
//
//КонецФункции


// *************************************************************
//Функция ИтогиПоСмете(Документ)
//	
//	Если Документ.ЛимитированныеЗатраты.Количество() > 0 Тогда
//		ТекРег 	= "СМ_ИтогиПоГлавам";
//		ТекИтог = Справочники.СМ_ИтогиПоГлавам.НайтиПоРеквизиту("Идентификатор","ИП4");
//	Иначе
//		ТекРег 	= "СМ_ИтогиПоСмете";
//		ТекИтог = Справочники.СМ_ИтогиПоСмете.ВсегоПоСмете;
//	КонецЕсли;
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	ТекРегистр.Смета,
//	|	ТекРегистр.Итог,
//	|	ТекРегистр.ПрямЗатраты,
//	|	ТекРегистр.ОснЗарплата,
//	|	ТекРегистр.ЭксплМашин,
//	|	ТекРегистр.ЗарплМашин,
//	|	ТекРегистр.СтоимМатер,
//	|	ТекРегистр.Оборуд,
//	|	ТекРегистр.ВозвратМатер,
//	|	ТекРегистр.ЗатратыТрудаРабочих,
//	|	ТекРегистр.ЗатратыТрудаМашин,
//	|	ТекРегистр.ТекПрямЗатраты,
//	|	ТекРегистр.ТекОснЗарплата,
//	|	ТекРегистр.ТекЭксплМашин,
//	|	ТекРегистр.ТекЗарплМашин,
//	|	ТекРегистр.ТекСтоимМатер,
//	|	ТекРегистр.ТекОборуд,
//	|	ТекРегистр.ТекВозвратМатер
//	|ИЗ
//	|	РегистрСведений."+ТекРег+" КАК ТекРегистр
//	|ГДЕ
//	|	ТекРегистр.Смета = &Смета
//	|	И ТекРегистр.Итог = &Итог";
//					
//	Запрос.УстановитьПараметр("Смета",Документ.Ссылка);
//	Запрос.УстановитьПараметр("Итог",ТекИтог);
//	
//	ТабРезультат = Запрос.Выполнить().Выгрузить();
//	Если ТабРезультат.Количество() > 0 Тогда
//		Возврат ТабРезультат[0].ТекПрямЗатраты;
//	Иначе
//		Возврат 0;	
//	КонецЕсли;
//		
//КонецФункции	


// *************************************************************
//Функция ПолучитьЛимЗатратуСметы(ЛимЗатрата)
//    Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
//	               |	СМ_АРПС_СоответствияЛимЗатрат.НаименованиеЛимзатратыАРПС
//	               |ИЗ
//	               |	РегистрСведений.СМ_АРПС_СоответствияЛимЗатрат КАК СМ_АРПС_СоответствияЛимЗатрат
//	               |ГДЕ
//	               |	СМ_АРПС_СоответствияЛимЗатрат.СметнаяПрограмма = &СметнаяПрограмма
//	               |	И СМ_АРПС_СоответствияЛимЗатрат.ЛимЗатрата = &ЛимЗатрата";
//	Запрос.УстановитьПараметр("ЛимЗатрата",ЛимЗатрата);
//	Запрос.УстановитьПараметр("СметнаяПрограмма",СметнаяПрограмма);
//    Выборка = Запрос.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда
//		Возврат  Выборка.НаименованиеЛимзатратыАРПС;
//	Иначе
//		Возврат Неопределено;
//	КонецЕсли;
//КонецФункции


// *************************************************************
//Функция ПолучитьПрефиксШифра(ШифрПозиции)
//	Префикс = "";
//	
//	КолСиволов = СтрДлина(ШифрПозиции);
//	сч = 1;
//	Пока сч <= КолСиволов Цикл
//		Символ = Сред(ШифрПозиции,сч,1);
//		Если СтрНайти("0123456789",Символ)>0 Тогда
//			Прервать;
//		КонецЕсли;
//		Префикс = Префикс + Строка(Символ);
//		сч = сч+1;
//	КонецЦикла;	
//	Возврат Префикс;
//КонецФункции


// *************************************************************
//Функция ПолучитьРесурснуюСтроимостьПозиции(ДокументСсылка,Раздел, ПозицияЛС)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	СМ_РесурснаяСтоимостьПозиции.Смета,
//	|	СМ_РесурснаяСтоимостьПозиции.Раздел,
//	|	СМ_РесурснаяСтоимостьПозиции.Позиция,
//	|	СМ_РесурснаяСтоимостьПозиции.СтоимПрямЗатраты,
//	|	СМ_РесурснаяСтоимостьПозиции.СтоимОснЗарплата,
//	|	СМ_РесурснаяСтоимостьПозиции.СтоимЭксплМашин,
//	|	СМ_РесурснаяСтоимостьПозиции.СтоимЗарплМашин,
//	|	СМ_РесурснаяСтоимостьПозиции.СтоимСтоимМатер,
//	|	СМ_РесурснаяСтоимостьПозиции.СтоимОборуд,
//	|	СМ_РесурснаяСтоимостьПозиции.СтоимВозвратМатер,
//	|	СМ_РесурснаяСтоимостьПозиции.ЗатратыТрудаРабочих,
//	|	СМ_РесурснаяСтоимостьПозиции.ЗатратыТрудаМашин,
//	|	СМ_РесурснаяСтоимостьПозиции.ТекСтоимПрямЗатраты,
//	|	СМ_РесурснаяСтоимостьПозиции.ТекСтоимОснЗарплата,
//	|	СМ_РесурснаяСтоимостьПозиции.ТекСтоимЭксплМашин,
//	|	СМ_РесурснаяСтоимостьПозиции.ТекСтоимЗарплМашин,
//	|	СМ_РесурснаяСтоимостьПозиции.ТекСтоимСтоимМатер,
//	|	СМ_РесурснаяСтоимостьПозиции.ТекСтоимОборуд,
//	|	СМ_РесурснаяСтоимостьПозиции.ТекСтоимВозвратМатер
//	|ИЗ
//	|	РегистрСведений.СМ_РесурснаяСтоимостьПозиции КАК СМ_РесурснаяСтоимостьПозиции
//	|ГДЕ
//	|	СМ_РесурснаяСтоимостьПозиции.Смета = &Смета
//	|	И СМ_РесурснаяСтоимостьПозиции.Позиция = &Позиция";
//	
//	Запрос.УстановитьПараметр("Смета", ДокументСсылка);
//	Запрос.УстановитьПараметр("Позиция",ПозицияЛС);
//	
//	ТабРезультат = Запрос.Выполнить().Выгрузить();
//	
//	Возврат ТабРезультат;
//	
//КонецФункции


// *************************************************************
//Функция ПолучитьСтоимостиПозицииСНачислениямиИПоправками(ДокументСсылка,ПозицияЛС,Раздел)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "
//	|ВЫБРАТЬ
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимПрямЗатраты,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОснЗарплата,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЭксплМашин,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЗарплМашин,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимСтоимМатер,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОборуд,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимВозвратМатер,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаРабочих,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаМашин,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимПрямЗатраты,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЗарплМашин,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОборуд,
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимВозвратМатер
//	|ИЗ
//	|	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП
//	|ГДЕ
//	|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = &Смета
//	|	И СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = &Позиция";
//	
//	Запрос.УстановитьПараметр("Смета", ДокументСсылка);
//	Запрос.УстановитьПараметр("Позиция", ПозицияЛС);

//	ТабРезультат = Запрос.Выполнить().Выгрузить();
//	
//	Возврат ТабРезультат;
//	
//КонецФункции


// *****************************************************************
// Функция возвращает список параметров поправки.
// 
//  Параметры:
//   Код 			- Число - тип строки.
//   Тип 			- Число - тип поправки.
//   КЧемуОтносится 	- Число - к чему относится поправка .
//   Действие 	 	- Число - 
//  				  		0 - умножение,
// 				  		1 - деление,
// 				  		2 - сложение,
// 				  		3 - вычитание.
//   Значение 	 	- Число - значение поправочного коэффициента .
//   Наименование 	- Число - наименование поправочного коэффициента .
//   Обоснование  	- Число - обоснование поправочного коэффициента .
// 
//  Возвращаемое значение:
//   СписокЗначений - список параметров поправки.
// 
//Функция СформироватьИдентификаторПоправки(Код,Тип,КЧемуОтносится,Действие,Значение,Наименование,Обоснование)
//	
//	Идентификатор = Новый СписокЗначений();
//	Идентификатор.Добавить(Код);
//	Идентификатор.Добавить(Тип);
//	Идентификатор.Добавить(КЧемуОтносится);
//	Идентификатор.Добавить(Действие);
//	Идентификатор.Добавить(Значение);
//	Идентификатор.Добавить(Наименование);
//	Идентификатор.Добавить(Обоснование);
//	
//	Возврат Идентификатор;
//	
//КонецФункции 


// ********************************************************************
// Возвращает строку - значения списка значений, разделенные символом #.
// Требование формата АРПС 1.10.
// 
//  Параметры:
//   Идентификатор - СписокЗначений - список, преобразуемый в строку с разделителями.
// 
//  Возвращаемое значение:
//   Строка. Строка с разделителями.
//  
//Функция СформироватьСтрокуСРазделителями(Идентификатор)
//	
//	СтрокаСРазделителями = "";
//	Итератор = 0;
//	
//	Для Каждого Элемент Из Идентификатор Цикл
//		Итератор = Итератор + 1;
//		
//		Если ТипЗнч(Элемент.Значение)  = Тип("Строка") Тогда
//			Элемент.Значение = СтрЗаменить(Элемент.Значение,"#"," ");
//			Элемент.Значение = СокрЛП(Элемент.Значение);
//		ИначеЕсли ТипЗнч(Элемент.Значение)  = Тип("Число") Тогда
//			Элемент.Значение = Формат(Элемент.Значение,"ЧГ=;ЧН=0");
//		КонецЕсли;
//		
//		СтрокаСРазделителями = СтрокаСРазделителями+Элемент.Значение;
//		
//		Если Итератор < Идентификатор.Количество() Тогда
//			СтрокаСРазделителями = СтрокаСРазделителями+"#";
//		КонецЕсли;
//	КонецЦикла;
//	
//	Возврат СтрокаСРазделителями;
//	
//КонецФункции //  СформироватьСтрокуСРазделителями()

#КонецОбласти

#КонецЕсли
