#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДанныеПрожиточногоМинимумаТрудоспособные(ДатаАктуальности = Неопределено) Экспорт
	
	ДанныеПМ = Новый Структура("Размер, Период");
	
	СрезПоследних = РегистрыСведений.ПрожиточныеМинимумы.СрезПоследних(ДатаАктуальности, Новый Структура("СоциальнаяГруппа",Перечисления.СоциальныеГруппыНаселения.Трудоспособные));
	Если СрезПоследних.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru='Сведения о прожиточном минимуме не заполнены';uk='Відомості про прожитковий мінімум не заповнено'");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеПМ, СрезПоследних[0]);
	
	Возврат ДанныеПМ;
	
КонецФункции

#КонецОбласти

#КонецЕсли
