#Область СлужебныеПроцедурыИФункции

// Возвращает максимальное значение реквизита ПорядковыйНомер в справочнике.
//
// Возвращаемое значение:
//		Число - максимальный порядковый номер.
//
Функция ПолучитьМаксимальныйНомерПоПорядку() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИтогиПоСмете.ПорядковыйНомер КАК ПорядковыйНомер
	               |ИЗ
	               |	Справочник.СМ_ИтогиПоСмете КАК ИтогиПоСмете
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ПорядковыйНомер УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ПорядковыйНомер;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти