
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Позиция = РеквизитФормыВЗначение("Объект");

	Если Объект.Ссылка.Пустая() Тогда
		
		Если ЭтаФорма.Параметры.Свойство("Родитель") Тогда
			СМ_СметаВызовСервера.ЗаполнитьДанныеДокументаВСтруктуреСмет(Объект, Параметры.Родитель);
		КонецЕсли;	
	
		Если ЭтаФорма.Параметры.Свойство("ЛокальнаяСмета") Тогда
			СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Параметры.ЛокальнаяСмета,Позиция);
		Иначе
			Если ЗначениеЗаполнено(Позиция.ИДРодителя) Тогда
				СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,Позиция);
			КонецЕсли;
		КонецЕсли;
		
		Если Параметры.Свойство("СпособСоздания") Тогда
			Объект.СпособСоздания = Параметры.СпособСоздания;
		КонецЕсли;
		
		Если НЕ Объект.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.Калькуляция Тогда
			Документы.СМ_ПозицияЛокальнойСметы.ЗаполнитьНачисленияПозицииПоУмолчанию(Объект);
		КонецЕсли;
		
		ЗаполнитьНастройкиПозицииПоУмолчанию();
		
	Иначе
		
		ОбновитьЗначенияПоАкту();
		СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(Объект.ИДСметы,Позиция);
		ЗагрузитьДвиженияВТаблицы();
		
	КонецЕсли;
	
	ЭтоРабота = ЭтоРабота(Объект.Определитель,Объект.ТипНормативныхСборников);
	ТолькоПросмотрФормы = СМ_СметаВызовСервера.РольТолькоПросмотр();
	
	СуществуютАкты = СМ_УчетВыполненныхРаботСервер.СуществуютАктыПоСмете(Объект.ИДСметы) И Параметры.ЕстьАкт И Параметры.СтатусРедактирования>0;
	
	ВводОбъемовВБазовыхЕдИзм = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ВводОбъемовВБазовыхЕдИзм");
	
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
	
	РасчитатьСтоимостьНаОбъем();
	
	Если ЭтоРабота = "Нет" Тогда
		Если Объект.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал Тогда
			БазиснаяЦена = Объект.СтоимМатериалов;
		Иначе
			БазиснаяЦена = Объект.Оборудование;
		КонецЕсли;	
	КонецЕсли;	
	
	МассивРесурсов = Объект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(Новый Структура("Удален",Ложь));
	Если Не Объект.Ссылка.Пустая()
		И МассивРесурсов.Количество() > 0
		И СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод Тогда
		РасчитатьТекСтоимостьНаОбъемРегистр();
		РасчитатьТекСтоимостьНаОбъем();
	Иначе
		РасчитатьТекСтоимостьНаОбъем();
	КонецЕсли;

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "СтраницаДополнительныеРеквизиты");
		ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Ложь);
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	КонецЕсли;
	
	ЭтоСметчик = Ложь;
	Если РольДоступна("СМ_Сметчик") Тогда
		ЭтоСметчик = Истина;
	КонецЕсли;	
	
	ЭтоСметчикМатериалы = Ложь;
	Если РольДоступна("СМ_СметчикМатериалы") Тогда
		ЭтоСметчикМатериалы = Истина;
	КонецЕсли;	
			
КонецПроцедуры

&НаСервере
Функция ПолучитьТекПоказателиРегистр()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимЗарплМашин) КАК ТекущаяЗарплМашинистов,
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимОснЗарплата) КАК ТекущаяОснЗарплата,
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимПрямЗатраты) КАК ТекущаяПрямЗатраты,
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимСтоимМатер) КАК ТекущаяСтоимМатериалов,
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимЭксплМашин) КАК ТекущаяЭксплМашин,
	               |	СМ_РесурснаяСтоимостьПозиции.Позиция
	               |ИЗ
	               |	РегистрСведений.СМ_РесурснаяСтоимостьПозиции КАК СМ_РесурснаяСтоимостьПозиции
	               |ГДЕ
	               |	СМ_РесурснаяСтоимостьПозиции.Смета = &Смета
	               |	И СМ_РесурснаяСтоимостьПозиции.Позиция = &Позиция
	               |	И СМ_РесурснаяСтоимостьПозиции.Раздел = &Раздел
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СМ_РесурснаяСтоимостьПозиции.Позиция";
	Запрос.УстановитьПараметр("Смета",Объект.ИДСметы);
	Запрос.УстановитьПараметр("Позиция",Объект.Ссылка);
	Запрос.УстановитьПараметр("Раздел",Объект.ИДРодителя);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьТекЗначениеАктаИзРегистра(ПозицияСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимЗарплМашин) КАК ТекущаяЗарплМашинистов,
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимОснЗарплата) КАК ТекущаяОснЗарплата,
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимПрямЗатраты) КАК ТекущаяПрямЗатраты,
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимСтоимМатер) КАК ТекущаяСтоимМатериалов,
	               |	СУММА(СМ_РесурснаяСтоимостьПозиции.ТекСтоимЭксплМашин) КАК ТекущаяЭксплМашин,
	               |	СМ_РесурснаяСтоимостьПозиции.Позиция
	               |ИЗ
	               |	РегистрСведений.СМ_РесурснаяСтоимостьПозиции КАК СМ_РесурснаяСтоимостьПозиции
	               |ГДЕ
	               |	СМ_РесурснаяСтоимостьПозиции.Смета = &Смета
	               |	И СМ_РесурснаяСтоимостьПозиции.Позиция = &Позиция
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	СМ_РесурснаяСтоимостьПозиции.Позиция";
	Запрос.УстановитьПараметр("Смета",Параметры.Акт);
	Запрос.УстановитьПараметр("Позиция",ПозицияСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не (СуществуютАкты) И (Не Параметры.ПозицияАкта) Тогда
		// Эрикос.zbikt 11.06.2014
		Если ТекущийОбъект.Демонтаж Тогда
			// корректировка sudav - под удаление теперь другая функция
			СМ_СметаВызовСервера.УдалитьПодчиненныеПозицииЛСМатериалы(ТекущийОбъект.Ссылка); 		
		КонецЕсли;
		
		// Эрикос.zbikt 26.06.2014
		Если  Не ПустаяСтрока(АдресХранилищаЗамен) Тогда
			ТаблицаЗамен = ПолучитьИзВременногоХранилища(АдресХранилищаЗамен);
			ЛС 		= ТекущийОбъект.ИДСметы;
			Документы.СМ_ПозицияЛокальнойСметы.ДобавитьДвиженияВРегЗамен(ТаблицаЗамен, ТекущийОбъект, ЛС);
		КонецЕсли;
		
		Документы.СМ_ПозицияЛокальнойСметы.Перерасчет(ТекущийОбъект, Ложь);
		
	КонецЕсли;
	
	ЗаписатьЗначенияПоАкту();
	ЗагрузитьДвиженияВТаблицы();
	СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗначенияПоАкту()
	
	Если Параметры.ПозицияАкта Тогда
		
		СтрокаПозиции = СМ_СметаВызовСервера.СтрокаПозицииАкта(Параметры.Акт, Объект.Ссылка);	
		Если СтрокаПозиции = Неопределено Тогда
			Возврат;
		КонецЕсли;
		РесурсыПозицииПоАкту = СМ_СметаВызовСервера.МассивСтрокРесурсовПозицииАкта(Параметры.Акт, Объект.Ссылка);
		
		// индексы могут отличаться
		КоэффициентыПересчетаАкта.Очистить();
		Если ЗначениеЗаполнено(СтрокаПозиции) Тогда
			Стр = КоэффициентыПересчетаАкта.Добавить();
			ЗаполнитьЗначенияСвойств(Стр, СтрокаПозиции);
			// текущие цены, если есть
			ТекущаяЦенаФакт 				= СтрокаПозиции.ТекущаяЦена;
			ФормулаТекЦеныФакт				= СтрокаПозиции.Позиция.ФормулаТекЦены;
			ТекущаяЗарплатаМашинистовФакт 	= СтрокаПозиции.ТекущаяЗарплатаМашинистов;
			// объем
			ФактОбъем 			= СтрокаПозиции.ФактОбъем;
			ФормулаФактОбъема 	= СтрокаПозиции.ФормулаОбъема;
		КонецЕсли;
		
		// ресурсы нужно обновить
		РесурсыПозицииАкта.Очистить();
		Для Каждого СтрокаРесурса Из РесурсыПозицииПоАкту Цикл
			Стр = РесурсыПозицииАкта.Добавить();	
			ЗаполнитьЗначенияСвойств(Стр, СтрокаРесурса); 			
		КонецЦикла;	
		
		// Нужно Обновить текущие стоимости прямых затрат по акту.
		Если Параметры.Акт.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			МассивРесурсов = РесурсыПозицииАкта.НайтиСтроки(Новый Структура("Удален",Ложь));
			Если МассивРесурсов.Количество() = 0 Тогда
				ФормулаТекущейПЗФакт = СтрокаПозиции.ФормулаТекущейПЗ;
				ФормулаТекущейОЗФакт = СтрокаПозиции.ФормулаТекущейОЗ;
				ФормулаТекущейСМФакт = СтрокаПозиции.ФормулаТекущейСМ;
				ФормулаТекущейЗМФакт = СтрокаПозиции.ФормулаТекущейЗМ;
				ФормулаТекущейЭМФакт = СтрокаПозиции.ФормулаТекущейЭМ;
				ТекущиеПЗФакт = СтрокаПозиции.ТекущаяПрямЗатраты;
				ТекущиеОЗФакт = СтрокаПозиции.ТекущаяОснЗарплата;
				ТекущиеСМФакт = СтрокаПозиции.ТекущаяСтоимМатериалов;
				ТекущиеЗМФакт = СтрокаПозиции.ТекущаяЗарплМашинистов;
				ТекущиеЭМФакт = СтрокаПозиции.ТекущаяЭксплМашин;
				ТекущиеПЗФакт1 = СтрокаПозиции.ТекущаяПрямЗатраты * СтрокаПозиции.ФактОбъем;
				ТекущиеОЗФакт1 = СтрокаПозиции.ТекущаяОснЗарплата * СтрокаПозиции.ФактОбъем;
				ТекущиеСМФакт1 = СтрокаПозиции.ТекущаяСтоимМатериалов * СтрокаПозиции.ФактОбъем;
				ТекущиеЗМФакт1 = СтрокаПозиции.ТекущаяЗарплМашинистов * СтрокаПозиции.ФактОбъем;
				ТекущиеЭМФакт1 = СтрокаПозиции.ТекущаяЭксплМашин * СтрокаПозиции.ФактОбъем;
			Иначе
				ЗначениеРегистра = ПолучитьТекЗначениеАктаИзРегистра(СтрокаПозиции.Позиция.Ссылка); 
				ФормулаТекущейПЗФакт = "";
				ФормулаТекущейОЗФакт = "";
				ФормулаТекущейСМФакт = "";
				ФормулаТекущейЗМФакт = "";
				ФормулаТекущейЭМФакт = "";
				ТекущиеПЗФакт = 0;
				ТекущиеОЗФакт = 0;
				ТекущиеСМФакт = 0;
				ТекущиеЗМФакт = 0;
				ТекущиеЭМФакт = 0;
				ТекущиеПЗФакт1 = 0;
				ТекущиеОЗФакт1 = 0;
				ТекущиеСМФакт1 = 0;
				ТекущиеЗМФакт1 = 0;
				ТекущиеЭМФакт1 = 0;
				Если ЗначениеРегистра.Количество() <> 0 Тогда
					ТекущиеПЗФакт = ЗначениеРегистра[0].ТекущаяПрямЗатраты;
					ТекущиеОЗФакт = ЗначениеРегистра[0].ТекущаяОснЗарплата;
					ТекущиеСМФакт = ЗначениеРегистра[0].ТекущаяСтоимМатериалов;
					ТекущиеЗМФакт = ЗначениеРегистра[0].ТекущаяЗарплМашинистов;
					ТекущиеЭМФакт = ЗначениеРегистра[0].ТекущаяЭксплМашин;
					ТекущиеПЗФакт1 = ЗначениеРегистра[0].ТекущаяПрямЗатраты * СтрокаПозиции.ФактОбъем;
					ТекущиеОЗФакт1 = ЗначениеРегистра[0].ТекущаяОснЗарплата * СтрокаПозиции.ФактОбъем;
					ТекущиеСМФакт1 = ЗначениеРегистра[0].ТекущаяСтоимМатериалов * СтрокаПозиции.ФактОбъем;
					ТекущиеЗМФакт1 = ЗначениеРегистра[0].ТекущаяЗарплМашинистов * СтрокаПозиции.ФактОбъем;
					ТекущиеЭМФакт1 = ЗначениеРегистра[0].ТекущаяЭксплМашин * СтрокаПозиции.ФактОбъем;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначенияПоАкту()
	
	Если (Параметры.ПозицияАкта) И (ФактОбъем<>0) Тогда
		
		ОбъектАкт = Параметры.Акт.ПолучитьОбъект();
		СтрокаПозиции = СМ_СметаВызовСервера.СтрокаПозицииАкта(ОбъектАкт, Объект.Ссылка, Истина);	
		РесурсыПозицииПоАкту = СМ_СметаВызовСервера.МассивСтрокРесурсовПозицииАкта(ОбъектАкт, Объект.Ссылка);
		РесурсыПоАкту = ОбъектАкт.РесурсыПозицийАкта;

		// индексы могут отличаться
		Если ЗначениеЗаполнено(СтрокаПозиции) И (КоэффициентыПересчетаАкта.Количество() > 0) Тогда
			ЗаполнитьЗначенияСвойств(СтрокаПозиции, КоэффициентыПересчетаАкта[0]);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПозиции) Тогда
			// текущие цены, если есть
			МассивРесурсов = РесурсыПоАкту.НайтиСтроки(Новый Структура("Удален",Ложь));
			Если МассивРесурсов.количество() <> 0 Тогда
				СтрокаПозиции.ТекущаяПрямЗатраты = ТекущиеПЗФакт;
				СтрокаПозиции.ТекущаяОснЗарплата = ТекущиеОЗФакт;
				СтрокаПозиции.ТекущаяЭксплМашин = ТекущиеЭМФакт;
				СтрокаПозиции.ТекущаяСтоимМатериалов = ТекущиеСМФакт;
				СтрокаПозиции.ТекущаяЗарплМашинистов = ТекущиеЗМФакт;
				СтрокаПозиции.ФормулаТекущейЗМ = ФормулаТекущейЗМФакт;
				СтрокаПозиции.ФормулаТекущейПЗ = ФормулаТекущейПЗФакт;
				СтрокаПозиции.ФормулаТекущейОЗ = ФормулаТекущейОЗФакт;
				СтрокаПозиции.ФормулаТекущейЭМ = ФормулаТекущейЭМФакт;
				СтрокаПозиции.ФормулаТекущейСМ = ФормулаТекущейСМФакт;
			КонецЕсли;
			СтрокаПозиции.ТекущаяЦена = ТекущаяЦенаФакт;
			СтрокаПозиции.ТекущаяЗарплатаМашинистов = ТекущаяЗарплатаМашинистовФакт;
			// объем
			СтрокаПозиции.ФактОбъем = ФактОбъем;
			СтрокаПозиции.ФормулаОбъема = ФормулаФактОбъема;
		КонецЕсли;
		
		// ресурсы нужно обновить
		СМ_СметаВызовСервера.ЗаполнитьТЧРесурсыАктаПоТаблице(ОбъектАкт, Объект.Ссылка, РесурсыПозицииАкта);
		
		ОбъектАкт.Записать();
		
	ИначеЕсли (Параметры.ПозицияАкта) Тогда
		
		ОбъектАкт = Параметры.Акт.ПолучитьОбъект();
		СМ_СметаВызовСервера.УдалитьСтрокуПозицииАкта(ОбъектАкт, Объект.Ссылка);
		ОбъектАкт.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		Если МодульУправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
			ОбновитьЭлементыДополнительныхРеквизитов();
			МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Функция ОчиститьФормулу(ТекФормула)
	ТекФормула = СтрЗаменить(ТекФормула,",",".");
	НоваяФормула = "";
	СтрокаСимв = "1234567890+-*/().";	
	Для сч = 1 По СтрДлина(ТекФормула) Цикл
		ТекСимв = Сред(ТекФормула,Сч,1);
		Если Найти(СтрокаСимв,ТекСимв) <> 0 Тогда
			НоваяФормула = НоваяФормула + ТекСимв;
		КонецЕсли;
	КонецЦикла;	
	Возврат (НоваяФормула);
	
КонецФункции

&НаКлиенте
Процедура ФормулаПЗНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ПрямЗатраты", "ФормулаПЗ");
	РасчитатьСтоимостьНаОбъем("ПрямЗатраты");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаОЗНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ОснЗарплата", "ФормулаОЗ");
	РасчитатьСтоимостьНаОбъем("ОснЗарплата");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаЭМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ЭксплМашин", "ФормулаЭМ");
	РасчитатьСтоимостьНаОбъем("ЭксплМашин");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаЗМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ЗарплМашинистов", "ФормулаЗМ");
	РасчитатьСтоимостьНаОбъем("ЗарплМашинистов");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаСМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("СтоимМатериалов", "ФормулаСМ");
	РасчитатьСтоимостьНаОбъем("СтоимМатериалов");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаОбНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("Оборудование", "ФормулаОб");
	РасчитатьСтоимостьНаОбъем("Оборудование");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаВМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ВозвратМатер", "ФормулаВМ");
	РасчитатьСтоимостьНаОбъем("ВозвратМатер");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТРНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ЗатратыТрудаРабочих", "ФормулаТР");
	РасчитатьСтоимостьНаОбъем("ЗатратыТрудаРабочих");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ЗатратыТрудаМашинистов", "ФормулаТМ");
	РасчитатьСтоимостьНаОбъем("ЗатратыТрудаМашинистов");
КонецПроцедуры

&НаКлиенте
Процедура ДемонтажПриИзменении(Элемент)
	
	// ДокторСофт
	Если Объект.Демонтаж Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаМатериалы", ЭтаФорма);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Материалы текущей позиции будут очищены. Продолжить?';" + " en = 'Do you want to continue?'"), Режим, 0);
	Иначе
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаПоправки", ЭтаФорма);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Поправки по демонтажу из табличной части будут удалены. Продолжить';" + " en = 'Do you want to continue?'"), Режим, 0);
	КонецЕсли;
	// ДокторСофт
	// Эрикос.zbikt 11.06.2014
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаМатериалы(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.Демонтаж = Ложь;
        Возврат;
    КонецЕсли;
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТипПоправки",ПредопределенноеЗначение("Перечисление.СМ_ТипыПоправок.ДемонтажМДС"));
	ОписаниеОЗакрытииФормыВыбораПоправок = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораПоправок",ЭтаФорма,);
	ОткрытьФорму("Справочник.СМ_ПоправкиПоТехническимЧастям.Форма.ФормаВыбораПоправокДемонтаж",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораПоправок,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ДемонтажПриИзмененииНаСервере();
	РасчитатьСтоимостьНаОбъем();
	РасчитатьТекСтоимостьНаОбъем();
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаПоправки(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.Демонтаж = Истина;
        Возврат;
    КонецЕсли;
	УдалитьСтрокиДемонтажа();
	
	ДемонтажПриИзмененииНаСервере();
	РасчитатьСтоимостьНаОбъем();
	РасчитатьТекСтоимостьНаОбъем();
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();

КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиДемонтажа()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ТипПоправки",Перечисления.СМ_ТипыПоправок.ДемонтажМДС);
	МассивСтрок = Объект.ПоправкиПозиции.НайтиСтроки(СтруктураОтбора);
	Для Каждого ТекСтрока Из МассивСтрок Цикл
		Объект.ПоправкиПозиции.Удалить(ТекСтрока);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДемонтажПриИзмененииНаСервере()
	// Эрикос.zbikt 11.06.2014
	
	Позиция = РеквизитФормыВЗначение("Объект");
	// снимается флаг применить с поправок
	Для Каждого СтрокаТЧ Из Позиция.ПоправкиПозиции Цикл
		СтрокаТЧ.Применить = Ложь;
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из Позиция.РесурсыПозицииЛокальнойСметы Цикл
		Если СтрокаТЧ.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
			СтрокаТЧ.Удален = Позиция.Демонтаж;
		КонецЕсли;
	КонецЦикла;
	
	// Расчет составляющих прямых затрат по баз.ценам составляющих позицию ресурсов
	ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Расчетный;
	КЧ = Новый КвалификаторыЧисла(20,6);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив,,,КЧ);
	
	ТаблЕдСтоим = Новый ТаблицаЗначений;
	ТаблЕдСтоим.Колонки.Добавить("ПрямЗатраты",ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("ОснЗарплата",ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("ЭксплМашин",ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("ЗарплМашинистов",ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("СтоимМатериалов",ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("ЗатратыТрудаРабочих",ОписаниеТиповЧ);
	
	// По базисным ценам рассчитываем единичные составляющие прямых затрат
	СМ_СметаРасчетБазисноИндексныйСервер.РасчетЕдиничныхЗначенийСоставляющих(Позиция,ВариантРасчетаЗМ,ТаблЕдСтоим);
	Для Каждого Значения Из ТаблЕдСтоим Цикл
		Позиция.СтоимМатериалов = Значения.СтоимМатериалов;
		Позиция.ЭксплМашин = Значения.ЭксплМашин;
		Позиция.ОснЗарплата = Значения.ОснЗарплата;
		Если Не Позиция.Демонтаж Тогда
			Позиция.ПрямЗатраты = Значения.ПрямЗатраты;
			Позиция.ЗарплМашинистов = Значения.ЗарплМашинистов;
			Позиция.ЗатратыТрудаРабочих = Значения.ЗатратыТрудаРабочих;
			Позиция.ЗатратыТрудаМашинистов = Позиция.ЗатратыТрудаМашинистов;
			Позиция.ОснЗарплата = Значения.ОснЗарплата;
			Если Сред(Позиция.Наименование,1,9) = НСтр("ru = 'Демонтаж.'") Тогда
				Позиция.Наименование = СокрЛ(Сред(Позиция.Наименование,10));
			КонецЕсли;	
		Иначе
			Позиция.ПрямЗатраты = Позиция.ЭксплМашин + Позиция.ОснЗарплата;
			Позиция.Наименование =  НСтр("ru = 'Демонтаж.'")+" " + Позиция.Наименование; 

		КонецЕсли;
		// При изменении ресурсной части позиции, мы не можем
		// откорректировать затраты труда машинистов.
	КонецЦикла;
	ЗначениеВДанныеФормы(Позиция, Объект);

КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПозицию(Команда)
	Если ЭтотОбъект.Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("РассчетПозиции",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Для расчета необходимо сохранить изменения. Записать документ?'"),РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаОбъемаПриИзменении(Элемент)
	
	ТекФормула 		= СокрЛП(Объект.ФормулаОбъема);
    ФормулаИзменена = Ложь;
	Если ЗначениеЗаполнено(ТекФормула) Тогда
		
		ТекПозиция = СтрНайти(ТекФормула,"=");
		Если ТекПозиция > 0 Тогда
			ТекФормула = СокрЛП(Сред(ТекФормула,2));
		КонецЕсли;
		
		// Поиск и подстановка параметров в формулу из позиции ЛС
		МассивПараметров = СМ_СметаКлиентСервер.ПолучитьСписокПараметровФормулы(ТекФормула);
		Если МассивПараметров.Количество() > 0 Тогда
			//СтруктураПараметров = СМ_СметаКлиентСервер.ЗаполнитьЗначенияПараметров(МассивПараметров,Объект.ИДСметы);
			СтруктураПараметров = ЗаполнитьЗначенияПараметров(МассивПараметров);
			ТекФормула 			= СМ_СметаКлиентСервер.ПодставитьПараметрыВФормулу(ТекФормула,СтруктураПараметров);
		КонецЕсли;
		
		Попытка
			ТекФормула 	= СтрЗаменить(ТекФормула,",",".");
			Формула 	= "ТекОбъем = " + ТекФормула+"; Объект.ОбъемРабот = ТекОбъем;";
			Выполнить(Формула);
			
			Если Не ЗначениеЗаполнено(Объект.НормаРасходаРесурса) Тогда
				Объект.НормаРасходаРесурса = 1;	
			КонецЕсли;
			Объект.КоличествоРесурса = Объект.ОбъемРабот / Объект.НормаРасходаРесурса;
			
			// Эрикос.zbikt 23.06.2014
			РасчитатьСтоимостьНаОбъем("", Истина);
			// Эрикос.zbikt 23.06.2014
			ФормулаИзменена = Истина;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, объем не изменен'"));
		КонецПопытки;
		
		Если ЗначениеЗаполнено(Объект.Ссылка) И ФормулаИзменена И СМ_СметаВызовСервера.ЕстьПривязанныеПозиции(Объект.Ссылка) Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбъем", ЭтаФорма);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Изменять пропорционально объем привязанных позиций?';"
			+ " en = 'Do you want to continue?'"), Режим, 0);
		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ЗаполнитьЗначенияПараметров(МассивПараметров)
	
	СтруктураПараметров = СМ_СметаКлиентСервер.ЗаполнитьЗначенияПараметров(МассивПараметров,Объект.ИДСметы);
	Возврат СтруктураПараметров;
	
КонецФункции

&НаКлиенте
Процедура ФормулаФактОбъемаПриИзменении(Элемент)
	
	ТекОбъем = ФактОбъем;
	Если ЗначениеЗаполнено(ФормулаФактОбъема) Тогда
		ФормулаФактОбъема = ОчиститьФормулу(ФормулаФактОбъема);
		Попытка
			Формула = "ТекОбъем = " + ФормулаФактОбъема+"; ФактОбъем = ТекОбъем;";
			Выполнить(Формула);
			// Эрикос.zbikt 23.06.2014
			РасчитатьСтоимостьНаФактОбъем("", Истина);  // - Судариков: внутри процедуры все на Объект.Объем работ завязано. Видимо, она не подходит.
			// Эрикос.zbikt 23.06.2014
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, объем не изменен'"));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПрименятьИндексыПриИзменении(Элемент)
	
	ОпределитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура РегиональнаяБазаПриИзменении(Элемент)
	
	ВидимостьКнопкиТехчасть();
	
КонецПроцедуры

// Процедура осуществляет действия после подтверждения пользователем обновления позиции.
// ПАРАМЕТРЫ:
//// Ответ - ответ пользователя на диалог.
//// ДополнительныеПараметры - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ОбновитьПоНормативнойБазеОповещение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	СтарыйШифрРасценки = Неопределено;
	ЗаменаКода = Ложь;
	Если ДополнительныеПараметры.Количество() <> 0 Тогда
		СтарыйШифрРасценки = ДополнительныеПараметры.СтарыйШифр;
		ЗаменаКода = Истина;
	КонецЕсли;	
	Записать();
	
	СМ_СметаКлиент.ОбновитьПоНормативнойБазе(Объект.Ссылка, , ЗаменаКода);
	Если СтарыйШифрРасценки <> Неопределено Тогда
		Если ЗаменаКода = Ложь Тогда
			Объект.ШифрРасценки = СтарыйШифрРасценки;
			ЗаписатьОбъект();
		КонецЕсли;	
	КонецЕсли;	
		
	ЭтаФорма.Прочитать();
			
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоНормативнойБазе(Команда)
	
	Если СметнаяКомпонента = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru='Сметная компонента не подключена'"));
	Иначе
		Если (Не ЗначениеЗаполнено(Объект.РегиональнаяБаза))
			ИЛИ (Объект.ТипНормативныхСборников = ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.Калькуляция")) Тогда
			Возврат;
		КонецЕсли;
		
		ОбновитьПоНормативнойБазеОповещение(КодВозвратаДиалога.Да, Новый Структура());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКНормативнымДанным(Команда)
	
	Если СметнаяКомпонента = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru='Сметная компонента не подключена'"));
	Иначе
		Если (Не ЗначениеЗаполнено(Объект.РегиональнаяБаза)) 
			ИЛИ (Объект.ТипНормативныхСборников = ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.Калькуляция")) Тогда
			Возврат;
		КонецЕсли;
		
		Если (СокрЛП(Объект.ШифрРасценки) = "")
			Или (Не ЗначениеЗаполнено(Объект.ТипНормативныхСборников)) Тогда
			Возврат;
		КонецЕсли;
		
		ИдФормы = СметнаяКомпонента.ПоказатьОкноНорм(Строка(СтруктураПараметровРасчетаЛС.КодРайона),Строка(СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Объект.РегиональнаяБаза,"Код")),СМ_СметаЗагрузкаВызовСервера.ОпределитьКодТипаСборника(Объект.ТипНормативныхСборников),СокрЛП(Объект.ШифрРасценки));
		ВариантВыбораВНБ = "ВНБ"+ИдФормы;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура НеХватаетМатериаловВКаталоге(Команда)
	Если Не ЗначениеЗаполнено(Объект.Ссылка)или ЭтаФорма.Модифицированность Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьФормуЗаявкиНаМатериалыДиалог", ЭтаФорма, Новый Структура);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Для создания заявки акт будет записан. Продолжить?'"), РежимДиалогаВопрос.ДаНет,0,,"Внимание");	
	Иначе
		ОткрытьФормуЗаявкиНаМатериалы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВСправочникРесурсы(Команда)
	
	НайденныйРесурс = НайтиРесурсПоКоду(Объект.ШифрРасценки); 
	ОткрытьФормуРесурса(НайденныйРесурс);

КонецПроцедуры

&НаКлиенте
Процедура ПерейтиВСправочникРесурсыРаб(Команда)
	
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		НайденныйРесурс = НайтиРесурсПоКоду(ТекДанные.СметныйКодРесурса); 
		ОткрытьФормуРесурса(НайденныйРесурс);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоНС(Команда)

	ОбновитьПоНССервер();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоНССервер()
	
	// Поиск нормативного сборника, поиск производится по коду расценки, типу сборника, СНБ позиции.
	// Если СНБ не заполнена, поиск производится без учета СНБ.
	НормативныйСборник = СМ_СметаВызовСервера.НайтиНормативныйСборник(Объект.ТипНормативныхСборников,Объект.ШифрРасценки, Объект.РегиональнаяБаза);
	Если ЗначениеЗаполнено(НормативныйСборник) Тогда
		ТекОбъект = РеквизитФормыВЗначение("Объект");
		СМ_СметаВызовСервера.ОбновитьПозициюПоНормативномуСборнику(ТекОбъект,Объект.ИДСметы,Объект.ИДРодителя,НормативныйСборник);
		ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура осуществляет действия после подтверждения пользователем пересчета позиции.
// ПАРАМЕТРЫ:
//// Результат - ответ пользователя на диалог.
//// Параметры - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура РассчетПозиции(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		ЗаписатьОбъект();
	КонецЕсли;
	ВыполнитьРасчетНаСервере();
	ЗагрузитьДвиженияВТаблицы();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРасчетНаСервере()
	
	ТекОбъект = РеквизитФормыВЗначение("Объект", Тип("ДокументОбъект.СМ_ПозицияЛокальнойСметы"));
	Документы.СМ_ПозицияЛокальнойСметы.ВыполнитьРасчет(ТекОбъект);
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбъект()
	ЭтотОбъект.Записать();
КонецПроцедуры

&НаСервере
Функция ЗапомнитьСтарыйШифр()
	Позиция = Объект.Ссылка.ПолучитьОбъект();
	Возврат(Позиция.ШифрРасценки);
КонецФункции

&НаСервере
Процедура РасчитатьСтоимостьНаОбъем(ИмяПоля = "", ОбъемИзменен = Ложь)
	
	Если ОбъемИзменен И ВводОбъемовВБазовыхЕдИзм Тогда
		Объект.ОбъемРабот = СМ_СметаВызовСервера.ПересчитатьВбазовыхЕдиницахИзмерения(Объект,Объект.ОбъемРабот);
		Если ЗначениеЗаполнено(Объект.ФормулаОбъема) Тогда
			Объект.ФормулаОбъема = СМ_СметаВызовСервера.ПересчитатьФормулаВбазовыхЕдиницахИзмерения(Объект,Объект.ФормулаОбъема);
	        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Проверьте формулу!'"), Объект.Ссылка, "ФормулаОбъема");
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля <> "" Тогда
		ЭтаФорма[ИмяПоля+"1"] = Объект[ИмяПоля]*Объект.ОбъемРабот;
		Возврат;
	КонецЕсли;
	
	ПрямЗатраты1 				= Объект.ПрямЗатраты * Объект.ОбъемРабот;
	ОснЗарплата1 				= Объект.ОснЗарплата * Объект.ОбъемРабот;
	ЭксплМашин1 				= Объект.ЭксплМашин * Объект.ОбъемРабот;
	ЗарплМашинистов1 			= Объект.ЗарплМашинистов * Объект.ОбъемРабот;
	СтоимМатериалов1 			= Объект.СтоимМатериалов * Объект.ОбъемРабот;
	Оборудование1 				= Объект.Оборудование * Объект.ОбъемРабот;
	ВозвратМатер1			 	= Объект.ВозвратМатер * Объект.ОбъемРабот;
	ЗатратыТрудаРабочих1 	 	= Объект.ЗатратыТрудаРабочих * Объект.ОбъемРабот;
	ЗатратыТрудаМашинистов1  	= Объект.ЗатратыТрудаМашинистов * Объект.ОбъемРабот;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьСтоимостьНаФактОбъем(ИмяПоля = "", ОбъемИзменен = Ложь)
	
	Если ОбъемИзменен И ВводОбъемовВБазовыхЕдИзм Тогда
		ФактОбъем = СМ_СметаВызовСервера.ПересчитатьВбазовыхЕдиницахИзмерения(Объект,ФактОбъем);
		Если ЗначениеЗаполнено(ФормулаФактОбъема) Тогда
			ФормулаФактОбъема = СМ_СметаВызовСервера.ПересчитатьФормулаВбазовыхЕдиницахИзмерения(Объект,ФормулаФактОбъема);	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Проверьте формулу!'"), Объект.Ссылка, "ФормулаОбъема");
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля <> "" Тогда
		ЭтаФорма[ИмяПоля+"1"] = Объект[ИмяПоля]*Объект.ОбъемРабот;
		Возврат;
	КонецЕсли;
	
	ПрямЗатраты1 = Объект.ПрямЗатраты * ФактОбъем;
	ОснЗарплата1 = Объект.ОснЗарплата * ФактОбъем;
	ЭксплМашин1 = Объект.ЭксплМашин * ФактОбъем;
	ЗарплМашинистов1 = Объект.ЗарплМашинистов *ФактОбъем;
	СтоимМатериалов1 = Объект.СтоимМатериалов * ФактОбъем;
	Оборудование1 = Объект.Оборудование * ФактОбъем;
	ВозвратМатер1 = Объект.ВозвратМатер * ФактОбъем;
	ЗатратыТрудаРабочих1 = Объект.ЗатратыТрудаРабочих * ФактОбъем;
	ЗатратыТрудаМашинистов1 = Объект.ЗатратыТрудаМашинистов * ФактОбъем;
	// Zbikt
	// При изменении факт объема необходимо менять нормы расходов на объем.
	СтрокаПозиции = СМ_СметаВызовСервера.СтрокаПозицииАкта(Параметры.Акт, Объект.Ссылка);	
	СтарыйФактОбъем = СтрокаПозиции.ФактОбъем;
	Если СтарыйФактОбъем <> 0 Тогда
		КоэффицИзменения = ФактОбъем / СтарыйФактОбъем ; 
	Иначе
		КоэффицИзменения = ФактОбъем; 
	КонецЕсли;	
	ТаблРес = Новый ТаблицаЗначений;
	ТаблРес = ЭтаФорма.РесурсыПозицииАкта.Выгрузить();
	ЭтаФорма.РесурсыПозицииАкта.Очистить();

	Для Каждого СтрокаРесурса Из ТаблРес Цикл
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ресурс",СтрокаРесурса.Ресурс);
		СтруктураОтбора.Вставить("СметныйКодРесурса",СтрокаРесурса.СметныйКодРесурса);
		
		МассивСтрок = Объект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(СтруктураОтбора);
		ТекСтрока = Неопределено;
		Если МассивСтрок.Количество() > 0 Тогда
			ТекСтрока = МассивСтрок[0];	
		КонецЕсли;

		СтрокаРесурса.НормаРасходаОбъем	= ?(ТекСтрока = Неопределено,СтрокаРесурса.НормаРасходаОбъем,ТекСтрока.НормаРасхода) * ФактОбъем;
		СтрокаРесурса.ФактРасходаОбъем	= ?(ТекСтрока = Неопределено,СтрокаРесурса.ФактРасходаОбъем,?(СтрокаРесурса.ФактРасходаОбъем = 0,ТекСтрока.НормаРасхода,СтрокаРесурса.ФактРасходаОбъем)) * КоэффицИзменения;
		СтрокаРесурсаАкта = ЭтаФорма.РесурсыПозицииАкта.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРесурсаАкта,СтрокаРесурса);
	КонецЦикла;
	// Zbikt
	

КонецПроцедуры

&НаСервере
Процедура РассчитатьТекСтоимостиПоАкту()
	Если ЭтаФорма.Параметры.Акт.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
		МассивРесурсов = ЭтаФорма.РесурсыПозицииАкта.НайтиСтроки(Новый Структура("Удален",Ложь));	
		Если  МассивРесурсов.Количество() = 0 Тогда
			ТекущиеПЗФакт1 = ТекущиеПЗФакт * ФактОбъем;
			ТекущиеОЗФакт1 = ТекущиеОЗФакт * ФактОбъем;
			ТекущиеЭМФакт1 = ТекущиеЭМФакт * ФактОбъем;
			ТекущиеЗМФакт1 = ТекущиеЗМФакт * ФактОбъем;
			ТекущиеСМФакт1 = ТекущиеСМФакт * ФактОбъем;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДвиженияВТаблицы()
	
	// Vonokov - ссылки на документы заполняются при создании на сервере.  
	// СУДАРИКОВ - убрал, все вынесено на закладку "Итоги".
	ЛС 		= Объект.ИДСметы;
	Раздел 	= Объект.ИДРодителя;
		
	// sudav - добавлен расчет итогов
	СтруктураИтогов = СМ_СметныйСоставВызовСервера.ПолучитьСтруктуруСИтогамиПозиции(Объект.Ссылка, Раздел, ЛС, ?(Параметры.ПозицияАкта, ФактОбъем, Объект.ОбъемРабот), Объект, Параметры.Акт);
	Если СтруктураИтогов <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, СтруктураИтогов);
	КонецЕсли;
	
	// Обновляем нумерацию.
	Номера = СМ_СметаВызовСервера.ПолучитьНомерДокумента(Объект.Ссылка, "СМ_ПозицияЛокальнойСметы");
	ПорНомер = Номера.ПорНомер;
		
КонецПроцедуры

&НаСервере
Функция ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса()
	
	ТЗ = Объект.РесурсыПозицииЛокальнойСметы.Выгрузить(,"НомерСтроки,Ресурс");
	
	МенВрТаб = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенВрТаб;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.НомерСтроки КАК НомерСтроки,
	               |	ТЗ.Ресурс КАК Ресурс
	               |ПОМЕСТИТЬ ВТРесурсы
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СтоимостьРесурсовПозиции.Количество КАК Количество,
	               |	ВТРесурсы.НомерСтроки,
	               |	ВТРесурсы.Ресурс,
	               |	СтоимостьРесурсовПозиции.НаименованиеРесурса,
	               |	СтоимостьРесурсовПозиции.НомерСтрокиДокумента
	               |ИЗ
	               |	ВТРесурсы КАК ВТРесурсы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_СтоимостьРесурсовПозиции КАК СтоимостьРесурсовПозиции
	               |		ПО ВТРесурсы.Ресурс = СтоимостьРесурсовПозиции.Ресурс
	               |ГДЕ
	               |	СтоимостьРесурсовПозиции.Смета = &Смета
	               |	И СтоимостьРесурсовПозиции.Позиция = &Позиция";
	
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Смета", Объект.ИдСметы);
	Запрос.УстановитьПараметр("Позиция",Объект.Ссылка);
	ТЗИтог = Запрос.Выполнить().Выгрузить();         
	
	Для Каждого СтрокаТаблицы Из Объект.РесурсыПозицииЛокальнойСметы Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("НомерСтрокиДокумента",СтрокаТаблицы.НомерСтроки);
		
		Массив = ТЗИтог.НайтиСтроки(Отбор); 
		
		Если Массив.Количество() = 0 Тогда
			
			// Старый вариант, когда еще нет номера строки документа.
			           
			Отбор = Новый Структура();
			Отбор.Вставить("НомерСтроки",СтрокаТаблицы.НомерСтроки);
		    Отбор.Вставить("НаименованиеРесурса",""+СтрокаТаблицы.НомерСтроки+" "+СтрокаТаблицы.НаименованиеРесурса);
			
			Массив = ТЗИтог.НайтиСтроки(Отбор); 
		
		КонецЕсли;
		
		//СтрТЗ = ТЗИтог.Найти(СтрокаТаблицы.ПолучитьИдентификатор()+1,"НомерСтроки");
		
		//Если Не СтрТЗ = Неопределено Тогда
		Если Массив.Количество() > 0 Тогда
			
			СтрокаТаблицы.Количество = Массив[0].Количество*Объект.ОбъемРабот;
			СтрокаТаблицы.Стоимость = СтрокаТаблицы.Количество*СтрокаТаблицы.ТекущаяЦена;
			
		КонецЕсли;
		
		СтрокаТаблицы.Картинка = СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(СтрокаТаблицы.ТипМатериала, СтрокаТаблицы.ВидРесурса);
		
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из РесурсыПозицииАкта Цикл
		СтрокаТаблицы.Картинка = СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(СтрокаТаблицы.ТипМатериала, СтрокаТаблицы.ВидРесурса);
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из Объект.НачисленияПозиции Цикл
		СтрокаТаблицы.СтандартноеЗначение = СтрокаТаблицы.ЧисловойПараметр.СтандартноеЗначение;
	КонецЦикла;
	

КонецФункции

&НаКлиенте
Процедура РедактироватьФормулу(ИмяРеквизита, ИмяРеквизитаФормулы)
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияФормулы",ЭтаФорма, Новый Структура("ИмяРеквизита, ИмяРеквизитаФормулы",ИмяРеквизита,ИмяРеквизитаФормулы));
	ПараметрыФормы = Новый Структура("ЗначениеЗаполнения",Новый Структура("Формула",Объект[ИмяРеквизитаФормулы]));
	ОткрытьФорму("ОбщаяФорма.СМ_РедакторФормулСмета",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Осуществляет действия после закрытия формы редактирования формулы.
// Параметры:
//   Результат - выбранная формула
//   Параметры - Структура - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияФормулы(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = "" Тогда
		Возврат;
	КонецЕсли;
	
	Объект[Параметры.ИмяРеквизитаФормулы] = Результат;
	Объект[Параметры.ИмяРеквизита] = СМ_СметаКлиент.РасчитатьФормулу(Объект[Параметры.ИмяРеквизитаФормулы]);
	ЭтаФорма[Параметры.ИмяРеквизита+"1"] = Объект[Параметры.ИмяРеквизита] * Объект.ОбъемРабот;
	
КонецПроцедуры

// Осуществляет действия после закрытия формы редактирования формулы текущих затрат акта.
// Параметры:
//   Результат - выбранная формула
//   Параметры - Структура - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыРедактированияФормулыАкта(Результат, Параметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = "" Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[Параметры.ИмяРеквизитаФормулы] = Результат;
	ЭтаФорма[Параметры.ИмяРеквизита] = СМ_СметаКлиент.РасчитатьФормулу(ЭтаФорма[Параметры.ИмяРеквизитаФормулы]);
	ЭтаФорма[Параметры.ИмяРеквизита+"1"] = ЭтаФорма[Параметры.ИмяРеквизита] * ФактОбъем;
	Если  Параметры.ИмяРеквизита <> "ТекущиеПЗФакт" Тогда
		ПересчитатьТекущиеПЗФакт();
	Иначе
		ТекущаяЦенаФакт = ЭтаФорма[Параметры.ИмяРеквизита];
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЧП(Команда)
	ОбновитьЧПНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЧПНаСервере()
	
	Документы.СМ_ПозицияЛокальнойСметы.ЗаполнитьНачисленияПозицииПоУмолчанию(Объект);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиПозицииПоУмолчанию()
	
	Методика1984года = ПолучитьФункциональнуюОпцию("СМ_Методика84Года");
	Если Методика1984года = Истина Тогда Возврат; КонецЕсли;

	Объект.ПоправочныйКоэффициентКСПТекущий = Константы.СМ_ПоправочныйКоэффициентСПТекущий.Получить();
	Объект.ПоправочныйКоэффициентКСПБазисный= Константы.СМ_ПоправочныйКоэффициентСПБазисный.Получить();
	Объект.ПоправочныйКоэффициентКНРТекущий = Константы.СМ_ПоправочныйКоэффициентНРТекущий.Получить();
	Объект.ПоправочныйКоэффициентКНРБазисный= Константы.СМ_ПоправочныйКоэффициентНРБазисный.Получить();
	
	Объект.КоэффициентКНРНаРемонтБазисный 	= Константы.СМ_КоэффициентНРбазисныйРемонт.Получить();
	Объект.КоэффициентКНРНаРемонтТекущий    = Константы.СМ_КоэффициентНРтекущийРемонт.Получить();
	Объект.КоэффициентКСПНаРемонтБазисный   = Константы.СМ_КоэффициентСПбазисныйРемонт.Получить();
	Объект.КоэффициентКСПНаРемонтТекущий    = Константы.СМ_КоэффициентСПтекущийРемонт.Получить(); 
	
	Объект.КоэффициентКНРАЭСБазисный  		= Константы.СМ_КоэффициентНРбазисныйАЭС.Получить(); 
	Объект.КоэффициентКНРАЭСТекущий         = Константы.СМ_КоэффициентНРтекущийАЭС.Получить();
	Объект.КоэффициентКСПАЭСБазисный        = Константы.СМ_КоэффициентСПбазисныйАЭС.Получить();
	Объект.КоэффициентКСПАЭСТекущий         = Константы.СМ_КоэффициентСПтекущийАЭС.Получить();
	
	Объект.КоэффициентКНРУСНБазисный        = Константы.СМ_КоэффициентНРбазисныйУСН.Получить();
	Объект.КоэффициентКНРУСНТекущий         = Константы.СМ_КоэффициентНРтекущийУСН.Получить();
	Объект.КоэффициентКСПУСНБазисный        = Константы.СМ_КоэффициентСПбазисныйУСН.Получить();
	Объект.КоэффициентКСПУСНТекущий         = Константы.СМ_КоэффициентСПтекущийУСН.Получить();
			
КонецПроцедуры

// Эрикос.sudav 05.06.2014
&НаСервере
Процедура ОбновитьНРиСПСервер()
	
	Документы.СМ_ПозицияЛокальнойСметы.ОбновитьНРиСП(Объект, СтруктураПараметровРасчетаЛС);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНРиСПКоманда(Команда)
	
	ОбновитьНРиСПСервер();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСобственную(Команда)
	// Добавить собственнуюпоправку.
	// Эрикос.zbikt 04.06.2014
	Коллекция = Объект.ПоправкиПозиции.Добавить();
	Коллекция.Применить = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоправки(Команда)
	ОбновитьПоправкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПоправкиНаСервере()
	Объект.ПоправкиПозиции.Очистить();
	СМ_СметаВызовСервера.ПолучитьПоправкиПоТехЧастям(Объект.РегиональнаяБаза, Объект.ТипНормативныхСборников, Объект.ШифрРасценки, Объект.ПоправкиПозиции,СтруктураПараметровРасчетаЛС);
КонецПроцедуры

// Эрикос.zbikt 04.06.2014
// Осуществляет действия после закрытия формы выбора поправок.
// Параметры:
//   Результат - выбранная поправка
//   Параметры - Структура - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораПоправок(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("СправочникСсылка.СМ_ПоправкиПоТехническимЧастям") Тогда
		СтруктураПопр = Новый СписокЗначений;
		СтруктураПопр.Добавить(Результат);
		ДобавитьПоправкуИзСправочникаНаСервере(СтруктураПопр);
		ТекДанные = Объект.ПоправкиПозиции.Добавить();
		Для Сч = 1 По СтруктураПопр.Количество() - 1 Цикл
			Представление 			= СтруктураПопр.Получить(Сч).Представление;
			Значение 				= СтруктураПопр.Получить(Сч).Значение;
			ТекДанные.Применить 	= Истина;
			Если Представление = "УсловияПрименения" Тогда
				ТекДанные.УсловияПрименения = Значение;
			ИначеЕсли Представление = "Обоснование" Тогда
				ТекДанные.Обоснование = Значение;
			ИначеЕсли Представление = "КоэффициентКОсновнойЗарплате" Тогда
				ТекДанные.КоэффОЗ = Значение;
			ИначеЕсли Представление = "КоэффициентКЭксплуатацииМашин" Тогда
				ТекДанные.КоэффЭМ = Значение;
			ИначеЕсли Представление = "КоэффициентКЗарплатеМашинистов" Тогда
				ТекДанные.КоэффЗМ = Значение;
			ИначеЕсли Представление = "КоэффициентКСтоимостиМатериалов" Тогда
				ТекДанные.КоэффСМ = Значение;
			ИначеЕсли Представление = "КоэффициентКТрудозатратамРабочих" Тогда
				ТекДанные.КоэффТР = Значение;
			ИначеЕсли Представление = "КоэффициентКТрудозатратамМашинистов" Тогда
				ТекДанные.КоэффТМ = Значение;
			ИначеЕсли Представление = "ДобавитьКПрямымЗатратам" Тогда
				ТекДанные.ДобавПЗ = Значение;
			ИначеЕсли Представление = "ДобавитьКОсновнойЗарплате" Тогда
				ТекДанные.ДобавОЗ = Значение;
			ИначеЕсли Представление = "ДобавитьКЭксплуатацииМашин" Тогда
				ТекДанные.ДобавЭМ = Значение;
			ИначеЕсли Представление = "ДобавитьКЗарплатеМашинистов" Тогда
				ТекДанные.ДобавЗМ = Значение;
			ИначеЕсли Представление = "ДобавитьКСтоимостиМатериалов" Тогда
				ТекДанные.ДобавСМ = Значение;
			ИначеЕсли Представление = "ДобавитьКТрудозатратамРабочих" Тогда
				ТекДанные.ДобавТР = Значение;
			ИначеЕсли Представление = "ДобавитьКТрудозатратам" Тогда
				ТекДанные.ДобавТ = Значение;
			ИначеЕсли Представление = "Справка" Тогда
				ТекДанные.Справка = Значение;
			ИначеЕсли Представление = "ТипПоправки" Тогда
				ТекДанные.ТипПоправки = Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Эрикос.zbikt 04.06.2014
&НаСервереБезКонтекста
Процедура ДобавитьПоправкуИзСправочникаНаСервере(СтруктураПопр)
	// Вставить содержимое обработчика.
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПоправкиПоТехническимЧастям.УсловияПрименения КАК УсловияПрименения,
	|	ПоправкиПоТехническимЧастям.Обоснование КАК Обоснование,
	|	ПоправкиПоТехническимЧастям.КоэффициентКОсновнойЗарплате КАК КоэффициентКОсновнойЗарплате,
	|	ПоправкиПоТехническимЧастям.КоэффициентКЭксплуатацииМашин КАК КоэффициентКЭксплуатацииМашин,
	|	ПоправкиПоТехническимЧастям.КоэффициентКЗарплатеМашинистов КАК КоэффициентКЗарплатеМашинистов,
	|	ПоправкиПоТехническимЧастям.КоэффициентКСтоимостиМатериалов КАК КоэффициентКСтоимостиМатериалов,
	|	ПоправкиПоТехническимЧастям.КоэффициентКТрудозатратамРабочих КАК КоэффициентКТрудозатратамРабочих,
	|	ПоправкиПоТехническимЧастям.КоэффициентКТрудозатратамМашинистов КАК КоэффициентКТрудозатратамМашинистов,
	|	ПоправкиПоТехническимЧастям.ДобавитьКПрямымЗатратам КАК ДобавитьКПрямымЗатратам,
	|	ПоправкиПоТехническимЧастям.ДобавитьКОсновнойЗарплате КАК ДобавитьКОсновнойЗарплате,
	|	ПоправкиПоТехническимЧастям.ДобавитьКЭксплуатацииМашин КАК ДобавитьКЭксплуатацииМашин,
	|	ПоправкиПоТехническимЧастям.ДобавитьКЗарплатеМашинистов КАК ДобавитьКЗарплатеМашинистов,
	|	ПоправкиПоТехническимЧастям.ДобавитьКСтоимостиМатериалов КАК ДобавитьКСтоимостиМатериалов,
	|	ПоправкиПоТехническимЧастям.ДобавитьКТрудозатратамРабочих КАК ДобавитьКТрудозатратамРабочих,
	|	ПоправкиПоТехническимЧастям.ДобавитьКТрудозатратам КАК ДобавитьКТрудозатратам,
	|	ПоправкиПоТехническимЧастям.ТипПоправки КАК ТипПоправки,
	|	ПоправкиПоТехническимЧастям.Справка КАК Справка
	|ИЗ
	|	Справочник.СМ_ПоправкиПоТехническимЧастям КАК ПоправкиПоТехническимЧастям
	|ГДЕ
	|	ПоправкиПоТехническимЧастям.Ссылка = &Ссылка";
	ТекПопр = СтруктураПопр.Получить(0);				   
	Запрос.УстановитьПараметр("Ссылка",ТекПопр.Значение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Инд = 0;
	Для Каждого СтрЗнач Из РезультатЗапроса Цикл
		Для каждого колонка Из РезультатЗапроса.Колонки Цикл
			Наим = Колонка.Имя;
			СтруктураПопр.Добавить(СтрЗнач.Получить(Инд),Колонка.Имя);
			Инд = Инд +1;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

// Эрикос.zbikt 04.06.2014
&НаКлиенте
Процедура ДобавитьПоправкуИзСправочника(Команда)
	// Докторсофт
	НомерСборника = СМ_СметаВызовСервера.ОпределитьНомерСборника(Объект.ТипНормативныхСборников,Объект.ШифрРасценки);
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ТипНормативногоСборника",Объект.ТипНормативныхСборников);
	ПараметрыФормы.Вставить("СметноНормативнаяБаза",Объект.РегиональнаяБаза);
	ПараметрыФормы.Вставить("НомерСборника",НомерСборника);
	ПараметрыФормы.Вставить("ТекущаяСтрока",НайтиПоправку(НомерСборника));
	ОписаниеОЗакрытииФормыВыбораПоправок = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораПоправок",ЭтаФорма, );
	ОткрытьФорму("Справочник.СМ_ПоправкиПоТехническимЧастям.Форма.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораПоправок,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    // Докторсофт
КонецПроцедуры
// Эрикос.zbikt 06.06.2014

// Докторсофт
&НаСервере
Функция НайтиПоправку(НомерСборника)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СправочникСМ_ПоправкиПоТехническимЧастям.Ссылка,
	               |	СправочникСМ_ПоправкиПоТехническимЧастям.Наименование КАК Обоснование,
	               |	ВЫБОР
	               |		КОГДА ВЫБОР
	               |					КОГДА &ОтборНомера
	               |						ТОГДА СправочникСМ_ПоправкиПоТехническимЧастям.НомерСборника = &НомерСборника
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И ВЫБОР
	               |					КОГДА &ОтборТНС
	               |						ТОГДА СправочникСМ_ПоправкиПоТехническимЧастям.СметноНормативнаяБаза = &СметноНормативнаяБаза
	               |					ИНАЧЕ ИСТИНА
	               |				КОНЕЦ
	               |				И СправочникСМ_ПоправкиПоТехническимЧастям.ТипНормативногоСборника = &ТипНормативногоСборника
	               |				И СправочникСМ_ПоправкиПоТехническимЧастям.ЭтоГруппа = ЛОЖЬ
	               |			ТОГДА 0
	               |		ИНАЧЕ 1
	               |	КОНЕЦ КАК Порядок
	               |ИЗ
	               |	Справочник.СМ_ПоправкиПоТехническимЧастям КАК СправочникСМ_ПоправкиПоТехническимЧастям
	               |ГДЕ
	               |	СправочникСМ_ПоправкиПоТехническимЧастям.ЭтоГруппа = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА &ОтборНомера
	               |				ТОГДА СправочникСМ_ПоправкиПоТехническимЧастям.НомерСборника = &НомерСборника
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И ВЫБОР
	               |			КОГДА &ОтборТНС
	               |				ТОГДА СправочникСМ_ПоправкиПоТехническимЧастям.СметноНормативнаяБаза = &СметноНормативнаяБаза
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ
	               |	И СправочникСМ_ПоправкиПоТехническимЧастям.ТипНормативногоСборника = &ТипНормативногоСборника
	               |			И СправочникСМ_ПоправкиПоТехническимЧастям.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок,
	               |	Обоснование";
				  
	НеОтбирать = Истина;
	Запрос.УстановитьПараметр("НомерСборника",НомерСборника); 
	Запрос.УстановитьПараметр("ОтборНомера",?(НомерСборника=0,Ложь,Истина));
	Запрос.УстановитьПараметр("ТипНормативногоСборника",Объект.ТипНормативныхСборников); 
	Запрос.УстановитьПараметр("ОтборТНС",ЗначениеЗаполнено(Объект.ТипНормативныхСборников));
	НеОтбирать = Не ЗначениеЗаполнено(Объект.РегиональнаяБаза);
	Запрос.УстановитьПараметр("СметноНормативнаяБаза",Объект.РегиональнаяБаза); 
	Если НеОтбирать Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		Иначе
			Возврат Неопределено;
		КонецЕсли;	
	КонецЕсли;
КонецФункции
// Докторсофт
&НаКлиенте
Процедура ПоправкиПозицииКоэффПЗПриИзменении(Элемент)
	НовПЗ = Число(Элемент.ТекстРедактирования);
	ТекДанные = Элементы.ПоправкиПозиции.ТекущиеДанные;
	
	Если НовПЗ <> 0 И (ТекДанные.КоэффОЗ <> 0 Или ТекДанные.КоэффСМ <> 0
		Или ТекДанные.КоэффЭМ <> 0 Или ТекДанные.КоэффЗМ <> 0
		Или ТекДанные.КоэффТР <> 0 Или ТекДанные.КоэффТМ <> 0) Тогда 
		ТекДанные.КоэффОЗ = 0;
		ТекДанные.КоэффСМ = 0;
		ТекДанные.КоэффЭМ = 0;
		ТекДанные.КоэффЗМ = 0;
		ТекДанные.КоэффТР = 0;
		ТекДанные.КоэффТМ = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Если задан коэффициент к ПЗ, то к составляющим коэффициенты не задаются!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоправкиПозицииКоэффОЗПриИзменении(Элемент)
	ТекДанные = Элементы.ПоправкиПозиции.ТекущиеДанные;
	ТекПЗ = ТекДанные.КоэффПЗ;
	Если ТекПЗ <> 0 Тогда 
		ТекДанные.КоэффОЗ = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Если задан коэффициент к ПЗ, то к составляющим коэффициенты не задаются!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоправкиПозицииКоэффЭМПриИзменении(Элемент)
	ТекДанные = Элементы.ПоправкиПозиции.ТекущиеДанные;
	ТекПЗ = ТекДанные.КоэффПЗ;
	Если ТекПЗ <> 0 Тогда 
		ТекДанные.КоэффЭМ = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Если задан коэффициент к ПЗ, то к составляющим коэффициенты не задаются!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоправкиПозицииКоэффЗМПриИзменении(Элемент)
	ТекДанные = Элементы.ПоправкиПозиции.ТекущиеДанные;
	ТекПЗ = ТекДанные.КоэффПЗ;
	Если ТекПЗ <> 0 Тогда 
		ТекДанные.КоэффЗМ = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Если задан коэффициент к ПЗ, то к составляющим коэффициенты не задаются!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоправкиПозицииКоэффСМПриИзменении(Элемент)
	ТекДанные = Элементы.ПоправкиПозиции.ТекущиеДанные;
	ТекПЗ = ТекДанные.КоэффПЗ;
	Если ТекПЗ <> 0 Тогда 
		ТекДанные.КоэффСМ = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Если задан коэффициент к ПЗ, то к составляющим коэффициенты не задаются!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоправкиПозицииКоэффТРПриИзменении(Элемент)
	ТекДанные = Элементы.ПоправкиПозиции.ТекущиеДанные;
	ТекПЗ = ТекДанные.КоэффПЗ;
	Если ТекПЗ <> 0 Тогда 
		ТекДанные.КоэффТР = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Если задан коэффициент к ПЗ, то к составляющим коэффициенты не задаются!'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоправкиПозицииКоэффТМПриИзменении(Элемент)
	ТекДанные = Элементы.ПоправкиПозиции.ТекущиеДанные;
	ТекПЗ = ТекДанные.КоэффПЗ;
	Если ТекПЗ <> 0 Тогда 
		ТекДанные.КоэффТМ = 0;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Если задан коэффициент к ПЗ, то к составляющим коэффициенты не задаются!'"));
	КонецЕсли;
КонецПроцедуры
// Эрикос.zbikt 06.06.2014

&НаКлиенте
Процедура ФормулаПЗПриИзменении(Элемент)
	
	Попытка
		ТекФормула = Объект.ФормулаПЗ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаПЗ = ТекФормула;
		Объект.ПрямЗатраты = вычислить(ТекФормула);
	Исключение
		Объект.ПрямЗатраты = 0;
	КонецПопытки;
	
	ПересчитатьПЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаОЗПриИзменении(Элемент)
	Попытка
		ТекФормула = Объект.ФормулаОЗ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаОЗ = ТекФормула;

		Объект.ОснЗарплата = вычислить(ТекФормула);
	Исключение
		Объект.ОснЗарплата = 0;
	КонецПопытки;
	
	ПересчитатьПЗ();

КонецПроцедуры

&НаКлиенте
Процедура ФормулаЭМПриИзменении(Элемент)
	Попытка
		ТекФормула = Объект.ФормулаЭМ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаЭМ = ТекФормула;
		Объект.ЭксплМашин = вычислить(ТекФормула);
	Исключение
		Объект.ЭксплМашин = 0;
	КонецПопытки;
	
	ПересчитатьПЗ();

КонецПроцедуры

&НаКлиенте
Процедура ФормулаЗМПриИзменении(Элемент)
	Попытка
		ТекФормула = Объект.ФормулаЗМ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаЗМ = ТекФормула;
		Объект.ЗарплМашинистов = вычислить(ТекФормула);
	Исключение
		Объект.ЗарплМашинистов = 0;
	КонецПопытки;
		// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("ЗарплМашинистов");

КонецПроцедуры

&НаКлиенте
Процедура ФормулаСМПриИзменении(Элемент)
	Попытка
		ТекФормула = Объект.ФормулаСМ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаСМ = ТекФормула;
		Объект.СтоимМатериалов = вычислить(ТекФормула);
	Исключение
		Объект.СтоимМатериалов = 0;
	КонецПопытки;
	
	ПересчитатьПЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаОбПриИзменении(Элемент)
	Попытка
		ТекФормула = Объект.ФормулаОб;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаОб = ТекФормула;
		Объект.Оборудование = вычислить(ТекФормула);
	Исключение
		Объект.Оборудование = 0;
	КонецПопытки;
		// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("Оборудование");

КонецПроцедуры

&НаКлиенте
Процедура ФормулаВМПриИзменении(Элемент)
	Попытка
		ТекФормула = Объект.ФормулаВМ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаВМ = ТекФормула;
		Объект.ВозвратМатер = вычислить(ТекФормула);
	Исключение
		Объект.ВозвратМатер = 0;
	КонецПопытки;
	// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("ВозвратМатер");
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТРПриИзменении(Элемент)
	Попытка
		ТекФормула = Объект.ФормулаТР;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаТР = ТекФормула;
		Объект.ЗатратыТрудаРабочих = вычислить(ТекФормула);
	Исключение
		Объект.ЗатратыТрудаРабочих = 0;
	КонецПопытки;
	// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("ЗатратыТрудаРабочих");

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТМПриИзменении(Элемент)
	Попытка
		ТекФормула = Объект.ФормулаТМ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаТМ = ТекФормула;
		Объект.ЗатратыТрудаМашинистов = вычислить(ТекФормула);
	Исключение
		Объект.ЗатратыТрудаМашинистов = 0;
	КонецПопытки;
	// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("ЗатратыТрудаМашинистов");
КонецПроцедуры

&НаКлиенте
Процедура ОснЗарплатаПриИзменении(Элемент)
	
	ПересчитатьПЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПЗ()
	
	НоваяПЗ		= Объект.ОснЗарплата + объект.ЭксплМашин + Объект.СтоимМатериалов;
	
	Попытка
		ПЗПоФормуле = Вычислить(объект.ФормулаПЗ);
	Исключение
		ПЗПоФормуле = 0;
	КонецПопытки;
	
	Если НоваяПЗ = 0 Тогда
		объект.ПрямЗатраты = ПЗПоФормуле;
		// Эрикос.zbikt 23.06.2014
		РасчитатьСтоимостьНаОбъем("");
		Возврат;
	КонецЕсли;
	
	Если ПЗПоФормуле = 0 Тогда
		объект.ПрямЗатраты = НоваяПЗ;
		// Эрикос.zbikt 23.06.2014
		РасчитатьСтоимостьНаОбъем("");
		Возврат;
	КонецЕсли;	
	
	Если НоваяПЗ <> ПЗПоФормуле Тогда
		
		ТекстВопроса = НСтр("ru='При расчете по ФОРМУЛЕ значение ПЗ равно: %ПзПоФормуле%, а расчет ПЗ по СОСТАВЛЯЮЩИМ равен: %НоваяПЗ% 
		|Сохранить значение расчета ПЗ по формуле (Кнопка ""Да"") ? Кнопка ""Нет"" оставит расчет ПЗ по составляющим.'");
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%ПзПоФормуле%", Сокрлп(ПзПоФормуле));
		ТекстВопроса = СтрЗаменить(ТекстВопроса, "%НоваяПЗ%", СокрЛП(НоваяПЗ));
		
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Новый Структура("ПЗПоФормуле,НоваяПЗ",ПЗПоФормуле,НоваяПЗ));
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0);
	Иначе
		Объект.ПрямЗатраты = НоваяПЗ;
		РасчитатьСтоимостьНаОбъем("");
	КонецЕсли;	
	
	 	// Эрикос.zbikt 23.06.2014
	 
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОБъект.ПрямЗатраты = Параметры.ПЗПоФормуле;
	Иначе
		Объект.ПрямЗатраты = Параметры.НоваяПЗ;
	КонецЕсли;
	РасчитатьСтоимостьНаОбъем("");
КонецПроцедуры

&НаКлиенте
Процедура ЭксплМашинПриИзменении(Элемент)
	ПересчитатьПЗ();
КонецПроцедуры

&НаКлиенте
Процедура ЗарплМашинистовПриИзменении(Элемент)
	ПересчитатьПЗ();
КонецПроцедуры

&НаКлиенте
Процедура СтоимМатериаловПриИзменении(Элемент)
	ПересчитатьПЗ();
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("Оборудование");
КонецПроцедуры

&НаКлиенте
Процедура ВозвратМатерПриИзменении(Элемент)
	// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("ВозвратМатер");
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыТрудаРабочихПриИзменении(Элемент)
	// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("ЗатратыТрудаРабочих");
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыТрудаМашинистовПриИзменении(Элемент)
	// Эрикос.zbikt 23.06.2014
	РасчитатьСтоимостьНаОбъем("ЗатратыТрудаМашинистов");
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПредупреждениеНаФорме(Текст)
	
	Элементы.ТекстПредупреждения.Видимость = Истина;
	Элементы.ТекстПредупреждения.Доступность = Истина;
	ТекстПредупреждения = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПредупреждениеНаФорме()
	
	Элементы.ТекстПредупреждения.Видимость = Ложь;
	Элементы.ТекстПредупреждения.Доступность = Ложь;
	ТекстПредупреждения = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьВидимостьЭлементовФормы()
	
	СкрытьПредупреждениеНаФорме();
	
	// Sudav - группа Шифр и порядковый номер
	Элементы.ГруппаПорядковыйНомерШифрВерсияРасчетОтмеченаВДереве.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.ПорНомер.Доступность = Ложь;
	
	// Sudav - группа Рег.база и тип сборника
	Элементы.ГруппаРегиональнаяБазаТипНормативныхСборников.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	
	// Sudav - наименование
	Элементы.Наименование.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	
	// Sudav - группа Определитель и Ед.изм.
	Элементы.ГруппаОпределительВидРабот.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.ГруппаЕдиницаИзмеренияИзмеритель.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	
	// Sudav - группа Объемов
	Элементы.ГруппаОбъемРаботФормулаОбъема.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.ГруппаОбъемРаботФормулаОбъема.Видимость = Не Параметры.ПозицияАкта;
	Элементы.ГруппаОбъемРаботФормулаОбъема.Доступность = Не Параметры.ПозицияАкта;
	
	// Sudav - группа Факт Объемов
	Элементы.ГруппаОбъемРаботФормулаОбъемаФакт.ТолькоПросмотр = Ложь;
	Элементы.ГруппаОбъемРаботФормулаОбъемаФакт.Видимость = Параметры.ПозицияАкта;
	Элементы.ГруппаОбъемРаботФормулаОбъемаФакт.Доступность = Параметры.ПозицияАкта;
	
	// Sudav - группа масса	
	Элементы.ГруппаБруттоНеттоТекущаяЦена.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.НеПрименятьИндексы.Видимость 			= (Не ЭтоРабота) И (Не СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньСмета);
	Элементы.НеПрименятьИндексы.Доступность			= (Не ЭтоРабота) И (Не СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньСмета);
	//Объект.НеПрименятьИндексы						= ?(Элементы.НеПрименятьИндексы.Видимость = Ложь,Ложь, Объект.НеПрименятьИндексы);
	                                    		
	Элементы.Демонтаж.Видимость 					= ЭтоРабота;
	Элементы.Демонтаж.Доступность					= ЭтоРабота;
	
	// Sudav - группа тек цена и привязана.
	Элементы.ГруппаПрикреплениеТекущаяЗПМашинистов.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.ПозицияВладелецТекст.Видимость 		= (Не ЭтоРабота) И ЗначениеЗаполнено(Объект.ИДПозицииВладельца);
	Элементы.ПозицияВладелецТекст.Доступность		= (Не ЭтоРабота) И ЗначениеЗаполнено(Объект.ИДПозицииВладельца);
	Элементы.ТекущаяЦена.Видимость 					= (Не ЭтоРабота) И (Не Параметры.ПозицияАкта);
	Элементы.ТекущаяЦена.Доступность				= (Не ЭтоРабота) И (Не Параметры.ПозицияАкта);
	Элементы.ФормулаТекЦены.Видимость 				= (Не ЭтоРабота) И (Не Параметры.ПозицияАкта);
	Элементы.ФормулаТекЦены.Доступность				= (Не ЭтоРабота) И (Не Параметры.ПозицияАкта);	
	Элементы.ТекущаяЗарплатаМашинистов.Видимость 	= (Не ЭтоРабота) И (Не Параметры.ПозицияАкта);
	Элементы.ТекущаяЗарплатаМашинистов.Доступность 	= (Не ЭтоРабота) И (Не Параметры.ПозицияАкта);
	
	// Группа фактической текущей цены.
	Элементы.ГруппаФактическойЦены.Видимость		    = Параметры.ПозицияАкта;
	Элементы.ТекущаяЦенаФакт.Видимость 					= (Не ЭтоРабота) И Параметры.ПозицияАкта;
	Элементы.ТекущаяЦенаФакт.Доступность				= (Не ЭтоРабота) И Параметры.ПозицияАкта;
	Элементы.ФормулаТекЦеныФакт.Видимость 				= (Не ЭтоРабота) И Параметры.ПозицияАкта;
	Элементы.ФормулаТекЦеныФакт.Доступность				= (Не ЭтоРабота) И Параметры.ПозицияАкта;	
	Элементы.ТекущаяЗарплатаМашинистовФакт.Видимость 	= (Не ЭтоРабота) И Параметры.ПозицияАкта;
	Элементы.ТекущаяЗарплатаМашинистовФакт.Доступность 	= (Не ЭтоРабота) И Параметры.ПозицияАкта;

	// Группа пересчета цен.
	Элементы.ГруппаПересчетЦен.Видимость  = (Не Параметры.ПозицияАкта) И (Не ЭтоРабота);
	Элементы.РезультатПересчета.Видимость = Ложь;
	
	Элементы.ПозицияКорректируемая.Видимость 	= ЗначениеЗаполнено(Объект.КорректируетПозицию);
	Элементы.ПозицияКорректируемая.Доступность	= ЗначениеЗаполнено(Объект.КорректируетПозицию);

	// Sudav - закладки.  	
	// Sudav - ГруппаЗатраты.  	
	Элементы.ГруппаЗатратыЛево.ТолькоПросмотр 	= СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.ГруппаЗатратыСред.ТолькоПросмотр 	= СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.ГруппаЗатратыПраво.ТолькоПросмотр 	= СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	// Sudav - ГруппаИтоги - регламентируется ниже.
	// Sudav - ГруппаНРиСП.
	Элементы.ОбновитьНРиСП.Доступность = Не (СуществуютАкты ИЛИ Параметры.РедактированиеЦен);
	Элементы.ГруппаНРиСПГоризонтально.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	
	// ГруппаНРИСПЗУ для Методики ТСН.
	Элементы.ГруппаНРИСП.Видимость 		= Не (СтруктураПараметровРасчетаЛС.МетодикаТСН) И Не (СтруктураПараметровРасчетаЛС.Методика1984);
	Элементы.ГруппаНРИСП.Доступность 	= Не (СтруктураПараметровРасчетаЛС.МетодикаТСН) И Не (СтруктураПараметровРасчетаЛС.Методика1984);

	Элементы.НРИСПЗУ.Видимость 		= (СтруктураПараметровРасчетаЛС.МетодикаТСН) И Не (СтруктураПараметровРасчетаЛС.Методика1984);
	Элементы.НРИСПЗУ.Доступность 	= (СтруктураПараметровРасчетаЛС.МетодикаТСН) И Не (СтруктураПараметровРасчетаЛС.Методика1984);
	Элементы.НРИСПЗУ.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	
	Элементы.Группа1984.Видимость 		= (СтруктураПараметровРасчетаЛС.Методика1984) И Не (СтруктураПараметровРасчетаЛС.МетодикаТСН);
	Элементы.Группа1984.Доступность 	= (СтруктураПараметровРасчетаЛС.Методика1984) И Не (СтруктураПараметровРасчетаЛС.МетодикаТСН);
	Элементы.Группа1984.ТолькоПросмотр 	= СуществуютАкты ИЛИ Параметры.РедактированиеЦен;

	// Sudav - ГруппаРесурсыПозицииЛокальнойСметы.
	Если Параметры.РедактированиеЦен Тогда
		Элементы.РесурсыПозицииЛокальнойСметыКонтекстноеМеню.Доступность = Ложь;
		ДоступностьПодчиненных(Элементы.РесурсыПозицииЛокальнойСметыКонтекстноеМеню.ПодчиненныеЭлементы,Ложь);
		ДоступностьПодчиненных(Элементы.РесурсыПозицииЛокальнойСметыКоманднаяПанель.ПодчиненныеЭлементы,Ложь);
		Элементы.РесурсыПозицииЛокальнойСметыРасчетПоБазису.Доступность = Истина;
		Элементы.РесурсыПозицииЛокальнойСметыРасчетПоТек.Доступность = Истина;
		ПросмотрПодчиненных(Элементы.РесурсыПозицииЛокальнойСметы.ПодчиненныеЭлементы,Истина);
		Элементы.РесурсыПозицииЛокальнойСметыБазиснаяЦена.ТолькоПросмотр = Ложь;
		Элементы.РесурсыПозицииЛокальнойСметыТекущаяЦена.ТолькоПросмотр = Ложь;
		Элементы.РесурсыПозицииЛокальнойСметы.ИзменятьСоставСтрок = Ложь;
	Иначе
		Элементы.РесурсыПозицииЛокальнойСметы.ТолькоПросмотр = СуществуютАкты;
		Элементы.РесурсыПозицииЛокальнойСметыКонтекстноеМеню.Доступность = Не (СуществуютАкты);
		Элементы.РесурсыПозицииЛокальнойСметыКоманднаяПанель.Доступность = Не (СуществуютАкты);
		Элементы.РесурсыПозицииЛокальнойСметы.Доступность = Не (Параметры.ПозицияАкта);
		Элементы.РесурсыПозицииЛокальнойСметы.Видимость = Не (Параметры.ПозицияАкта);
		Элементы.РесурсыПозицииЛокальнойСметыДобавитьПлюсМинусВНБ.Доступность = ?(СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен = "",Ложь,Истина);
	КонецЕсли;	
	
	Элементы.РесурсыПозицииАкта.ТолькоПросмотр 				= Ложь;
	Элементы.РесурсыПозицииАктаКонтекстноеМеню.Доступность 	= Ложь;
	Элементы.РесурсыПозицииАктаКоманднаяПанель.Доступность 	= Ложь;
	Элементы.РесурсыПозицииАкта.Доступность 				= Параметры.ПозицияАкта;
	Элементы.РесурсыПозицииАкта.Видимость 					= Параметры.ПозицияАкта;
	Элементы.ГруппаРесурсыПозицииЛокальнойСметы.Доступность = ЭтоРабота;
	Элементы.ГруппаРесурсыПозицииЛокальнойСметы.Видимость 	= ЭтоРабота;

	Если Объект.РесурсыПозицииЛокальнойСметы.Количество() > 0 И 
		 Объект.ТипНормативныхСборников = ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.Транспортировка") Тогда
		Элементы.ГруппаРесурсыПозицииЛокальнойСметы.Доступность = Истина;
		Элементы.ГруппаРесурсыПозицииЛокальнойСметы.Видимость 	= Истина;
	КонецЕсли;
	
	// Возможно тут нужно ограничить поля (кроме тек цен).
	// Sudav - ГруппаПоправкиПозиции.
	Элементы.ПоправкиПозиции.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.ПоправкиПозицииКонтекстноеМеню.Доступность = Не (СуществуютАкты ИЛИ Параметры.РедактированиеЦен);
	Элементы.ПоправкиПозицииКоманднаяПанель.Доступность = Не (СуществуютАкты ИЛИ Параметры.РедактированиеЦен);
	// Группа текущих стоимостей.
	Элементы.ГруппаСтраницТек.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;

	// Sudav - ГруппаНачисленияПозиции.
	Элементы.НачисленияПозиции.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.НачисленияПозицииКонтекстноеМеню.Доступность = Не (СуществуютАкты ИЛИ Параметры.РедактированиеЦен);
	Элементы.НачисленияПозицииКоманднаяПанель.Доступность = Не (СуществуютАкты);
	// Sudav - ГруппаСоставРабот.
	Элементы.СоставРабот.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.СоставРаботКонтекстноеМеню.Доступность = Не (СуществуютАкты ИЛИ Параметры.РедактированиеЦен);
	Элементы.СоставРаботКоманднаяПанель.Доступность = Не (СуществуютАкты ИЛИ Параметры.РедактированиеЦен);
	Элементы.ГруппаСоставРабот.Видимость = ЭтоРабота;
	Элементы.ГруппаСоставРабот.Доступность = ЭтоРабота; 
	// Sudav - ГруппаКоэффициентыПересчета.
	Элементы.КоэффициентыПересчета.ТолькоПросмотр = СуществуютАкты ИЛИ Параметры.РедактированиеЦен;
	Элементы.КоэффициентыПересчетаКонтекстноеМеню.Доступность = Не (СуществуютАкты ИЛИ Параметры.РедактированиеЦен);
	Элементы.КоэффициентыПересчетаКоманднаяПанель.Доступность = Не (СуществуютАкты ИЛИ Параметры.РедактированиеЦен);
	Элементы.КоэффициентыПересчета.Видимость = Не Параметры.ПозицияАкта;
	Элементы.КоэффициентыПересчета.Доступность = Не Параметры.ПозицияАкта;   	
	Элементы.КоэффициентыПересчетаАкта.ТолькоПросмотр = Ложь;
	Элементы.КоэффициентыПересчетаАктаКонтекстноеМеню.Доступность = Истина;
	Элементы.КоэффициентыПересчетаАктаКоманднаяПанель.Доступность = Истина;
	Элементы.КоэффициентыПересчетаАкта.Видимость = Параметры.ПозицияАкта;
	Элементы.КоэффициентыПересчетаАкта.Доступность = Параметры.ПозицияАкта;
	Элементы.ГруппаКоэффициентыПересчета.Видимость = (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка) И (Не Объект.НеПрименятьИндексы);
	Элементы.ГруппаКоэффициентыПересчета.Доступность = (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка) И (Не Объект.НеПрименятьИндексы);
	
	// Методика 1984 года.
	Если СтруктураПараметровРасчетаЛС.Методика1984 Тогда
		Если СтруктураПараметровРасчетаЛС.РасчетНРиСПотПЗ Тогда
			Если (СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка) И (Не Объект.НеПрименятьИндексы) Тогда
				Элементы.ГруппаКоэффициентыПересчета.Видимость = Не  (СтруктураПараметровРасчетаЛС.БезПримененияКоэффициентов);
				Элементы.ГруппаКоэффициентыПересчета.Доступность = Не  (СтруктураПараметровРасчетаЛС.БезПримененияКоэффициентов);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод Тогда
		Элементы.ГруппаСтраницТек.Видимость = Ложь;
		Элементы.ГруппаСтраницТекФакт.Видимость = Ложь;
	Иначе
		Если Параметры.ПозицияАкта Тогда
			Элементы.ГруппаСтраницТек.Видимость = Ложь;
			МассивРесурсов = ЭтаФорма.РесурсыПозицииАкта.НайтиСтроки(Новый Структура("Удален",Ложь));
			Элементы.ГруппаСтраницТекФакт.ТекущаяСтраница = Элементы.ГруппаСтраницТекФакт.ПодчиненныеЭлементы.ТекущиеРеквизитамиФакт;
			//
			Элементы.ГруппаСтраницТекФакт.ТекущаяСтраница.Видимость = ЭтоРабота;
			Элементы.ГруппаСтраницТекФакт.ТекущаяСтраница.Доступность = ЭтоРабота; 
			//
			Если МассивРесурсов.Количество() = 0  Тогда
				Элементы.ГруппаСтраницТекФакт.ПодчиненныеЭлементы.ТекущиеРеквизитамиФакт.Доступность = Истина;
			Иначе
				Элементы.ГруппаСтраницТекФакт.ПодчиненныеЭлементы.ТекущиеРеквизитамиФакт.Доступность = Ложь;
			КонецЕсли;
		Иначе
			Элементы.ГруппаСтраницТекФакт.Видимость = Ложь;
			Элементы.ГруппаСтраницТек.Видимость = ЭтоРабота;
			Элементы.ГруппаСтраницТек.Доступность = ЭтоРабота; 
			МассивРесурсов = Объект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(Новый Структура("Удален",Ложь));
			Если МассивРесурсов.Количество() = 0 И СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод Тогда
				Элементы.ГруппаСтраницТек.ТекущаяСтраница = Элементы.ГруппаСтраницТек.ПодчиненныеЭлементы.ТекущиеРеквизитами;
			Иначе
				Элементы.ГруппаСтраницТек.ТекущаяСтраница = Элементы.ГруппаСтраницТек.ПодчиненныеЭлементы.ТекущиеРегистром;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// Доступность индексов от метода применения индекса и для позиций только с ПЗ.
	Если Элементы.ГруппаКоэффициентыПересчета.Видимость = Истина И Элементы.ГруппаКоэффициентыПересчета.Доступность = Истина Тогда
		ВидимостьИндексовПересчета();
	КонецЕсли;	

	// sudav - панель формы
	Элементы.ФормаОбновитьПоНормативнойБазе.Видимость =  (Не Параметры.РедактированиеЦен) И (Не СуществуютАкты) И ((ЗначениеЗаполнено(Объект.РегиональнаяБаза)) И (Объект.ТипНормативныхСборников <> ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.Калькуляция")));
	Элементы.ФормаОбновитьПоНормативнойБазе.Доступность = (Не Параметры.РедактированиеЦен) И (Не СуществуютАкты) И ((ЗначениеЗаполнено(Объект.РегиональнаяБаза)) И (Объект.ТипНормативныхСборников <> ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.Калькуляция")));
	Элементы.ФормаПерейтиКНормативнымДанным.Видимость = ((ЗначениеЗаполнено(Объект.РегиональнаяБаза)) И (Объект.ТипНормативныхСборников <> ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.Калькуляция")) И ЗначениеЗаполнено(Объект.ШифрРасценки));
	Элементы.ФормаПерейтиКНормативнымДанным.Доступность = ((ЗначениеЗаполнено(Объект.РегиональнаяБаза)) И (Объект.ТипНормативныхСборников <> ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.Калькуляция")) И ЗначениеЗаполнено(Объект.ШифрРасценки));
	
	// Кнопка "Тех. часть"
	ВидимостьКнопкиТехчасть();
	
	Если (СуществуютАкты И (Не Параметры.ПозицияАкта)) Тогда
		ПоказатьПредупреждениеНаФорме(НСтр("ru='Существуют акты, введенные по данной смете. Позиция не может быть отредактирована!'"));
	КонецЕсли;
		
	ПозицияВладелецТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Привязана к позиции №%1'"), СМ_СметаКлиент.ПолучитьТекстИнформацииОПозиции(Объект.ИДПозицииВладельца));
	ПозицияКорректируемая = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Корректируемая позиция №%1'"), СМ_СметаКлиент.ПолучитьТекстИнформацииОПозиции(Объект.КорректируетПозицию));
	
	Если Параметры.ПозицияАкта Тогда
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Позиция №%1 %2'"), ПорНомер, СМ_СметаКлиент.ПолучитьТекстИнформацииОбАкте(Параметры.Акт, СтруктураПараметровРасчетаЛС, НСтр("ru='акта выполненных работ'")));
	Иначе
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Позиция №%1 %2'"), ПорНомер, СМ_СметаКлиент.ПолучитьТекстИнформацииОСмете(Объект, СтруктураПараметровРасчетаЛС, НСтр("ru='локальной сметы'")));                    
	КонецЕсли;
	
	ОпределитьВидимостьИтогов();
	
	ОпределитьЗаголовкиСтраниц();
	
	Если СметнаяКомпонента = Неопределено Тогда
		Элементы.ФормаОбновитьПоНормативнойБазе.Видимость = Ложь;
		Элементы.ФормаОткрытьТехЧасть.Видимость = Ложь;
		Элементы.ФормаПерейтиКНормативнымДанным.Видимость = Ложь;
		Элементы.РесурсыПозицииЛокальнойСметыДобавитьПлюсМинусВНБ.Видимость = Ложь;
	КонецЕсли;
	
	МассивРесурсов = Объект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(Новый Структура("Удален",Ложь));
	Если МассивРесурсов.Количество() = 0 И СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод Тогда
		Элементы.ГруппаСтраницТек.ТекущаяСтраница = Элементы.ГруппаСтраницТек.ПодчиненныеЭлементы.ТекущиеРеквизитами;
	Иначе
		Элементы.ГруппаСтраницТек.ТекущаяСтраница = Элементы.ГруппаСтраницТек.ПодчиненныеЭлементы.ТекущиеРегистром;
	КонецЕсли;
	
	Если ТолькоПросмотрФормы ИЛИ Параметры.СтатусРедактирования > 0 Тогда
		Для Каждого Элем Из ЭтаФорма.Элементы Цикл
			Если ТипЗнч(Элем) = Тип("ДекорацияФормы") ИЛИ ТипЗнч(Элем) = Тип("ДополнениеЭлементаФормы") ИЛИ Элем = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ТипЗнч(Элем) = Тип("КнопкаФормы") Тогда
				Элем.Доступность = Ложь;
			Иначе
				Элем.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЦикла;
		// ДокторСофт
		ЭтаФорма.КоманднаяПанель.Доступность = Ложь;
	КонецЕсли;
	
	Элементы.СтатусРесурса.Видимость = (ЭтоМатериал(Объект.Определитель) ИЛИ ЭтоОборудование(Объект.Определитель));
	Элементы.НеИзменятьЦены.Видимость = (ЭтоМатериал(Объект.Определитель) ИЛИ ЭтоОборудование(Объект.Определитель));
	
	// Видимость реквизитов "НормаРасхода" и "Количество ресурса"
	Элементы.ГруппаНормаРасхода.Видимость = (ЭтоМатериал(Объект.Определитель) ИЛИ ЭтоОборудование(Объект.Определитель));

	Если Параметры.СтатусРедактирования = 2 Тогда
		Элементы.ГруппаСтраницы.ТолькоПросмотр = Ложь;
		Элементы.СтраницаОсновное.ТолькоПросмотр = Ложь;
		Элементы.ГруппаПорядковыйНомерШифрВерсияРасчетОтмеченаВДереве.ТолькоПросмотр = Ложь;
		Элементы.Расчет.ТолькоПросмотр = Ложь;
	ИначеЕсли Параметры.СтатусРедактирования = 1 Тогда
		Элементы.ГруппаСтраницы.ТолькоПросмотр = Ложь;
		Элементы.СтраницаОсновное.ТолькоПросмотр = Ложь;
		ПросмотрПодчиненных(Элементы.СтраницаОсновное.ПодчиненныеЭлементы,Истина);
		Элементы.ГруппаОбъемРаботФормулаОбъемаФакт.ТолькоПросмотр = Ложь;
		Элементы.ГруппаОбъемРаботФормулаОбъема.ТолькоПросмотр = Ложь;
		Элементы.ФактОбъем.ТолькоПросмотр = Ложь;
		Элементы.ОбъемРабот.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	// Видимость кнопок перехода в справочник ресурсы
	Если ЭтоМатериал(Объект.Определитель) ИЛИ ЭтоОборудование(Объект.Определитель) Тогда
		Элементы.ФормаПерейтиВСправочникРесурсы.Видимость = Истина;	
		// ********************************************************************
		// ++ AVV Ошибки учета ресурсов акта.
		// Для позиций-ресурсов закрыт доступ к редактированию поправок.
		Элементы.ГруппаПоправкиПозиции.ТолькоПросмотр 						= Истина;
		Элементы.ПоправкиПозицииОбновитьПоправки.Доступность 				= Ложь;
		Элементы.ПоправкиПозицииДобавитьСобственную.Доступность				= Ложь;
		Элементы.ПоправкиПозицииДобавитьПоправкуИзСправочника.Доступность 	= Ложь;
		// -- AVV
		// ********************************************************************
	Иначе
		// ********************************************************************
		// ++ AVV Ошибки учета ресурсов акта.
		Элементы.ГруппаПоправкиПозиции.ТолькоПросмотр 						= Ложь;
		Элементы.ПоправкиПозицииОбновитьПоправки.Доступность 				= Истина;
		Элементы.ПоправкиПозицииДобавитьСобственную.Доступность				= Истина;
		Элементы.ПоправкиПозицииДобавитьПоправкуИзСправочника.Доступность 	= Истина;
		// -- AVV
		// ********************************************************************
		Элементы.ФормаПерейтиВСправочникРесурсы.Видимость 	= Ложь;		
	КонецЕсли;	
	
	Если ЭтоРабота(Объект.Определитель,Объект.ТипНормативныхСборников) Тогда
		Элементы.РесурсыПозицииЛокальнойСметыПерейтиВСправочникРесурсыРаб.Видимость = Истина;
		Элементы.РесурсыПозицииЛокальнойСметыКонтекстноеМенюПерейтиВСправочникРесурсыРаб.Видимость = Истина;
	Иначе
		Элементы.РесурсыПозицииЛокальнойСметыПерейтиВСправочникРесурсыРаб.Видимость = Ложь;
		Элементы.РесурсыПозицииЛокальнойСметыКонтекстноеМенюПерейтиВСправочникРесурсыРаб.Видимость = Ложь;
	КонецЕсли;

	// ********************************************************************
	// Не удалять 
	// Видимость кнопки установки цвета, при открытии формы позиции из акта
	//Если Параметры.Свойство("ПозицияАкта") Тогда
	//	Если Параметры.ПозицияАкта Тогда
	//		Элементы.ФормаГруппаПалитраЦветов.Доступность 		= Истина;
	//		Элементы.ФормаГруппаПалитраЦветов.ТолькоПросмотр 	= Ложь;
	//		ЭтаФорма.КоманднаяПанель.Доступность 				= Истина;
	//		Для Каждого ТекКнопка Из Элементы.ФормаГруппаПалитраЦветов.ПодчиненныеЭлементы Цикл
	//			ТекКнопка.Доступность = Истина;
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	// ********************************************************************
		
	// *********************************************
	// ++ AVV Роли в системе
	//Если ЭтоСметчик ИЛИ ЭтоСметчикМатериалы Тогда
	//	Элементы.ШифрРасценки.Доступность 									= Ложь;
	//	Элементы.Наименование.Доступность                               	= Ложь;
	//	Элементы.ТипНормативныхСборников.Доступность                    	= Ложь;
	//	Элементы.Определитель.Доступность                              	 	= Ложь;
	//	Элементы.ЕдиницаИзмерения.Доступность                           	= Ложь;
	//	Элементы.РесурсыПозицииЛокальнойСметыДобавитьЗаРасценку.Доступность = Ложь;
	//	Элементы.РесурсыПозицииЛокальнойСметыВычестьЗаРасценку.Доступность  = Ложь;
	//	Элементы.РесурсыПозицииЛокальнойСметыДобавитьПлюсМинус.Доступность  = Ложь;
	//	Если НЕ ЭтоСметчикМатериалы Тогда
	//		Элементы.РесурсыПозицииЛокальнойСметыБазиснаяЦена.Доступность  	= Ложь;
	//		Элементы.РесурсыПозицииЛокальнойСметыТекущаяЦена.Доступность 	= Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	// -- AVV Роли в системе
	// *********************************************	
	
КонецПроцедуры	

&НаКлиенте
Процедура ДоступностьПодчиненных(СМ_ПодчиненныеЭлементы,ДоступностьЭлемента)
	Для каждого ПодчЭлем Из СМ_ПодчиненныеЭлементы Цикл
		ПодчЭлем.Доступность = ДоступностьЭлемента;
		Если ТипЗнч(ПодчЭлем) = Тип("ГруппаФормы") ИЛИ ТипЗнч(ПодчЭлем) = Тип("СтраницаФормы") Тогда
			ДоступностьПодчиненных(ПодчЭлем.ПодчиненныеЭлементы,ДоступностьЭлемента);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрПодчиненных(СМ_ПодчиненныеЭлементы,Просмотр)
	Для каждого ПодчЭлем Из СМ_ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(ПодчЭлем) = Тип("ДекорацияФормы")
			ИЛИ ТипЗнч(ПодчЭлем) = Тип("КнопкаФормы")
			ИЛИ ТипЗнч(ПодчЭлем) = Тип("ДополнениеЭлементаФормы")
			ИЛИ ПодчЭлем = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПодчЭлем.ТолькоПросмотр = Просмотр;
		Если ТипЗнч(ПодчЭлем) = Тип("ГруппаФормы") ИЛИ ТипЗнч(ПодчЭлем) = Тип("СтраницаФормы") Тогда
			ПросмотрПодчиненных(ПодчЭлем.ПодчиненныеЭлементы,Просмотр);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьИндексовПересчета()
	Если СтруктураПараметровРасчетаЛС.ЭтоИндексыПоЭлементам Тогда
		Если Объект.Оборудование + Объект.ОснЗарплата + Объект.СтоимМатериалов + Объект.ЭксплМашин = 0 И Объект.ПрямЗатраты <> 0 Тогда
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффПолнСтоимРабот.Видимость		 = Истина;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффОборуд.Видимость				 = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффОснЗарплаты.Видимость			 = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффСтоимЗарплатеМашин.Видимость	 = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффСтоимМатериалов.Видимость		 = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффСтоимЭксплМашин.Видимость		 = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаВариантПересчетаЭММ.Видимость		 = Ложь;	
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаВариантПересчетаЭММ.Видимость = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффПолнСтоимРабот.Видимость = Истина;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффОборуд.Видимость		 = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффОснЗарплаты.Видимость	 = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффСтоимЗарплатеМашин.Видимость = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффСтоимМатериалов.Видимость = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффСтоимЭксплМашин.Видимость = Ложь;
		Иначе
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффПолнСтоимРабот.Видимость		  = Ложь;
			Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффПолнСтоимРабот.Видимость = Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффПолнСтоимРабот.Видимость 			= Истина;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффОборуд.Видимость					= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффОснЗарплаты.Видимость 				= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффСтоимЗарплатеМашин.Видимость		= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффСтоимМатериалов.Видимость			= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаКоэффСтоимЭксплМашин.Видимость			= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаВариантПересчетаЭММ.Видимость 			= Ложь;	
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффПолнСтоимРабот.Видимость	= Истина;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффОборуд.Видимость 			= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффОснЗарплаты.Видимость 		= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффСтоимЗарплатеМашин.Видимость = Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффСтоимМатериалов.Видимость 	= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаКоэффСтоимЭксплМашин.Видимость	= Ложь;
		Элементы.ГруппаКоэффициентыПересчета.ПодчиненныеЭлементы.КоэффициентыПересчетаАкта.ПодчиненныеЭлементы.КоэффициентыПересчетаАктаВариантПересчетаЭММ.Видимость 	= Ложь;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьВидимостьИтогов() 
	
	// sudav
	Элементы.ГруппаТекущиеЕдиничныеСтоимостиСИндексами.Видимость = СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка;
	Элементы.ГруппаБазисныеЕдиничныеСтоимости.Видимость = СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод;
	Элементы.ГруппаБазисныеЕдиничныеСтоимостиСПоправками.Видимость = СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод;
	Элементы.ГруппаБазисныеЕдиничныеСтоимостиСНачислениями.Видимость = СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод;
	Элементы.ГруппаТекущиеЕдиничныеСтоимости.Видимость = Истина; 
	Элементы.ГруппаТекущиеЕдиничныеСтоимости.Заголовок = ?(СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод,НСтр("ru='Текущие на единицу'"),НСтр("ru='На единицу'"));
	
	Элементы.ГруппаТекущиеСтоимостиНаОбъемСИндексами.Видимость = СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка;
	Элементы.ГруппаБазисныеСтоимостиНаОбъем.Видимость = СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод;
	Элементы.ГруппаБазисныеСтоимостиНаОбъемСПоправками.Видимость = СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод;
	Элементы.ГруппаБазисныеСтоимостиНаОбъемСНачислениями.Видимость = СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод;
	Элементы.ГруппаТекущиеСтоимостиНаОбъем.Видимость = Истина; 
	Элементы.ГруппаТекущиеСтоимостиНаОбъем.Заголовок = ?(СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод,НСтр("ru='Текущие на объем'"),НСтр("ru='На объем'"));
	
	Элементы.ТекущиеПЗСНачислениями.Шрифт   = Новый Шрифт(Элементы.ТекущиеПЗСИндексами.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеОЗСНачислениями.Шрифт   = Новый Шрифт(Элементы.ТекущиеОЗСНачислениями.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеЭМСНачислениями.Шрифт   = Новый Шрифт(Элементы.ТекущиеЭМСНачислениями.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеЗМСНачислениями.Шрифт   = Новый Шрифт(Элементы.ТекущиеЗМСНачислениями.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеМАТСНачислениями.Шрифт  = Новый Шрифт(Элементы.ТекущиеМАТСНачислениями.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеОБСНачислениями.Шрифт   = Новый Шрифт(Элементы.ТекущиеОБСНачислениями.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеВМАТСНачислениями.Шрифт = Новый Шрифт(Элементы.ТекущиеВМАТСНачислениями.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ЗТРСНачислениями.Шрифт 		= Новый Шрифт(Элементы.ЗТРСНачислениями.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ЗТМСНачислениями.Шрифт 		= Новый Шрифт(Элементы.ЗТМСНачислениями.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	
	Элементы.ТекущиеПЗСНачислениямиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеПЗСНачислениямиНаОбъем.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеОЗСНачислениямиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеОЗСНачислениямиНаОбъем.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеЭМСНачислениямиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеЭМСНачислениямиНаОбъем.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеЗМСНачислениямиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеЗМСНачислениямиНаОбъем.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеМАТСНачислениямиНаОбъем.Шрифт  = Новый Шрифт(Элементы.ТекущиеМАТСНачислениямиНаОбъем.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеОБСНачислениямиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеОБСНачислениямиНаОбъем.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеВМАТСНачислениямиНаОбъем.Шрифт = Новый Шрифт(Элементы.ТекущиеВМАТСНачислениямиНаОбъем.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ЗТРСНачислениямиНаОбъем1.Шрифт 	   = Новый Шрифт(Элементы.ЗТРСНачислениямиНаОбъем1.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ЗТМСНачислениямиНаОбъем1.Шрифт 	   = Новый Шрифт(Элементы.ЗТМСНачислениямиНаОбъем1.Шрифт,,,НЕ СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	
	Элементы.ТекущиеПЗСИндексами.Шрифт   = Новый Шрифт(Элементы.ТекущиеПЗСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеОЗСИндексами.Шрифт 	 = Новый Шрифт(Элементы.ТекущиеОЗСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеЭМСИндексами.Шрифт   = Новый Шрифт(Элементы.ТекущиеЭМСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеЗМСИндексами.Шрифт   = Новый Шрифт(Элементы.ТекущиеЗМСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеМАТСИндексами.Шрифт  = Новый Шрифт(Элементы.ТекущиеМАТСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеОБСИндексами.Шрифт   = Новый Шрифт(Элементы.ТекущиеОБСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеВМАТСИндексами.Шрифт = Новый Шрифт(Элементы.ТекущиеВМАТСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ЗТРСИндексами.Шрифт 		 = Новый Шрифт(Элементы.ЗТРСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ЗТМСИндексами.Шрифт 		 = Новый Шрифт(Элементы.ЗТМСИндексами.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	
	Элементы.ТекущиеПЗСИндексамиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеПЗСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеОЗСИндексамиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеОЗСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеЭМСИндексамиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеЭМСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеЗМСИндексамиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеЗМСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеМАТСИндексамиНаОбъем.Шрифт  = Новый Шрифт(Элементы.ТекущиеМАТСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеОБСИндексамиНаОбъем.Шрифт   = Новый Шрифт(Элементы.ТекущиеОБСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ТекущиеВМАТСИндексамиНаОбъем.Шрифт = Новый Шрифт(Элементы.ТекущиеВМАТСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ЗТРСИндексамиНаОбъем.Шрифт 		= Новый Шрифт(Элементы.ЗТРСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	Элементы.ЗТМСИндексамиНаОбъем.Шрифт 		= Новый Шрифт(Элементы.ЗТМСИндексамиНаОбъем.Шрифт,,,СтруктураПараметровРасчетаЛС.ЭтоБазисноИндексныйУровеньРасценка);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОпределитьЗаголовкиСтраниц() 
	
	// sudav
	Отбор = Новый Структура("Применить", Истина);
	Элементы.ГруппаПоправкиПозиции.Заголовок 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Поправки по тех. частям%1'"), ?(Объект.ПоправкиПозиции.НайтиСтроки(Отбор).Количество(), "*", ""));
	Элементы.ГруппаНачисленияПозиции.Заголовок 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Начисления%1'"			   ), ?(Объект.НачисленияПозиции.Итог("Значение") = Объект.НачисленияПозиции.Итог("СтандартноеЗначение"), "", "*"));
	Элементы.ГруппаКоэффициентыПересчета.Заголовок 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Коэффициенты пересчета%1'" ), ?((Объект.КоэффициентыПересчета.Количество()) ИЛИ (КоэффициентыПересчетаАкта.Количество()), "*", ""));
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ЭтоМатериал(Определитель)
	
	Если Определитель.видРасценки = Перечисления.СМ_ВидыРасценки.Материал Тогда
		Возврат истина;
	Иначе
		Возврат ложь;
	КонецЕсли;	
	
КонецФункции	

&НаСервереБезКонтекста
Функция ЭтоРабота(Определитель,ТипНормативныхСборников)
	
	Если Определитель.видРасценки = Перечисления.СМ_ВидыРасценки.Работа
		И (Не ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаЭксплуатациюМашин
		И Не ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.Транспортировка) Тогда
		Возврат истина;
	Иначе
		Возврат ложь;
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
Процедура ОпределительПриИзменении(Элемент)
	
	ЭтоРабота = ЭтоРабота(Объект.Определитель,Объект.ТипНормативныхСборников);
	
	ОбновитьЧПНаСервере();
	
	ОпределитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = СМ_ЗащитаКлиент.ЗапускОбъекта();
	Если (СтруктураПараметровРасчетаЛС <> Неопределено) И (Не Отказ) Тогда
		ОпределитьВидимостьЭлементовФормы();
	КонецЕсли;
	
	// Элементы.ФормаКнопкаЦветШрифта.Картинка = ПолучитьКартинку();
	Элементы.ФормаГруппаПалитраЦветов.Картинка = ПолучитьКартинку();
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	Если Параметры.ПоказатьРядом Тогда
		ПодключитьОбработчикОжидания("ЗакрепитьСправа",1);
	КонецЕсли;
	
	ФормулаТекЦеныФактПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрепитьСправа()
    Если ЭтаФорма.ВводДоступен() Тогда
        WSHShell = Новый COMОбъект("WScript.Shell");
        WSHShell.SendKeys("%");
        WSHShell.SendKeys("{DOWN 5}");
        WSHShell.SendKeys("{RIGHT}");
        WSHShell.SendKeys("{UP 5}");
        WSHShell.SendKeys("{ENTER}");
        ОтключитьОбработчикОжидания("ЗакрепитьСправа");
		ПодключитьОбработчикОжидания("АктивизируемФормуСметы",0.1,Истина);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АктивизируемФормуСметы() 
	ОткрытыеОкна = ПолучитьОкна();
	Для Каждого ТекОкно Из ОткрытыеОкна Цикл
		Если ТекОкно.Основное ИЛИ ТекОкно.НачальнаяСтраница Тогда
			Продолжить;
		КонецЕсли;
		ФормаОкна = ТекОкно.Содержимое[0];
		Если ЭтаФорма.ВладелецФормы = ФормаОкна Тогда
			ФормаОкна.Активизировать();
		КонецЕсли;
	КонецЦикла;
	ОтключитьОбработчикОжидания("АктивизируемФормуСметы");
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗаРасценку(Команда)
	
	ПараметрыПоиска = СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);
	
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		ПараметрыПоиска.Вставить("ТекРесурс",ТекДанные.Ресурс);
	КонецЕсли;	
	
	ОписаниеОЗакрытииФормыВыбораРесурса = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораРесурсаДобавить",ЭтаФорма,ПараметрыПоиска);
	ОткрытьФорму("Справочник.СМ_Ресурсы.Форма.ФормаВыбора",ПараметрыПоиска,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораРесурса,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// ПоместитьВоВременноеХранилище(ПараметрыПоиска.Ресурс,АдресТаблицыРесурсов);
КонецПроцедуры

&НаКлиенте
Процедура ВынестиЗаРасценку(Команда)
	
	// Вынос позиции за расценку 
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ТекДанные.Удален 			= Истина;
	ЭтаФорма.Модифицированность = Истина;
	
	ПараметрыПоиска 						= СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);
	ПараметрыПоиска.НаименованиеРесурса 	= ТекДанные.НаименованиеРесурса; 
	ПараметрыПоиска.ЕдиницаИзмеренияРесурса = ТекДанные.ЕдиницаИзмеренияРесурса;
	ПараметрыПоиска.Ресурс 					= ТекДанные.Ресурс;
	ПараметрыПоиска.БазиснаяЦена 			= ТекДанные.БазиснаяЦена;
	ПараметрыПоиска.ТекущаяЦена 			= ТекДанные.ТекущаяЦена;
	ПараметрыПоиска.БазиснаяЗарплМаш 		= ТекДанные.БазиснаяЗарплатаМашинистов;
	ПараметрыПоиска.ТекущаяЗарплМаш 		= ТекДанные.ТекущаяЗарплатаМашинистов;
	ПараметрыПоиска.Код 					= ТекДанные.СметныйКодРесурса;
	ПараметрыПоиска.ВидРесурса 				= ТекДанные.ВидРесурса;
	ПараметрыПоиска.ТипМатериала 			= ТекДанные.ТипМатериала;
	ПараметрыПоиска.Норма 					= СтрЗаменить(ТекДанные.НормаРасхода,",",".");
	ПараметрыПоиска.Код 					= ТекДанные.СметныйКодРесурса;
	
	ДобавитьЗаРасценкуНаСервере(ПараметрыПоиска);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаРасценкой(Команда)
	
	// Вставка Позиции минус текущий ресурс 
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	СтарыйРесурс = ТекДанные.Ресурс;
	
	ПараметрыПоиска = СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);
	
	ПараметрыПоиска.НаименованиеРесурса = ТекДанные.НаименованиеРесурса; 
	ПараметрыПоиска.ЕдиницаИзмеренияРесурса = ТекДанные.ЕдиницаИзмеренияРесурса;
	
	ПараметрыПоиска.Ресурс = СтарыйРесурс;
	ПараметрыПоиска.БазиснаяЦена = ТекДанные.БазиснаяЦена;
	ПараметрыПоиска.ТекущаяЦена = ТекДанные.ТекущаяЦена;
	ПараметрыПоиска.БазиснаяЗарплМаш = ТекДанные.БазиснаяЗарплатаМашинистов;
	ПараметрыПоиска.ТекущаяЗарплМаш = ТекДанные.ТекущаяЗарплатаМашинистов;
	ПараметрыПоиска.Код = ТекДанные.СметныйКодРесурса;
	ПараметрыПоиска.ВидРесурса = ТекДанные.ВидРесурса;
	ПараметрыПоиска.ТипМатериала = ТекДанные.ТипМатериала;
	НормаРасхода = СтрЗаменить(ТекДанные.НормаРасхода,",",".");
	ПараметрыПоиска.Норма = -1 * НормаРасхода;
	ПараметрыПоиска.Код = ТекДанные.СметныйКодРесурса;
	
	ДобавитьЗаРасценкуНаСервере(ПараметрыПоиска);

КонецПроцедуры

// Осуществляет действия после закрытия формы выбора ресурса.
// Параметры:
//   Результат - выбранный ресурс
//   ПараметрыПоиска - Структура - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораРесурсаДобавить(Результат, ПараметрыПоиска) Экспорт
	
	Результат = СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(Результат);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыПоиска.Ресурс = Результат;
	ПараметрыПоиска.Вставить("Раздел",Объект.ИДРодителя); 
	ПараметрыПоиска.Вставить("Владелец",Объект); 
	НаименованиеЕдИзм = СокрЛП(Строка(ПараметрыПоиска.ЕдИзм)); 
	Если НаименованиеЕдИзм = "" Тогда
		НаименованиеЕдИзм = ОпеределитьЕдИзм(ПараметрыПоиска.Ресурс);
	КонецЕсли;	
	НаименованиеЕдИзм = НаименованиеЕдИзм +")";
	Подсказка 	= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Введите норму (%1'"),НаименованиеЕдИзм);
	Оповещение 	= Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект,Новый Структура("ПараметрыПоиска,СтарыйРесурс,Результат",ПараметрыПоиска,Неопределено,Результат));
	ПоказатьВводЧисла(Оповещение, 1, Подсказка, 15, 6);
	
КонецПроцедуры

// Осуществляет действия после закрытия формы выбора ресурса.
// Параметры:
//   Результат - выбранный ресурс
//   ПараметрыПоиска - Структура - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыВыбораРесурса(Результат, ПараметрыПоиска) Экспорт  
	
	Результат = СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(Результат);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли; 
	
	СтарыйРесурс = ПараметрыПоиска.Ресурс;
	
	ДобавитьЗаРасценкуНаСервере(ПараметрыПоиска);
	
	ПараметрыПоиска.Норма 	= -1*ПараметрыПоиска.Норма;
	ПараметрыПоиска.Вставить("ТекРесурс",СтарыйРесурс);			
	ПараметрыПоиска.Ресурс 	= Результат;
	ПараметрыПоиска.Вставить("Раздел",Объект.ИДРодителя); 
	ПараметрыПоиска.Вставить("Владелец",Объект); 
	
	НоваяНорма 			= ПараметрыПоиска.Норма;
	НаименованиеЕдИзм 	= СокрЛП(Строка(ПараметрыПоиска.ЕдИзм)); 
	Если НаименованиеЕдИзм = "" Тогда
		НаименованиеЕдИзм = ОпеределитьЕдИзм(ПараметрыПоиска.Ресурс);
	КонецЕсли;	
	НаименованиеЕдИзм 	= НаименованиеЕдИзм +")";
	Подсказка 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Введите норму (%1'"),НаименованиеЕдИзм);
	Оповещение 			= Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект,Новый Структура("ПараметрыПоиска,СтарыйРесурс,Результат",ПараметрыПоиска,СтарыйРесурс,Результат));
	ПоказатьВводЧисла(Оповещение, НоваяНорма, Подсказка, 15, 6);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораРесурсаСНБ(Результат, ПараметрыПоиска)
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтарыйРесурс 			= ПараметрыПоиска.Ресурс;
	ПараметрыПоиска.Норма 	= -1*ПараметрыПоиска.Норма;
	ПараметрыПоиска.Вставить("ТекРесурс",СтарыйРесурс);	
	ПараметрыПоиска.Ресурс 	= Результат;
	ПараметрыПоиска.Вставить("Раздел",Объект.ИДРодителя); 
	ПараметрыПоиска.Вставить("Владелец",Объект); 
	
	НоваяНорма 			= ПараметрыПоиска.Норма;
	НаименованиеЕдИзм 	= СокрЛП(Строка(ПараметрыПоиска.ЕдИзм)); 
	Если НаименованиеЕдИзм = "" Тогда
		НаименованиеЕдИзм = ОпеределитьЕдИзм(ПараметрыПоиска.Ресурс);
	КонецЕсли;	
	НаименованиеЕдИзм 	= НаименованиеЕдИзм +")";
	Подсказка 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Введите норму (%1'"),НаименованиеЕдИзм);
	Оповещение 			= Новый ОписаниеОповещения("ПослеВводаКоличества", ЭтотОбъект,Новый Структура("ПараметрыПоиска,СтарыйРесурс,Результат",ПараметрыПоиска,СтарыйРесурс,Результат));
	ПоказатьВводЧисла(Оповещение, НоваяНорма, Подсказка, 15, 6);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаКоличества(НоваяНорма, Параметры) Экспорт
	Если НЕ НоваяНорма = Неопределено Тогда
		Если Параметры.СтарыйРесурс <> Неопределено Тогда
			СтараяЕдиницаИзмерения = ПолучитьЕдиницуИзмерения(Параметры.СтарыйРесурс);
			НоваяЕдиницаИзмерения =  ПолучитьЕдиницуИзмерения(Параметры.Результат);
			Если СтараяЕдиницаИзмерения <> НоваяЕдиницаИзмерения Тогда
				Состояние(НСтр("ru='Разные единицы измерения ресурсов, проверьте объем в позиции-ресурсе замены'"),100);
				НоваяНорма = ПересчитатьНорму(НоваяНорма,СтараяЕдиницаИзмерения,НоваяЕдиницаИзмерения);	
			КонецЕсли;	
		КонецЕсли;
		Параметры.ПараметрыПоиска.Норма = НоваяНорма;
		// Определение текущих цен из ВБ.
		// Если Автозагрузка цен из ИБ, вызывается модуль определения цен ВБ.
		ПолучитьПравоЗагрузкиТекущихЦен(Параметры.ПараметрыПоиска);
		Если Параметры.ПараметрыПоиска.ЗагружатьТекущиеЦены И ЗначениеЗаполнено(Параметры.ПараметрыПоиска.ФайлСборникаТекущихЦен) Тогда
			СтруктураЦен = Новый Структура();
			СтруктураЦен.Вставить("БазиснаяЦена");
			СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
			СтруктураЦен.Вставить("ТекущаяЦена");
			СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
			Район 						= Параметры.ПараметрыПоиска.Район;
			ИмяФайлаСборникаТекущихЦен 	= Параметры.ПараметрыПоиска.ФайлСборникаТекущихЦен;
			КодРегиональнойБазы 		= Параметры.ПараметрыПоиска.КодРегионаФайлаТекущихЦен; 
			СМ_СметаКлиент.ПолучитьЦеныНовогоРесурса(Параметры.Результат,Район,ИмяФайлаСборникаТекущихЦен,КодРегиональнойБазы,СтруктураЦен); 	
			Параметры.ПараметрыПоиска.ТекущаяЦена 		= СтруктураЦен.ТекущаяЦена;
			Параметры.ПараметрыПоиска.ТекущаяЗарплМаш 	= СтруктураЦен.ТекущаяЗарплатаМашинистов;
		ИначеЕсли Параметры.ПараметрыПоиска.ЗагружатьТекущиеЦены Тогда // Флаг обновление по текущим ценам включен, сборник тек цен не указан. 
			СтруктураЦен = Новый Структура();
			СтруктураЦен.Вставить("БазиснаяЦена",0);
			СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов",0);
			СтруктураЦен.Вставить("ТекущаяЦена",0);
			СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов",0);
		
			//ТекРесурс = ?(ЗначениеЗаполнено(Параметры.ПараметрыПоиска),СМ_СметаВызовСервера.НайтиРесурсПоКоду(Параметры.ПараметрыПоиска),Параметры.ПараметрыПоиска.Ресурс);
			//ТекРесурс = ?(ЗначениеЗаполнено(Параметры.ПараметрыПоиска.Код),СМ_СметаВызовСервера.НайтиРесурсПоКоду(Параметры.ПараметрыПоиска.Код), Параметры.ПараметрыПоиска.Ресурс);
			ТекРесурс 	= Параметры.ПараметрыПоиска.Ресурс;
						
			СМ_СметаВызовСервера.ПолучитьЦеныНовогоРесурса(ТекРесурс,Параметры.ПараметрыПоиска.Район,Параметры.ПараметрыПоиска.РегионДляВыбораЦен,Параметры.ПараметрыПоиска.ДатаТекущихЦен,СтруктураЦен,Истина);						
			Параметры.ПараметрыПоиска.ТекущаяЦена 		= СтруктураЦен.ТекущаяЦена;
			Параметры.ПараметрыПоиска.ТекущаяЗарплМаш 	= СтруктураЦен.ТекущаяЗарплатаМашинистов;			
		КонецЕсли;
		ДобавитьЗаРасценкуНаСервере(Параметры.ПараметрыПоиска, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОпеределитьЕдИзм(ТекРесурс)
	Наим = "";
	Если ТекРесурс <> Неопределено Тогда
		Наим = СокрЛП(Строка(ТекРесурс.ЕдиницаИзмерения));
	КонецЕсли;	
	Возврат Наим;
КонецФункции

&НаСервере
Процедура ДобавитьЗаРасценкуНаСервере(СтруктураОписанияРесурса, ОбновитьПоВнутреннемуСправочнику = Ложь)
	
	Позиция = РеквизитФормыВЗначение("Объект");
	
	ПолучитьОписаниеРесурса(СтруктураОписанияРесурса); 
	
	Если СтруктураОписанияРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих
		Или СтруктураОписанияРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ресурсы затраты труда не являются самостоятельной расценкой'"));
		Возврат;
	КонецЕсли;
	
	СМ_СметаВызовСервера.СоздатьПозициюНеучтенныйРесурс(Позиция, СтруктураОписанияРесурса, СтруктураПараметровРасчетаЛС);
	
	ЗначениеВДанныеФормы(Позиция, Объект);
	
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииЛокальнойСметыРесурсПриИзменении(Элемент)
	
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	НовыйРесурс = ТекДанные.Ресурс;
	ПараметрыПоиска = СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);
	ПараметрыПоиска.Ресурс = НовыйРесурс;
	
	// Получить данные о ресурсе
	ПолучитьОписаниеРесурса(ПараметрыПоиска);
	
	ТекДанные.НаименованиеРесурса = ПараметрыПоиска.НаименованиеРесурса;
	ТекДанные.ЕдиницаИзмеренияРесурса = ПараметрыПоиска.ЕдиницаИзмеренияРесурса;

	ТекДанные.СметныйКодРесурса = ПараметрыПоиска.Код;
	ТекДанные.ВидРесурса = ПараметрыПоиска.ВидРесурса;
	ТекДанные.БазиснаяЦена = ПараметрыПоиска.БазиснаяЦена;
	ТекДанные.БазиснаяЗарплатаМашинистов = ПараметрыПоиска.БазиснаяЗарплМаш;
	ТекДанные.ТекущаяЦена = ПараметрыПоиска.ТекущаяЦена;
	ТекДанные.ТекущаяЗарплатаМашинистов = ПараметрыПоиска.ТекущаяЗарплМаш;
	ТекДанные.ТипМатериала = ПараметрыПоиска.ТипМатериала;
	ТекДанные.Добавлен = Истина;
	
	// Если автозагрузка цен из ИБ, то вызывается модуль определения цен ВБ. 
	ПолучитьПравоЗагрузкиТекущихЦен(ПараметрыПоиска);
	Если ПараметрыПоиска.ЗагружатьТекущиеЦены И ЗначениеЗаполнено(ПараметрыПоиска.ФайлСборникаТекущихЦен) Тогда
		СтруктураЦен = Новый Структура();
		СтруктураЦен.Вставить("БазиснаяЦена");
		СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
		СтруктураЦен.Вставить("ТекущаяЦена");
		СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
		Район = ПараметрыПоиска.Район;
		ИмяФайлаСборникаТекущихЦен = ПараметрыПоиска.ФайлСборникаТекущихЦен;
		КодРегиональнойБазы = ПараметрыПоиска.КодРегионаФайлаТекущихЦен; 
		СМ_СметаКлиент.ПолучитьЦеныНовогоРесурса(НовыйРесурс,Район,ИмяФайлаСборникаТекущихЦен,КодРегиональнойБазы,СтруктураЦен); 	
		ТекДанные.ТекущаяЦена = СтруктураЦен.ТекущаяЦена;
		ТекДанные.ТекущаяЗарплатаМашинистов = СтруктураЦен.ТекущаяЗарплатаМашинистов;
	КонецЕсли;
	
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьОписаниеРесурса(СтруктураОписанияРесурса,БезВызова = Ложь)
	// Для выбора цен из справочника(регистра сведений).
	СтруктураОписанияРесурса.Район = СтруктураПараметровРасчетаЛС.Район;
	СтруктураОписанияРесурса.ДатаТекущихЦен = СтруктураПараметровРасчетаЛС.ДатаТекущихЦен;
	СтруктураОписанияРесурса.ФайлСборникаТекущихЦен = СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен ;
	СтруктураОписанияРесурса.КодРегионаФайлаТекущихЦен = СтруктураПараметровРасчетаЛС.КодРегионаФайлаТекущихЦен;
	Если СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен = "" Тогда
		СтруктураОписанияРесурса.ЗагружатьТекущиеЦены = СтруктураПараметровРасчетаЛС.АвтозагрузкаЦен;
	Иначе
		СтруктураОписанияРесурса.ЗагружатьТекущиеЦены = Ложь;
	КонецЕсли;
	СМ_СметаВызовСервера.ПолучитьОписаниеРесурса(СтруктураОписанияРесурса);
КонецПроцедуры

&НаСервере
Процедура ПолучитьПравоЗагрузкиТекущихЦен(СтруктураОписанияРесурса)
	// Для выбора цен из ВБ.
	СтруктураОписанияРесурса.ЗагружатьТекущиеЦены = СтруктураПараметровРасчетаЛС.АвтозагрузкаЦен;
	СтруктураОписанияРесурса.ФайлСборникаТекущихЦен = СтруктураПараметровРасчетаЛС.ФайлСборникаТекущихЦен ;
	СтруктураОписанияРесурса.Район = СтруктураПараметровРасчетаЛС.Район;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПлюсМинус(Команда)
	
	// Вставка Позиции минус текущий ресурс 
	ТекДанные 		= Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	СтарыйРесурс 	= ТекДанные.Ресурс;
	Позиция 		= Объект;
	НормаРасхода 	= СтрЗаменить(ТекДанные.НормаРасхода,",",".");
	ПараметрыПоиска = СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Позиция);
	
	ПараметрыПоиска.НаименованиеРесурса 	= ТекДанные.НаименованиеРесурса; 
	ПараметрыПоиска.ЕдиницаИзмеренияРесурса = ТекДанные.ЕдиницаИзмеренияРесурса;
	ПараметрыПоиска.Ресурс 					= СтарыйРесурс;
	ПараметрыПоиска.БазиснаяЦена 			= ТекДанные.БазиснаяЦена;
	ПараметрыПоиска.ТекущаяЦена 			= ТекДанные.ТекущаяЦена;
	ПараметрыПоиска.БазиснаяЗарплМаш 		= ТекДанные.БазиснаяЗарплатаМашинистов;
	ПараметрыПоиска.ТекущаяЗарплМаш 		= ТекДанные.ТекущаяЗарплатаМашинистов;
	ПараметрыПоиска.Код 					= ТекДанные.СметныйКодРесурса;
	ПараметрыПоиска.ВидРесурса 				= ТекДанные.ВидРесурса;
	ПараметрыПоиска.ТипМатериала 			= ТекДанные.ТипМатериала;
	ПараметрыПоиска.НеИндексировать 		= Истина;
	ПараметрыПоиска.Норма 					= -1 * НормаРасхода;
	ПараметрыПоиска.Вставить("СметныйКодРесурса",ТекДанные.СметныйКодРесурса);
	ПараметрыПоиска.Вставить("ТекРесурс",СтарыйРесурс);

	// Вставка  Позиции плюс из справочника
	ОписаниеОЗакрытииФормыВыбораРесурса = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораРесурса",ЭтаФорма,ПараметрыПоиска );
	ОткрытьФорму("Справочник.СМ_Ресурсы.Форма.ФормаВыбора",ПараметрыПоиска,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораРесурса,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемРаботПриИзменении(Элемент)
	
	НовыйОбъем = Объект.ОбъемРабот;	
	Если НовыйОбъем < Параметры.ОбъемВсегоБезАкта И Параметры.ОбъемВсегоБезАкта > 0 Тогда
		СтарыйОбъем 		= СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Объект.Ссылка, "ОбъемРабот");
		Объект.ОбъемРабот 	= СтарыйОбъем;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Введенный объем работ меньше выполненного!'"));
		Возврат;
	КонецЕсли;

	РасчитатьСтоимостьНаОбъем("", Истина);
	СМ_СметаКлиентСервер.РассчитатьКоличествоРесурса(Объект);
	
	//**********************************************************
	// ++ AVV
	Если ЗначениеЗаполнено(Объект.ФормулаОбъема) Тогда
		
		ТекФормула = Объект.ФормулаОбъема;
		
		// Поиск и подстановка параметров в формулу из ЛС
		МассивПараметров = СМ_СметаКлиентСервер.ПолучитьСписокПараметровФормулы(Объект.ФормулаОбъема);
		Если МассивПараметров.Количество() > 0 Тогда
			//СтруктураПараметров = СМ_СметаКлиентСервер.ЗаполнитьЗначенияПараметров(МассивПараметров,Объект.ИДСметы);
			СтруктураПараметров = ЗаполнитьЗначенияПараметров(МассивПараметров);
			ТекФормула			= СМ_СметаКлиентСервер.ПодставитьПараметрыВФормулу(ТекФормула,СтруктураПараметров);
		КонецЕсли;
		
		Попытка
			ТекФормула 	= СтрЗаменить(ТекФормула,",",".");
			Формула 	= "ТекОбъем = " + ТекФормула+"; Объект.ОбъемРабот = ТекОбъем;";
			Выполнить(Формула);
		
			Если Объект.ОбъемРабот <> НовыйОбъем Тогда
				Объект.ОбъемРабот = НовыйОбъем;
				Если Объект.НормаРасходаРесурса = 1 Тогда
					Объект.ФормулаОбъема = "";	
				Иначе
					Объект.ФормулаОбъема = "" + Объект.НормаРасходаРесурса + "*" + Объект.КоличествоРесурса;		
				КонецЕсли;
				ФормулаИзменена = Истина;
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка в формуле, объем не изменен'"));
		КонецПопытки;

	КонецЕсли;	
	// -- AVV
	//**********************************************************

	Если ЗначениеЗаполнено(Объект.Ссылка) И СМ_СметаВызовСервера.ЕстьПривязанныеПозиции(Объект.Ссылка) Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбъем", ЭтаФорма);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Изменять пропорционально объем привязанных позиций?';"
		+ " en = 'Do you want to continue?'"), Режим, 0);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НормаРасходаРесурсаПриИзменении(Элемент)
	
	СМ_СметаКлиентСервер.РассчитатьКоличествоРесурса(Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбъем(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;
	НовыйОбъем 	= Объект.ОбъемРабот;	
	СтарыйОбъем = СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Объект.Ссылка, "ОбъемРабот");
	ВыполнитьПересчетПривязанныхПозиций(НовыйОбъем,СтарыйОбъем);
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПересчетПривязанныхПозиций(НовыйОбъем,СтарыйОбъем)
	
	СМ_СметаРасчетСервер.ВыполнитьПересчетПривязанныхПозиций(Объект.Ссылка,НовыйОбъем,СтарыйОбъем);
	
КонецПроцедуры

// Эрикос.zbikt 25.06.2014

&НаКлиенте
Процедура ЗаменаРесурсаИзНС(Команда)
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	СтарыйРесурс = ТекДанные.Ресурс;
	Ресурсы = Новый Структура();
	Ресурсы.Вставить("СтарыйРесурс", СтарыйРесурс);
	Ресурсы.Вставить("НормаРасходаСтарогоМатериала", ТекДанные.НормаРасхода);
	Ресурсы.Вставить("БазиснаяЦенаСтарогоМатериала", ТекДанные.БазиснаяЦена);
	Ресурсы.Вставить("ТекущаяЦенаСтарогоМатериала", ТекДанные.ТекущаяЦена);
	Ресурсы.Вставить("БазисЗарплМашСтарРесурс", ТекДанные.БазиснаяЗарплатаМашинистов);
	Ресурсы.Вставить("ТекЗарплМашСтарРесурс", ТекДанные.ТекущаяЗарплатаМашинистов);

	ПараметрыПоиска = СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);  
	ПараметрыПоиска.Вставить("ЗаменяемыйРесурс",Ресурсы);
	ПолучитьОписаниеРесурса(ПараметрыПоиска,Истина);
	ПараметрыПоиска.Вставить("ТекРесурс",СтарыйРесурс);
	ПараметрыПоиска.Вставить("МестоЗамены","НС");
	ОписаниеОЗакрытииФормыВыбораРесурса = Новый ОписаниеОповещения("ПриЗакрытииФормыЗаменыРесурса",ЭтаФорма,ПараметрыПоиска );
	ОткрытьФорму("Справочник.СМ_НормативныеСборники.Форма.ФормаВыбора",,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораРесурса,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	СтарыйРесурс = ТекДанные.Ресурс;
	Ресурсы = Новый Структура();
	Ресурсы.Вставить("СтарыйРесурс", СтарыйРесурс);
	Ресурсы.Вставить("НормаРасходаСтарогоМатериала", ТекДанные.НормаРасхода);
	Ресурсы.Вставить("БазиснаяЦенаСтарогоМатериала", ТекДанные.БазиснаяЦена);
	Ресурсы.Вставить("ТекущаяЦенаСтарогоМатериала", ТекДанные.ТекущаяЦена);
	Ресурсы.Вставить("БазисЗарплМашСтарРесурс", ТекДанные.БазиснаяЗарплатаМашинистов);
	Ресурсы.Вставить("ТекЗарплМашСтарРесурс", ТекДанные.ТекущаяЗарплатаМашинистов);

	ПараметрыПоиска = СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);  
	ПараметрыПоиска.Вставить("ЗаменяемыйРесурс",Ресурсы);
	ПолучитьОписаниеРесурса(ПараметрыПоиска,Истина);
	ПараметрыПоиска.Вставить("ТекРесурс",СтарыйРесурс);
	ПараметрыПоиска.Вставить("МестоЗамены","Ресурсы");
	ОписаниеОЗакрытииФормыВыбораРесурса = Новый ОписаниеОповещения("ПриЗакрытииФормыЗаменыРесурса",ЭтаФорма,ПараметрыПоиска );
	ОткрытьФорму("Справочник.СМ_Ресурсы.Форма.ФормаВыбора",ПараметрыПоиска,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораРесурса,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Процедура осуществляет действия после закрытия формы выбора ресурса при замене.
// ПАРАМЕТРЫ:
//// Результат - выбранный ресурс.
//// ПараметрыПоиска - дополнительные параметры переданные при формировании вопроса пользователю.
&НаКлиенте
Процедура ПриЗакрытииФормыЗаменыРесурса(Результат, ПараметрыПоиска) Экспорт
	
	Результат = СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(Результат);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПоиска.МестоЗамены = "Ресурсы" Тогда
		ТаблРесурсы = ПараметрыПоиска.ЗаменяемыйРесурс;
		СтарыйРесурс = ТаблРесурсы.СтарыйРесурс;
		
		ТаблРесурсы.Вставить("НовыйРесурс", Результат);
		
		ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
		ТекДанные.Ресурс = Результат;
		ПараметрыПоиска.Ресурс = Результат;
		
		СМ_СметаВызовСервера.ПолучитьОписаниеРесурса(ПараметрыПоиска);
		
		ТекДанные.НаименованиеРесурса = ПараметрыПоиска.НаименованиеРесурса;
		ТекДанные.ЕдиницаИзмеренияРесурса = ПараметрыПоиска.ЕдиницаИзмеренияРесурса;
		ТекДанные.Заменен = Истина;
		ТекДанные.СметныйКодРесурса = ПараметрыПоиска.Код;
		ТекДанные.ВидРесурса = ПараметрыПоиска.ВидРесурса;
		ТекДанные.БазиснаяЦена = ПараметрыПоиска.БазиснаяЦена;
		ТекДанные.БазиснаяЗарплатаМашинистов = ПараметрыПоиска.БазиснаяЗарплМаш;
		ТекДанные.ТекущаяЦена = ПараметрыПоиска.ТекущаяЦена;
		ТекДанные.ТекущаяЗарплатаМашинистов = ПараметрыПоиска.ТекущаяЗарплМаш;
		ТекДанные.ТипМатериала = ПараметрыПоиска.ТипМатериала;
		Если Не СметнаяКомпонента = Неопределено Тогда
			// Если Автозагрузка цен из ИБ , вызывается модуль определения цен ВБ 
			ПолучитьПравоЗагрузкиТекущихЦен(ПараметрыПоиска);
			Если  ПараметрыПоиска.ЗагружатьТекущиеЦены И ЗначениеЗаполнено(ПараметрыПоиска.ФайлСборникаТекущихЦен) Тогда
				СтруктураЦен = Новый Структура();
				СтруктураЦен.Вставить("БазиснаяЦена");
				СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
				СтруктураЦен.Вставить("ТекущаяЦена");
				СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
				Район = ПараметрыПоиска.Район;
				ИмяФайлаСборникаТекущихЦен = ПараметрыПоиска.ФайлСборникаТекущихЦен;
				КодРегиональнойБазы = ПараметрыПоиска.КодРегионаФайлаТекущихЦен; 
				СМ_СметаКлиент.ПолучитьЦеныНовогоРесурса(Результат,Район,ИмяФайлаСборникаТекущихЦен,КодРегиональнойБазы,СтруктураЦен); 	
				ТекДанные.ТекущаяЦена = СтруктураЦен.ТекущаяЦена;
				ТекДанные.ТекущаяЗарплатаМашинистов = СтруктураЦен.ТекущаяЗарплатаМашинистов;
			КонецЕсли;
		КонецЕсли;
		АдресХранилищаЗамен = ПоместитьВоВременноеХранилище(ТаблРесурсы, Новый УникальныйИдентификатор());
	ИначеЕсли ПараметрыПоиска.МестоЗамены = "НС" Тогда
		ТаблРесурсы = ПараметрыПоиска.ЗаменяемыйРесурс;
		СтарыйРесурс = ТаблРесурсы.СтарыйРесурс;
		ПараметрыПоиска.Вставить("ПозицияРесурса",Объект.Ссылка);
		СМ_СметаВызовСервера.ЗаполнитьДанныеРесурса(Результат,ПараметрыПоиска);
		ТаблРесурсы.Вставить("НовыйРесурс",ПараметрыПоиска.Ресурс);
		ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
		ДопПараметры = Новый Структура("ПараметрыПоиска,ТаблРесурсы,ТекДанные",ПараметрыПоиска,ТаблРесурсы,ТекДанные);
		Определитель = ПараметрыПоиска.Определитель;
		ВидРасценки = СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Определитель,"ВидРасценки");
		Если ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Транспортировка")
			ИЛИ ВидРасценки = ПредопределенноеЗначение("Перечисление.СМ_ВидыРасценки.Работа") Тогда
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("Продолжить_ПолучитьЗаменуРесурса", ЭтаФорма, ДопПараметры);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Выбран не материал. Продолжить?';"
			+ " en = 'Do you want to continue?'"), Режим, 0);
		Иначе
			Продолжить_ПолучитьЗаменуРесурса(КодВозвратаДиалога.Да, ДопПараметры);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура продолжает обработку выбранного значения замены. 
//
// Параметры:
//     Структура - набор необходимых параметров.
//
Процедура Продолжить_ПолучитьЗаменуРесурса(Результат, Структура) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
    КонецЕсли;
	
	ПараметрыПоиска = Структура.ПараметрыПоиска;
	ТекДанные = Структура.ТекДанные;
	ТаблРесурсы = Структура.ТаблРесурсы;
	ТекДанные.Ресурс = ТаблРесурсы.НовыйРесурс;
	
	ТекДанные.НаименованиеРесурса = ?(ТипЗнч(ПараметрыПоиска.Ресурс) = Тип("СправочникСсылка.СМ_Ресурсы"),ПараметрыПоиска.Ресурс.ДлинноеНаименование,ПараметрыПоиска.Ресурс);
	ТекДанные.ЕдиницаИзмеренияРесурса = ПараметрыПоиска.ЕдиницаИзмерения;
	ТекДанные.Заменен = Истина;
	ТекДанные.СметныйКодРесурса = ?(ТипЗнч(ПараметрыПоиска.Ресурс) = Тип("СправочникСсылка.СМ_Ресурсы"),СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(ПараметрыПоиска.Ресурс,"Код"),ПараметрыПоиска.ШифрРасценки);
	ВидРесурса = ?(ТипЗнч(ПараметрыПоиска.Ресурс) = Тип("СправочникСсылка.СМ_Ресурсы"),СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(ПараметрыПоиска.Ресурс,"ВидРесурса"),СМ_СметаЗагрузкаВызовСервера.ОпределитьВидРесурсаПоШифру(ПараметрыПоиска.ШифрРасценки));
	ТекДанные.ВидРесурса = ВидРесурса;
	ТекДанные.БазиснаяЦена = ПараметрыПоиска.БазисЦена;
	ТекДанные.БазиснаяЗарплатаМашинистов = ПараметрыПоиска.БазисЗарплМаш;
	ТекДанные.ТекущаяЦена = ПараметрыПоиска.ТекЦена;
	ТекДанные.ТекущаяЗарплатаМашинистов = ПараметрыПоиска.ТекЗарплМаш;
	ТекДанные.ТипМатериала = ПредопределенноеЗначение("Перечисление.СМ_ТипыМатериалов.Учтенный");

	АдресХранилищаЗамен = ПоместитьВоВременноеХранилище(ТаблРесурсы, Новый УникальныйИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииЛокальнойСметыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	УдалитьРесурсы(Неопределено);
	Возврат;
	// Эрикос.zbikt 26.06.2014
	ТекРесурс = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные.Ресурс;
	Ресурсы = Новый Структура();
	Ресурсы.Вставить("СтарыйРесурс", ТекРесурс);
	Ресурсы.Вставить("НовыйРесурс");
	АдресХранилищаЗамен = ПоместитьВоВременноеХранилище(Ресурсы, Новый УникальныйИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура РасчетПоТек(Команда)
	// Эрикос.zbikt 07.07.2014
	// Расчет составляющих прямых затрат по текущим ценам составляющих позицию ресурсов.
	РасчетПоЦенамРесурсовНаСервере(Ложь); 
	РасчитатьСтоимостьНаОбъем();
	РасчитатьТекСтоимостьНаОбъем();
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
КонецПроцедуры

&НаКлиенте
Процедура РасчетПоБазису(Команда)
	// Эрикос.zbikt 07.07.2014
	// Расчет составляющих прямых затрат по баз.ценам составляющих позицию ресурсов.
	РасчетПоЦенамРесурсовНаСервере(Истина);
	РасчитатьСтоимостьНаОбъем();
	РасчитатьТекСтоимостьНаОбъем();
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
КонецПроцедуры

&НаСервере
Процедура РасчетПоЦенамРесурсовНаСервере(ПоБазису)
	
	// Эрикос.zbikt 07.07.2014
	Позиция = РеквизитФормыВЗначение("Объект");
		
	ВариантРасчетаЗМ = СтруктураПараметровРасчетаЛС.ВариантРасчетаЗМ;
	Если ВариантРасчетаЗМ.пустая() Тогда
		ВариантРасчетаЗМ = Перечисления.СМ_ВариантыРасчетаЗМ.Расчетный;
	КонецЕсли;	
	КЧ = Новый КвалификаторыЧисла(20,6);
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
	
	ТаблЕдСтоим = Новый ТаблицаЗначений;
	ТаблЕдСтоим.Колонки.Добавить("ПрямЗатраты",		ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("ОснЗарплата",		ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("ЭксплМашин",		ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("ЗарплМашинистов",		ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("СтоимМатериалов",		ОписаниеТиповЧ);
	ТаблЕдСтоим.Колонки.Добавить("ЗатратыТрудаРабочих",		ОписаниеТиповЧ);
	
	// По базисным (текущим) ценам рассчитываем единичные составляющие прямых затрат.
	СМ_СметаРасчетБазисноИндексныйСервер.РасчетЕдиничныхЗначенийСоставляющих(Позиция,ВариантРасчетаЗМ,ТаблЕдСтоим,ПоБазису);
	Для Каждого Значения Из ТаблЕдСтоим Цикл
		Позиция.ПрямЗатраты = Значения.ПрямЗатраты;
		Позиция.СтоимМатериалов = Значения.СтоимМатериалов;
		Позиция.ЭксплМашин = Значения.ЭксплМашин;
		Позиция.ЗарплМашинистов = Значения.ЗарплМашинистов;
		Позиция.ОснЗарплата = Значения.ОснЗарплата;
		Позиция.ЗатратыТрудаРабочих = Значения.ЗатратыТрудаРабочих;
		Позиция.ЗатратыТрудаМашинистов = Позиция.ЗатратыТрудаМашинистов;
		// При изменении ресурсной части позиции мы не можем откорректировать затраты труда машинистов.
	КонецЦикла;
	ЗначениеВДанныеФормы(Позиция, Объект);
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.КоэффициентыПересчета.ТекущиеДанные;
	
	Если НоваяСтрока И (ТекДанные<>Неопределено) И (Не ЗначениеЗаполнено(ТекДанные.ВариантПересчетаЭММ)) Тогда
		ТекДанные.ВариантПересчетаЭММ = СМ_СметаВызовСервера.ПолучитьВариантПересчетаЭММПоУмолчанию();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаАктаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекДанные = Элементы.КоэффициентыПересчетаАкта.ТекущиеДанные;
	
	Если НоваяСтрока И (ТекДанные<>Неопределено) И (Не ЗначениеЗаполнено(ТекДанные.ВариантПересчетаЭММ)) Тогда
		ТекДанные.ВариантПересчетаЭММ = СМ_СметаВызовСервера.ПолучитьВариантПересчетаЭММПоУмолчанию();		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.КоэффициентыПересчета.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В настоящий момент нельзя вводить более одной строки с коэффициентами пересчета в текущие цены!'"));
		Отказ = Истина;		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаАктаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если КоэффициентыПересчетаАкта.Количество() > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='В настоящий момент нельзя вводить более одной строки с коэффициентами пересчета в текущие цены!'"));
		Отказ = Истина;		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекДанные 						= Элементы.КоэффициентыПересчета.ТекущиеДанные;
		ТекДанные.ВариантПересчетаЭММ 	= СМ_СметаВызовСервера.ПолучитьВариантПересчетаЭММПоУмолчанию();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаАктаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекДанные 						= Элементы.КоэффициентыПересчетаАкта.ТекущиеДанные;
		ТекДанные.ВариантПересчетаЭММ 	= СМ_СметаВызовСервера.ПолучитьВариантПересчетаЭММПоУмолчанию();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Параметры.ПозицияАкта Тогда
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("АктВыполненныхРабот",Параметры.Акт);
		Оповестить("ОбновитьДерево",СтруктураПараметров);
	Иначе
		СписокДействий = Новый Массив;
		СписокДействий.Добавить("ОбновитьДерево");
		СписокДействий.Добавить("ПеренумероватьДерево");
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("СписокДействий",СписокДействий);
		СтруктураПараметров.Вставить("Смета",Объект.ИДСметы);
		СтруктураПараметров.Вставить("НовыйОбъект",Объект.Ссылка);
		Оповестить("ОбновитьДеревоСметы",СтруктураПараметров);
	КонецЕсли;

	ЭтоРабота = ЭтоРабота(Объект.Определитель,Объект.ТипНормативныхСборников);
	
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
	
	РасчитатьТекСтоимостьНаОбъемРегистр();
	РасчитатьТекСтоимостьНаОбъем();
	
	СохранитьВерсию();
	
	Если Параметры.ПоказатьРядом Тогда
		ПодключитьОбработчикОжидания("АктивизируемФормуСметы",0.1,Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьВерсию()
	Сохраняем = СМ_ВерсионированиеСервер.СохранятьПриЗаписиПодчиненного();
	Если Сохраняем Тогда
		СМ_ВерсионированиеСервер.ЗаписатьВерсиюОбъекта(Объект.ИДСметы);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаКоэффОснЗарплатыПриИзменении(Элемент)
	
	ЗаполнитьКоэффициентЗарплатыМашинистов();
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаКоэффСтоимЭксплМашинПриИзменении(Элемент)
	
	ЗаполнитьКоэффициентЗарплатыМашинистов();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоэффициентЗарплатыМашинистов()
	
	ТекДанные = Элементы.КоэффициентыПересчета.ТекущиеДанные;
	
	Если СтруктураПараметровРасчетаЛС.ВариантПересчетаЭММ = ПредопределенноеЗначение("Перечисление.СМ_ВариантыПересчетаЭММ.Одинаковые") Тогда
		ТекДанные.КоэффСтоимЗарплатеМашин = ТекДанные.КоэффСтоимЭксплМашин;	
	ИначеЕсли СтруктураПараметровРасчетаЛС.ВариантПересчетаЭММ = ПредопределенноеЗначение("Перечисление.СМ_ВариантыПересчетаЭММ.Разные")
		ИЛИ СтруктураПараметровРасчетаЛС.ВариантПересчетаЭММ = ПредопределенноеЗначение("Перечисление.СМ_ВариантыПересчетаЭММ.РазныеКРазности") Тогда
		ТекДанные.КоэффСтоимЗарплатеМашин = ТекДанные.КоэффОснЗарплаты;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаВариантПересчетаЭММПриИзменении(Элемент)
	
	ТекДанные = Элементы.КоэффициентыПересчета.ТекущиеДанные;
	
	Если ТекДанные.ВариантПересчетаЭММ = ПредопределенноеЗначение("Перечисление.СМ_ВариантыПересчетаЭММ.Одинаковые") Тогда
		ТекДанные.КоэффСтоимЗарплатеМашин = ТекДанные.КоэффСтоимЭксплМашин;	
	ИначеЕсли ТекДанные.ВариантПересчетаЭММ = ПредопределенноеЗначение("Перечисление.СМ_ВариантыПересчетаЭММ.Разные")
		ИЛИ ТекДанные.ВариантПересчетаЭММ = ПредопределенноеЗначение("Перечисление.СМ_ВариантыПересчетаЭММ.РазныеКРазности") Тогда
		ТекДанные.КоэффСтоимЗарплатеМашин = ТекДанные.КоэффОснЗарплаты;
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ПозицияВладелецТекстНажатие(Элемент, СтандартнаяОбработка)
	
	Пар = Новый Структура("Ключ", Объект.ИДПозицииВладельца);
	ОткрытьФорму("Документ.СМ_ПозицияЛокальнойСметы.ФормаОбъекта",Пар,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НачисленияПозицииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОпределитьЗаголовкиСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ПоправкиПозицииПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОпределитьЗаголовкиСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОпределитьЗаголовкиСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура КоэффициентыПересчетаАктаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОпределитьЗаголовкиСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииЛокальнойСметыПриИзменении(Элемент)
	Если Не Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные = Неопределено Тогда
		Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные.Картинка = СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные.ТипМатериала, Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные.ВидРесурса);
	КонецЕсли;
	
	МассивРесурсов = Объект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(Новый Структура("Удален",Ложь));
	Если МассивРесурсов.Количество() = 0 И СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод Тогда
		Элементы.ГруппаСтраницТек.ТекущаяСтраница = Элементы.ГруппаСтраницТек.ПодчиненныеЭлементы.ТекущиеРеквизитами;
	Иначе
		Элементы.ГруппаСтраницТек.ТекущаяСтраница = Элементы.ГруппаСтраницТек.ПодчиненныеЭлементы.ТекущиеРегистром;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииАктаПриИзменении(Элемент)
	Элементы.РесурсыПозицииАкта.ТекущиеДанные.Картинка = СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(Элементы.РесурсыПозицииАкта.ТекущиеДанные.ТипМатериала, Элементы.РесурсыПозицииАкта.ТекущиеДанные.ВидРесурса);
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииЛокальнойСметыТипМатериалаПриИзменении(Элемент)
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
КонецПроцедуры

&НаКлиенте
Процедура ШифрРасценкиПриИзменении(Элемент)
	Если СметнаяКомпонента = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (Не ЗначениеЗаполнено(Объект.РегиональнаяБаза))
		ИЛИ	(Объект.ТипНормативныхСборников = ПредопределенноеЗначение("Перечисление.СМ_ТипыНормативныхСборников.Калькуляция")) Тогда
		Возврат;
	КонецЕсли;
	// Калькуляция можно менять шифр, ничего не меняя
	СтарыйШифр = ЗапомнитьСтарыйШифр();
	ДополнительныеПараметры = Новый Структура("ШифрРасценки,СтарыйШифр", Объект.ШифрРасценки,СтарыйШифр);

	ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Обновить показатели расценки %1 по нормативной базе %2 ?'"), Объект.ШифрРасценки, Объект.РегиональнаяБаза);
	Оповещение = Новый ОписаниеОповещения("ОбновитьПоНормативнойБазеОповещение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ФактОбъемПриИзменении(Элемент)
	
	
	ПроверитьПревышениеФактОбъем();

	// РасчитатьСтоимостьНаФактОбъем("", Истина);
	//// Текущие стоимости  по акту
	// РассчитатьТекСтоимостиПоАкту();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПревышениеФактОбъем()
	Если СМ_СметаВызовСервера.ЗначениеОпции("СМ_ПодтверждатьПревышениеОбъемаАкта") Тогда
		НовыйОбъем 	= ФактОбъем;	

		Если НовыйОбъем > (Объект.ОбъемРабот-Параметры.ОбъемВсегоБезАкта) Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ВладелецФайла",  Параметры.Акт);
			ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
			ПараметрыФормы.Вставить("РежимВыбора", Истина);
			
			Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайла", ЭтотОбъект);
			ОткрытьФорму("Документ.СМ_АктВыполненныхРабот.Форма.ПрисоединенныеФайлы",ПараметрыФормы,ЭтаФорма,Ложь,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			ОчиститьФайлТЧПозиции();
			РасчитатьСтоимостьНаФактОбъем("", Истина);
			РассчитатьТекСтоимостиПоАкту();
			Записать();
			Оповестить("ОбновитьДеревоСметы");
		КонецЕсли;
	Иначе
		 РасчитатьСтоимостьНаФактОбъем("", Истина);
		 РассчитатьТекСтоимостиПоАкту();
		 Записать();
		 Оповестить("ОбновитьДеревоСметы");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайла(Результат, ДопПараметры) Экспорт
	Если Не Результат = Неопределено Тогда
		ЗаполнитьФайлТЧПозиции(Результат);
		
		РасчитатьСтоимостьНаФактОбъем("", Истина);
		РассчитатьТекСтоимостиПоАкту();
		Записать();
		Оповестить("ОбновитьДеревоСметы");
	Иначе
		ФактОбъем = Параметры.СтарыйФактОбъем;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФайлТЧПозиции(СтруктураДанных)
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Позиция",Объект.Ссылка);
	
	Акт = Параметры.Акт.ПолучитьОбъект();
	МассивСтрок = Акт.Позиции.НайтиСтроки(СтруктураОтбора);
	Если МассивСтрок.Количество() > 0 Тогда
		НоваяСтрока = МассивСтрок[0];	
		НоваяСтрока.СсылкаНаФайл = СтруктураДанных.Файл;
		НоваяСтрока.КомментарийКФайлу = СтруктураДанных.Комментарий;
		Акт.Записать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОчиститьФайлТЧПозиции()
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Позиция",Объект.Ссылка);
	Акт = Параметры.Акт.ПолучитьОбъект();
	МассивСтрок = Акт.Позиции.НайтиСтроки(СтруктураОтбора);
	Если МассивСтрок.Количество() > 0 Тогда
		НоваяСтрока = МассивСтрок[0];	
		НоваяСтрока.СсылкаНаФайл = Справочники.СМ_АктВыполненныхРаботПрисоединенныеФайлы.ПустаяСсылка();
		НоваяСтрока.КомментарийКФайлу = "";
		Акт.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	Объект.Измеритель = Элемент.ТекстРедактирования;
	Если ВводОбъемовВБазовыхЕдИзм Тогда
		Если ЗначениеЗаполнено(Объект.ФормулаОбъема) Тогда
			ФормулаОбъемаПриИзменении(Неопределено);
			ФормулаФактОбъемаПриИзменении(Неопределено);
		КонецЕсли;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВводОбъемовВБазовыхЕдИзм Тогда
		Если ЗначениеЗаполнено(Объект.ФормулаОбъема) Тогда
			Объект.ФормулаОбъема = СМ_СметаВызовСервера.УдалитьФормулуБазовыхЕслиЕсть(Объект.ЕдиницаИзмерения,Объект.ФормулаОбъема);	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Проверьте формулу!'"), Объект.Ссылка, "ФормулаОбъема");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

// ДокторСофт
&НаКлиенте
Процедура РасчетПриИзменении(Элемент)
	ПроставитьЗначениеВсемПодчиненнымПозициям(Объект.Ссылка,Объект.Расчет);
	Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПроставитьЗначениеВсемПодчиненнымПозициям(ТекущаяСтрока,Значение)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	Если ТипЗнч(ТекущаяСтрока) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		ТЗПодчиненных = СМ_СметаВызовСервера.ПолучитьТаблицуПодчиненных(ТекущаяСтрока,Ложь,Ложь, Истина, Ложь);
		Для каждого стр Из ТЗПодчиненных Цикл
			СМ_СметаВызовСервера.УстановитьРеквизитДокумента(стр.Ид, "Расчет", Значение, Истина);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТехЧасть(Команда)
	Если СметнаяКомпонента = Неопределено Тогда
		ПоказатьПредупреждение(,НСтр("ru='Сметная компонента не подключена'"));
	Иначе
		СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,Объект.Ссылка);
		ПараметрыДляОбновления = СМ_СметаВызовСервера.ПолучитьПараметрыДляОбновления(Объект.Ссылка,СтруктураПараметровРасчетаЛС);
		Попытка
			СметнаяКомпонента.ОткрытьТехЧасть(ПараметрыДляОбновления.КодБазы, Строка(ПараметрыДляОбновления.НомерСборника), ПараметрыДляОбновления.ТипСборника);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры
// ДокторСофт

// Перенесение позиции в справочник СМ_НормативныеСборники.
&НаСервере
Процедура ПеренестиВНормСбНаСервере(ПараметрПереноса,РодительПозиции)
	
	Позиция = ПараметрПереноса.Позиция;
	СтруктураПараметровРасчетаЛС = СМ_СметаВызовСервера.ПолучитьСтруктуруПараметровРасчетаЛС(,Позиция);
	Район = СтруктураПараметровРасчетаЛС.Район;
	
	НовыйОбъект = Справочники.СМ_НормативныеСборники.СоздатьЭлемент();
	НовыйОбъект.Родитель = РодительПозиции;
	НовыйОбъект.КодНормативнойРасценки = Позиция.ШифрРасценки;
	НовыйОбъект.ЕдиницаИзмерения = Позиция.ЕдиницаИзмерения;
	НовыйОбъект.Измеритель = Позиция.Измеритель;
	НовыйОбъект.Наименование = СокрЛП(Сред(Позиция.Наименование,1,150));
	НовыйОбъект.ДлинноеНаименование = СокрП(Сред(Позиция.Наименование,151));
	НовыйОбъект.Определитель = Позиция.Определитель;	
	НовыйОбъект.ТипНормативногоСборника = Позиция.ТипНормативныхСборников;
	НовыйОбъект.УровеньЦен = Перечисления.СМ_ДатыБазисныхЦен.Ц2001;
	НовыйОбъект.МассаБруттоТ = Позиция.МассаБрутто;
	НовыйОбъект.МассаНеттоТ = Позиция.МассаНетто;
	НовыйОбъект.Статус = Перечисления.СМ_СтатусыФормированияНормативов.Утвержден;
	
	НоваяЦена = НовыйОбъект.ЦеныНормативныхСборников.Добавить();
	НоваяЦена.РегиональнаяБаза = Позиция.РегиональнаяБаза;
	НоваяЦена.Район = Район;
	НоваяЦена.ПрямыеЗатраты = Позиция.ПрямЗатраты;
	НоваяЦена.ОсновнаяЗарплата = Позиция.ОснЗарплата ;
	НоваяЦена.ЭксплуатацияМашинИМеханизмов = Позиция.ЭксплМашин;
	НоваяЦена.ВТомЧислеЗарплатаМашинистов = Позиция.ЗарплМашинистов;
	НоваяЦена.СтоимостьМатериалов = Позиция.СтоимМатериалов;
	НоваяЦена.СтоимостьОборудования = Позиция.Оборудование;
	НоваяЦена.ВозвратМатериалов = Позиция.ВозвратМатер;
	НоваяЦена.ЗатратыТрудаРабочих = Позиция.ЗатратыТрудаРабочих;
	НоваяЦена.ПроцентНР = Позиция.НакладныеРасходыТекущие;
	НоваяЦена.ПроцентСП = Позиция.СметнаяПрибыльТекущие;
	// Рассчитываемые реквизиты.
	НоваяЦена.НакладныеРасходыСумма = Окр((Позиция.ОснЗарплата + Позиция.ЗарплМашинистов)* Позиция.НакладныеРасходыТекущие/100,2);
	НоваяЦена.СметнаяПрибыльСумма = Окр((Позиция.ОснЗарплата + Позиция.ЗарплМашинистов)* Позиция.СметнаяПрибыльТекущие/100,2);
	
	ТЧРесурсыПозиции = Позиция.РесурсыПозицииЛокальнойСметы;
	Для Каждого РесурсПозиции Из ТЧРесурсыПозиции Цикл
		
		НовыйРесурс = НовыйОбъект.РесурсыНормативныхСборников.Добавить();
		НовыйРесурс.Ресурс = РесурсПозиции.Ресурс;
		НовыйРесурс.ТипРесурса = РесурсПозиции.ТипМатериала;
		НовыйРесурс.НормаРасхода = РесурсПозиции.НормаРасхода;
		НовыйРесурс.НаименованиеРесурса = РесурсПозиции.НаименованиеРесурса;
		НовыйРесурс.ЕдиницаИзмеренияРесурса = РесурсПозиции.ЕдиницаИзмеренияРесурса;
		НовыйРесурс.КодРесурса =  РесурсПозиции.СметныйКодРесурса;
	КонецЦикла;
	
	ТЧСоставРабот = Позиция.СоставРабот;
	Для Каждого Работа Из ТЧСоставРабот Цикл
		
		НовыйСостав = НовыйОбъект.СоставРабот.Добавить();
		НовыйСостав.Номер = Работа.Номер;
		НовыйСостав.НаименованиеРаботы = Работа.НаименованиеРаботы;
	КонецЦикла;

	Попытка
		НовыйОбъект.Записать();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Расценка сохранена в справочнике Нормативные сборники'"));

	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось сохранить расценку в справочнике Нормативные сборники'"));
	КонецПопытки;

	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВНормСб(Команда)
	ПараметрПереноса = Новый Структура;
	ПараметрПереноса.Вставить("Позиция",Объект.Ссылка);
	ОписаниеОЗакрытииФормыВыбораНормСборника = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбораНормСборника",ЭтаФорма,ПараметрПереноса);
	ОткрытьФорму("Справочник.СМ_НормативныеСборники.ФормаВыбораГруппы",ПараметрПереноса,ЭтаФорма,,,,ОписаниеОЗакрытииФормыВыбораНормСборника,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбораНормСборника(Результат,ПараметрПереноса) Экспорт
	Если Результат <> Неопределено Тогда
		РодительПозиции = Результат;
		ПеренестиВНормСбНаСервере(ПараметрПереноса,РодительПозиции);
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ВидимостьКнопкиТехчасть()
	
	// Кнопка "Тех. часть"
	Если ЗначениеЗаполнено(Объект.РегиональнаяБаза) И СметнаяКомпонента <> Неопределено Тогда
		Элементы.ФормаОткрытьТехЧасть.Видимость  	= Истина;
		Элементы.ФормаОткрытьТехЧасть.Доступность   = Истина;
	Иначе
		Элементы.ФормаОткрытьТехЧасть.Видимость  	= Ложь;
		Элементы.ФормаОткрытьТехЧасть.Доступность   = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПлюсМинусВНБ(Команда)
	
	Если Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	ФайлСборникаТекущихЦен = СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Объект.ИДСметы, "ФайлСборникаТекущихЦен");
	Если Не ЗначениеЗаполнено(ФайлСборникаТекущихЦен) Тогда
		Возврат;	
	КонецЕсли;
	
	Район = СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Объект.ИДСметы, "Район");
	ИдФормы = СметнаяКомпонента.ПоказатьОкноТекущихЦен(СокрЛП(ФайлСборникаТекущихЦен), Строка(СМ_СметаВызовСервера.ПолучитьЗначениеРеквизита(Район,"Код")),,,Истина,Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Источник = "AddIn.Base" Тогда
		Если Событие = "SelectRasc"+ИдФормы Тогда
			Если Не СтрНайти(ВариантВыбораВНБ,"ТекЦены") = 0 Тогда // из СНБ
				Если ЗначениеЗаполнено(Данные) Тогда
					СМ_СметаКлиент.ОбновитьПозициюПоНорме(Объект.Ссылка,Данные);
					ЭтаФорма.Прочитать();
				КонецЕсли;
			Иначе
				Результат = ЗаполнитьДанныеРесурса(Данные);
				Если Результат = Неопределено Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Данный ресурс не найден в БД.'"));
					Возврат;
				КонецЕсли;
				
				// Вставка Позиции минус текущий ресурс 
				ТекДанные 				= Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
				НормаРасхода 			= СтрЗаменить(ТекДанные.НормаРасхода,",",".");
				СтарыйРесурс 			= ТекДанные.Ресурс;
				СтараяЕдиницаИзмерения 	= ПолучитьЕдиницуИзмерения(СтарыйРесурс);
				
				ПараметрыПоиска 					= СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);
				ПараметрыПоиска.Ресурс 				= СтарыйРесурс;
				ПараметрыПоиска.БазиснаяЦена 		= ТекДанные.БазиснаяЦена;
				ПараметрыПоиска.ТекущаяЦена 		= ТекДанные.ТекущаяЦена;
				ПараметрыПоиска.БазиснаяЗарплМаш 	= ТекДанные.БазиснаяЗарплатаМашинистов;
				ПараметрыПоиска.ТекущаяЗарплМаш 	= ТекДанные.ТекущаяЗарплатаМашинистов;
				ПараметрыПоиска.Код 				= ТекДанные.СметныйКодРесурса;
				ПараметрыПоиска.ВидРесурса 			= ТекДанные.ВидРесурса;
				ПараметрыПоиска.ТипМатериала 		= ТекДанные.ТипМатериала;
				ПараметрыПоиска.НеИндексировать 	= Истина;
				ПараметрыПоиска.Норма 				= -1 * НормаРасхода;
				ПараметрыПоиска.Вставить("СметныйКодРесурса",ТекДанные.СметныйКодРесурса);

				ДобавитьЗаРасценкуНаСервере(ПараметрыПоиска);
				
				ПриЗакрытииФормыВыбораРесурсаСНБ(Результат.Ресурс, ПараметрыПоиска);
				
				ИдФормы = ИдФормы + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ПересчитатьНорму(Норма,СтараяЕдиницаИзмерения,НоваяЕдиницаИзмерения)
	НоваяНорма = Норма;
	БазоваяСтарая = СтараяЕдиницаИзмерения.БазоваяЕдиница;
	БазоваяНовая = НоваяЕдиницаИзмерения.БазоваяЕдиница;
	Если БазоваяНовая <> Неопределено Тогда
		Если БазоваяНовая = СтараяЕдиницаИзмерения Тогда
			Если НоваяЕдиницаИзмерения.КоэффициентПеревода <> 0 Тогда
				НоваяНорма = НоваяНорма / НоваяЕдиницаИзмерения.КоэффициентПеревода; 
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	Если БазоваяСтарая <> Неопределено Тогда
		Если БазоваяСтарая = НоваяЕдиницаИзмерения Тогда
			Если СтараяЕдиницаИзмерения.КоэффициентПеревода <> 0 Тогда
				НоваяНорма = НоваяНорма * СтараяЕдиницаИзмерения.КоэффициентПеревода; 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат НоваяНорма;
КонецФункции

Функция ПолучитьЕдиницуИзмерения(СтарыйРесурс)
	ЕдИзм = Неопределено;
	Если СтарыйРесурс <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СправочникСмета.Ссылка КАК Ресурс,
		|	СправочникСмета.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Справочник.СМ_Ресурсы КАК СправочникСмета
		|ГДЕ
		|	СправочникСмета.Код = &Шифр";
		Запрос.УстановитьПараметр("Шифр",СтарыйРесурс.Код);
		РесурсыДанные = Запрос.Выполнить().Выбрать();
		Если РесурсыДанные.Следующий() Тогда
			ЕдИзм = РесурсыДанные.ЕдиницаИзмерения;
		КонецЕсли; 
	КонецЕсли; 
	Возврат ЕдИзм;

КонецФункции

Функция ЗаполнитьДанныеРесурса(Данные)
	ТаблицаРесурса = СМ_СметаЗагрузкаВызовСервера.ЗагрузитьТекущиеЦеныВТаблицу(Данные);
	Если ТаблицаРесурса.Количество()>0 Тогда
		СтрРесурс = ТаблицаРесурса[0];
		Ресурс = НайтиРесурсПоШифру(СтрРесурс.ШифрРасценки);
		Если Ресурс = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			Структура = Новый Структура("Норма,Ресурс,ЕдиницаИзмерения",СтрРесурс.ОбъемРабот,Ресурс,СтрРесурс.ЕдиницаИзмерения);
			Возврат Структура;
		КонецЕсли;
	КонецЕсли;
КонецФункции

// Поиск в справочнике ресурсов.
//
Функция НайтиРесурсПоШифру(Шифр)
	Ресурс = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		               |	СправочникСмета.Ссылка КАК Ресурс
	    	           |ИЗ
	        	       |	Справочник.СМ_Ресурсы КАК СправочникСмета
	            	   |ГДЕ
		               |	СправочникСмета.Код = &Шифр";
	Запрос.УстановитьПараметр("Шифр",Шифр);
	РесурсыДанные = Запрос.Выполнить().Выбрать();
	Если РесурсыДанные.Следующий() Тогда
		Ресурс = РесурсыДанные.Ресурс;
	КонецЕсли; 
	Возврат Ресурс;
КонецФункции

&НаСервере
Процедура ОбновитьНРиСП1984НаСервере()
	Документы.СМ_ПозицияЛокальнойСметы.ОбновитьНРиСП1984(Объект, СтруктураПараметровРасчетаЛС);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНРиСП1984(Команда)
	ОбновитьНРиСП1984НаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПозицияКорректируемаяНажатие(Элемент, СтандартнаяОбработка)
	Пар = Новый Структура("Ключ", Объект.КорректируетПозицию);
	ОткрытьФорму("Документ.СМ_ПозицияЛокальнойСметы.ФормаОбъекта",Пар,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	СтандартнаяОбработка = Ложь;	

КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииЛокальнойСметыСметныйКодРесурсаПриИзменении(Элемент)
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	ТекДанные.Ресурс = СМ_СметаВызовСервера.НайтиРесурсПоКоду(ТекДанные);
	
	Если Не ЗначениеЗаполнено(ТекДанные.Ресурс) Тогда
		Если СМ_СметаВызовСервера.НедоступнаРаботаСПрайсами() Тогда
			Элементы.РесурсыПозицииЛокальнойСметы.ЗакончитьРедактированиеСтроки(Истина);
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	НовыйРесурс = ТекДанные.Ресурс;
	ПараметрыПоиска = СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);
	ПараметрыПоиска.Ресурс = НовыйРесурс;
	
	// получить данные о ресурсе
	ПолучитьОписаниеРесурса(ПараметрыПоиска);
	
	ТекДанные.НаименованиеРесурса = ПараметрыПоиска.НаименованиеРесурса;
	ТекДанные.ЕдиницаИзмеренияРесурса = ПараметрыПоиска.ЕдиницаИзмеренияРесурса;
	ТекДанные.СметныйКодРесурса = ПараметрыПоиска.Код;
	ТекДанные.ВидРесурса = ПараметрыПоиска.ВидРесурса;
	ТекДанные.БазиснаяЦена = ПараметрыПоиска.БазиснаяЦена;
	ТекДанные.БазиснаяЗарплатаМашинистов = ПараметрыПоиска.БазиснаяЗарплМаш;
	ТекДанные.ТекущаяЦена = ПараметрыПоиска.ТекущаяЦена;
	ТекДанные.ТекущаяЗарплатаМашинистов = ПараметрыПоиска.ТекущаяЗарплМаш;
	ТекДанные.ТипМатериала = ПараметрыПоиска.ТипМатериала;
	ТекДанные.Добавлен = Истина;
	
	// Если Автозагрузка цен из ИБ , вызывается модуль определения цен ВБ 
	ПолучитьПравоЗагрузкиТекущихЦен(ПараметрыПоиска);
	Если  ПараметрыПоиска.ЗагружатьТекущиеЦены И ЗначениеЗаполнено(ПараметрыПоиска.ФайлСборникаТекущихЦен) Тогда
		СтруктураЦен = Новый Структура();
		СтруктураЦен.Вставить("БазиснаяЦена");
		СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
		СтруктураЦен.Вставить("ТекущаяЦена");
		СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
		Район = ПараметрыПоиска.Район;
		ИмяФайлаСборникаТекущихЦен = ПараметрыПоиска.ФайлСборникаТекущихЦен;
		КодРегиональнойБазы = ПараметрыПоиска.КодРегионаФайлаТекущихЦен; 
		СМ_СметаКлиент.ПолучитьЦеныНовогоРесурса(НовыйРесурс,Район,ИмяФайлаСборникаТекущихЦен,КодРегиональнойБазы,СтруктураЦен); 	
		ТекДанные.ТекущаяЦена = СтруктураЦен.ТекущаяЦена;
		ТекДанные.ТекущаяЗарплатаМашинистов = СтруктураЦен.ТекущаяЗарплатаМашинистов;
	КонецЕсли;
	
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьЦвет(Команда)
	Объект.ОтмеченаВДереве = ?(Объект.ОтмеченаВДереве+1>6,0,Объект.ОтмеченаВДереве+1);
	Элементы.ФормаКнопкаЦветШрифта.Картинка = ПолучитьКартинку();
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьКартинку()
	Если Объект.ОтмеченаВДереве = 0 Тогда
		Возврат БиблиотекаКартинок.СМ_ЦветаЧерный;
	ИначеЕсли Объект.ОтмеченаВДереве = 1 Тогда
		Возврат БиблиотекаКартинок.СМ_ЦветаБелый;	
	ИначеЕсли Объект.ОтмеченаВДереве = 2 Тогда
		Возврат БиблиотекаКартинок.СМ_ЦветаСиний;	
	ИначеЕсли Объект.ОтмеченаВДереве = 3 Тогда
		Возврат БиблиотекаКартинок.СМ_ЦветаЖелтый;	
	ИначеЕсли Объект.ОтмеченаВДереве = 4 Тогда
		Возврат БиблиотекаКартинок.СМ_ЦветаЗеленый;	
	ИначеЕсли Объект.ОтмеченаВДереве = 5 Тогда
		Возврат БиблиотекаКартинок.СМ_ЦветаКрасный;	
	ИначеЕсли Объект.ОтмеченаВДереве = 6 Тогда
		Возврат БиблиотекаКартинок.СМ_ЦветаФиолетовый;	
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура РаскраситьПоЦвету(ИндексЦвета)
	
	Объект.ОтмеченаВДереве 						= ИндексЦвета;
	Элементы.ФормаГруппаПалитраЦветов.Картинка 	= ПолучитьКартинку();
	Модифицированность 							= Истина;
	
	// ********************************************************************
	// Не удалять 
	// Видимость кнопки установки цвета, при открытии формы позиции из акта
	//Если Параметры.ПозицияАкта Тогда
	//	ЭтаФорма.Закрыть(ИндексЦвета);
	//Иначе
	//	Объект.ОтмеченаВДереве 						= ИндексЦвета;
	//	Элементы.ФормаГруппаПалитраЦветов.Картинка 	= ПолучитьКартинку();
	//	Модифицированность 							= Истина;
	//КонецЕсли;
	// ********************************************************************
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЧерный(Команда)
	РаскраситьПоЦвету(0);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрБелый(Команда)
	РаскраситьПоЦвету(1);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрСиний(Команда)
	РаскраситьПоЦвету(2);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЖелтый(Команда)
	РаскраситьПоЦвету(3);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрЗеленый(Команда)
	РаскраситьПоЦвету(4);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрКрасный(Команда)
	РаскраситьПоЦвету(5);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрФиолетовый(Команда)
	РаскраситьПоЦвету(6);
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииЛокальнойСметыНаименованиеРесурсаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	Если ЗначениеЗаполнено(Текст) И Не ЗначениеЗаполнено(ТекДанные.СметныйКодРесурса) Тогда
		Список = СМ_СметаВызовСервера.ПолучитьСписокРесурсовПоСтроке(Текст);
		Элемент.СписокВыбора.ЗагрузитьЗначения(Список);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииЛокальнойСметыНаименованиеРесурсаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Результат	= СМ_СметаКлиент.ПолучитьОдинРесурсИзМассива(ВыбранноеЗначение);
	
	Если Не ЗначениеЗаполнено(Результат) Тогда
		Возврат;
	КонецЕсли;

	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	ТекДанные.Ресурс = Результат;
	НовыйРесурс = ТекДанные.Ресурс;
	ПараметрыПоиска = СМ_СметаКлиент.ИнициироватьСтруктуруОписанияРесурса(Объект, СтруктураПараметровРасчетаЛС);
	ПараметрыПоиска.Ресурс = НовыйРесурс;
	
	// получить данные о ресурсе
	ПолучитьОписаниеРесурса(ПараметрыПоиска);
	ТекДанные.НаименованиеРесурса = ПараметрыПоиска.НаименованиеРесурса;
	ТекДанные.ЕдиницаИзмеренияРесурса = ПараметрыПоиска.ЕдиницаИзмеренияРесурса;
	ТекДанные.СметныйКодРесурса = ПараметрыПоиска.Код;
	ТекДанные.ВидРесурса = ПараметрыПоиска.ВидРесурса;
	ТекДанные.БазиснаяЦена = ПараметрыПоиска.БазиснаяЦена;
	ТекДанные.БазиснаяЗарплатаМашинистов = ПараметрыПоиска.БазиснаяЗарплМаш;
	ТекДанные.ТекущаяЦена = ПараметрыПоиска.ТекущаяЦена;
	ТекДанные.ТекущаяЗарплатаМашинистов = ПараметрыПоиска.ТекущаяЗарплМаш;
	ТекДанные.ТипМатериала = ПараметрыПоиска.ТипМатериала;
	ТекДанные.Добавлен = Истина;
	
	// Если Автозагрузка цен из ИБ , вызывается модуль определения цен ВБ 
	ПолучитьПравоЗагрузкиТекущихЦен(ПараметрыПоиска);
	Если  ПараметрыПоиска.ЗагружатьТекущиеЦены И ЗначениеЗаполнено(ПараметрыПоиска.ФайлСборникаТекущихЦен) Тогда
		СтруктураЦен = Новый Структура();
		СтруктураЦен.Вставить("БазиснаяЦена");
		СтруктураЦен.Вставить("БазиснаяЗарплатаМашинистов");
		СтруктураЦен.Вставить("ТекущаяЦена");
		СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов");
		Район = ПараметрыПоиска.Район;
		ИмяФайлаСборникаТекущихЦен = ПараметрыПоиска.ФайлСборникаТекущихЦен;
		КодРегиональнойБазы = ПараметрыПоиска.КодРегионаФайлаТекущихЦен; 
		СМ_СметаКлиент.ПолучитьЦеныНовогоРесурса(НовыйРесурс,Район,ИмяФайлаСборникаТекущихЦен,КодРегиональнойБазы,СтруктураЦен); 	
		ТекДанные.ТекущаяЦена = СтруктураЦен.ТекущаяЦена;
		ТекДанные.ТекущаяЗарплатаМашинистов = СтруктураЦен.ТекущаяЗарплатаМашинистов;
	КонецЕсли;
	
	ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
	Элемент.СписокВыбора.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейОЗПриИзменении(Элемент)
	
	Попытка
		ТекФормула = Объект.ФормулаТекущейОЗ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаТекущейОЗ = ТекФормула;

		Объект.ТекущаяОснЗарплата = вычислить(ТекФормула);
	Исключение
		Объект.ТекущаяОснЗарплата = 0;
	КонецПопытки;
	
	ПересчитатьТекПЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТекПЗ()
	
	НоваяПЗ		= Объект.ТекущаяОснЗарплата + Объект.ТекущаяЭксплМашин + Объект.ТекущаяСтоимМатериалов;
	Объект.ТекущаяЦена = НоваяПЗ;
	Объект.ТекущаяПрямЗатраты = НоваяПЗ;
	РасчитатьТекСтоимостьНаОбъем("");
КонецПроцедуры	

&НаКлиенте
Процедура ФормулаТекущейОЗНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ТекущаяОснЗарплата", "ФормулаТекущейОЗ");
	РасчитатьТекСтоимостьНаОбъем("ТекущаяОснЗарплата");

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейЭМПриИзменении(Элемент)
	
	Попытка
		ТекФормула = Объект.ФормулаТекущейЭМ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаТекущейЭМ = ТекФормула;
		Объект.ТекущаяЭксплМашин = вычислить(ТекФормула);
	Исключение
		Объект.ТекущаяЭксплМашин = 0;
	КонецПопытки;
	
	ПересчитатьТекПЗ();

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейЭМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ТекущаяЭксплМашин", "ФормулаТекущейЭМ");
	РасчитатьТекСтоимостьНаОбъем("ТекущаяЭксплМашин");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейЗМПриИзменении(Элемент)
	
	Попытка
		ТекФормула = Объект.ФормулаТекущейЗМ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаТекущейЗМ = ТекФормула;
		Объект.ТекущаяЗарплМашинистов = вычислить(ТекФормула);
	Исключение
		Объект.ТекущаяЗарплМашинистов = 0;
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейЗМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ТекущаяЗарплМашинистов", "ФормулаТекущейЗМ");
	РасчитатьТекСтоимостьНаОбъем("ТекущаяЗарплМашинистов");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейСМПриИзменении(Элемент)
	
	Попытка
		ТекФормула = Объект.ФормулаТекущейСМ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаТекущейСМ = ТекФормула;
		Объект.ТекущаяСтоимМатериалов = вычислить(ТекФормула);
	Исключение
		Объект.ТекущаяСтоимМатериалов = 0;
	КонецПопытки;
	
	ПересчитатьТекПЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейСМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ТекущаяСтоимМатериалов", "ФормулаТекущейСМ");
	РасчитатьТекСтоимостьНаОбъем("ТекущаяСтоимМатериалов");
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяСтоимМатериаловПриИзменении(Элемент)
	ПересчитатьТекПЗ();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяЗарплМашинистовПриИзменении(Элемент)
	ПересчитатьТекПЗ();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяЭксплМашинПриИзменении(Элемент)
	ПересчитатьТекПЗ();
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяОснЗарплатаПриИзменении(Элемент)
	ПересчитатьТекПЗ();
КонецПроцедуры

&НаСервере
Процедура РасчитатьТекСтоимостьНаОбъем(ИмяПоля = "", ОбъемИзменен = Ложь)
	
	Если ОбъемИзменен И ВводОбъемовВБазовыхЕдИзм Тогда
		Объект.ОбъемРабот = СМ_СметаВызовСервера.ПересчитатьВбазовыхЕдиницахИзмерения(Объект,Объект.ОбъемРабот);
		Если ЗначениеЗаполнено(Объект.ФормулаОбъема) Тогда
			Объект.ФормулаОбъема = СМ_СметаВызовСервера.ПересчитатьФормулаВбазовыхЕдиницахИзмерения(Объект,Объект.ФормулаОбъема);
	        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Проверьте формулу!'"), Объект.Ссылка, "ФормулаОбъема");
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяПоля <> "" Тогда
		ЭтаФорма[ИмяПоля+"1"] = Объект[ИмяПоля]*Объект.ОбъемРабот;
		Возврат;
	КонецЕсли;
	
	ТекущаяОснЗарплата1 = Объект.ТекущаяОснЗарплата * Объект.ОбъемРабот;
	ТекущаяЭксплМашин1 = Объект.ТекущаяЭксплМашин * Объект.ОбъемРабот;
	ТекущаяЗарплМашинистов1 = Объект.ТекущаяЗарплМашинистов * Объект.ОбъемРабот;
	ТекущаяСтоимМатериалов1 = Объект.ТекущаяСтоимМатериалов * Объект.ОбъемРабот;
	ТекущаяПрямЗатраты1 = Объект.ТекущаяПрямЗатраты * Объект.ОбъемРабот;
	
КонецПроцедуры

&НаСервере
Процедура РасчитатьТекСтоимостьНаОбъемРегистр()
	
	ТекПоказатели = ПолучитьТекПоказателиРегистр();

	Если ТекПоказатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Показатели = ТекПоказатели[0];
	РегТекущаяОснЗарплата = Показатели.ТекущаяОснЗарплата;
	РегТекущаяЭксплМашин = Показатели.ТекущаяЭксплМашин;
	РегТекущаяЗарплМашинистов = Показатели.ТекущаяЗарплМашинистов;
	РегТекущаяСтоимМатериалов = Показатели.ТекущаяСтоимМатериалов;
	РегТекущаяПрямЗатраты = Показатели.ТекущаяПрямЗатраты;
	
	// Чтобы не влияло на округление - берем напрямую из таблицы единичные показатели
	РегТекущаяОснЗарплата1 = Показатели.ТекущаяОснЗарплата * Объект.ОбъемРабот;
	РегТекущаяЭксплМашин1 = Показатели.ТекущаяЭксплМашин * Объект.ОбъемРабот;
	РегТекущаяЗарплМашинистов1 = Показатели.ТекущаяЗарплМашинистов * Объект.ОбъемРабот;
	РегТекущаяСтоимМатериалов1 = Показатели.ТекущаяСтоимМатериалов * Объект.ОбъемРабот;
	РегТекущаяПрямЗатраты1 = Показатели.ТекущаяПрямЗатраты * Объект.ОбъемРабот;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРесурсы(Команда)
	Для Каждого ИдентификаторСтроки Из Элементы.РесурсыПозицииЛокальнойСметы.ВыделенныеСтроки Цикл
		
		ВыбраннаяСтрока = Объект.РесурсыПозицииЛокальнойСметы.НайтиПоИдентификатору(ИдентификаторСтроки);
		ВыбраннаяСтрока.Удален = Не ВыбраннаяСтрока.Удален;
		
		Если ВыбраннаяСтрока.Удален Тогда
			ТекРесурс = ВыбраннаяСтрока.Ресурс;
			Ресурсы = Новый Структура();
			Ресурсы.Вставить("СтарыйРесурс", ТекРесурс);
			Ресурсы.Вставить("НовыйРесурс");
			АдресХранилищаЗамен = ПоместитьВоВременноеХранилище(Ресурсы, Новый УникальныйИдентификатор());
		КонецЕсли;
		
	КонецЦикла;
	Если Элементы.РесурсыПозицииЛокальнойСметы.ВыделенныеСтроки.Количество()>0 Тогда
		ЗаполнитьСтандартноеЗначениеЧПИКартинкиРесурса();
		Модифицированность = Истина;
	КонецЕсли;
	
	МассивРесурсов = Объект.РесурсыПозицииЛокальнойСметы.НайтиСтроки(Новый Структура("Удален",Ложь));
	Если МассивРесурсов.Количество() = 0 И СтруктураПараметровРасчетаЛС.ЭтоРесурсныйМетод Тогда
		Элементы.ГруппаСтраницТек.ТекущаяСтраница = Элементы.ГруппаСтраницТек.ПодчиненныеЭлементы.ТекущиеРеквизитами;
	Иначе
		Элементы.ГруппаСтраницТек.ТекущаяСтраница = Элементы.ГруппаСтраницТек.ПодчиненныеЭлементы.ТекущиеРегистром;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейПЗПриИзменении(Элемент)
	
	Попытка
		ТекФормула = Объект.ФормулаТекущейПЗ;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаТекущейПЗ = ТекФормула;
		Объект.ТекущаяПрямЗатраты = вычислить(ТекФормула);
	Исключение
		Объект.ТекущаяПрямЗатраты = 0;
	КонецПопытки;
	
	ПересчитатьТекПЗ();

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейПЗНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулу("ТекущаяПрямЗатраты", "ФормулаТекущейПЗ");
	РасчитатьСтоимостьНаОбъем("ТекущаяПрямЗатраты");
КонецПроцедуры

//  Блок расчета базисной и текущей цен

&НаКлиенте
// Проверка формулы для сообщения пользователю.
Функция ПроверитьФормулу(ФормулаКП)
	СтрокаСимв = "1234567890+-*/().";
	Результат = Истина;
	Для сч = 1 По СтрДлина(ФормулаКП) Цикл
		ТекСимв = Сред(ФормулаКП,Сч,1);
		Если Найти(СтрокаСимв,ТекСимв) = 0 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Возврат (Результат);
КонецФункции

&НаКлиенте
// Расчет базисной и текущей цен
Процедура РасчетЦены(Команда)
	Вариант =  ВариантПересчета;
	Если ПустаяСтрока(Вариант) = Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбран вариант пересчета'"));
	Иначе	
		Если Вариант = "0" Тогда
			// Расчет базисной цены по текущей.
			Если Объект.ТекущаяЦена = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задана текущая цена'"));
			Иначе	
				Если  Объект.КоэффициентПересчетаЦен <> 0 Тогда 
					РезультатПересчета = Окр(Объект.ТекущаяЦена / Объект.КоэффициентПересчетаЦен,20,2);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задан коэффициент пересчета'"));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Вариант = "1" Тогда
			// Расчет текущей цены по базисной.
			
			Если ЭтоОборудование(Объект.Определитель)= Ложь Тогда
				БазиснаяЦена = Объект.СтоимМатериалов;
			Иначе
				БазиснаяЦена = Объект.Оборудование;
			КонецЕсли;	
			Если БазиснаяЦена = 0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задана базисная цена'"));
			Иначе	
				Если  Объект.КоэффициентПересчетаЦен <> 0 Тогда 
					РезультатПересчета = Окр(БазиснаяЦена * Объект.КоэффициентПересчетаЦен,20,2);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не задан коэффициент пересчета'"));
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;	
		Элементы.РезультатПересчета.Видимость = Истина;
		Если Вариант = "0" Тогда
			БазиснаяЦена = РезультатПересчета;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
// Процедура вычисляет коэффициент по заданной формуле.
Процедура ФормулаКоэффициентаПересчетаЦенПриИзменении(Элемент)
	
	Попытка
		ТекФормула = Объект.ФормулаКоэффициентаПересчетаЦен;
		Если ПроверитьФормулу(ТекФормула) = Ложь Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Формула задана неправильно, лишние символы будут удалены'"));
	    КонецЕсли;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		Объект.ФормулаКоэффициентаПересчетаЦен = ТекФормула;
		Объект.КоэффициентПересчетаЦен = Окр(Вычислить(ТекФормула),7);
	Исключение
		Объект.КоэффициентПересчетаЦен = 0;
	КонецПопытки;
	
КонецПроцедуры

&НаСервереБезКонтекста
// Определение позиция материал, или оборудование
Функция ЭтоОборудование(Определитель)
	
	Если Определитель.видРасценки = Перечисления.СМ_ВидыРасценки.Оборудование Тогда
		Возврат истина;
	Иначе
		Возврат ложь;
	КонецЕсли;	
	
КонецФункции	

&НаКлиенте
// Занесения результата в соответствующие реквизиты позиции
Процедура ЗанестиРезультат(Команда)
	
	Вариант =  ВариантПересчета;
	ТекФормула = ОчиститьФормулу(Объект.ФормулаКоэффициентаПересчетаЦен);
	Объект.ФормулаКоэффициентаПересчетаЦен = ТекФормула;
	Если Вариант = "0" Тогда
		// Расчет Базисной цены от текущей.
		Если ЭтоОборудование(Объект.Определитель)= Ложь Тогда
			Объект.СтоимМатериалов = РезультатПересчета;
			РасчитатьСтоимостьНаОбъем("СтоимМатериалов"); 
			ПересчитатьПЗ();
			Если ПустаяСтрока(Объект.ФормулаКоэффициентаПересчетаЦен) = Истина Тогда
				Объект.ФормулаСМ = СокрЛП(Строка(Объект.ТекущаяЦена)) + "/" +СокрЛП(Строка(Объект.КоэффициентПересчетаЦен));
			Иначе	
				Объект.ФормулаСМ = СокрЛП(Строка(Объект.ТекущаяЦена)) + "/(" +СокрЛП(Объект.ФормулаКоэффициентаПересчетаЦен)+ ")";
			КонецЕсли;	
		Иначе
			Объект.Оборудование = РезультатПересчета;
			РасчитатьСтоимостьНаОбъем("Оборудование"); 
			Если ПустаяСтрока(Объект.ФормулаКоэффициентаПересчетаЦен) = Истина Тогда
				Объект.ФормулаОб = СокрЛП(Строка(Объект.ТекущаяЦена)) + "/" +СокрЛП(Строка(Объект.КоэффициентПересчетаЦен));
			Иначе
				Объект.ФормулаОб = СокрЛП(Строка(Объект.ТекущаяЦена)) + "/(" +СокрЛП(Объект.ФормулаКоэффициентаПересчетаЦен) + ")";
			КонецЕсли;	
		КонецЕсли;	
		Иначе
			Объект.ТекущаяЦена = РезультатПересчета;
			Если ЭтоОборудование(Объект.Определитель)= Ложь Тогда
				Если ПустаяСтрока(Объект.ФормулаКоэффициентаПересчетаЦен) = Истина Тогда
					Объект.ФормулаТекущейЦены = СокрЛП(Строка(Объект.СтоимМатериалов)) + "*" +СокрЛП(Строка(Объект.КоэффициентПересчетаЦен)); 
				Иначе
					Объект.ФормулаТекущейЦены = СокрЛП(Строка(Объект.СтоимМатериалов)) + "*(" +СокрЛП(Объект.ФормулаКоэффициентаПересчетаЦен) + ")"; 
				КонецЕсли;
			Иначе
				Если ПустаяСтрока(Объект.ФормулаКоэффициентаПересчетаЦен) = Истина Тогда
					Объект.ФормулаТекущейЦены = СокрЛП(Строка(Объект.Оборудование)) + "*" +СокрЛП(Строка(Объект.КоэффициентПересчетаЦен)); 
				Иначе
					Объект.ФормулаТекущейЦены = СокрЛП(Строка(Объект.Оборудование)) + "*(" +СокрЛП(Объект.ФормулаКоэффициентАПересчетаЦен) + ")"; 
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаявкиНаМатериалыДиалог(Результат, СтруктураПараметров) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	Записать();
	Если ЗначениеЗаполнено(Объект.Ссылка)и не ЭтаФорма.Модифицированность Тогда
		ОткрытьФормуЗаявкиНаМатериалы();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Документ не записан, заявка не может быть оформлена."));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗаявкиНаМатериалы()
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Объект", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
	ФормаНовогоДокумента = ПолучитьФорму("Документ.СМ_ЗаявкаНаМатериал.Форма.ФормаДокумента", ПараметрыФормы, ЭтаФорма);
 	ФормаНовогоДокумента.Открыть();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Поддержка дополнительных реквизитов.

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствамиКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("УправлениеСвойствамиКлиент");
		МодульУправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
		МодульУправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВоВсеПозицииРазделаНаСервере()
Запрос=Новый Запрос ("ВЫБРАТЬ
                     |	СМ_ПозицияЛокальнойСметы.Ссылка
                     |ИЗ
                     |	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
                     |ГДЕ
                     |	СМ_ПозицияЛокальнойСметы.ИДРодителя = &ИДРодителя
                     |	И СМ_ПозицияЛокальнойСметы.Ссылка <> &Ссылка");
запрос.УстановитьПараметр("ИДРодителя",Объект.ИДРодителя);
запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);

Рез=запрос.Выполнить().Выбрать();
Пока рез.Следующий() Цикл
	Об=Рез.Ссылка.ПолучитьОбъект();
	Об.ДополнительныеРеквизиты.очистить();
	Об.ДополнительныеРеквизиты.Загрузить(Объект.ДополнительныеРеквизиты.Выгрузить());
	Об.Записать();
КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВоВсеПозицииРаздела(Команда)
	Если ЭтотОбъект.Модифицированность Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Перед установкой документ необходимо записать!");
		Возврат;
	КонецЕсли;	
	ДобавитьВоВсеПозицииРазделаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТекущиеПЗФакт()
	
	НоваяПЗ							= ТекущиеОЗФакт + ТекущиеЭМФакт + ТекущиеСМФакт;
	ТекущиеПЗФакт  					= НоваяПЗ;
	ТекущиеПЗФакт1 					= НоваяПЗ * ФактОбъем;
	ТекущаяЦенаФакт 				= НоваяПЗ;
	ТекущаяЗарплатаМашинистовФакт 	= ТекущиеЗМФакт;

КонецПроцедуры	

&НаКлиенте
Процедура РедактироватьФормулуАкта(ИмяРеквизита, ИмяРеквизитаФормулы)
	
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗакрытииФормыРедактированияФормулыАкта",ЭтаФорма, Новый Структура("ИмяРеквизита, ИмяРеквизитаФормулы",ИмяРеквизита,ИмяРеквизитаФормулы));
	ПараметрыФормы = Новый Структура("ЗначениеЗаполнения",Новый Структура("Формула",ИмяРеквизитаФормулы));
	ОткрытьФорму("ОбщаяФорма.СМ_РедакторФормулСмета",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейПЗФактПриИзменении(Элемент)
	
	Попытка
		ТекФормула 				= ФормулаТекущейПЗФакт;
		ТекФормула 				= ОчиститьФормулу(ТекФормула);
		ФормулаТекущейПЗФакт 	= ТекФормула;
		ТекущиеПЗФакт 			= вычислить(ТекФормула);
	Исключение
		ТекущиеПЗФакт = 0;
	КонецПопытки;
	ТекущаяЦенаФакт = ТекущиеПЗФакт;

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейПЗФактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулуАкта("ТекущиеПЗФакт", "ФормулаТекущейПЗФакт");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейОЗФактПриИзменении(Элемент)
	Попытка
		ТекФормула = ФормулаТекущейОЗФакт;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		ФормулаТекущейОЗФакт = ТекФормула;
		ТекущиеОЗФакт = вычислить(ТекФормула);
	Исключение
		ТекущиеОЗФакт = 0;
	КонецПопытки;
	
	ПересчитатьТекущиеПЗФакт();
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейОЗФактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулуАкта("ТекущиеОЗФакт", "ФормулаТекущейОЗФакт");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейЭМФактПриИзменении(Элемент)
	Попытка
		ТекФормула = ФормулаТекущейЭМФакт;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		ФормулаТекущейЭМФакт = ТекФормула;
		ТекущиеЭМФакт = вычислить(ТекФормула);
	Исключение
		ТекущиеЭМФакт = 0;
	КонецПопытки;
	
	ПересчитатьТекущиеПЗФакт();
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейЭМФактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулуАкта("ТекущиеЭМФакт", "ФормулаТекущейЭМФакт");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейЗМФактПриИзменении(Элемент)
	
	Попытка
		ТекФормула = ФормулаТекущейЗМФакт;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		ФормулаТекущейЗМФакт = ТекФормула;
		ТекущиеЗМФакт = вычислить(ТекФормула);
	Исключение
		ТекущиеЗМФакт = 0;
	КонецПопытки;
	Если ТекущиеЗМФакт >= ТекущиеЭМФакт Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Зарплата машинистов должна быть меньше эксплуатации машин'"));
		ТекущиеЗМФакт = 0;
	КонецЕсли;	
	ТекущаяЗарплатаМашинистовФакт = ТекущиеЗМФакт;

КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейЗМФактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулуАкта("ТекущиеЗМФакт", "ФормулаТекущейЗМФакт");
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейСМФактПриИзменении(Элемент)
	
	Попытка
		ТекФормула = ФормулаТекущейСМФакт;
		ТекФормула = ОчиститьФормулу(ТекФормула);
		ФормулаТекущейСМФакт = ТекФормула;
		ТекущиеСМФакт = вычислить(ТекФормула);
	Исключение
		ТекущиеСМФакт = 0;
	КонецПопытки;
	ПересчитатьТекущиеПЗФакт();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекущейСМФактНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РедактироватьФормулуАкта("ТекущиеСМФакт", "ФормулаТекущейСМФакт");
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеПЗФактПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ФормулаТекущейПЗФакт) = Истина Тогда
		Попытка
			ТекФормула = ФормулаТекущейПЗФакт;
			ТекущиеФакт = вычислить(ТекФормула);
			Если Окр(ТекущиеФакт,2) <> ТекущиеПЗФакт Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Прямые затраты отличаются от расчитанных по формуле'"));
			КонецЕсли;	
		Исключение
		КонецПопытки;
	КонецЕсли;	
	
	ТекущиеПЗФакт1 	= ТекущиеПЗФакт * ФактОбъем;
	ТекущаяЦенаФакт = ТекущиеПЗФакт;

КонецПроцедуры

&НаКлиенте
Процедура ТекущиеОЗФактПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ФормулаТекущейОЗФакт) = Истина Тогда
		Попытка
			ТекФормула = ФормулаТекущейОЗФакт;
			ТекущиеФакт = вычислить(ТекФормула);
			Если Окр(ТекущиеФакт,2) <> ТекущиеОЗФакт Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Основная зарплата отличается от расчитанной по формуле'"));
			КонецЕсли;	
		Исключение
		КонецПопытки;
	КонецЕсли;
	ТекущиеОЗФакт1 = ТекущиеОЗФакт * ФактОбъем;
	ПересчитатьТекущиеПЗФакт();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеЭМФактПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ФормулаТекущейЭМФакт) = Истина Тогда
		Попытка
			ТекФормула = ФормулаТекущейЭМФакт;
			ТекущиеФакт = вычислить(ТекФормула);
			Если Окр(ТекущиеФакт,2) <> ТекущиеЭМФакт Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Эксплуатация машин отличается от расчитанной по формуле'"));
			КонецЕсли;	
		Исключение
		КонецПопытки;
	КонецЕсли;
	ТекущиеЭМФакт1 = ТекущиеЭМФакт * ФактОбъем;
	ПересчитатьТекущиеПЗФакт();
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеЗМФактПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ФормулаТекущейЗМФакт) = Истина Тогда
		Попытка
			ТекФормула = ФормулаТекущейЗМФакт;
			ТекущиеФакт = вычислить(ТекФормула);
			Если Окр(ТекущиеФакт,2) <> ТекущиеЗМФакт Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Зарплата машинистов отличается от расчитанной по формуле'"));
			КонецЕсли;	
		Исключение
		КонецПопытки;
	КонецЕсли;
	Если ТекущиеЗМФакт >= ТекущиеЭМФакт Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Зарплата машинистов должна быть меньше эксплуатации машин'"));
		ТекущиеЗМФакт = 0;
	КонецЕсли;
	ТекущиеЗМФакт1 = ТекущиеЗМФакт * ФактОбъем;
	ТекущаяЗарплатаМашинистовФакт = ТекущиеЗМФакт;
КонецПроцедуры

&НаКлиенте
Процедура ТекущиеСМФактПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ФормулаТекущейСМФакт) = Истина Тогда
		Попытка
			ТекФормула = ФормулаТекущейСМФакт;
			ТекущиеФакт = вычислить(ТекФормула);
			Если Окр(ТекущиеФакт,2) <> ТекущиеСМФакт Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Стоимость материалов отличается от расчитанной по формуле'"));
			КонецЕсли;	
		Исключение
		КонецПопытки;
	КонецЕсли;
	ТекущиеСМФакт1 = ТекущиеСМФакт * ФактОбъем;
	ПересчитатьТекущиеПЗФакт();
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииЛокальнойСметыНаименованиеРесурсаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	//ОповещениеВыбораРесурса = Новый ОписаниеОповещения("ОповещениеВыбораРесурса",ЭтаФорма,);
	//ОткрытьФорму("Справочник.СМ_Ресурсы.Форма.ФормаВыбора",Новый Структура("ТекРесурс",ТекущиеДанные.Ресурс),Элемент,ЭтаФорма.УникальныйИдентификатор,,,ОповещениеВыбораРесурса,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ОткрытьФорму("Справочник.СМ_Ресурсы.Форма.ФормаВыбора",Новый Структура("ТекРесурс",ТекущиеДанные.Ресурс),Элемент,ЭтаФорма.УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	Если Параметры.ПоказатьРядом Тогда
		Закрыть(Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПозицииАктаФактРасходаОбъемПриИзменении(Элемент)
	ТекДанные 	= Элементы.РесурсыПозицииАкта.ТекущиеДанные;
	ПроверитьПревышениеФактическогоРасхода(ТекДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПревышениеФактическогоРасхода(ТекДанные)
	Если СМ_СметаВызовСервера.ЗначениеОпции("СМ_ПодтверждатьПревышениеОбъемаАкта")
		И ТекДанные.ФактРасходаОбъем > ТекДанные.НормаРасходаОбъем Тогда 
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("ТекДанные",ТекДанные);
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораВариантаСписания", ЭтотОбъект, ДопПараметры);
		ПоказатьВводЗначения(Оповещение,ПредопределенноеЗначение("Перечисление.СМ_ВариантыСписанияПревышения.ДефектныйАкт"), "Вариант списания превышения");

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораВариантаСписания(Результат, ДопПараметры) Экспорт
	Если Результат = ПредопределенноеЗначение("Перечисление.СМ_ВариантыСписанияПревышения.ДефектныйАкт") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла",  Параметры.Акт);
		ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		
		ДопПараметры.Вставить("ВариантСписания", Результат);
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайлаДефектныйАкт", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Документ.СМ_АктВыполненныхРабот.Форма.ПрисоединенныеФайлы",ПараметрыФормы,ЭтаФорма,Ложь,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	ИначеЕсли Результат = ПредопределенноеЗначение("Перечисление.СМ_ВариантыСписанияПревышения.ПредыдущийПериод") Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ТекущийАкт",  Параметры.Акт);
		
		ДопПараметры.Вставить("ВариантСписания", Результат);
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеВыбораФайлаПредыдущийАкт", ЭтотОбъект, ДопПараметры);
		ОткрытьФорму("Документ.СМ_АктВыполненныхРабот.Форма.ФормаВыбораПредыдущего",ПараметрыФормы,ЭтаФорма,Ложь,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	Иначе
		ТекДанные = ДопПараметры.ТекДанные; 
		ТекДанные.ФактРасходаОбъем = ТекДанные.НормаРасходаОбъем;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Расход по факту установлен по норме.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайлаПредыдущийАкт(Результат, ДопПараметры) Экспорт
	ТекДанные = ДопПараметры.ТекДанные;
	Если Не Результат = Неопределено Тогда
		ТекДанные.ВариантСписанияПревышения = ДопПараметры.ВариантСписания;
		ТекДанные.СсылкаНаАкт = Результат.Акт;
		ТекДанные.СсылкаНаФайл = ПредопределенноеЗначение("Справочник.СМ_АктВыполненныхРаботПрисоединенныеФайлы.ПустаяСсылка");
		ТекДанные.КомментарийКФайлу = Результат.Комментарий;
	Иначе
		ТекДанные.ФактРасходаОбъем = ТекДанные.НормаРасходаОбъем;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Фактический расход установлен по норме.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораФайлаДефектныйАкт(Результат, ДопПараметры) Экспорт
	ТекДанные = ДопПараметры.ТекДанные;
	Если Не Результат = Неопределено Тогда
		ТекДанные.ВариантСписанияПревышения = ДопПараметры.ВариантСписания;
		ТекДанные.СсылкаНаФайл = Результат.Файл;
		ТекДанные.СсылкаНаАкт = ПредопределенноеЗначение("Документ.СМ_АктВыполненныхРабот.ПустаяСсылка");
		ТекДанные.КомментарийКФайлу = Результат.Комментарий;
	Иначе
		ТекДанные.ФактРасходаОбъем = ТекДанные.НормаРасходаОбъем;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Фактический расход установлен по норме.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусРесурсаПодрядчика(Команда)
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	ТекДанные.СтатусРесурса = ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.Подрядчика");
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтатусРесурсаСобственный(Команда)
	ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
	ТекДанные.СтатусРесурса = ПредопределенноеЗначение("Перечисление.СМ_ОбеспечениеРесурса.Собственный");
	Модифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция НайтиРесурсПоКоду(ТекКод)
	
	Если НЕ ЗначениеЗаполнено(ТекКод) Тогда
		Возврат Неопределено;
	КонецЕсли;	
		
	НайденныйРесурс = Справочники.СМ_Ресурсы.НайтиПоКоду(ТекКод);
	
	Если НайденныйРесурс = Справочники.СМ_Ресурсы.ПустаяСсылка() Тогда
		Возврат Неопределено;
	Иначе
		Возврат НайденныйРесурс;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРесурса(НайденныйРесурс)
	
	Если НайденныйРесурс <> Неопределено Тогда 		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Ключ", НайденныйРесурс);
		ОткрытьФорму("Справочник.СМ_Ресурсы.ФормаОбъекта",СтруктураПараметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 	
	Иначе
	   	Сообщение 		= Новый СообщениеПользователю();
		Сообщение.Текст = "Элемент не найден";
		Сообщение.Сообщить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРасчеты(Команда)
	ПараметрыФормы = Новый Структура("ВыбранныйДокумент", Объект.Ссылка);
	ОткрытьФорму("ОбщаяФорма.СМ_ИтогиПоДокументу", ПараметрыФормы); 
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекЦеныПриИзменении()
	
	Если ЗначениеЗаполнено(Объект.ФормулаТекЦены) Тогда
		Попытка
			ТекФормула 				= Объект.ФормулаТекЦены;
			ТекФормула 				= ОчиститьФормулу(ТекФормула);
			Объект.ФормулаТекЦены 	= ТекФормула;
			Объект.ТекущаяЦена 		= Вычислить(ТекФормула);
		Исключение
			Объект.ТекущаяЦена = 0;
		КонецПопытки;
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекЦеныФактПриИзменении()
	
	Если ЗначениеЗаполнено(Этаформа.Параметры.Акт) И ЗначениеЗаполнено(Объект.ФормулаТекЦены) Тогда
		Попытка
			ТекФормула 					= Объект.ФормулаТекЦены;
			ТекФормула 					= ОчиститьФормулу(ТекФормула);
			ЭтаФорма.ФормулаТекЦеныФакт = ТекФормула;
			ЭтаФорма.ТекущаяЦенаФакт	= Вычислить(ТекФормула);
		Исключение
			ТекущаяЦенаФакт	= 0;
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТекущаяЦенаПриИзменении(Элемент)
	
	Объект.ФормулаТекЦены = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущаяЦенаФактПриИзменении(Элемент)

	ЭтаФорма.ФормулаТекЦеныФакт = "";
	
КонецПроцедуры

#КонецОбласти

#Область НаУдаление

//&НаСервере
//Процедура Удалить_СвойстваВыполнитьОтложеннуюИнициализацию()
//	
//	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Свойства") Тогда
//		МодульУправлениеСвойствами = ОбщегоНазначения.ОбщийМодуль("УправлениеСвойствами");
//		МодульУправлениеСвойствами.ЗаполнитьДополнительныеРеквизитыВФорме(ЭтотОбъект);
//	КонецЕсли;
//	
//КонецПроцедуры


//&НаКлиенте
//Процедура РесурсыПозицииЛокальнойСметыПриАктивизацииЯчейки(Элемент)
//	
//	// *********************************************
//	// ++ AVV Роли в системе
//	//Если Элемент.ТекущийЭлемент.Имя = "РесурсыПозицииЛокальнойСметыБазиснаяЦена" ИЛИ 
//	//	 Элемент.ТекущийЭлемент.Имя = "РесурсыПозицииЛокальнойСметыТекущаяЦена"	Тогда
//	//	Если ЭтоСметчикМатериалы Тогда
//	//		ТекДанные = Элементы.РесурсыПозицииЛокальнойСметы.ТекущиеДанные;
//	//		Если ТекДанные.ВидРесурса = ПредопределенноеЗначение("Перечисление.СМ_ВидыРесурсов.Материалы") Тогда
//	//			Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь;
//	//		Иначе	
//	//			Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
//	//		КонецЕсли;
//	//	КонецЕсли;
//	//КонецЕсли;
//	// -- AVV Роли в системе
//	// *********************************************
//	
//КонецПроцедуры

#КонецОбласти

