
#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		Если Не ЗначениеЗаполнено(Запись.Организация) или Не ЗначениеЗаполнено(запись.Пользователь) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить организацию и ответственное лицо");
			Отказ=Истина;
			Возврат;
		КонецЕсли;
		
		Запрос=Новый Запрос( "ВЫБРАТЬ ПЕРВЫЕ 1
		                     |	СМ_ОтветственныеЛица.ДатаНачала
		                     |ИЗ
		                     |	РегистрСведений.СМ_ОтветственныеЛица КАК СМ_ОтветственныеЛица
		                     |ГДЕ
		                     |	СМ_ОтветственныеЛица.Организация = &Организация
		                     |	И СМ_ОтветственныеЛица.Пользователь = &Пользователь
		                     |	И СМ_ОтветственныеЛица.ДатаОкончания = ДАТАВРЕМЯ(1,1,1)");
		Запрос.УстановитьПараметр("Организация",Запись.Организация);
		Запрос.УстановитьПараметр("Пользователь",Запись.Пользователь);
		Результат=Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пользователь уже является ответственным лицом");
			Отказ=Истина;
			Возврат;
		КонецЕсли;
	
		Если Не ЗначениеЗаполнено(Запись.ДатаНачала) Тогда
			Запись.ДатаНачала=ТекущаяДата();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
