
#Область СлужебныеПроцедурыИФункции

// Функция формирует табличный документ отчета (используется для печати из форм списков и элементов).
//
// Параметры:
//     АктыВыполненныхРабот - массив, элементы которого должны иметь свойство "АктВыполненныхРабот".
//     ПредставлениеПериода - строка с представлением периода, если заполнена выводится сводная шапка.
//
// Возвращаемое значение:
//     ТабличныйДокумент - результат формирования отчета с заданными параметрами.
//
Процедура ПолучитьЗаполненныйОтчет(Разделять,АктыВыполненныхРабот,ДокументРезультат, ПредставлениеПериода = "", ТолькоМатериалы = Ложь, ТолькоФакт = Ложь,МассивСмет = Неопределено,ИсключатьМатериалыЗаказчика = Ложь,ВыводитьДоговор = Ложь,ВыводитьПодрядчика = Ложь, ВыводитьПодписи = Ложь) Экспорт

	Если ТипЗнч(АктыВыполненныхРабот) <> Тип("Массив") Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Неправильный формат передаваемого параметра'"));
		Возврат;
	КонецЕсли;
	
	ИнформацияПоАкту = "";
	
	ТаблицаРесурсов = Новый ТаблицаЗначений;
	Для Каждого ТекСтрока Из АктыВыполненныхРабот Цикл
		Если ТаблицаРесурсов.Количество() = 0 Тогда
			ТаблицаРесурсов = СМ_СметаРасчетВызовСервера.ПолучитьТаблицуСтоимостиРесурсовАкта(ТекСтрока.АктВыполненныхРабот,Истина,,,,Истина,,ИсключатьМатериалыЗаказчика,Истина);
			ТаблицаРесурсов.Колонки.Добавить("АктВыполненныхРабот");
			ТаблицаРесурсов.ЗаполнитьЗначения(ТекСтрока.АктВыполненныхРабот,"АктВыполненныхРабот");
			Заказчик 			= ТекСтрока.АктВыполненныхРабот.ЛокальнаяСмета.Заказчик.Наименование;
			Подрядчик 			= ТекСтрока.АктВыполненныхРабот.Подрядчик.Наименование;
			СметаНомер			= ТекСтрока.АктВыполненныхРабот.ЛокальнаяСмета.НомерСметы;
			СметаНаименование 	= ТекСтрока.АктВыполненныхРабот.ЛокальнаяСмета.Наименование;
			Организация 		= ТекСтрока.АктВыполненныхРабот.ЛокальнаяСмета.Организация;
		Иначе
			ТекТаблицаРесурсов = СМ_СметаРасчетВызовСервера.ПолучитьТаблицуСтоимостиРесурсовАкта(ТекСтрока.АктВыполненныхРабот,Истина,,,,Истина,,ИсключатьМатериалыЗаказчика,Истина);
			Для Каждого ТекСтрокаРесурсов Из ТекТаблицаРесурсов Цикл
				НоваяСтрокаРесурсов = ТаблицаРесурсов.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРесурсов,ТекСтрокаРесурсов);
				НоваяСтрокаРесурсов.АктВыполненныхРабот = ТекСтрока.АктВыполненныхРабот;
			КонецЦикла;
			Организация = "";
		КонецЕсли;
		
		Если ВыводитьДоговор ИЛИ ВыводитьПодрядчика Тогда
			Если ВыводитьДоговор И ВыводитьПодрядчика Тогда
				ИнформацияПоАкту = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1%2№%3 за %4 по договору: %5; подрядчик: %6'"), ИнформацияПоАкту, ?(ИнформацияПоАкту="","",Символы.ПС), ТекСтрока.АктВыполненныхРабот.НомерАкта, Формат(ТекСтрока.АктВыполненныхРабот.Дата,"ДЛФ=D"),ТекСтрока.АктВыполненныхРабот.Договор,ТекСтрока.АктВыполненныхРабот.Подрядчик);
			ИначеЕсли Не ВыводитьДоговор И ВыводитьПодрядчика Тогда
				ИнформацияПоАкту = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1%2№%3 за %4 подрядчик: %5'"), ИнформацияПоАкту, ?(ИнформацияПоАкту="","",Символы.ПС), ТекСтрока.АктВыполненныхРабот.НомерАкта, Формат(ТекСтрока.АктВыполненныхРабот.Дата,"ДЛФ=D"),ТекСтрока.АктВыполненныхРабот.Подрядчик);
			ИначеЕсли ВыводитьДоговор И Не ВыводитьПодрядчика Тогда	
				ИнформацияПоАкту = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1%2№%3 за %4 по договору: %5'"), ИнформацияПоАкту, ?(ИнформацияПоАкту="","",Символы.ПС), ТекСтрока.АктВыполненныхРабот.НомерАкта, Формат(ТекСтрока.АктВыполненныхРабот.Дата,"ДЛФ=D"),ТекСтрока.АктВыполненныхРабот.Договор);
			КонецЕсли;
		Иначе
			ИнформацияПоАкту = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1%2№%3 за %4'"), ИнформацияПоАкту, ?(ИнформацияПоАкту="","","; "), ТекСтрока.АктВыполненныхРабот.НомерАкта, Формат(ТекСтрока.АктВыполненныхРабот.Дата,"ДЛФ=D"));
		КонецЕсли;
		
	КонецЦикла;
	
	ИнформацияПоСмете = "";
	Если Не МассивСмет = Неопределено Тогда
		Для Каждого ТекСмета Из МассивСмет Цикл
			СметаНомер = ТекСмета.Смета.НомерСметы;
			СметаНаименование = ТекСмета.Смета.Наименование;
			ИнформацияПоСмете = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1%2Смета №%3. %4'"),ИнформацияПоСмете,?(ИнформацияПоСмете="","","; "), СметаНомер, СметаНаименование);
		КонецЦикла;
	КонецЕсли;
	
	Если ТолькоМатериалы Тогда
		ТаблицаРесурсов = ТаблицаРесурсов.Скопировать(ТаблицаРесурсов.НайтиСтроки(Новый Структура("ВидРесурса",Перечисления.СМ_ВидыРесурсов.Материалы)));
	КонецЕсли;
	
	Если ИсключатьМатериалыЗаказчика Тогда
		МассивСтрок = ТаблицаРесурсов.НайтиСтроки(Новый Структура("СтатусРесурса",Перечисления.СМ_ОбеспечениеРесурса.Подрядчика));
		Для Каждого стр Из МассивСтрок Цикл
			ТаблицаРесурсов.Удалить(стр);
		КонецЦикла;
	КонецЕсли;
	
	ПревышениеОбъема = ПолучитьФункциональнуюОпцию("СМ_ПодтверждатьПревышениеОбъемаАкта");
	
	Если ТолькоФакт Тогда
		
		СписокСтрокДляУдаления = Новый СписокЗначений();
		Для Каждого Стр Из ТаблицаРесурсов Цикл
			Если Стр.РасходПоФакту = 0 Тогда
				Если ПревышениеОбъема И Стр.ВариантОтклонения = Перечисления.СМ_ВариантыОтклоненияНормы.СледующийПериод Тогда
					Продолжить;	
				КонецЕсли;
				СписокСтрокДляУдаления.Добавить(Стр);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Стр Из СписокСтрокДляУдаления Цикл
			ТаблицаРесурсов.Удалить(Стр.Значение);
		КонецЦикла;   
		
	КонецЕсли;
	
	ПараметрыЧисла 	= Новый КвалификаторыЧисла(15, 6);
	СтрокаТип 		= Новый ОписаниеТипов("Строка");
	ТаблицаРесурсов.Колонки.Добавить("Комментарий", СтрокаТип);
	
	Для Каждого стр Из ТаблицаРесурсов Цикл
		Если стр.РасходПоФакту > стр.РасходПоНорме Тогда 
			стр.Комментарий = Строка(стр.ВариантПревышения);
		ИначеЕсли стр.РасходПоФакту < стр.РасходПоНорме Тогда
			стр.Комментарий = Строка(стр.ВариантОтклонения);
		КонецЕсли;
	КонецЦикла;

	Если ТаблицаРесурсов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Разделять Тогда
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЕсли;
	Разделять = Истина;
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаРесурсов",ТаблицаРесурсов);
	
	// выводим результат 
	СхемаКомпоновкиДанных 	= ЭтотОбъект.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
    Настройки 				= ЭтотОбъект.КомпоновщикНастроек.Настройки;// СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	Если АктыВыполненныхРабот.Количество() = 1 Тогда 	
		СтрокаЗаказчик 		= "Заказчик: " + ТекСтрока.АктВыполненныхРабот.ЛокальнаяСмета.Заказчик.Наименование;
		СтрокаПодрядчик 	= "Подрядчик: " + ТекСтрока.АктВыполненныхРабот.Подрядчик.Наименование;
	Иначе
		СтрокаЗаказчик 		= "";
		СтрокаПодрядчик 	= "";
	КонецЕсли;

	Если ПредставлениеПериода <> "" Тогда
		СтрокаСметы 		= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='по заказчику %1'"), Заказчик);
		СтрокаАкта 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='за %1'"), ПредставлениеПериода);
		ДиректорОрганизации = "Начальник ______________";
	Иначе
		СтрокаСметы 		= ?(ЗначениеЗаполнено(ИнформацияПоСмете),ИнформацияПоСмете,СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Смета №%1. %2'"), СметаНомер, СметаНаименование));
		СтрокаАкта 			= СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='по актам: %1'"), ИнформацияПоАкту);
		ДиректорОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Директор %1'"),?(ЗначениеЗаполнено(Организация),Организация,"______________"));
	КонецЕсли;
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаЗаказчик",СтрокаЗаказчик);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаПодрядчик",СтрокаПодрядчик);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаСметы",СтрокаСметы);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СтрокаАкта",СтрокаАкта);
    Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДиректорОрганизации",ДиректорОрганизации);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВыводитьПодписи",ВыводитьПодписи);
	
	Если ТолькоМатериалы Тогда
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЗаголовокФормы","Форма М-29а");
	Иначе
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЗаголовокФормы","Форма М-29");
	КонецЕсли;

	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 
	// Инициализируем макет компоновки используя схему компоновки данных 
	// и созданные ранее настройки и данные расшифровки.
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных , ДанныеРасшифровки);
	
	// ДокументРезультат.Очистить();

	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	
	ПроцессорВывода.НачатьВывод();
	
	Параметры = Новый Структура;
	
	ПередВыводомМакета(ДокументРезультат, МакетКомпоновки, Параметры);

	Пока Истина Цикл
		
		ЭлементВывода = ПроцессорКомпоновки.Следующий();
		Если ЭлементВывода = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		Отказ = Ложь;
		
		ПередВыводомЭлементаМакета(ДокументРезультат, МакетКомпоновки, ЭлементВывода, Параметры, Отказ);
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		ПроцессорВывода.ВывестиЭлемент(ЭлементВывода);
		
	КонецЦикла;
	
	ПроцессорВывода.ЗакончитьВывод();	

	ДокументРезультат.НижнийКолонтитул.Выводить = Истина;
	ДокументРезультат.НижнийКолонтитул.Шрифт = Новый Шрифт(ДокументРезультат.НижнийКолонтитул.Шрифт, , , , Истина);
	ДокументРезультат.НижнийКолонтитул.ТекстВЦентре = НСтр("ru='Стр. [&НомерСтраницы] из [&СтраницВсего]'");
	// ДокументРезультат.ФиксацияСверху = 9;
	ОбластьШапкиПовтор = ДокументРезультат.Область(Параметры.ОбластьШапкиОтчета.Низ, ,Параметры.ОбластьШапкиОтчета.Низ) ;
	ДокументРезультат.ПовторятьПриПечатиСтроки = ОбластьШапкиПовтор;
	ДокументРезультат.АвтоМасштаб = Истина;

КонецПроцедуры

Процедура ПередВыводомМакета(Результат, МакетКомпоновки, Параметры)
	
	НачатьПоискОбластиШапкиОтчета(МакетКомпоновки, Параметры);
	
КонецПроцедуры

Процедура ПередВыводомЭлементаМакета(Результат, МакетКомпоновки, ЭлементВывода, Параметры, Отказ)
	
	НайтиОбластьШапкиОтчета(Результат, ЭлементВывода, Параметры);
	
КонецПроцедуры

// Вызывается в обработчике "ПередВыводомМакета"
//
Процедура НачатьПоискОбластиШапкиОтчета(МакетКомпоновки, ПараметрыОтчета)

	ПараметрыОтчета.Вставить("МакетШапки", ПолучитьМакетШапки(МакетКомпоновки.Тело));
	
КонецПроцедуры

// Возвращает имя макета шапки отчета
//
Функция ПолучитьМакетШапки(ТелоМакетаКомпоновки)

	КоличествоЭлементовТела = ТелоМакетаКомпоновки.Количество();
	Для ИндексЭлемента = 0 По КоличествоЭлементовТела - 1 Цикл
		
		ЭлементТела = ТелоМакетаКомпоновки[ИндексЭлемента];
		Если ТипЗнч(ЭлементТела) = Тип("ТаблицаМакетаКомпоновкиДанных")
			И Не ПустаяСтрока(ЭлементТела.МакетШапки) Тогда
			
			Возврат ЭлементТела.МакетШапки;
			
		ИначеЕсли ТипЗнч(ЭлементТела) = Тип("ГруппировкаМакетаКомпоновкиДанных") И ИндексЭлемента > 0
			И ТипЗнч(ТелоМакетаКомпоновки[ИндексЭлемента - 1]) = Тип("МакетОбластиМакетаКомпоновкиДанных") 
			И Не ПустаяСтрока(ТелоМакетаКомпоновки[ИндексЭлемента - 1].Макет) Тогда
			
			Возврат ТелоМакетаКомпоновки[ИндексЭлемента - 1].Макет;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

// Вызывается в обработчике "ПередВыводомЭлементаМакета"
//
Процедура НайтиОбластьШапкиОтчета(Результат, ЭлементВывода, ПараметрыОтчета)
	
	Если Не ПараметрыОтчета.Свойство("ОбластьШапкиОтчета") Тогда
		Если ПустаяСтрока(ПараметрыОтчета.МакетШапки) Тогда
			ПараметрыОтчета.Вставить("ОбластьШапкиОтчета");
		ИначеЕсли Не ПараметрыОтчета.Свойство("НомерСтрокиШапкиНачало") И ЭлементВывода.Макет = ПараметрыОтчета.МакетШапки Тогда
			ПараметрыОтчета.Вставить("НомерСтрокиШапкиНачало", Результат.ВысотаТаблицы + 1);
		ИначеЕсли ПараметрыОтчета.Свойство("НомерСтрокиШапкиНачало") Тогда
			ПараметрыОтчета.Вставить("НомерСтрокиШапкиКонец", Результат.ВысотаТаблицы);
			ПараметрыОтчета.Вставить("ОбластьШапкиОтчета", Результат.Область(ПараметрыОтчета.НомерСтрокиШапкиНачало, , ПараметрыОтчета.НомерСтрокиШапкиКонец));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти