
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Основная Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	уатТопливныеКарты.Основная,
		|	уатТопливныеКарты.КомуВыдана,
		|	уатТопливныеКарты.КемВыдана,
		|	уатТопливныеКарты.Ссылка
		|ИЗ
		|	Справочник.уатТопливныеКарты КАК уатТопливныеКарты
		|ГДЕ
		|	уатТопливныеКарты.КомуВыдана = &КомуВыдана
		|	И уатТопливныеКарты.Основная = ИСТИНА
		|	И уатТопливныеКарты.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("КомуВыдана", КомуВыдана);
		
		ТЗ = Запрос.Выполнить().Выгрузить();
		Если ТЗ.Количество() > 0 Тогда
			СпрОбъект = ТЗ[0].Ссылка.ПолучитьОбъект();
			СпрОбъект.Основная = Ложь;
			СпрОбъект.Записать();
			ТекстСообщения = "Установлена новая основная топливная карта для """ + КомуВыдана + """ (старая основная карта: """ + ТЗ[0].Ссылка + """)";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
