
Процедура Старт(пФорма) Экспорт
	пФорма.Пактум_УИД_ФоновогоЗадания=Строка(Новый УникальныйИдентификатор);
КонецПроцедуры

Процедура НачатьАутентификацию1С(ОповещениеОЗавершенииАутентификации) Экспорт
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершенииАутентификации, "");
КонецПроцедуры

Процедура СообщитьОНевозможностиАутентификацииЗавершение(ОповещениеОЗавершенииАутентификации) Экспорт
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершенииАутентификации, Неопределено);
	
КонецПроцедуры

Функция ПроверкаЗавершенияФоновогоЗадания(пКодПоЕДРПОУ, пКод, пУИД, пКоличествоПроверок_ФоновогоЗадания, пФорма, Конфигурация="БП") Экспорт
	СтруПодтверждение=Пактум_Сервер.ПолучитьПодтверждение_ЗавершенияФоновогоЗадания(пУИД);
	фЗавершить=Ложь;
	
	Если СтруПодтверждение.Выполнено Тогда
		РазблокироватьФорму(пФорма, Конфигурация);
		
		Если ОбъектИлиСписок(пФорма) = "Объект" Тогда
			Стру = Пактум_Сервер.ПолучитьКонтрагента(СокрЛП(пКодПоЕДРПОУ), пКод);
			
			пФорма.Модифицированность = Ложь;
			пФорма.Закрыть();
			Оповестить("Пактум.НовыйКонтрагент", Стру.Контрагент);
			ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", Стру.Контрагент));
		КонецЕсли;
		
		//Если СтруПодтверждение.Ошибки Тогда
		Если Не ПустаяСтрока(СокрЛП(СтруПодтверждение.ТекстОшибки)) Тогда
			Сообщить(СтруПодтверждение.ТекстОшибки);
		КонецЕсли;
		Пактум_Сервер.УдалитьИзРегистра_ФоновыеЗадания(пУИД);
		фЗавершить=Истина;
	Иначе
		Если пКоличествоПроверок_ФоновогоЗадания >=21 Тогда 	//3 мин + 30 сек
			Сообщить(НСтр("ru='Заполнить карточку контрагента с кодом ЕГРПОУ';uk= 'Заповнити картку контрагента з кодом ЄДРПОУ'") 
						+ " " + СокрЛП(пКодПоЕДРПОУ) + " " 
						+ НСтр("ru='не удалось.';uk= 'не вдалось.'"));
			фЗавершить=Истина;                                                                                             
			
			Если ОбъектИлиСписок(пФорма) = "Объект" Тогда
				РазблокироватьФорму(пФорма, Конфигурация);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат фЗавершить; 
КонецФункции

Процедура ЗаблокироватьФорму(пФорма, Конфигурация) Экспорт
	ВидФормы = ОбъектИлиСписок(пФорма);
	Если ВидФормы = "Объект" Тогда
		пФизЛицо=Ложь;
		Если Лев(Конфигурация, 2)="БП" Тогда
			Если пФорма.Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
				пФизЛицо=Истина;
			КонецЕсли;
		ИначеЕсли Конфигурация="УНФ" Тогда
			Если пФорма.Объект.ВидКонтрагента=ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель") Тогда
				пФизЛицо=Истина;
			КонецЕсли;
		КонецЕсли;
		Если пФизЛицо Тогда
			пФорма.Элементы.ЗаполнитьПоЕГРПОУ1.Видимость=Ложь;
			пФорма.Элементы.ДекорацияЗаполнитьПоЕГРПОУ1.Видимость=Истина;
		Иначе
			пФорма.Элементы.ЗаполнитьПоЕГРПОУ.Видимость=Ложь;
			пФорма.Элементы.ДекорацияЗаполнитьПоЕГРПОУ.Видимость=Истина;
		КонецЕсли;
		пФорма.ТолькоПросмотр=Истина;
	ИначеЕсли ВидФормы = "Список" Тогда
		пФорма.Элементы.ПактумСоздатьПоСпискуЕДРПОУ.Доступность = Ложь;
	ИначеЕсли ВидФормы = "Мониторинг" Тогда
		пФорма.Элементы.ДеревоПактумМониторинг.Доступность = Ложь;
		пФорма.Элементы.ДеревоПактумМониторингОбновитьДанные.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

Процедура РазблокироватьФорму(пФорма, Конфигурация) Экспорт
	ВидФормы = ОбъектИлиСписок(пФорма);
	Если ВидФормы = "Объект" Тогда
		пФизЛицо=Ложь;
		Если Лев(Конфигурация, 2)="БП" Тогда
			Если пФорма.Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
				пФизЛицо=Истина;
			КонецЕсли;
		ИначеЕсли Конфигурация="УНФ" Тогда
			Если пФорма.Объект.ВидКонтрагента=ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель") Тогда
				пФизЛицо=Истина;
			КонецЕсли;
		КонецЕсли;
		Если пФизЛицо Тогда
			пФорма.Элементы.ЗаполнитьПоЕГРПОУ1.Видимость=Истина;
			пФорма.Элементы.ДекорацияЗаполнитьПоЕГРПОУ1.Видимость=Ложь;
		Иначе
			пФорма.Элементы.ЗаполнитьПоЕГРПОУ.Видимость=Истина;
			пФорма.Элементы.ДекорацияЗаполнитьПоЕГРПОУ.Видимость=Ложь;
		КонецЕсли;
		пФорма.ТолькоПросмотр=Ложь;
	ИначеЕсли ВидФормы = "Список" Тогда
		пФорма.Элементы.ПактумСоздатьПоСпискуЕДРПОУ.Доступность = Истина;
	ИначеЕсли ВидФормы = "Мониторинг" Тогда
		пФорма.Элементы.ДеревоПактумМониторинг.Доступность = Истина;
		пФорма.Элементы.ДеревоПактумМониторингОбновитьДанные.Доступность = Истина;	
	КонецЕсли;
КонецПроцедуры

Процедура Лого_Нажатие() Экспорт
	ЗапуститьПриложение("http://pactumsys.com");
КонецПроцедуры

Функция ОбъектИлиСписок(пФорма) Экспорт 
	
	ЕстьСписок = пФорма.Элементы.Найти("Список");
	Если ЕстьСписок <> Неопределено Тогда
		Возврат "Список";
	КонецЕсли;
	
	ЕстьОбъект = пФорма.Элементы.Найти("Код");
	Если ЕстьОбъект <> Неопределено Тогда
		Возврат "Объект";
	КонецЕсли;
	
	ЕстьМониторинг = пФорма.Элементы.Найти("ДеревоПактумМониторинг");
	Если ЕстьМониторинг <> Неопределено Тогда
		Возврат "Мониторинг";
	КонецЕсли;
	
	Возврат "";
КонецФункции
