
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗадание(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьЗаданиеНаСервере(ПланПроизводства, ПолныйПересчет, Автозапуск);
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// дополнительных действий не предусмотрено
	Возврат;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЗаданиеНаСервере(ОбъектРасчета, ПолныйПересчет, Автозапуск)
	
	РегистрыСведений.ОчередьРасчетаПланаПроизводства.ДобавитьЗадание(ОбъектРасчета.Сценарий, ОбъектРасчета, Автозапуск)
	
КонецПроцедуры

#КонецОбласти

