
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ЗначенияРеквизитов);
	
	Элементы.СтавкаНДС.Видимость			 = Не Параметры.ЕстьКолонкаСтавкаНДС;
	Элементы.ЕдиницаИзмерения.Видимость		 = Не Параметры.ЕстьКолонкаЕдиницаИзмерения;
	
	Если ЗначениеЗаполнено(Параметры.СтавкаНДС) Тогда
		ЭтотОбъект.СтавкаНДС = Параметры.СтавкаНДС;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ЕдиницаИзмерения) Тогда
		ЭтотОбъект.ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	ЗначенияРеквизитов = Новый Структура;
	ЗначенияРеквизитов.Вставить("Родитель", Родитель);
	ЗначенияРеквизитов.Вставить("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	ЗначенияРеквизитов.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	ЗначенияРеквизитов.Вставить("СтавкаНДС", СтавкаНДС);
	ЗначенияРеквизитов.Вставить("Услуга", Услуга);
	
	Закрыть(ЗначенияРеквизитов);
	
КонецПроцедуры

