
&НаСервереБезКонтекста
Функция ПолучитьСписокВидовКИКонтрагента()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыКонтактнойИнформации.Ссылка,
	|	ВидыКонтактнойИнформации.Наименование
	|ИЗ
	|	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	|ГДЕ
	|	ВидыКонтактнойИнформации.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.СправочникКонтрагенты)";
	
	Результат = Новый СписокЗначений;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Результат.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ПолучитьСписокВидовКИКонтрагента()

&НаКлиенте
Процедура ВидНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить("Виды контактной информации");
	СписокТипов.Добавить("Строка");
	
	ВыбЭлем = Неопределено;

	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВидНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("СписокТипов", СписокТипов)), СписокТипов);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНачалоВыбораЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
    
    СписокТипов = ДополнительныеПараметры.СписокТипов;
    
    
    ВыбЭлем = ВыбранныйЭлемент;
    Если Не ВыбЭлем = Неопределено Тогда
        Если ВыбЭлем = СписокТипов[0] Тогда
            ВыбВидКИ = Неопределено;

            ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВидНачалоВыбораЗавершениеВыборКИ", ЭтотОбъект), ПолучитьСписокВидовКИКонтрагента());
            
        Иначе
            Запись.Вид = "";
        КонецЕсли;
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ВидНачалоВыбораЗавершениеВыборКИ(ВыбранныйЭлемент1, ДополнительныеПараметры1) Экспорт
    
    ВыбВидКИ = ВыбранныйЭлемент1;
    Если Не ВыбВидКИ = Неопределено Тогда 
        Запись.Вид = ВыбВидКИ;
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТолькоПросмотр = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекстСообщения = НСтр("ru = 'Данный объект предназначен для совместимости с предыдущей редакций. 
	|Изменение данных запрещено!'; en = 'This object is for compatibility with previous editions.
	| Modifying data is prohibited!'");
	ПоказатьПредупреждение(, ТекстСообщения, 60, НСтр("en='Data can be changed!';ru='Изменение данных запрещено!'"));
	Отказ = Истина;
КонецПроцедуры
