#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует компоновщик настроек компоновки данных,
// по данным источника получения данных хозяйственной операции.
//
// Параметры:
//	Форма - Форма - форма объекта.
//	ХозяйственнаяОперация - СправочникСсылка.НастройкиХозяйственныхОпераций - хозяйственная операция,
//							определяющая источник получения данных.
//
Процедура ИнициализироватьКомпоновщик(Форма, ХозяйственнаяОперация) Экспорт

	Форма.АдресСхемыКомпоновкиДанных = ПолучитьСхемуКомпоновкиДанных(Форма, ХозяйственнаяОперация);
	Если ЗначениеЗаполнено(Форма.АдресСхемыКомпоновкиДанных) Тогда
		Форма.Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Форма.АдресСхемыКомпоновкиДанных));
	КонецЕсли;

КонецПроцедуры

// Загружает настройки в компоновщик настроек.
//
// Параметры:
//	Форма - Форма - форма объекта.
//	Настройки - НастройкиКомпоновкиДанных - загружаемые настройки.
//
Процедура ЗагрузитьНастройки(Форма, Настройки) Экспорт

	Если Настройки <> Неопределено Тогда
		Форма.Компоновщик.ЗагрузитьНастройки(Настройки);
	КонецЕсли;

КонецПроцедуры

// Записывает информацию о дополнительном отборе, установленном в объекте.
// Вызывается в событиях "ПередЗаписьюНаСервере" в формах справочника.
//
// Параметры:
//	Форма - Форма - форма объекта.
//	Объект - СправочникОбъект.ШаблоныПроводокДляМеждународногоУчета - записываемый объект.  
//
Процедура ЗаписатьДополнительныйОтбор(Форма, Объект) Экспорт

	Объект.ДополнительныйОтбор = Новый ХранилищеЗначения(Форма.Компоновщик.ПолучитьНастройки());
	Объект.ПредставлениеОтбора = Строка(Форма.Компоновщик.Настройки.Отбор);

КонецПроцедуры

// Формирует индекс картинки для объекта справочника.
//
// Параметры:
//	ШаблонПроводки - СправочникОбъект.ШаблоныПроводокДляМеждународногоУчета - шаблон проводки.
//
// Возвращаемое значение:
//	Число - индекс картинки.
//
Функция ИндексКартинки(ШаблонПроводки) Экспорт

	Если ШаблонПроводки.ЭтоГруппаШаблонов Тогда
		Если ШаблонПроводки.ВариантСовместногоПрименения = Перечисления.ВариантыСовместногоПримененияШаблоновПроводок.Все Тогда
			Результат = 0;
		Иначе
			Результат = 1;
		КонецЕсли;
	Иначе
		Результат = 2;
	КонецЕсли;
	
	Если ШаблонПроводки.ПометкаУдаления Тогда
		Результат = Результат + 3
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка = Ложь;
		ЭтоГруппаШаблонов = Ложь;
		ШаблонПроводки = Неопределено;
		Если Параметры.Свойство("Ключ", ШаблонПроводки) И ЗначениеЗаполнено(ШаблонПроводки)
			ИЛИ Параметры.Свойство("ЗначениеКопирования", ШаблонПроводки) И ЗначениеЗаполнено(ШаблонПроводки) Тогда
			ЭтоГруппаШаблонов = МеждународнаяОтчетностьВызовСервера.ЭтоГруппаШаблонов(ШаблонПроводки);
		ИначеЕсли Параметры.Свойство("ДополнительныеПараметры") Тогда
			Если Параметры.ДополнительныеПараметры.Свойство("ЭтоГруппаШаблонов") Тогда
				ЭтоГруппаШаблонов = Параметры.ДополнительныеПараметры.ЭтоГруппаШаблонов;
			КонецЕсли;
		КонецЕсли;
		
		ВыбраннаяФорма = "Справочник.ШаблоныПроводокДляМеждународногоУчета.Форма." + ?(ЭтоГруппаШаблонов, "ФормаГруппы", "ФормаЭлемента");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСхемуКомпоновкиДанных(Форма, ХозяйственнаяОперация)

	АдресСКД = Неопределено;
	СхемаКомпоновкиДанных = ИсточникиДанныхПовтИсп.СхемаПолученияДанных(ХозяйственнаяОперация);
	Если СхемаКомпоновкиДанных <> Неопределено Тогда
		АдресСКД = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Форма.УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат АдресСКД;

КонецФункции

#КонецОбласти

#КонецЕсли