
////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.РаботаВМоделиСервиса.ПолучениеВнешнихКомпонент".
// ОбщийМодуль.ПолучениеВнешнихКомпонентВМоделиСервисаПереопределяемый.
//
// Серверные переопределяемые процедуры загрузки внешних компонент:
//  - внешних компоненты используемых программой;
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяются идентификаторы внешних компонент, которые используются в конфигурации.
// Указанные внешние компоненты будут загружены при обработке поставляемых данных.
//
// Параметры:
//  Идентификаторы - Массив - содержит идентификаторы внешних компоненты.
//
Процедура ПриОпределенииИспользуемыхВерсийВнешнихКомпонент(Идентификаторы) Экспорт
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриОпределенииИспользуемыхВерсийВнешнихКомпонент(Идентификаторы);
	// Конец ЭлектронноеВзаимодействие
	
КонецПроцедуры

#КонецОбласти
