
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ГлобальнаяСтрокаДереваСмет = Неопределено И Не ГлобальнаяСтрокаДереваСмет.ПометкаУдаления Тогда
		ГлСмета = ГлобальнаяСтрокаДереваСмет.Ссылка;
		ТекАкт	= ЗаполнитьПараметрАкт(ГлСмета);
	КонецЕсли;
	
	Если ТекАкт <> Неопределено Тогда
		ПараметрСсылка = Новый ПараметрКомпоновкиДанных("Ссылка");
		ТекЭлементы = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
		Для Каждого ТекЭлемент Из ТекЭлементы Цикл
			Если ТекЭлемент.Параметр = ПараметрСсылка Тогда
				ТекЭлемент.Значение = ТекАкт;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьПараметрАкт(ГлСмета)
	
	ТаблицаАктов = СМ_СметаВызовСервера.ПолучитьАктыСметы(ГлСмета);
	Если ТаблицаАктов.Количество() > 0 Тогда
		Возврат ТаблицаАктов[0].Ссылка;	
	Иначе
		Возврат Неопределено;	
	КонецЕсли;

КонецФункции

#КонецОбласти
