
&НаКлиенте
Процедура ОК(Команда)
	Закрыть(Новый Структура("Маршрут, Выход, Рейс", Маршрут, Выход, Рейс));
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если АвтоТест тогда
		Возврат;
	Конецесли;
	Если ВладелецФормы = Неопределено Тогда
		Отказ = Истина;
		ПоказатьПредупреждение(Новый ОписаниеОповещения("ПриОткрытииЗавершение", ЭтотОбъект), "Непосредственное открытие для данного объекта запрещено!", 10);
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытииЗавершение(ДополнительныеПараметры) Экспорт
	Зарезервировано = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		АвтоТест = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры
