
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьОтборПоПодразделению();
	УстановитьОтборВидРабочегоЦентраИсточник();
	УстановитьОтборВидРабочегоЦентраПриемник();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборПодразделениеПриИзменении(Элемент)
	
	УстановитьОтборПоПодразделению();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидРабочегоЦентраИсточникПриИзменении(Элемент)
	
	УстановитьОтборВидРабочегоЦентраИсточник();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВидРабочегоЦентраПриемникПриИзменении(Элемент)
	
	УстановитьОтборВидРабочегоЦентраПриемник();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Отборы

&НаСервере
Процедура УстановитьОтборПоПодразделению()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Подразделение", 
		ОтборПодразделение, 
		ВидСравненияКомпоновкиДанных.ВИерархии,
		, // Представление - автоматически
		ЗначениеЗаполнено(ОтборПодразделение));

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборВидРабочегоЦентраИсточник()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"ВидРабочегоЦентраИсточник", 
		ОтборВидРабочегоЦентраИсточник, 
		ВидСравненияКомпоновкиДанных.Равно,
		, // Представление - автоматически
		ЗначениеЗаполнено(ОтборВидРабочегоЦентраИсточник));

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборВидРабочегоЦентраПриемник()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"ВидРабочегоЦентраПриемник", 
		ОтборВидРабочегоЦентраПриемник, 
		ВидСравненияКомпоновкиДанных.Равно,
		, // Представление - автоматически
		ЗначениеЗаполнено(ОтборВидРабочегоЦентраПриемник));

КонецПроцедуры

#КонецОбласти

#КонецОбласти
