
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Амортизация(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ВнереализационныеДоходы(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ВнереализационныеРасходы(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСредстваБезналичные(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДенежныеСредстваНаличные(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДоговораДобровольногоСтрахованияРаботников(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДоходыБудущихПериодов(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДоходыОтРеализацииПрочегоИмущества(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ДоходыОтРеализацииТоваровИУслуг(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура КосвенныеРасходыНаПроизводствоИРеализацию(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура Материалы(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура МатериальныеРасходы(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НезавершенноеПроизводство(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура НематериальныеАктивы(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОперацииВыбытияИмуществаРаботУслуг(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОперацииВыбытияПрочегоИмущества(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОперацииПриобретенияИмуществаРаботУслуг(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОплатаТруда(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеСредства(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПолуфабрикатыИПродукция(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеКосвенныеРасходы(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПрочиеРасходы(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеРасходыОтносящиесяКРеализованнымТоварамУслугам(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПрямыеТранспортныеРасходы(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РасходыБудущихПериодов(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РасходыНаДобровольноеСтрахование(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РасходыОтРеализацииПрочегоИмущества(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РасчетыСБюджетом(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РасчетыСПоставщикамиИПокупателями(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура СпецоснасткаИСпецодеждаВЭксплуатации(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНаСкладе(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОтгруженные(Команда)
	ОткрытьРегистрНалоговогоУчета(Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура РеализацияОСиНМА(Команда)
	
	ОткрытьФорму("Отчет.РегистрНалоговогоУчетаФинРезультатовОтРеализацииАмортизируемогоИмущества.Форма.ФормаОтчета");
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрИнформацииОбОбъектеОС(Команда)
	
	ОткрытьФорму("Отчет.РегистрИнформацииОбОбъектеОС.Форма.ФормаОтчета");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьРегистрНалоговогоУчета(КлючВарианта)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", КлючВарианта);
	
	ОткрытьФорму("Отчет.РегистрыНалоговогоУчета.Форма.ФормаОтчета", ПараметрыФормы);
	
КонецПроцедуры


#КонецОбласти
