
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВладелецФормы = ПараметрыВыполненияКоманды.Источник;
	
	Если НЕ ВладелецФормы.Окно = ПараметрыВыполненияКоманды.Окно Тогда
		ТекстПредупреждения = НСтр("ru='Данные не редактируются в отдельном окне';uk='Дані не редагуються в окремому вікні'");
		ПоказатьПредупреждение(,ТекстПредупреждения);
	КонецЕсли; 
	
	ПараметрыОткрытия = Новый Структура("СсылкаНаОбъект", ПараметрКоманды);
	
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.СпециальныеСтатусы", 
		ПараметрыОткрытия, 
		ВладелецФормы, 
		, 
		ВладелецФормы.Окно);
		
КонецПроцедуры
