
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если ВебКлиент Тогда
	ОкноОткрытияПанели = ПараметрыВыполненияКоманды.Окно;
	#Иначе
	ОкноОткрытияПанели = ПараметрыВыполненияКоманды.Источник;
	#КонецЕсли 
	
	//ОткрытьФорму(
	//	"Обработка.УСОERP_ПанельСправочниковПодрядчикСтроительства.Форма.ПанельСправочниковПодрядчикСтроительства",
	//	,
	//	ПараметрыВыполненияКоманды.Источник,
	//	ПараметрыВыполненияКоманды.Уникальность,
	//	ОкноОткрытияПанели);
	
	ОткрытьФорму("Обработка.УСОERP_ПанельСправочниковПодрядчикСтроительства.Форма.ПанельСправочниковПодрядчикСтроительства",, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ОкноОткрытияПанели);
	
КонецПроцедуры
