#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

//////////////////////////////////////
// Процедуры расчета

Процедура РассчитатьСуммуДоговора()
	
	СуммаДоговора = СуммаДоговораБезРассрочки + СуммаРассрочки;
	
КонецПроцедуры

// Инициализирует новый документ.
//
Процедура ИнициализироватьДокумент()

	Ответственный       = ПараметрыСеанса.ТекущийПользователь;
	Организация         = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	СтатусДокумента = Перечисления.УПН_СтатусыДокументовПоСделке.НаСогласовании;
	Валюта               = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Валюта);
	ВалютаВзаиморасчетов = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(ВалютаВзаиморасчетов);
	
КонецПроцедуры // ИнициализироватьДокумент()

Процедура ЗаполнитьДокументПоБТИ(ПересчитатьГрафик = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПлощадиОбъектовНедвижимости.ОбщаяПлощадь,
	|	ПлощадиОбъектовНедвижимости.ЖилаяПлощадь,
	|	ПлощадиОбъектовНедвижимости.КоличествоЖилыхКомнат
	|ИЗ
	|	РегистрСведений.УПН_ПараметрыОбъектовНедвижимостиПоБТИ.СрезПоследних(, ОбъектНедвижимости = &Ссылка) КАК ПлощадиОбъектовНедвижимости";
	
	Для Каждого СтрокаТЧ Из ОбъектыНедвижимости Цикл
		Запрос.УстановитьПараметр("Ссылка", СтрокаТЧ.ОбъектНедвижимости);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			СтрокаТЧ.Сумма = СтрокаТЧ.ОбщаяПлощадь * СтрокаТЧ.Цена;
		КонецЕсли;
	КонецЦикла;
	
	СуммаДоговораБезРассрочки = ОбъектыНедвижимости.Итог("Сумма");
	РассчитатьСуммуДоговора();

КонецПроцедуры

/////////////////////////////////////////////////////////////
// Процедуры проведения.

// Процедура выполняет все необходимые проверки для возможного
// дальнейшего движения по бизнес-процессу.
//
// Параметры:
//  Нет.
//
Процедура ПроверкаДоговора(Отказ)
	
	// Проверка: Суммы выплаты по графику должны совпадать с суммой договора.
	Если ГрафикПлатежей.Количество() > 0 Тогда
		СуммаВыплаты = ГрафикПлатежей.Итог("СуммаВыплаты");
		СуммаПроцентаРассрочки = ГрафикПлатежей.Итог("СуммаПроцентаРассрочки");
		СуммаВыплатыБезРассрочки = ГрафикПлатежей.Итог("СуммаВыплатыБезРассрочки");
		Если Не СуммаВыплатыБезРассрочки = СуммаДоговораБезРассрочки Тогда
			ТекстОшибки = "Сумма итоговой выплаты без рассрочки по графику платежей составляет " + Формат(СуммаВыплатыБезРассрочки, "ЧДЦ=2") + " и не совпадает с суммой договора без рассрочки: " + Формат(СуммаДоговораБезРассрочки, "ЧДЦ=2") + "!";		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
		КонецЕсли;
		Если Не СуммаПроцентаРассрочки = СуммаРассрочки Тогда
			ТекстОшибки = "Сумма итогового процента рассрочки по графику платежей составляет " + Формат(СуммаПроцентаРассрочки, "ЧДЦ=2") + " и не совпадает с суммой рассрочки: " + Формат(СуммаРассрочки, "ЧДЦ=2") + "!";		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
		КонецЕсли;
		Если Не СуммаВыплаты = СуммаДоговора Тогда
			ТекстОшибки = "Сумма итоговой выплаты по графику платежей составляет " + Формат(СуммаВыплаты, "ЧДЦ=2") + " и не совпадает с суммой договора: " + Формат(СуммаДоговора, "ЧДЦ=2") + "!";		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,,, Отказ);
		КонецЕсли;
	КонецЕсли;
				
КонецПроцедуры

// Процедура формирует движения по регистрам.
//
// Параметры:
//  Нет.
//
Процедура СформироватьДвиженияПоНедвижимости()
			
	// Проведение по регистру Расчеты с клиентами по объектам недвижимости
	Движения.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Записывать = Истина;
	АналитикаУчетаПоПартнерам = РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(ЭтотОбъект);
	//>{УСО 2.0}:{Управление строительным предприятием}{Последов Д.В.}
	Движения.УСОERP_СоответствиеДоговоровИДолей.Записывать = Истина;
	//<{УСО 2.0}:{Управление строительным предприятием}{Последов Д.В.}
	Если ОбъектыНедвижимости.Количество() > 0 Тогда
		Коэффициенты = ОбщегоНазначения.ВыгрузитьКолонку(ОбъектыНедвижимости, "Сумма");
		Результаты = ОбщегоНазначения.РаспределитьСуммуПропорциональноКоэффициентам(СуммаРассрочки, Коэффициенты);
		
		Индекс = 0;
		Для Каждого СтрокаТЧ Из ОбъектыНедвижимости Цикл
			
			НоваяЗапись = Движения.УПН_РасчетыСКлиентамиПоОбъектамНедвижимости.Добавить();
			НоваяЗапись.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяЗапись.Период = Дата;
			НоваяЗапись.ОбъектНедвижимости = СтрокаТЧ.ОбъектНедвижимости;
			НоваяЗапись.АналитикаУчетаПоПартнерам = АналитикаУчетаПоПартнерам;
			НоваяЗапись.Договор = Договор;
			НоваяЗапись.Валюта = Договор.ВалютаВзаиморасчетов;
			НоваяЗапись.Сумма = СтрокаТЧ.Сумма + ?(ЦенаВключаетНДС, 0, СтрокаТЧ.СуммаНДС) + ?(Результаты = Неопределено, 0, Результаты[Индекс]);
			НоваяЗапись.Площадь = СтрокаТЧ.ОбщаяПлощадь;
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура СформироватьДвиженияПоРегиструСоответствияДоговоровИДолей()
	Движения.УСОERP_СоответствиеДоговоровИДолей.Записывать = Истина;
	Если ОбъектыНедвижимости.Количество() > 0 Тогда
		Для Каждого СтрокаТЧ Из ОбъектыНедвижимости Цикл
			НоваяЗаписьСоответствиеДолей = Движения.УСОERP_СоответствиеДоговоровИДолей.Добавить();
			НоваяЗаписьСоответствиеДолей.Период = Дата;
			НоваяЗаписьСоответствиеДолей.Расторгнут = Ложь;
			НоваяЗаписьСоответствиеДолей.Агент = КонтрагентАгент;
			НоваяЗаписьСоответствиеДолей.Договор = Договор;
			НоваяЗаписьСоответствиеДолей.ДоговорАгента = ДоговорАгента;
			НоваяЗаписьСоответствиеДолей.Доля = СтрокаТЧ.ОбъектНедвижимости;
			НоваяЗаписьСоответствиеДолей.Контрагент = Контрагент;
			НоваяЗаписьСоответствиеДолей.ОбщаяПлощадь = СтрокаТЧ.ОбщаяПлощадь;
			НоваяЗаписьСоответствиеДолей.Статус = СтатусДокумента;
			НоваяЗаписьСоответствиеДолей.Сумма = СтрокаТЧ.Сумма;
			НоваяЗаписьСоответствиеДолей.СуммаВознаграждения = СуммаВознаграждения;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// КОНТРОЛЬ ПРОВЕДЕНИЯ

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;

	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры // СформироватьСписокРегистровДляКонтроля()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		
	ИнициализироватьДокумент();
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
	
	//>{УСО 2.0}:{Управление строительным предприятием}{Последов Д.В.}
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Контрагент = ДанныеЗаполнения.Контрагент;
		Партнер = ДанныеЗаполнения.Контрагент.Партнер;
		Договор = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		НомерДоговора = ДанныеЗаполнения.Номер;
		ДатаДоговора = ДанныеЗаполнения.ДатаНачалаДействия;
		Если ЗначениеЗаполнено(ДанныеЗаполнения.УСОERP_ТипЦены) Тогда
			ВидЦены = ДанныеЗаполнения.УСОERP_ТипЦены;
			Валюта = ДанныеЗаполнения.УСОERP_ТипЦены.ВалютаЦены;
			ВалютаВзаиморасчетов = Валюта;
			ЦенаВключаетНДС = ДанныеЗаполнения.УСОERP_ТипЦены.ЦенаВключаетНДС;
		КонецЕсли;
	КонецЕсли;
	//<{УСО 2.0}:{Управление строительным предприятием}{Последов Д.В.}
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
	Если ГрафикПлатежей.Количество() = 0 Тогда
		ИндексРеквизита = ПроверяемыеРеквизиты.Найти("ПериодичностьОплаты");
		Если ИндексРеквизита <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндексРеквизита);
		КонецЕсли;
	КонецЕсли;
	ПроверкаДоговора(Отказ);
			
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры // ПередЗаписью()

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Если СтатусДокумента = Перечисления.УПН_СтатусыДокументовПоСделке.Подписано Тогда
		СформироватьДвиженияПоНедвижимости();
	КонецЕсли;
	
	//>{УСО 2.0}:{Управление строительным предприятием}{Последов Д.В.}
	СформироватьДвиженияПоРегиструСоответствияДоговоровИДолей();
	//<{УСО 2.0}:{Управление строительным предприятием}{Последов Д.В.}
	
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ПриКопировании(ОбъектКопирования)
	
	СтатусДокумента = Перечисления.УПН_СтатусыДокументовПоСделке.НаСогласовании;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
