#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Прочее

Процедура ПересчитатьНомераВУровне(СценарийПланирования,Родитель) Экспорт
	
	Сч = 1;
	
	Выборка  = Справочники.УСОERP_СтроительныеРаботы.Выбрать(Родитель,СценарийПланирования,,"НомерРаботыВУровне");
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.НомерРаботыВУровне <> Сч Тогда
			
			Выб = Выборка.ПолучитьОбъект();
			Выб.НомерРаботыВУровне = Сч;
			Выб.НомерРаботыВУровнеСтрокой = Формат(Сч,"ЧГ=0");
			Выб.ДополнительныеСвойства.Вставить("КопированиеСценария");
			Выб.Записать();
			
		КонецЕсли;
		
		Сч = Сч+1;
		
	КонецЦикла; 	
	
КонецПроцедуры

Функция ПолучитьВыполненныйОбъем(Работа)  Экспорт
	
	Если НЕ ЗначениеЗаполнено(Работа) Тогда
		Возврат 0;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Работа",Работа);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Работа КАК Работа,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем
	|ПОМЕСТИТЬ ВрТаб_Выполнение
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Работа КАК Работа,
	|		УСОERP_ВыполнениеРаботЗаказчика.Объем КАК Объем
	|	ИЗ
	|		РегистрНакопления.УСОERP_ВыполнениеРаботЗаказчика КАК УСОERP_ВыполнениеРаботЗаказчика
	|	ГДЕ
	|		УСОERP_ВыполнениеРаботЗаказчика.Работа В ИЕРАРХИИ(&Работа)
	|		И УСОERP_ВыполнениеРаботЗаказчика.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		&Работа,
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Объем
	|	ИЗ
	|		РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком КАК УСОERP_ВыполнениеРаботСубподрядчиком
	|	ГДЕ
	|		УСОERP_ВыполнениеРаботСубподрядчиком.Работа В ИЕРАРХИИ(&Работа)
	|		И УСОERP_ВыполнениеРаботСубподрядчиком.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Работа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Работа КАК Работа,
	|	СУММА(ВложенныйЗапрос.Объем) КАК Объем
	|ПОМЕСТИТЬ ВрТаб_Учет
	|ИЗ
	|	(ВЫБРАТЬ
	|		&Работа КАК Работа,
	|		УСОERP_УчетВыполненныхРабот.Объем КАК Объем
	|	ИЗ
	|		РегистрНакопления.УСОERP_УчетВыполненныхРабот КАК УСОERP_УчетВыполненныхРабот
	|	ГДЕ
	|		УСОERP_УчетВыполненныхРабот.Работа В ИЕРАРХИИ(&Работа)
	|		И УСОERP_УчетВыполненныхРабот.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Работа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Работа КАК Работа,
	|	МАКСИМУМ(ВложенныйЗапрос.Объем) КАК Объем
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВрТаб_Выполнение.Работа КАК Работа,
	|		ВрТаб_Выполнение.Объем КАК Объем
	|	ИЗ
	|		ВрТаб_Выполнение КАК ВрТаб_Выполнение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВрТаб_Учет.Работа,
	|		ВрТаб_Учет.Объем
	|	ИЗ
	|		ВрТаб_Учет КАК ВрТаб_Учет) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Работа";
	
	Возврат Запрос.Выполнить().Выгрузить().Итог("Объем");

КонецФункции

Функция ПорядокСортировки(КодСДР) Экспорт
	
	ПорядокСортировки = "";
	
	МассивПодСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(КодСДР,".");
	
	Для Каждого ЭлементМассива ИЗ МассивПодСтрок Цикл
		
		 ПорядокСортировки = ""+ПорядокСортировки+""+Формат(Число(ЭлементМассива),"ЧЦ=4; ЧВН=; ЧГ=0");
		 
	 КонецЦикла;
	
	Возврат ПорядокСортировки;
	
КонецФункции

#КонецОбласти

#КонецЕсли