&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьСерверПодчиненныйДокумент();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриЧтенииСозданииНаСервере();
	Иначе 
		//	ОбновитьСерверПодчиненныйДокумент();	
	КонецЕсли;
	
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;
	
	ЭтаФорма.ТолькоПросмотр = (Объект.Статус = Перечисления.СтатусыПланов.Утвержден И Объект.Проведен);
	Если ЭтаФорма.ТолькоПросмотр Тогда
		Элементы.Заполнить.Доступность = Ложь;
		Элементы.Подбор.Доступность = Ложь;
		Элементы.ВыполненоВсегоЗаполнитьВыполненоВсего.Доступность = Ложь;
	КонецЕсли;
		
	УСОERP_ОбработкаТабличныхЧастей.СортироватьТаблицу(Объект.Работы);
	
	СформироватьНадписьВалюты(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
		// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ТекущаяСтрока	=	Элементы.Работы.ТекущаяСтрока;
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, "Работы", ТекущаяСтрока);
 	РассчитатьИтоговыеПоказатели(ЭтаФорма, "Работы");
	
	Если ИсточникВыбора.ИмяФормы = "Документ.УСОERP_УчетВыполненныхРабот.Форма.ФормаВыбора" Тогда
		//ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, "Работы");
		РассчитатьИтоговыеПоказатели(ЭтаФорма, "Работы");
	КонецЕсли;
	
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства 	

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
		
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

	ОбновитьВспомогательныеРеквизитыТабличнойЧастиРаботы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	ОбновитьСубподрядныеСМРНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтложенныйНДСПриИзменении(Неопределено);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
	Если ИмяСобытия = "Запись_АктВыполненныхРабот" Тогда 
		ОбновитьСерверПодчиненныйДокумент();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Для Каждого Эл из Объект.Работы Цикл 	
	//	Эл.Длительность = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(Эл.Работа, Эл.ДатаНачала, Эл.ДатаОкончания, Эл.ЕдиницаДлительности);
	//КонецЦикла;	
	//
	//Для Каждого Эл из Объект.СубподрядныеСМР Цикл 	
	//	Эл.Длительность = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(Эл.Работа, Эл.ДатаНачала, Эл.ДатаОкончания, Эл.ЕдиницаДлительности);
	//КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПриИзмененииОрганизацииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПериодаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)	
	
	ПриИзмененииПартнераСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПартнерОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоглашениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыВыбораСоглашения = ПродажиКлиент.ПараметрыНачалаВыбораСоглашенияСКлиентом();
	
	ПараметрыВыбораСоглашения.Элемент                     = Элемент;
	ПараметрыВыбораСоглашения.Партнер                     = Объект.Партнер;
	ПараметрыВыбораСоглашения.Документ                    = Объект.Соглашение;
	ПараметрыВыбораСоглашения.ДатаДокумента               = Объект.Дата;
	ПараметрыВыбораСоглашения.ХозяйственнаяОперация       = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.РеализацияКлиенту");
	ПараметрыВыбораСоглашения.ДанныеФормыСтруктура        = Объект;
	
	ПродажиКлиент.НачалоВыбораСоглашенияСКлиентом(ПараметрыВыбораСоглашения, СтандартнаяОбработка);
		
КонецПроцедуры
	
&НаКлиенте
Процедура СоглашениеПриИзменении(Элемент)	
	
	ПриИзмененииСоглашенияСервер();
	
КонецПроцедуры	

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)	
	
	ПриИзмененииКонтрагентаСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийОбъектСтроительства)
		И ТекущийОбъектСтроительства <> Объект.ОбъектСтроительства 
		И Объект.Работы.Количество()>0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ПроектПриИзмененииПродолжение",ЭтотОбъект),"Табличная часть работ будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ПроектПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзмененииПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Объект.ОбъектСтроительства = ТекущийОбъектСтроительства;
		Возврат;
	КонецЕсли;
	
	Объект.Работы.Очистить();
	
	ПроектПриИзмененииНаСервере(); 	
	
КонецПроцедуры  

&НаКлиенте
Процедура ПроектОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
		
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Объект.Работы.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОчиститьТабличнуюЧасть(ВыбранноеЗначение, Элемент.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	//ДатаПриИзмененииСервер();
	//Если Объект.Дата < Объект.ДатаНачала ИЛИ Объект.Дата > Объект.ДатаОкончания Тогда 
	//	Объект.ДатаНачала = Объект.Дата;	
	//КонецЕсли;		
	ПриИзмененииПериода(Объект.Дата);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыСтоимостьСНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущаяСтрока;
	
	РаботыСтоимостьСНДСПриИзмененииНаСервере(ТекущаяСтрока);
	
	ПересчитатьСуммуНДС(ТекущаяСтрока, "Работы");

	//РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма, ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура РаботыСтоимостьСНДСПриИзмененииНаСервере(ИдентификаторСтроки)
	
	ТекущаяСтрока					=	Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Не ТекущаяСтрока.СтоимостьВсего = 0 Тогда
		ТекущаяСтрока.ОбъемРеализации	=	?(ТекущаяСтрока.СтоимостьВсего = 0, 0, Окр(ТекущаяСтрока.СуммаСНДС * ТекущаяСтрока.ОбъемВсего / ТекущаяСтрока.СтоимостьВсего,2));
		ТекущаяСтрока.ПроцентРеализации	=	?(ТекущаяСтрока.ОбъемВсего = 0, 0, Окр(ТекущаяСтрока.ОбъемРеализации * 100 / ТекущаяСтрока.ОбъемВсего,2));
	Иначе
		ТекущаяСтрока.СуммаСНДС = 0;
	КонецЕсли;
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма, ТекущаяСтрока) ;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущаяСтрока;
	
	ПересчитатьСуммуНДС(ТекущаяСтрока, "Работы");

КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущаяСтрока;
	
	//ЗаполнитьРаботыНаСервере();
	РаботаПриИзмененииНаСервере(ТекущаяСтрока, "Работы");
	
	ПересчитатьСуммуНДС(ТекущаяСтрока, "Работы");
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыРаботаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	=	Ложь;
		
	//СписокРабот = Неопределено;
	//ЗаполнитьРаботыНаСервере(СписокРабот, Истина, Истина);
	//
	//Форма = ПолучитьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаВыбора", Новый Структура("ОбъектСтроительства, СписокРабот", Объект.ОбъектСтроительства, СписокРабот), ЭтаФорма);	
	Форма = ПолучитьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаВыбора", Новый Структура("Организация, ОбъектСтроительства, Утверждена", Объект.Организация, Объект.ОбъектСтроительства, Истина), ЭтаФорма);	
	Форма.Открыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВладельцев(ОбъектСтроительства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_СценарииПланированияПроектовСтроительства.Ссылка КАК Владелец
	|ИЗ
	|	Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
	|ГДЕ
	|	УСОERP_СценарииПланированияПроектовСтроительства.Владелец = &ОбъектСтроительств
	|	И УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий)
	|	И УСОERP_СценарииПланированияПроектовСтроительства.Организация = &Организация
	|	И УСОERP_СценарииПланированияПроектовСтроительства.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ОбъектСтроительств", ОбъектСтроительства);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Владелец");
	
КонецФункции

&НаКлиенте
Процедура РаботыПроцентРеализацииПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущаяСтрока;
	
	РаботыПроцентРеализацииПриИзмененииНаСервере(ТекущаяСтрока);
	
	ПересчитатьСуммуНДС(ТекущаяСтрока, "Работы");
	
КонецПроцедуры

&НаСервере
Процедура РаботыПроцентРеализацииПриИзмененииНаСервере(ИдентификаторСтроки)
	
	ТекущаяСтрока					=	Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущаяСтрока.ОбъемРеализации	=	ТекущаяСтрока.ОбъемВсего * ТекущаяСтрока.ПроцентРеализации / 100;
	ТекущаяСтрока.СуммаСНДС			=	?(ТекущаяСтрока.ОбъемВсего = 0, 0, Окр(ТекущаяСтрока.СтоимостьВсего * ТекущаяСтрока.ОбъемРеализации / ТекущаяСтрока.ОбъемВсего,2));
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыОбъемРеализацииПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Работы.ТекущаяСтрока;
	
	РаботыОбъемРеализацииПриИзмененииНаСервере(ТекущаяСтрока);
	
	ПересчитатьСуммуНДС(ТекущаяСтрока, "Работы");
													
КонецПроцедуры

&НаСервере
Процедура РаботыОбъемРеализацииПриИзмененииНаСервере(ИдентификаторСтроки)
	
	ТекущаяСтрока					=	Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущаяСтрока.ПроцентРеализации	=	?(ТекущаяСтрока.ОбъемВсего = 0, 0, окр(ТекущаяСтрока.ОбъемРеализации * 100 / ТекущаяСтрока.ОбъемВсего,2));
	ТекущаяСтрока.СуммаСНДС			=	?(ТекущаяСтрока.ОбъемВсего = 0, 0, Окр(ТекущаяСтрока.СтоимостьВсего * ТекущаяСтрока.ОбъемРеализации / ТекущаяСтрока.ОбъемВсего,2));
	
	РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура СубподрядныеСМРОбъемПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СубподрядныеСМР.ТекущаяСтрока;
	
	СубподрядныеСМРОбъемПриИзмененииНаСервере(ТекущаяСтрока);
	
	ПересчитатьСуммуНДС(ТекущаяСтрока, "СубподрядныеСМР");

КонецПроцедуры

&НаСервере
Процедура СубподрядныеСМРОбъемПриИзмененииНаСервере(ИдентификаторСтроки)
	
	//ТекущаяСтрока					=	Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	//ТекущаяСтрока.ОбъемРеализации	=	ТекущаяСтрока.СуммаСНДС * ТекущаяСтрока.ОбъемВсего / ТекущаяСтрока.СтоимостьВсего;
	//ТекущаяСтрока.ПроцентРеализации	=	ТекущаяСтрока.ОбъемРеализации * 100 / ТекущаяСтрока.ОбъемВсего;
	
КонецПроцедуры

&НаКлиенте
Процедура СубподрядныеСМРСуммаСНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СубподрядныеСМР.ТекущаяСтрока;
	
	СубподрядныеСМРСуммаСНДСПриИзмененииНаСервере(ТекущаяСтрока);
	
	ПересчитатьСуммуНДС(ТекущаяСтрока, "СубподрядныеСМР");

КонецПроцедуры

&НаСервере
Процедура СубподрядныеСМРСуммаСНДСПриИзмененииНаСервере(ИдентификаторСтроки)
	
	//ТекущаяСтрока					=	Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	//ТекущаяСтрока.ОбъемРеализации	=	ТекущаяСтрока.СуммаСНДС * ТекущаяСтрока.ОбъемВсего / ТекущаяСтрока.СтоимостьВсего;
	//ТекущаяСтрока.ПроцентРеализации	=	ТекущаяСтрока.ОбъемРеализации * 100 / ТекущаяСтрока.ОбъемВсего;
	
КонецПроцедуры

&НаКлиенте
Процедура СубподрядныеСМРСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.СубподрядныеСМР.ТекущаяСтрока;
	
	ПересчитатьСуммуНДС(ТекущаяСтрока, "СубподрядныеСМР");

КонецПроцедуры

&НаКлиенте
Процедура НадписьВалютыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаДокумента"         , Объект.Валюта);
	СтруктураПараметров.Вставить("ВалютаВзаиморасчетов"    , Объект.ВалютаВзаиморасчетов);
	СтруктураПараметров.Вставить("СуммаВзаиморасчетов"     , ?(Объект.ВыполненоВсего.Количество(),Объект.ВыполненоВсего.Итог("СуммаВзаиморасчетов"),Объект.Работы.Итог("СуммаВзаиморасчетов")));
	СтруктураПараметров.Вставить("СуммаДокумента"          , ?(Объект.ВыполненоВсего.Количество(),Объект.ВыполненоВсего.Итог("Сумма"),Объект.Работы.Итог("СуммаСНДС")));
	СтруктураПараметров.Вставить("Курс"                    , Объект.Курс);
	СтруктураПараметров.Вставить("Кратность"               , Объект.Кратность);
	СтруктураПараметров.Вставить("ДатаДокумента"           , Объект.Дата);
	СтруктураПараметров.Вставить("ЭтоДокументПродажи"      , Истина); 
	
	СтруктураПараметров.Вставить("ТолькоПросмотр"          , ЭтаФорма.ТолькоПросмотр);  	
		
	СтруктураПараметров.Вставить("ВалютаДокументаТолькоПросмотр", ЭтаФорма.ТолькоПросмотр);
	
	ДополнительныеПараметры = Новый Структура;
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОбработатьИзмененияПоКнопкеВзаиморасчеты", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("ОбщаяФорма.ВалютыИКурсДокумента", СтруктураПараметров,,,,,ОповещениеОЗакрытии);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеВзаиморасчеты(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		
		ИзмениласьВалютаВзаиморасчетов = РезультатЗакрытия.ВалютаВзаиморасчетов <> Объект.ВалютаВзаиморасчетов;
		ИзмениласьВалюта = РезультатЗакрытия.Валюта <> Объект.Валюта;
		
		Объект.Валюта = РезультатЗакрытия.Валюта;
		
		Если ИзмениласьВалюта Тогда
			
			Если ЦенообразованиеКлиент.НеобходимПересчетВВалюту(Объект, ВалютаДокумента, "ВыполненоВсего","Сумма") 
				И РезультатЗакрытия.НеобходимПересчетСуммДокумента Тогда
				
				ПриИзмененииВалютыСервер(Объект.Валюта);
				ЦенообразованиеКлиент.ОповеститьОбОкончанииПересчетаСуммВВалюту(ВалютаДокумента, Объект.Валюта);
				
			КонецЕсли;
			
			ВалютаДокумента = Объект.Валюта; 			
			
		КонецЕсли;
		
		Объект.ВалютаВзаиморасчетов = РезультатЗакрытия.ВалютаВзаиморасчетов;
		
		Если ИзмениласьВалютаВзаиморасчетов Тогда
			
			ВалютаВзаиморасчетовДокумента = Объект.ВалютаВзаиморасчетов;
			
		КонецЕсли;
		
		Объект.Курс					= РезультатЗакрытия.Курс;
		Объект.Кратность			= РезультатЗакрытия.Кратность;
		Объект.СуммаВзаиморасчетов	= РезультатЗакрытия.СуммаВзаиморасчетов;
		
		ПерераспредитьСуммуВзаиморасчетовИСформироватьНадпись();
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
КонецПроцедуры   

&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьНадписьВалюты(Форма)
	
	ПараметрыНадписиВалюты = ВзаиморасчетыКлиентСервер.ПараметрыНадписиВалюты();
	
	ПараметрыНадписиВалюты.ВалютаДокумента      = Форма.ВалютаДокумента;
	ПараметрыНадписиВалюты.ВалютаВзаиморасчетов = Форма.ВалютаВзаиморасчетовДокумента;
	ПараметрыНадписиВалюты.ВалютаРеглУчета      = Форма.ВалютаРегламентированногоУчета;
	ПараметрыНадписиВалюты.СуммаДокумента       = ?(Форма.Объект.ВыполненоВсего.Количество(),Форма.Объект.ВыполненоВсего.Итог("Сумма"),Форма.Объект.Работы.Итог("СуммаСНДС"));
	ПараметрыНадписиВалюты.СуммаВзаиморасчетов  =  ?(Форма.Объект.ВыполненоВсего.Количество(),Форма.Объект.ВыполненоВсего.Итог("СуммаВзаиморасчетов"),Форма.Объект.Работы.Итог("СуммаВзаиморасчетов"));
	ПараметрыНадписиВалюты.Курс                 = Форма.Объект.Курс;
	ПараметрыНадписиВалюты.Кратность            = Форма.Объект.Кратность;
	
	Форма.НадписьВалюты = ВзаиморасчетыКлиентСервер.СформироватьНадписьВалюты(ПараметрыНадписиВалюты);
	
КонецПроцедуры

&НаСервере
Процедура ПерераспредитьСуммуВзаиморасчетовИСформироватьНадпись()
	
	СтруктураКурса = РаботаСКурсамиВалютУТ.СтруктураКурсаВалюты(Объект.Курс, Объект.Кратность);
	
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьЗначенияСвойствКоллекции(
	Объект.Работы,
	0,
	"СуммаВзаиморасчетов");
	
	ОбщегоНазначенияУТКлиентСервер.ЗаполнитьЗначенияСвойствКоллекции(
	Объект.ВыполненоВсего,
	0,
	"СуммаВзаиморасчетов");
	
	
	Ценообразование.РассчитатьСуммыВзаиморасчетовВТабличнойЧасти(Объект, "ВыполненоВсего", СтруктураКурса);
	Ценообразование.РассчитатьСуммыВзаиморасчетовВТабличнойЧасти(Объект, "Работы", СтруктураКурса);
	
	СформироватьНадписьВалюты(ЭтаФорма);
	
КонецПроцедуры 

&НаСервере
Процедура ПриИзмененииВалютыСервер(НоваяВалюта)
	
	СтараяВалюта                = ВалютаДокумента;
	ДатаДокумента               = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата,ТекущаяДатаСеанса());
	СтруктураКурсовСтаройВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(СтараяВалюта, ДатаДокумента);
	СтруктураКурсовНовойВалюты  = РаботаСКурсамиВалют.ПолучитьКурсВалюты(НоваяВалюта,  ДатаДокумента);
	
	Для Каждого ТекСтрока ИЗ Объект.ВыполненоВсего Цикл 		
		
		ТекСтрока.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
		ТекСтрока.Сумма,
		СтараяВалюта,НоваяВалюта,
		СтруктураКурсовСтаройВалюты.Курс,СтруктураКурсовНовойВалюты.Курс,
		СтруктураКурсовСтаройВалюты.Кратность,СтруктураКурсовНовойВалюты.Кратность);
		
		ТекСтрока.СуммаСНДС = ТекСтрока.Сумма; 	
		
		ТекСтрока.Цена = ?(ТекСтрока.КоличествоУпаковок,ТекСтрока.Сумма/ТекСтрока.КоличествоУпаковок,0);
		ТекСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекСтрока.СуммаСНДС, ТекСтрока.СтавкаНДС, Истина);   
		
	КонецЦикла; 		
	
	Для Каждого ТекСтрока ИЗ Объект.Работы Цикл
		
		ТекСтрока.СуммаСНДС = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(
		ТекСтрока.СуммаСНДС,
		СтараяВалюта,НоваяВалюта,
		СтруктураКурсовСтаройВалюты.Курс,СтруктураКурсовНовойВалюты.Курс,
		СтруктураКурсовСтаройВалюты.Кратность,СтруктураКурсовНовойВалюты.Кратность);
		
		ТекСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекСтрока.СуммаСНДС, ТекСтрока.СтавкаНДС, Истина);
		
	КонецЦикла;
	
	Объект.СуммаДокумента = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаСНДС"),ОБъект.ВыполненоВсего.Итог("СуммаСНДС"));	
	Объект.СуммаНДС = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаНДС"),ОБъект.ВыполненоВсего.Итог("СуммаНДС"));
	
	//СтруктураПересчета = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаСуммыНДСВТЧ(Объект);
	//СтруктураДействий = Новый Структура;
	//СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчета);
	//СтруктураДействий.Вставить("ОчиститьСуммуВзаиморасчетов");
	//ОбработкаТабличнойЧастиСервер.ОбработатьТЧ(Объект.ВыполненоВсего, СтруктураДействий, Неопределено);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаботы(Команда)
	
	Если Объект.ВыполненоВсего.Количество() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРаботыПродолжение",ЭтотОбъект);
		
		ПоказатьВопрос(ОписаниеОповещения,"Очистить табличную часть ""Выполнено всего""?",РежимДиалогаВопрос.ДаНет);
		
	КонецЕсли;
			
	ЗаполнитьРаботыНаСервере();
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма, "Работы");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРаботыПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.ВыполненоВсего.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСубподрядныеСМР(Команда)
	
	СписокРабот	=	Новый СписокЗначений;
	Для каждого ЭлРабота Из Объект.Работы Цикл
		СписокРабот.Добавить(ЭлРабота.Работа);
	КонецЦикла;
	
	ЗаполнитьСубподрядныеСМРНаСервере(СписокРабот);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	СтруктураОтбора = Новый Структура;
	ЗаполнитьСтруктуруОтбораНаСервере(СтруктураОтбора);

	ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаПодбора",СтруктураОтбора,ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтруктуруОтбораНаСервере(СтруктураОтбора) 	
		
	Если НовыйВариант Тогда
		
		СтруктураОтбора.Вставить("ДокументУтверждения",Объект.ДокументУтверждения);
		Возврат;
		
	КонецЕсли;
	
	СтруктураОтбора.Вставить("Организация",Объект.Организация);
	СтруктураОтбора.Вставить("ОбъектСтроительства",Объект.ОбъектСтроительства);
	СтруктураОтбора.Вставить("ПометкаУдаления",Ложь);
	СтруктураОтбора.Вставить("Утверждена",Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьАктНажатие(Элемент)
	
	Если ПодчиненныйДокументАктВыполненныхРабот.Пустая() Тогда		
		ВводитьДокумент = Истина;	
		Если (НЕ ЗначениеЗаполнено(Объект.Ссылка)
			ИЛИ НЕ Объект.Проведен
			ИЛИ Модифицированность) Тогда
			
			ПоказатьВопрос(Новый ОписаниеОповещения("",ЭтотОбъект),"Формирование документов возможно только после проведения документа. Провести?",РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			СформироватьАктНажатиеПродолжение(КодВозвратаДиалога.Да,Новый Структура);	
			
		КонецЕсли;
		
	Иначе
		ПараметрыФормы = Новый Структура("Ключ, УСОERP_ДокументОснование, ТолькоПросмотр", ПодчиненныйДокументАктВыполненныхРабот, Объект.Ссылка, Истина);
		ОткрытьФорму("Документ.АктВыполненныхРабот.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьАктНажатиеПродолжение(Ответ,ДопПараметры)Экспорт 	
	
	ВводитьДокумент = Ответ = КодВозвратаДиалога.Да; 	
	
	Если (НЕ ЗначениеЗаполнено(Объект.Ссылка)
		ИЛИ НЕ Объект.Проведен
		ИЛИ Модифицированность) Тогда
		
		Попытка
			ВводитьДокумент = ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Исключение
			ПоказатьПредупреждение(,"Не удалось выполнить проведение документа");
			ВводитьДокумент = Ложь;
		КонецПопытки;
		
	КонецЕсли;	
	
	Если ВводитьДокумент Тогда 
		ФормаНового		=	ПолучитьФорму("Документ.АктВыполненныхРабот.Форма.ФормаДокумента", , ЭтаФорма); 
		ДанныеФормы		=	ФормаНового.Объект; 
		СформироватьАктВыполненныхРабот(ДанныеФормы);
	КонецЕсли;
	
	// формирование счет - фактуры выданной
	ПараметрыФормы = Новый Структура("Ключ, УСОERP_ДокументОснование, ТолькоПросмотр", ПодчиненныйДокументАктВыполненныхРабот, Объект.Ссылка, Истина);
	ФормаАкта = ПолучитьФорму("Документ.АктВыполненныхРабот.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	
	УСОERP_ПродажиКлиентПереопределяемый.ВвестиСчетФактуруПослеВопроса(КодВозвратаДиалога.Да, Новый Структура("Исправление, Корректировочный, Организация, ОткрыватьСуществующую, Форма", Ложь, Ложь, Объект.Организация, Ложь, ФормаАкта));
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Работы.Имя);

	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;

	ОтборЭлемента =ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемВсего");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемВыполненоВсего");
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СтоимостьВсего");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммаСНДСВсего");

	ОтборЭлемента =ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемВсего");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемРеализации");
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СтоимостьВсего");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммаСНДС");
	
	ОтборЭлемента =ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемВыполнения");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемРеализации");
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СтоимостьСНДСВыполненоОбщая");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммаСНДС");

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ДоступноКПриему");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.ОбъемРеализации");
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СтоимостьДоступнаяКПриему");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммаСНДС");

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветОсобогоТекста);
	
	//
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыОбъемВсего.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыЕдиницаОбъема.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСтоимостьВсего.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыОбъемВыполнения.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыПроцентВыполнения.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСтоимостьСНДСВыполненоОбщая.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыОбъемНаНачалоПериода.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыПроцентРеализованоНаНачалоПериода.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСтоимостьСНДСНаНачалоПериода.Имя);

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Серый);
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Работы.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	Элемент = УсловноеОформление.Элементы.Добавить(); 	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.Работы.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.Работа.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыОбъемВыполнения.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыПроцентВыполнения.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСтоимостьСНДСВыполненоОбщая.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыОбъемНаНачалоПериода.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыПроцентРеализованоНаНачалоПериода.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСтоимостьСНДСНаНачалоПериода.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыОбъемРеализации.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыПроцентРеализации.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСуммаСНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСтавкаНДС.Имя);

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСуммаНДС.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "-");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСуммаСНДС.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСтавкаНДС.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыСуммаНДС.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммаСНДС");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", "-");

	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыОбъемРеализации.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыПроцентРеализации.Имя);
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыНомерСтроки.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыКодСДР.Имя);
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыРабота.Имя);
	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.РаботыОбъемРеализации.Имя);
	
	ГруппаОтбора = Элемент.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;

	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Работы.СуммаСНДС");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ТекстЗапрещеннойЯчейкиЦвет);
	
КонецПроцедуры

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ОбновитьСубподрядныеСМРНаСервере()
	
	//Если Объект.СубподрядныеСМР.Количество() > 0 Тогда 
	//	СписокРабот = Новый СписокЗначений;	
	//	Для Каждого Эл из Объект.СубподрядныеСМР Цикл 
	//		СписокРабот.Добавить(Эл.Работа);
	//		ЗаполнитьСубподрядныеСМРНаСервере(СписокРабот);
	//	КонецЦикла;	
	//КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаботыНаСервереПоДокументамУчета()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_УчетВыполненныхРаботОбороты.Регистратор
	|ПОМЕСТИТЬ ВТ_ДокументыУчетаВыполненныхРаботЗаПериод
	|ИЗ
	|	РегистрНакопления.УСОERP_УчетВыполненныхРабот.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Организация = &Организация
	|				И ОбъектСтроительства = &ОбъектСтроительства) КАК УСОERP_УчетВыполненныхРаботОбороты
	|ГДЕ
	|	УСОERP_УчетВыполненныхРаботОбороты.Регистратор ССЫЛКА Документ.УСОERP_УчетВыполненныхРабот
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_УчетВыполненныхРаботОбороты.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_РеализацияСтроительныхРаботВнутренняяРаботы.ДокументОснование,
	|	ВТ_ДокументыУчетаВыполненныхРаботЗаПериод.Регистратор
	|ПОМЕСТИТЬ ВТ_НеДоступныеДокументыУчетаРабот
	|ИЗ
	|	Документ.УСОERP_РеализацияСтроительныхРаботВнутренняя.Работы КАК УСОERP_РеализацияСтроительныхРаботВнутренняяРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДокументыУчетаВыполненныхРаботЗаПериод КАК ВТ_ДокументыУчетаВыполненныхРаботЗаПериод
	|		ПО УСОERP_РеализацияСтроительныхРаботВнутренняяРаботы.ДокументОснование = ВТ_ДокументыУчетаВыполненныхРаботЗаПериод.Регистратор
	|ГДЕ
	|	УСОERP_РеализацияСтроительныхРаботВнутренняяРаботы.Ссылка.Проведен = ИСТИНА
	|	И ЕСТЬNULL(ВТ_ДокументыУчетаВыполненныхРаботЗаПериод.Регистратор, ЗНАЧЕНИЕ(Документ.УСОERP_УчетВыполненныхРабот.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.УСОERP_УчетВыполненныхРабот.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДокументыУчетаВыполненныхРаботЗаПериод.Регистратор,
	|	УСОERP_РеализацияСтроительныхРаботВнутренняяРаботы.ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НеДоступныеДокументыУчетаРабот.Регистратор КАК Регистратор,
	|	УСОERP_УчетВыполненныхРаботРаботы.Ссылка,
	|	УСОERP_УчетВыполненныхРаботРаботы.Работа,
	|	УСОERP_УчетВыполненныхРаботРаботы.ОбъемВсего,
	|	УСОERP_УчетВыполненныхРаботРаботы.ЕдиницаОбъема,
	|	УСОERP_УчетВыполненныхРаботРаботы.ПроцентВыполнения,
	|	УСОERP_УчетВыполненныхРаботРаботы.Объем КАК ОбъемВыполнения,
	|	ВТ_ДокументыУчетаВыполненныхРаботЗаПериод.Регистратор КАК ДокументОснование,
	|	УСОERP_УчетВыполненныхРаботРаботы.ДатаНачала,
	|	УСОERP_УчетВыполненныхРаботРаботы.ДатаОкончания
	|ИЗ
	|	ВТ_ДокументыУчетаВыполненныхРаботЗаПериод КАК ВТ_ДокументыУчетаВыполненныхРаботЗаПериод
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеДоступныеДокументыУчетаРабот КАК ВТ_НеДоступныеДокументыУчетаРабот
	|		ПО (ВТ_НеДоступныеДокументыУчетаРабот.Регистратор <> ВТ_НеДоступныеДокументыУчетаРабот.Регистратор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.УСОERP_УчетВыполненныхРабот.Работы КАК УСОERP_УчетВыполненныхРаботРаботы
	|		ПО ВТ_ДокументыУчетаВыполненныхРаботЗаПериод.Регистратор = УСОERP_УчетВыполненныхРаботРаботы.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_УчетВыполненныхРаботРаботы.Ссылка.Дата,
	|	УСОERP_УчетВыполненныхРаботРаботы.Ссылка.Номер,
	|	УСОERP_УчетВыполненныхРаботРаботы.НомерСтроки";
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(НачалоДня(Объект.ДатаНачалаПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(Объект.ДатаОкончанияПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ОбъектСтроительства", Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.Работы.Загрузить(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаботыНаСервере(СписокРабот = Неопределено, ПолучитьСписок = Ложь, Подбор = Ложь)
	
	Если Не ПолучитьСписок И Не Подбор Тогда
		Объект.Работы.Очистить();
	КонецЕсли;
	
	ДанныеПоРаботам = УСОERP_ЗащищенныеФункцииСервер.УСОERP_РеализацияСтроительныхРаботВнутренняя_ПолучитьДанныеПоВыполнениюРабот(ЭтотОбъект, СписокРабот);
	
	Если ПолучитьСписок Тогда
		СписокРабот = Новый СписокЗначений;
	КонецЕсли;
	
	СтавкаНДС = ?(Объект.Договор.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка(),Перечисления.СтавкиНДС.НДС20,Объект.Договор.СтавкаНДС);
	
	Если ДанныеПоРаботам.Количество() > 0 Тогда
		Для каждого ЭлРабота Из ДанныеПоРаботам Цикл
			Если Не ПолучитьСписок Тогда
				НоваяСтрокаТЧ = Объект.Работы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ЭлРабота);
				Если НЕ ЗначениеЗаполнено(НоваяСтрокаТЧ.СтавкаНДС) Тогда
					Если НЕ НоваяСтрокаТЧ.СуммарнаяРабота
						И НоваяСтрокаТЧ.СтоимостьВсего<>0 Тогда
						НоваяСтрокаТЧ.СтавкаНДС	=	СтавкаНДС;
										
					КонецЕсли;
				КонецЕсли;
	
				НоваяСтрокаТЧ.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(НоваяСтрокаТЧ.СуммаСНДС, НоваяСтрокаТЧ.СтавкаНДС, Истина);

			Иначе
				СписокРабот.Добавить(ЭлРабота.Работа);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ СписокРабот = Неопределено Тогда 
		Для Каждого Эл из СписокРабот Цикл 
			Элемент = Эл.Значение; 
			Пока ЗначениеЗаполнено(Элемент.Родитель) Цикл
				Элемент = Элемент.Родитель; 
				СписокРабот.Добавить(Элемент);
			КонецЦикла;	
		КонецЦикла;	
	КонецЕсли;

		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСубподрядныеСМРНаСервере(СписокРабот)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Регистратор КАК ДокументПриемки,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Организация,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.ОбъектСтроительства,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Партнер,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Контрагент,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Соглашение,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Договор,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.ОбъемРасход,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.СуммаСНДСРасход КАК СуммаПоДокументуПриемкиСНДС
		|ИЗ
		|	РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком.Обороты(
		|			&ДатаНачалаПериода,
		|			&ДатаОкончанияПериода,
		|			Регистратор,
		|			Работа В (&СписокРабот)
		|				И ОбъектСтроительства = &ОбъектСтроительства
		|				И Организация = &Организация) КАК УСОERP_ВыполнениеРаботСубподрядчикомОбороты";

	Запрос.УстановитьПараметр("Организация",			Объект.Организация);
	Запрос.УстановитьПараметр("ОбъектСтроительства", 	Объект.ОбъектСтроительства);
	Запрос.УстановитьПараметр("ДатаНачалаПериода",		Объект.ДатаНачалаПериода);	
	Запрос.УстановитьПараметр("ДатаОкончанияПериода",	Объект.ДатаОкончанияПериода);
	Запрос.УстановитьПараметр("СписокРабот",			СписокРабот);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяРабота	=	Объект.СубподрядныеСМР.Добавить();  
		ЗаполнитьЗначенияСвойств(НоваяРабота, Выборка);
		РаботаПриИзмененииНаСервере(НоваяРабота.ПолучитьИдентификатор(), "СубподрядныеСМР");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение, Табл, ИдентификаторСтроки = Неопределено)
	
	Если НовыйВариант И Табл = "Работы" Тогда
		
		ЗаполнитьТЧВыбраннымиРаботами_НовыйВариант(ВыбранноеЗначение);
		
	Иначе 		
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
		Для Каждого Элем из ВыбранноеЗначение Цикл
			ЗаполнитьТЧВыбраннымиРаботами(Элем, Табл, ИдентификаторСтроки);
		КонецЦикла;	
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.УСОERP_СтроительныеРаботы") Тогда
		ЗаполнитьТЧВыбраннымиРаботами(ВыбранноеЗначение, Табл, ИдентификаторСтроки);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбор этапа в данном случае не предусмотрен! Необходимо выбрать конкретную работу.'")
		                                                 + Символы.ПС + ОписаниеОшибки());
													 КонецЕсли;
	 КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧВыбраннымиРаботами(ВыбранноеЗначение, Табл, ИдентификаторСтроки = Неопределено)

	ЭтоСуммарнаяРабота = УСОERP_УправлениеСтроительнымПроизводством.ЭтоСуммарнаяРабота(ВыбранноеЗначение);
	Если Не ЭтоСуммарнаяРабота Тогда
		СтрокиРабот = Объект.Работы.НайтиСтроки(Новый Структура("Работа", ВыбранноеЗначение));
		Если СтрокиРабот.Количество() = 0 Тогда 
			Если ИдентификаторСтроки = Неопределено Тогда
				ТекущаяСтрока	=	Объект.Работы.Добавить();
			Иначе	
				ТекущаяСтрока	=	Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
			КонецЕсли;
			ТекущаяСтрока.Работа = ВыбранноеЗначение;
			РаботаПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор(), Табл);
		КонецЕсли;
	Иначе
		Если ИдентификаторСтроки = Неопределено Тогда
			// добавление этапа
			ТекущаяСтрока = Объект.Работы.Добавить();
			ТекущаяСтрока.Работа = ВыбранноеЗначение;
			РаботаПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор(), Табл);
			// добавление подчиненных работ
			ПодчиненныеРаботы = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПодчиненныеРаботы(ВыбранноеЗначение, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный, Дата("00010101"));
			Для каждого ЭлПодчиненныеРаботы Из ПодчиненныеРаботы Цикл
				СтрокиРабот = Объект.Работы.НайтиСтроки(Новый Структура("Работа", ЭлПодчиненныеРаботы.Работа));
				Если СтрокиРабот.Количество() = 0 Тогда 
					ТекущаяСтрока = Объект.Работы.Добавить();
					ТекущаяСтрока.Работа = ЭлПодчиненныеРаботы.Работа;
					РаботаПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор(), Табл);
				КонецЕсли;
			КонецЦикла;
		Иначе	
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбор этапа в данном случае не предусмотрен! Необходимо выбрать конкретную работу.'")
							+ Символы.ПС + ОписаниеОшибки());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура  ЗаполнитьТЧВыбраннымиРаботами_НовыйВариант(ВыбранноеЗначение)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТабРаботы",Объект.Работы.Выгрузить().ВыгрузитьКолонку("Работа"));
	Запрос.УстановитьПараметр("МассивРабот",ВыбранноеЗначение);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Работа,
	|	УСОERP_СтроительныеРаботы.ОбъемРаботы КАК ОбъемВсего,
	|	УСОERP_СтроительныеРаботы.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	УСОERP_СтроительныеРаботы.ДатаНачала КАК ДатаНачала,
	|	УСОERP_СтроительныеРаботы.ДатаОкончания КАК ДатаОкончания,
	|	УСОERP_СтроительныеРаботы.СуммарнаяРабота КАК СуммарнаяРабота
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Ссылка В ИЕРАРХИИ(&МассивРабот)
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И НЕ УСОERP_СтроительныеРаботы.Ссылка В (&ТабРаботы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_СтроительныеРаботы.ПорядокСортировки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если НЕ Выборка.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		
		Если Объект.Работы.НайтиСтроки(Новый Структура("Работа",Выборка.Работа)).Количество() Тогда
			Продолжить;
		КонецЕсли;		
		
		Нстр = Объект.Работы.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,Выборка);
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТабРабот",Объект.Работы.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТабРабот.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
	|	ТабРабот.ОбъемВсего КАК ОбъемВсего,
	|	ТабРабот.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ТабРабот.СтоимостьВсего КАК СтоимостьВсего,
	|	ТабРабот.ПроцентРеализованоНаНачалоПериода КАК ПроцентРеализованоНаНачалоПериода,
	|	ТабРабот.ОбъемНаНачалоПериода КАК ОбъемНаНачалоПериода,
	|	ТабРабот.СтоимостьСНДСНаНачалоПериода КАК СтоимостьСНДСНаНачалоПериода,
	|	ТабРабот.ПроцентВыполнения КАК ПроцентВыполнения,
	|	ТабРабот.ОбъемВыполнения КАК ОбъемВыполнения,
	|	ТабРабот.ПроцентРеализации КАК ПроцентРеализации,
	|	ТабРабот.ОбъемРеализации КАК ОбъемРеализации,
	|	ТабРабот.СуммаСНДС КАК СуммаСНДС,
	|	ТабРабот.СтавкаНДС КАК СтавкаНДС,
	|	ТабРабот.СуммаНДС КАК СуммаНДС,
	|	ТабРабот.ДатаНачала КАК ДатаНачала,
	|	ТабРабот.ДатаОкончания КАК ДатаОкончания,
	|	ТабРабот.СтоимостьСНДСВыполненоОбщая КАК СтоимостьСНДСВыполненоОбщая,
	|	ТабРабот.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов
	|ПОМЕСТИТЬ ВрТаб
	|ИЗ
	|	&ТабРабот КАК ТабРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТаб.Работа КАК Работа,
	|	ВрТаб.ОбъемВсего КАК ОбъемВсего,
	|	ВрТаб.ЕдиницаОбъема КАК ЕдиницаОбъема,
	|	ВрТаб.СтоимостьВсего КАК СтоимостьВсего,
	|	ВрТаб.ПроцентРеализованоНаНачалоПериода КАК ПроцентРеализованоНаНачалоПериода,
	|	ВрТаб.ОбъемНаНачалоПериода КАК ОбъемНаНачалоПериода,
	|	ВрТаб.СтоимостьСНДСНаНачалоПериода КАК СтоимостьСНДСНаНачалоПериода,
	|	ВрТаб.ПроцентВыполнения КАК ПроцентВыполнения,
	|	ВрТаб.ОбъемВыполнения КАК ОбъемВыполнения,
	|	ВрТаб.ПроцентРеализации КАК ПроцентРеализации,
	|	ВрТаб.ОбъемРеализации КАК ОбъемРеализации,
	|	ВрТаб.СуммаСНДС КАК СуммаСНДС,
	|	ВрТаб.СтавкаНДС КАК СтавкаНДС,
	|	ВрТаб.СуммаНДС КАК СуммаНДС,
	|	ВрТаб.ДатаНачала КАК ДатаНачала,
	|	ВрТаб.ДатаОкончания КАК ДатаОкончания,
	|	ВрТаб.СтоимостьСНДСВыполненоОбщая КАК СтоимостьСНДСВыполненоОбщая,
	|	ВрТаб.СуммаВзаиморасчетов КАК СуммаВзаиморасчетов,
	|	ВрТаб.Работа.СуммарнаяРабота КАК СуммарнаяРабота
	|ИЗ
	|	ВрТаб КАК ВрТаб
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВрТаб.Работа.ПорядокСортировки,
	|	ВрТаб.Работа.КодСДР";
	
	СписокРабот	=	Новый СписокЗначений;
	СписокРабот.ЗагрузитьЗначения(Объект.Работы.Выгрузить().ВыгрузитьКолонку("Работа"));
	
		ДанныеПоРаботам = УСОERP_ЗащищенныеФункцииСервер.УСОERP_РеализацияСтроительныхРаботВнутренняя_ПолучитьДанныеПоВыполнениюРабот(ЭтотОбъект, СписокРабот);
		
		Объект.Работы.Очистить();
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Нстр = Объект.Работы.Добавить();
			ЗаполнитьЗначенияСвойств(Нстр,Выборка);
			
		Строка = ДанныеПоРаботам.Найти(Нстр.Работа);
		
		Если Строка <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Нстр,Строка);
		КонецЕсли;
		
	КонецЦикла; 	
	
КонецПроцедуры 

&НаСервере
Процедура РаботаПриИзмененииНаСервере(ИдентификаторСтроки, Табл)
	
	ТекущаяСтрока = Объект[Табл].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СписокРабот	=	Новый СписокЗначений;
	СписокРабот.Добавить(ТекущаяСтрока.Работа);
	
	ДанныеПоРаботам = УСОERP_ЗащищенныеФункцииСервер.УСОERP_РеализацияСтроительныхРаботВнутренняя_ПолучитьДанныеПоВыполнениюРабот(ЭтотОбъект, СписокРабот);
	
	Если ДанныеПоРаботам.Количество() > 0 Тогда
		Для каждого ЭлРабота Из ДанныеПоРаботам Цикл
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока,	ЭлРабота);
		КонецЦикла;
	Иначе
		ТекущаяСтрока.ОбъемВсего 						= 	0;
		ТекущаяСтрока.ЕдиницаОбъема 					= 	Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка();
		ТекущаяСтрока.СтоимостьВсего					=	0;
		ТекущаяСтрока.ПроцентРеализованоНаНачалоПериода	=	0;
		ТекущаяСтрока.ОбъемНаНачалоПериода 				= 	0;
		ТекущаяСтрока.СтоимостьСНДСНаНачалоПериода		=	0;
		ТекущаяСтрока.ПроцентВыполнения					= 	0;
		ТекущаяСтрока.ОбъемВыполнения					=	0;
		ТекущаяСтрока.ДатаНачала 						= Дата("00010101");
		ТекущаяСтрока.ДатаОкончания 					= Дата("00010101");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СтавкаНДС) Тогда
		ТекущаяСтрока.СтавкаНДС	=	Перечисления.СтавкиНДС.НДС18;
	КонецЕсли;   
	
	ТекущаяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.СуммаСНДС, ТекущаяСтрока.СтавкаНДС, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуНДС(ИдентификаторСтроки, Табл)
	
	ТекущаяСтрока	=	Объект.Работы.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	ТекущаяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.СуммаСНДС, ТекущаяСтрока.СтавкаНДС, Истина);
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма, Табл);

КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммаСНДСНаСервере(ТекущаяСтрока, Табл)
	
	СтруктураДействий = Новый Структура;	
	СтруктураДействий.Вставить("СтроительствоПересчитатьСуммуНДС");
	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма, Табл);

КонецПроцедуры

&НаСервере
Функция ПолучитьПодчиненныйДокумент(ИмяДокумента)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Док.Ссылка
	|ИЗ
	|	Документ." + ИмяДокумента + " КАК Док
	|ГДЕ
	|	Док.УСОERP_ДокументОснование = &Ссылка
	|	И НЕ Док.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура СформироватьАктВыполненныхРабот(ДанныеФормы)

	ДокументАктВыполненныхРаботОбъект = ДанныеФормыВЗначение(ДанныеФормы, Тип("ДокументОбъект.АктВыполненныхРабот")); 
	
	УсловияПродажПоУмолчанию = ПродажиСервер.ПолучитьУсловияПродажПоУмолчанию(
								Объект.Контрагент.Партнер,
								Новый Структура("ИсключитьГруппыСкладовДоступныеВЗаказах, ВыбранноеСоглашение, ХозяйственнаяОперация", 
								Истина, ДокументАктВыполненныхРаботОбъект.Соглашение, 
								Перечисления.ХозяйственныеОперации.РеализацияКлиенту));
	Если НЕ УсловияПродажПоУмолчанию	=	Неопределено Тогда  							 
		ЗаполнитьЗначенияСвойств(ДокументАктВыполненныхРаботОбъект, УсловияПродажПоУмолчанию);
	КонецЕсли;

	ДокументАктВыполненныхРаботОбъект.Дата 				        	= ТекущаяДата();
	ДокументАктВыполненныхРаботОбъект.Валюта 		            	= Объект.Договор.ВалютаВзаиморасчетов;
	ДокументАктВыполненныхРаботОбъект.Организация 		        	= Объект.Организация;
	ДокументАктВыполненныхРаботОбъект.БанковскийСчетОрганизации 	= ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(
																			ДокументАктВыполненныхРаботОбъект.Организация,
																			, 
																	    	ДокументАктВыполненныхРаботОбъект.БанковскийСчетОрганизации);
	ДокументАктВыполненныхРаботОбъект.Касса 						= ЗначениеНастроекПовтИсп.ПолучитьКассуОрганизацииПоУмолчанию(
																			ДокументАктВыполненныхРаботОбъект.Организация,
																			ДокументАктВыполненныхРаботОбъект.ФормаОплаты,
																			ДокументАктВыполненныхРаботОбъект.Касса);																		
	ДокументАктВыполненныхРаботОбъект.Контрагент 	            	= Объект.Контрагент;
	ДокументАктВыполненныхРаботОбъект.Партнер 	                	= Объект.Партнер;
	ДокументАктВыполненныхРаботОбъект.БанковскийСчетКонтрагента		= ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(Объект.Контрагент);
	ДокументАктВыполненныхРаботОбъект.Договор 		            	= Объект.Договор;
		
	ЗакупкиВызовСервера.ЗаполнитьБанковскиеСчетаПоДоговору(ДокументАктВыполненныхРаботОбъект.Договор, ДокументАктВыполненныхРаботОбъект.БанковскийСчетОрганизации, ДокументАктВыполненныхРаботОбъект.БанковскийСчетКонтрагента);	
	
	ДокументАктВыполненныхРаботОбъект.СуммаДокумента 	       		= Объект.СуммаДокумента;
	ДокументАктВыполненныхРаботОбъект.СуммаВзаиморасчетов      		= Объект.СуммаДокумента;
	ДокументАктВыполненныхРаботОбъект.ЦенаВключаетНДС           	= Истина;
	ДокументАктВыполненныхРаботОбъект.ВалютаВзаиморасчетов      	= Объект.Договор.ВалютаВзаиморасчетов;	
	ДокументАктВыполненныхРаботОбъект.НалогообложениеНДС        	= Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	ДокументАктВыполненныхРаботОбъект.УСОERP_ДокументОснование        	= Объект.Ссылка;
	ДокументАктВыполненныхРаботОбъект.Менеджер                		= Пользователи.ТекущийПользователь();

	КоличествоСтрок =  Объект.Работы.Количество();
	Если КоличествоСтрок > 0 Тогда 
		ТекущаяСтрока = ДокументАктВыполненныхРаботОбъект.Услуги.Добавить();
		ТекущаяСтрока.Номенклатура				=	Объект.ОбъектСтроительства.НоменклатураРаботЗаказчика;
		ТекущаяСтрока.Содержание				=	"Реализация строительных работ по договору " + Объект.Договор.Наименование + " за период: " + Формат(Объект.ДатаНачалаПериода, "ДЛФ = Д") + " - " + Формат(Объект.ДатаОкончанияПериода, "ДЛФ = Д");
		ТекущаяСтрока.Количество				=	1;
		ТекущаяСтрока.СтавкаНДС					=	Объект.Работы[0].СтавкаНДС;	
		ТекущаяСтрока.СуммаНДС					=	ИтогиРаботыСуммаНДС + ИтогиСубподрядныеСМРСуммаНДС;
		ТекущаяСтрока.Сумма						=	ИтогиРаботыСуммаВсего + ИтогиСубподрядныеСМРСуммаВсего;
		ТекущаяСтрока.СуммаСНДС					=	ИтогиРаботыСуммаВсего + ИтогиСубподрядныеСМРСуммаВсего;
		ТекущаяСтрока.СуммаВзаиморасчетов		=	ИтогиРаботыСуммаВсего + ИтогиСубподрядныеСМРСуммаВсего;
		ТекущаяСтрока.Цена						=	ИтогиРаботыСуммаВсего + ИтогиСубподрядныеСМРСуммаВсего;
	КонецЕсли;
	
	ЗначениеВДанныеФормы(ДокументАктВыполненныхРаботОбъект, ДанныеФормы);
	Попытка
		ДокументАктВыполненныхРаботОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ОбновитьСерверПодчиненныйДокумент();
	Исключение
	    
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ПриИзмененииРеквизитовШапки

&НаКлиенте
Процедура ПриИзмененииПериода(ДатаПериод)
	
	//Если ДатаПериод = Объект.ДатаНачала Тогда 
	//	Объект.ДатаНачала    = НачалоДня(ДатаПериод); 
	//	Объект.ДатаОкончания = ?(Объект.ДатаНачала > Объект.ДатаОкончания, КонецДня(Объект.ДатаНачала), КонецДня(Объект.ДатаОкончания));
	//Иначе 
	//	Объект.ДатаОкончания = КонецДня(ДатаПериод);
	//	Объект.ДатаНачала = ?(Объект.ДатаНачала > Объект.ДатаОкончания, НачалоДня(Объект.ДатаОкончания), НачалоДня(Объект.ДатаНачала));
	//КонецЕсли;
	//Если Объект.Дата < Объект.ДатаНачала ИЛИ Объект.Дата > Объект.ДатаОкончания Тогда 
	//	Объект.Дата = Объект.ДатаНачала;	
	//КонецЕсли;		
	//	
	//ЗаполнитьВопрос();
	Объект.ДатаНачалаПериода = НачалоМесяца(ДатаПериод);
	Объект.ДатаОкончанияПериода = КонецМесяца(ДатаПериод);


КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОрганизацииСервер()
	
	//ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЗаполнитьДоговорПоУмолчанию();
	КонецЕсли;
	
	ЗаполнитьПодчиненныеСвойстваПоСтатистике("Организация");
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПартнераСервер()
	
	ПартнерыИКонтрагенты.ЗаполнитьКонтрагентаПартнераПоУмолчанию(Объект.Партнер, Объект.Контрагент);
	//ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	
	//ЗаполнитьПодчиненныеСвойстваПоСтатистике("Контрагент");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСоглашенияСервер()
	
	//ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ЗаполнитьДоговорПоУмолчанию();
	КонецЕсли;
	
	//ЗаполнитьПодчиненныеСвойстваПоСтатистике("Договор");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКонтрагентаСервер()
	
	//ПродажиСервер.УстановитьДоступностьДоговора(Объект, Элементы.Договор.Доступность, Элементы.Договор.Видимость, Объект.Договор);
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ЗаполнитьДоговорПоУмолчанию();
	КонецЕсли;
	
	//ЗаполнитьПодчиненныеСвойстваПоСтатистике("Договор");
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Договор.ВалютаВзаиморасчетов) И НЕ Объект.Валюта = Объект.Договор.ВалютаВзаиморасчетов Тогда 
		Объект.Валюта   = Объект.Договор.ВалютаВзаиморасчетов;
		Объект.ВалютаВзаиморасчетов = Объект.Договор.ВалютаВзаиморасчетов; 		
		//ВалютаДокумента = Объект.Валюта;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроектПриИзмененииНаСервере()
		
	Объект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ОбъектСтроительства, "Заказчик");
		
	Объект.Партнер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "Партнер");
	
	ПриИзмененииПартнераСервер();
	ПриИзмененииКонтрагентаСервер();

	ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииСервер()
	
	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(Объект);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	ВалютаДокумента = Объект.Валюта;
	ВалютаВзаиморасчетовДокумента = Объект.ВалютаВзаиморасчетов;
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	РассчитатьИтоговыеПоказатели(ЭтаФорма, "Работы");	
		
	ОбновитьВспомогательныеРеквизитыТабличнойЧастиРаботы();
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	//ОбщегоНазначенияУТКлиент.РедактироватьПериод(Объект, 
	//	Новый Структура("ДатаНачала, ДатаОкончания", "ДатаНачала", "ДатаОкончания"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("РезультатВыбораПериода", ЭтаФорма);
	
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода",,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатВыбораПериода(Результат, ДополнительныеПараметры) Экспорт

	Если Объект.Работы.Количество() > 0 Тогда
		ОчиститьТабличнуюЧасть(Результат, "ВыборПериода");
	ИначеЕсли Результат <> Неопределено Тогда
		Объект.ДатаНачалаПериода = Результат.НачалоПериода;
		Объект.ДатаОкончанияПериода = Результат.КонецПериода; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТабличнуюЧасть(ВыбранноеЗначение, ИмяЭлемента)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Значение", ВыбранноеЗначение);
	ДопПараметры.Вставить("Имя", ИмяЭлемента);
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВопроса", ЭтаФорма, ДопПараметры);
	ПоказатьВопрос(Оповещение, "Табличная часть ""Работы"" и ""Субподрядные работы"" будут очищены. Продолжить?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВопроса(Результат, ДопПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	Иначе
		Объект.Работы.Очистить();
		Объект.СубподрядныеСМР.Очистить();
		
		Если ТипЗнч(ДопПараметры.Значение) = Тип("СправочникСсылка.СМ_ОбъектыСтроительства") Тогда
			Объект.ОбъектСтроительства = ДопПараметры.Значение;
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("СправочникСсылка.Контрагенты") Тогда
			Объект.Контрагент = ДопПараметры.Значение;
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("СправочникСсылка.Партнеры") Тогда
			Объект.Партнер = ДопПараметры.Значение;
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Объект.Договор = ДопПараметры.Значение;	
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("Дата") Тогда
			Если ДопПараметры.Имя = "ДатаНачалаПериода" Тогда
				Объект.ДатаНачалаПериода = ДопПараметры.Значение;
			Иначе
				Объект.ДатаОкончанияПериода = ДопПараметры.Значение;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ДопПараметры.Значение) = Тип("Структура") Тогда
			Объект.ДатаНачалаПериода = ДопПараметры.Значение.НачалоПериода;
			Объект.ДатаОкончанияПериода = ДопПараметры.Значение.КонецПериода;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоговорПоУмолчанию()
	
	Договор = ПродажиСервер.ПолучитьДоговорПоУмолчанию(Объект, Объект.Договор.ХозяйственнаяОперация);
	
	Если Договор <> Объект.Договор Тогда
		Объект.Договор = Договор;
		Объект.Валюта = Объект.Договор.ВалютаВзаиморасчетов;
		Объект.ВалютаВзаиморасчетов = Объект.Договор.ВалютаВзаиморасчетов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказатели(Форма, Табл)
	
	Форма["Итоги" + Табл + "СуммаВсего"]     = Форма.Объект[Табл].Итог("СуммаСНДС");
	Форма["Итоги" + Табл + "СуммаНДС"]       = Форма.Объект[Табл].Итог("СуммаНДС");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСерверПодчиненныйДокумент()
	
	ПодчиненныйДокументАктВыполненныхРабот = ПолучитьПодчиненныйДокумент("АктВыполненныхРабот");
	ВидимостьПодчиненныйДокумент(ЭтаФорма, ПодчиненныйДокументАктВыполненныхРабот);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ВидимостьПодчиненныйДокумент(Форма, ПодчиненныйДокументАктВыполненныхРабот)
	
	Если ПодчиненныйДокументАктВыполненныхРабот.Пустая() Тогда 
		Форма.Элементы.СформироватьАкт.Заголовок	    = "Сформировать документ ""Акт выполненных работ""";
		Форма.Элементы.КартинкаСформироватьАкт.Картинка	= Новый Картинка();
	Иначе 	
		Форма.Элементы.СформироватьАкт.Заголовок	=	"" + ПодчиненныйДокументАктВыполненныхРабот;
		Если ПодчиненныйДокументАктВыполненныхРабот.Проведен Тогда
			Форма.Элементы.КартинкаСформироватьАкт.Картинка = БиблиотекаКартинок.ДокументПроведенКоннекторНиз;			
		ИначеЕсли ПодчиненныйДокументАктВыполненныхРабот.ПометкаУдаления Тогда
			Форма.Элементы.КартинкаСформироватьАкт.Картинка = БиблиотекаКартинок.ДокументПомеченНаУдалениеКоннекторНиз;			
		Иначе
			Форма.Элементы.КартинкаСформироватьАкт.Картинка = БиблиотекаКартинок.ДокументЗаписанКоннекторНиз;			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеСвойстваПоСтатистике(ИмяРеквизитаРодителя)
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьПодчиненныеСвойства(Объект, ИмяРеквизитаРодителя);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВспомогательныеРеквизитыТабличнойЧастиРаботы()
	
	Для Каждого СтрокаРабота Из Объект.Работы Цикл
		СтрокаРабота.СуммарнаяРабота = СтрокаРабота.Работа.СуммарнаяРабота;
		СтрокаРабота.ДоступноКПриему = СтрокаРабота.ОбъемВыполнения - СтрокаРабота.ОбъемНаНачалоПериода;
		СтрокаРабота.СтоимостьДоступнаяКПриему = СтрокаРабота.СтоимостьСНДСВыполненоОбщая - СтрокаРабота.СтоимостьСНДСНаНачалоПериода;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСБуферомОбмена

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказателиВыполненияРабот(Форма, ТекущаяСтрока = Неопределено)

	Если ТекущаяСтрока = Неопределено Тогда
		КоллекцияРаботы = Форма.Объект.Работы;
		Для каждого ЭлКоллекции Из КоллекцияРаботы Цикл
			ЭлКоллекции.ОбъемВыполненоВсего	=	ЭлКоллекции.ОбъемРеализации + ЭлКоллекции.ОбъемНаНачалоПериода;
			ЭлКоллекции.СуммаСНДСВсего		=	ЭлКоллекции.СтоимостьСНДСНаНачалоПериода + ЭлКоллекции.СуммаСНДС;
		КонецЦикла;
	Иначе
		ТекущаяСтрока.ОбъемВыполненоВсего	=	ТекущаяСтрока.ОбъемРеализации + ТекущаяСтрока.ОбъемНаНачалоПериода;
		ТекущаяСтрока.СуммаСНДСВсего		=	ТекущаяСтрока.СтоимостьСНДСНаНачалоПериода + ТекущаяСтрока.СуммаСНДС;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область Дополнительно
&НаКлиенте
Процедура ЗаполнитьВыполненоВсего(Команда)
	ЗаполнитьВыполненоВсегоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВыполненоВсегоНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектСтроительства.НоменклатураРаботЗаказчика) Тогда
		ТекстОшибки = НСтр("ru='Для объекта строительства не заполнен реквизит ""Номенклатура работ при отгрузке заказчику"".'");
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЕдиницыИзмерения.Ссылка КАК Штука
		|ПОМЕСТИТЬ ЕдиницаИзмерения
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	НЕ ЕдиницыИзмерения.ПометкаУдаления
		|	И ЕдиницыИзмерения.ТипИзмеряемойВеличины = ЗНАЧЕНИЕ(Перечисление.ТипыИзмеряемыхВеличин.КоличествоШтук)
		|	И ЕдиницыИзмерения.НаименованиеПолное ПОДОБНО ""Штука""
		|	И ЕдиницыИзмерения.Владелец = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Работы.СуммаСНДС КАК Сумма,
		|	Работы.СтавкаНДС,
		|	Работы.СуммаНДС КАК СуммаНДС
		|ПОМЕСТИТЬ ТЧ_Работы
		|ИЗ
		|	&Работы КАК Работы
		|ГДЕ
		|	НЕ Работы.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СМ_ОбъектыСтроительства.НоменклатураРаботЗаказчика КАК Номенклатура,
		|	СМ_ОбъектыСтроительства.НоменклатураРаботЗаказчика.ГруппаФинансовогоУчета КАК НоменклатурнаяГруппа,
		|	1 КАК КоличествоУпаковок,
		|	ЕдиницаИзмерения.Штука КАК Упаковка,
		|	СУММА(ТЧ_Работы.Сумма) КАК Цена,
		|	СУММА(ТЧ_Работы.Сумма) КАК Сумма,
		|	ТЧ_Работы.СтавкаНДС,
		|	СУММА(ТЧ_Работы.СуммаНДС) КАК СуммаНДС
		|ИЗ
		|	ТЧ_Работы КАК ТЧ_Работы,
		|	ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Справочник.СМ_ОбъектыСтроительства КАК СМ_ОбъектыСтроительства
		|ГДЕ
		|	СМ_ОбъектыСтроительства.Ссылка = &ОбъектСтроительства
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧ_Работы.СтавкаНДС,
		|	ЕдиницаИзмерения.Штука,
		|	СМ_ОбъектыСтроительства.НоменклатураРаботЗаказчика,
		|	СМ_ОбъектыСтроительства.НоменклатураРаботЗаказчика.ГруппаФинансовогоУчета";
		
	Запрос.УстановитьПараметр("Работы", 				Объект.Работы.Выгрузить());
	Запрос.УстановитьПараметр("ОбъектСтроительства",	Объект.ОбъектСтроительства);
	
	ДанныеЗаполнения = Запрос.Выполнить().Выбрать();
	
	Если ДанныеЗаполнения.Количество() > 1 Тогда
		ТекстОшибки = НСтр("ru='В табличной части ""Работы"" введены несколько различных ставок НДС.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Объект.ВыполненоВсего.Очистить();
	ДанныеЗаполнения.Следующий();
			
	// Заполнение ТЧ "ВыполненоВсего"
	НоваяСтрокаТЧ = Объект.ВыполненоВсего.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ, ДанныеЗаполнения);
	НоваяСтрокаТЧ.НаправлениеДеятельности = Объект.ДокументУтверждения.НаправлениеДеятельности;
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтложенныйНДСПриИзменении(Элемент)
	
	Элементы.ГруппаВыполненоВсего.Видимость = Объект.ОтложенныйНДС;
	
	Если НЕ Объект.ОтложенныйНДС Тогда
		Объект.ВыполненоВсего.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДокументУтвержденияПриИзмененииНаСервере()
	НовыйВариант = Объект.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина;
	Объект.НаправлениеДеятельности = Объект.ДокументУтверждения.НаправлениеДеятельности;
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияПриИзменении(Элемент)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДокументУтвержденияОчистка(Элемент, СтандартнаяОбработка)
	ДокументУтвержденияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыполненоВсегоЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВыполненоВсего.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.КоличествоУпаковок*ТекущаяСтрока.Цена;
	ПересчитатьСуммуНДС_(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ВыполненоВсегоКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВыполненоВсего.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.КоличествоУпаковок*ТекущаяСтрока.Цена;
	ПересчитатьСуммуНДС_(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ВыполненоВсегоСуммаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВыполненоВсего.ТекущиеДанные;
	
	Если ТекущаяСтрока.КоличествоУпаковок Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма/ТекущаяСтрока.КоличествоУпаковок;
	КонецЕсли;
		
	ПересчитатьСуммуНДС_(ТекущаяСтрока);

КонецПроцедуры

&НаКлиенте
Процедура ВыполненоВсегоСтавкаНДСПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.ВыполненоВсего.ТекущиеДанные;
	
	ПересчитатьСуммуНДС_(ТекущаяСтрока);

КонецПроцедуры 

&НаКлиенте  
Процедура ПересчитатьСуммуНДС_(ТекущаяСтрока)
	
	ТекущаяСтрока.СуммаНДС = ЦенообразованиеКлиентСервер.РассчитатьСуммуНДС(ТекущаяСтрока.Сумма, ТекущаяСтрока.СтавкаНДС, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ВыполненоВсегоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаДокумента = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаСНДС"),Объект.ВыполненоВсего.Итог("Сумма"));
	Объект.СуммаНДС = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаНДС"),Объект.ВыполненоВсего.Итог("СуммаНДС"));
	СформироватьНадписьВалюты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВыполненоВсегоПослеУдаления(Элемент)
	Объект.СуммаДокумента = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаСНДС"),Объект.ВыполненоВсего.Итог("Сумма"));
	Объект.СуммаНДС = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаНДС"),Объект.ВыполненоВсего.Итог("СуммаНДС"));
	СформироватьНадписьВалюты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РаботыПослеУдаления(Элемент)
	
	Если НовыйВариант Тогда
		УдалитьПустыхРодителей();
	КонецЕсли;
	
	
	Объект.СуммаДокумента = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаСНДС"),Объект.ВыполненоВсего.Итог("Сумма"));
	Объект.СуммаНДС = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаНДС"),Объект.ВыполненоВсего.Итог("СуммаНДС"));
	СформироватьНадписьВалюты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РаботыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Объект.СуммаДокумента = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаСНДС"),Объект.ВыполненоВсего.Итог("Сумма"));
	Объект.СуммаНДС = ?(Объект.Работы.Количество(),Объект.Работы.Итог("СуммаНДС"),Объект.ВыполненоВсего.Итог("СуммаНДС"));
	СформироватьНадписьВалюты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура РаботыПередУдалением(Элемент, Отказ)
	УдалитьПодчиненныеРаботы(Элемент.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Процедура УдалитьПодчиненныеРаботы(ИдСтроки)
	
	Если НЕ НовыйВариант Тогда
		Возврат;
	КонецЕсли;   	
	
	Строка = Объект.Работы.НайтиПоИдентификатору(ИдСтроки);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Работа",Строка.Работа);
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Если Строка.СуммарнаяРабота Тогда  		
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УСОERP_СтроительныеРаботы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
		|ГДЕ
		|	УСОERP_СтроительныеРаботы.Ссылка В ИЕРАРХИИ(&Работа)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			СтрокиРаботы = Объект.Работы.НайтиСтроки(Новый Структура("Работа",Выборка.Ссылка));
			
			Для Каждого СтрокаРаботы ИЗ СтрокиРаботы Цикл
				
				МассивСтрокДляУдаления.Добавить(СтрокаРаботы);
				
			КонецЦикла; 			
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ЭлементМассива ИЗ МассивСтрокДляУдаления Цикл
		
		Объект.Работы.Удалить(ЭлементМассива);
		
	КонецЦикла;   		
	
КонецПроцедуры

&НаСервере
Процедура УдалитьПустыхРодителей()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("МассивРабот",Объект.Работы.Выгрузить().Скопировать(Новый Структура("СуммарнаяРабота",Ложь)).ВыгрузитьКолонку("Работа"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Ссылка В(&МассивРабот)
	|ИТОГИ ПО
	|	Ссылка ТОЛЬКО ИЕРАРХИЯ";
	
	ТЗРабот = Запрос.Выполнить().Выгрузить();
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Строки = Объект.Работы.НайтиСтроки(Новый Структура("СуммарнаяРабота",Истина));
	
	Для Каждого НайденнаяСтрока ИЗ Строки Цикл
		
		Если ТЗРабот.Найти(НайденнаяСтрока.Работа) = Неопределено Тогда
			МассивСтрокДляУдаления.Добавить(НайденнаяСтрока);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементМассива ИЗ МассивСтрокДляУдаления Цикл
		
		Объект.Работы.Удалить(ЭлементМассива);
		
	КонецЦикла;  	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНаправлениеДеятельности()
	Возврат Объект.ДокументУтверждения.НаправлениеДеятельности;
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненоВсегоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.НаправлениеДеятельности = ПолучитьНаправлениеДеятельности();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
	
КонецПроцедуры   

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры 

// Конец СтандартныеПодсистемы.Свойства
#КонецОбласти



