//++ Устарело_Производство21
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	// Установим получение материала по заказу на производство
	// для настроек в которых не заполнена номенклатура.
	Для каждого Запись Из ЭтотОбъект Цикл
		
		ТребуетсяПередачаПоЗаказуНаПроизводство = Ложь;
		
		Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
			
			//++ НЕ УТКА
			Запись.ОснованиеДляПолучения = Перечисления.ОснованияДляПолученияМатериаловВПроизводстве.ПоЗаказуНаПроизводство;
			//-- НЕ УТКА
			ТребуетсяПередачаПоЗаказуНаПроизводство = Истина;
			
		КонецЕсли;
		
		Если ТребуетсяПередачаПоЗаказуНаПроизводство И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ОснованиеДляПолучения") Тогда
			
			ДанныеЗаполнения.Удалить("ОснованиеДляПолучения");
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
//-- Устарело_Производство21