#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Настройки общей формы отчета подсистемы "Варианты отчетов".
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   КлючВарианта - Строка - Имя предопределенного варианта отчета или уникальный идентификатор пользовательского.
//   Настройки - Структура - см. возвращаемое значение ОтчетыКлиентСервер.ПолучитьНастройкиОтчетаПоУмолчанию().
//
Процедура ОпределитьНастройкиФормы(Форма, КлючВарианта, Настройки) Экспорт
	Настройки.События.ПриСозданииНаСервере = Истина;
	Настройки.Вставить("РазрешеноМенятьВарианты", Ложь);
КонецПроцедуры

// Вызывается в обработчике одноименного события формы отчета после выполнения кода формы.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - Форма отчета.
//   Отказ - Передается из параметров обработчика "как есть".
//   СтандартнаяОбработка - Передается из параметров обработчика "как есть".
//
// См. также:
//   "ФормаКлиентскогоПриложения.ПриСозданииНаСервере" в синтаксис-помощнике.
//
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если ЭтаФорма.Параметры.Свойство("КлючВарианта") Тогда
		Если ЭтаФорма.Параметры.КлючВарианта = "СверкаПоРегистраторам" Тогда
			ЭтаФорма.КлючТекущегоВарианта = ЭтаФорма.Параметры.КлючВарианта;
		Иначе
			ЭтаФорма.КлючТекущегоВарианта = "СверкаБезПодразделений";
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КлючВарианта = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта;
	
	ВерсияКонфигурации = Лев(Метаданные.Версия, 3);
	
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	ПериодОтчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКомпоновкиДанных, "ПериодОтчета");
	Если ПериодОтчета <> Неопределено Тогда
		ЭтотОбъект.НачалоПериода = ПериодОтчета.Значение.ДатаНачала;
		ЭтотОбъект.КонецПериода = ?(ЗначениеЗаполнено(ПериодОтчета.Значение.ДатаОкончания), КонецДня(ПериодОтчета.Значение.ДатаОкончания), Дата(3999, 1, 1));
	КонецЕсли;
	
	ПараметрОрганизация = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКомпоновкиДанных, "Организация");
	ЭтотОбъект.МассивОрганизаций = ?(ПараметрОрганизация.Использование 
										И ЗначениеЗаполнено(ПараметрОрганизация.Значение), ПараметрОрганизация.Значение, ДоступныеОрганизации());
	ПараметрРазделУчета = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(НастройкиКомпоновкиДанных, "РазделУчета");
	ЭтотОбъект.РазделУчета = ?(ПараметрРазделУчета.Использование, ПараметрРазделУчета.Значение, 0);
	
	// настроим представления счетов
	Параметр = БухгалтерскиеОтчетыКлиентСервер.ПолучитьПараметр(НастройкиКомпоновкиДанных, "ПредставлениеСчетовПоКоду");
	ПредставлениеПоКоду = Истина;
	Если Параметр <> Неопределено Тогда
		ПредставлениеПоКоду = Параметр.Значение;
	КонецЕсли;
	
	ПолеСчета = СхемаКомпоновкиДанных.НаборыДанных.ИсходныеДанные.Поля.Найти("СчетБУ");
	Если ПолеСчета <> Неопределено Тогда
		ПолеСчета.ВыражениеПредставления = ?(ПредставлениеПоКоду, "СчетБУ.Код", "СчетБУ.Код+"", ""+СчетБУ.Наименование");
	КонецЕсли;
	
	ВычисляемоеПолеБУ =  СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("БУ");
	Если ВычисляемоеПолеБУ <> Неопределено Тогда 
		ВычисляемоеПолеБУ.Выражение = """" + НСтр("ru='БУ';uk='БО'") + """";
	КонецЕсли;
	ВычисляемоеПолеОУ =  СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("ОУ");
	Если ВычисляемоеПолеОУ <> Неопределено Тогда 
		ВычисляемоеПолеОУ.Выражение = """" + НСтр("ru='ОУ';uk='ОО'") + """";
	КонецЕсли;
	ВычисляемоеПолеОтклонение =  СхемаКомпоновкиДанных.ВычисляемыеПоля.Найти("Отклонение");
	Если ВычисляемоеПолеОтклонение <> Неопределено Тогда 
		ВычисляемоеПолеОтклонение.Выражение = """" + НСтр("ru='ОУ-БУ';uk='ОО-БО'") + """";
	КонецЕсли;
	
	ДокументРезультат.Очистить();
	
	ВременныеТаблицы = ЗаполнитьВспомогательныеТаблицы();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(
		СхемаКомпоновкиДанных,
		НастройкиКомпоновкиДанных,
		ДанныеРасшифровки);
		
	УстановитьПривилегированныйРежим(Истина);
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТЗСебестоимостьТоваров",    ТаблицаСебестоимостьТоваров(ВременныеТаблицы, КлючВарианта));
	ВнешниеНаборыДанных.Вставить("ТЗДенежныеСредства",        ТаблицаДенежныеСредства(ВременныеТаблицы, КлючВарианта));
	ВнешниеНаборыДанных.Вставить("ТЗРасчетыСКонтрагентами",   ТаблицаРасчетыСКонтрагентами(ВременныеТаблицы, КлючВарианта, ВерсияКонфигурации));
	ВнешниеНаборыДанных.Вставить("ТЗПроизводственныеЗатраты", ТаблицаПроизводственныеЗатраты(ВременныеТаблицы, КлючВарианта, ВерсияКонфигурации));
	УстановитьПривилегированныйРежим(Ложь);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ВременныеТаблицы.Закрыть();
	
	ПостОбработка(ДокументРезультат, ДанныеРасшифровки, КлючВарианта);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗаполнитьВспомогательныеТаблицы()
	
	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗапросСчетов = РеглУчетВыборкиСерверПовтИсп.ЗапросПланаСчетов();
	ЗапросСчетов.МенеджерВременныхТаблиц = ВременныеТаблицы;
	ЗапросСчетов.Выполнить();
	
	ЗапросСчетов = РеглУчетВыборкиСерверПовтИсп.ЗапросСчетов();
	ЗапросСчетов.МенеджерВременныхТаблиц = ВременныеТаблицы;
	ЗапросСчетов.Выполнить();

	ЗапросСчетов = РеглУчетВыборкиСерверПовтИсп.ЗапросСчетовПоУмолчанию();
	ЗапросСчетов.МенеджерВременныхТаблиц = ВременныеТаблицы;
	ЗапросСчетов.Выполнить();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ВременныеТаблицы;

КонецФункции

Функция ТаблицаСебестоимостьТоваров(ВременныеТаблицы, КлючВарианта)
	
	Если Не (ЭтотОбъект.РазделУчета = 0 Или ЭтотОбъект.РазделУчета = 2) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(КлючВарианта = "СверкаПоРегистраторам",
					ТекстЗапросаСебестоимостьПоРегистраторам(),
					ТекстЗапросаСебестоимость());
	
	Если Найти(КлючВарианта, "БезПодразделений") <> 0 Или КлючВарианта = "СверкаПоРегистраторам" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подзапрос.Подразделение,", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаОстатков", Новый Граница(ЭтотОбъект.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета", 
				ПолучитьФункциональнуюОпцию("ФормироватьВидыЗапасовПоГруппамФинансовогоУчета"));
	
	МассивВидовСубконто = Новый Массив;
	МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура);
	МассивВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Запрос.УстановитьПараметр("ВидыСубконтоНоменклатураСклад", МассивВидовСубконто);
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Возврат ТЗ;
	
КонецФункции

Функция ТаблицаДенежныеСредства(ВременныеТаблицы, КлючВарианта)
	
	Если Не (ЭтотОбъект.РазделУчета = 0 Или ЭтотОбъект.РазделУчета = 1) Тогда
		Возврат Новый ТаблицаЗначений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(КлючВарианта = "СверкаПоРегистраторам",
					ТекстЗапросаДенежныеСредстваПоРегистраторам(),
					ТекстЗапросаДенежныеСредства());
	
	Если Найти(КлючВарианта, "БезПодразделений") <> 0 Или КлючВарианта = "СверкаПоРегистраторам" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаОстатков", Новый Граница(ЭтотОбъект.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("РазделУчета", ЭтотОбъект.РазделУчета);
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ТЗ1 = Новый ТаблицаЗначений;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		ТЗ1.Колонки.Добавить(Колонка.Имя, Новый ОписаниеТипов(Колонка.ТипЗначения, "NULL"));
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТЗ, ТЗ1);
	
	Возврат ТЗ1;
	
КонецФункции

Функция ТаблицаРасчетыСКонтрагентами(ВременныеТаблицы, КлючВарианта, ВерсияКонфигурации)
	
	Если Не (ЭтотОбъект.РазделУчета = 0 Или ЭтотОбъект.РазделУчета = 3
		 Или ЭтотОбъект.РазделУчета = 4 Или ЭтотОбъект.РазделУчета = 5 
		 Или ЭтотОбъект.РазделУчета = 6 Или ЭтотОбъект.РазделУчета = 7) Тогда
		 
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(КлючВарианта = "СверкаПоРегистраторам",
					ТекстЗапросаРасчетыСКонтрагентамиПоРегистраторам(),
					ТекстЗапросаРасчетыСКонтрагентами());
	
	Если Найти(КлючВарианта, "БезПодразделений") <> 0 Или КлючВарианта = "СверкаПоРегистраторам" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подзапрос.Подразделение,", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаОстатков", Новый Граница(ЭтотОбъект.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПустойСчет", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("РазделУчета", ЭтотОбъект.РазделУчета);
	Запрос.УстановитьПараметр("НоваяАрхитектураВзаиморасчетов", ПолучитьФункциональнуюОпцию("НоваяАрхитектураВзаиморасчетов"));
	
	
	СчетаУчетаРасчетов3 = Новый Массив; // 3 - Расчеты c поставщиками
	СчетаУчетаРасчетов4 = Новый Массив; // 4 - Расчеты с клиентами
	СчетаУчетаРасчетов5 = Новый Массив; // 5 - Расчеты по кредитам и депозитам
	СчетаУчетаРасчетов7 = Новый Массив; // 7 - Прочие расчеты с контрагентами
	ВсеСчетаУчетаРасчетов = Новый Массив;

	СтруктураСчетовУчета = Обработки.НастройкаОтраженияДокументовВРеглУчете.ДоступныеСчетаУчетаРасчетов();
	
	Для каждого ЭлементСтруктуры Из СтруктураСчетовУчета Цикл
		Для каждого ТекущийСчет Из ЭлементСтруктуры.Значение Цикл
			ВсеСчетаУчетаРасчетов.Добавить(ТекущийСчет);
		КонецЦикла;
	КонецЦикла;
	
	ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(ВсеСчетаУчетаРасчетов);
	
	СчетаУчетаРасчетов3.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками);
	СчетаУчетаРасчетов3.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоВыданнымАвансам);
	
	СчетаУчетаРасчетов4.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками);
	СчетаУчетаРасчетов4.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамПолученным);
	
	ОбычныеСчетаУчетаРасчетов = Новый Массив;
	Для каждого СчетРасчетов Из СчетаУчетаРасчетов3 Цикл
		ОбычныеСчетаУчетаРасчетов.Добавить(СчетРасчетов);
	КонецЦикла;
	Для каждого СчетРасчетов Из СчетаУчетаРасчетов4 Цикл
		ОбычныеСчетаУчетаРасчетов.Добавить(СчетРасчетов);
	КонецЦикла;
	
	Для каждого ТекущийСчет Из ВсеСчетаУчетаРасчетов Цикл
		
		ЭтоПрочее = Истина;
		
		Для каждого СчетРасчетов Из ОбычныеСчетаУчетаРасчетов Цикл
			Если ТекущийСчет.ПринадлежитЭлементу(СчетРасчетов) ИЛИ ТекущийСчет = СчетРасчетов Тогда
				ЭтоПрочее = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоПрочее Тогда
			СчетаУчетаРасчетов7.Добавить(ТекущийСчет);
		КонецЕсли;
		
	КонецЦикла;
	
	СчетаУчетаРасчетов5.Добавить(ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте);
	СчетаУчетаРасчетов5.Добавить(ПланыСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте);
	СчетаУчетаРасчетов5.Добавить(ПланыСчетов.Хозрасчетный.ДолгосрочныеЗаймы);
	СчетаУчетаРасчетов5.Добавить(ПланыСчетов.Хозрасчетный.КраткосрочныеЗаймы);
	СчетаУчетаРасчетов5.Добавить(ПланыСчетов.Хозрасчетный.ТекущаяЗадолженностьПоДолгосрочнымОбязательствам);
	СчетаУчетаРасчетов5.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоНачисленнымПроцентам);
	
	Запрос.УстановитьПараметр("СчетаУчетаРасчетов3", СчетаУчетаРасчетов3);
	Запрос.УстановитьПараметр("СчетаУчетаРасчетов4", СчетаУчетаРасчетов4);
	Запрос.УстановитьПараметр("СчетаУчетаРасчетов5", СчетаУчетаРасчетов5);
	Запрос.УстановитьПараметр("СчетаУчетаРасчетов7", СчетаУчетаРасчетов7);
	Запрос.УстановитьПараметр("ВсеСчетаУчетаРасчетов", ВсеСчетаУчетаРасчетов);
	
	ВидыСубконтоКонтрагентыДоговоры = Новый Массив; // 6 - для лизинга
	ВидыСубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты);
	ВидыСубконтоКонтрагентыДоговоры.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры);
	Запрос.УстановитьПараметр("ВидыСубконтоКонтрагентыДоговоры", ВидыСубконтоКонтрагентыДоговоры);
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Возврат ТЗ;
	
КонецФункции

Функция ТаблицаПроизводственныеЗатраты(ВременныеТаблицы, КлючВарианта, ВерсияКонфигурации)
	
	Если Не (ЭтотОбъект.РазделУчета = 0 Или ЭтотОбъект.РазделУчета = 8) Тогда
		
		Возврат Новый ТаблицаЗначений;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ?(КлючВарианта = "СверкаПоРегистраторам",
					ТекстЗапросаПроизводственныеЗатратыПоРегистраторам(),
					ТекстЗапросаПроизводственныеЗатраты());
					
	Если Найти(КлючВарианта, "БезПодразделений") <> 0 Или КлючВарианта = "СверкаПоРегистраторам" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Подзапрос.Подразделение,", "");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", ЭтотОбъект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ЭтотОбъект.КонецПериода);
	Запрос.УстановитьПараметр("КонецПериодаОстатков", Новый Граница(ЭтотОбъект.КонецПериода, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("РазделУчета", ЭтотОбъект.РазделУчета);
	Запрос.УстановитьПараметр("ИспользоватьПроизводствоНаСтороне", ПолучитьФункциональнуюОпцию("ИспользоватьПроизводствоНаСтороне"));
    ВидСубконтоСтатьиЗатрат = Новый Массив;
    ВидСубконтоСтатьиЗатрат.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат);
    Запрос.УстановитьПараметр("ВидСубконтоСтатьиЗатрат", ВидСубконтоСтатьиЗатрат);
	
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	ТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.Прямой);
	Возврат ТЗ;
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаСебестоимость()
	
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Счет
	|ПОМЕСТИТЬ Счета_Номенклатура
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	|	И НЕ ХозрасчетныйВидыСубконто.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеНеоборотныеМатериальныеАктивыГруппа), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИзносАмортизацияНеоборотныхАктивов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Счет
	|ПОМЕСТИТЬ Счета_НоменклатураСклад
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Счета_Номенклатура КАК Счета_Номенклатура
	|		ПО ХозрасчетныйВидыСубконто.Ссылка = Счета_Номенклатура.Счет
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады)
	|	И НЕ ХозрасчетныйВидыСубконто.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеНеоборотныеМатериальныеАктивыГруппа), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИзносАмортизацияНеоборотныхАктивов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета_Номенклатура.Счет КАК Счет
	|ПОМЕСТИТЬ Счета_НоменклатураБезСклада
	|ИЗ
	|	Счета_Номенклатура КАК Счета_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Счета_НоменклатураСклад КАК Счета_НоменклатураСклад
	|		ПО Счета_Номенклатура.Счет = Счета_НоменклатураСклад.Счет
	|ГДЕ
	|	Счета_НоменклатураСклад.Счет ЕСТЬ NULL
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подзапрос.Организация,
	|	Подзапрос.АналитикаУчетаНоменклатуры,
	|	Подзапрос.ВидЗапасов,
	|	Подзапрос.РазделУчета,
	|	СУММА(Подзапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Подзапрос.Приход + Подзапрос.ПриходКорректировкаНДС) КАК Приход,
	|	СУММА(Подзапрос.Расход + Подзапрос.РасходКорректировкаНДС) КАК Расход,
	|	СУММА(Подзапрос.КонечныйОстаток) КАК КонечныйОстаток
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровОстаткиИОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация КАК Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
	|		СебестоимостьТоваров.РазделУчета КАК РазделУчета,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений))
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|				+ СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл
	|				+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		КОНЕЦ КАК Приход,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика))
	|				ТОГДА -(СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл 
	|					+ СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл
	|					+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Расход,
	|		ВЫБОР 
    |           КОГДА (СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|		        И ((СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
	|	   		        И СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|		          ИЛИ (СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
	|	   		        И СебестоимостьТоваров.НалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |               )
    |            )
	|			ТОГДА СебестоимостьТоваров.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		0 КАК НачальныйОстаток,
	|		0 КАК КонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
	|		И СебестоимостьТоваров.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.ВидЗапасов,
	|		СебестоимостьТоваров.РазделУчета,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДавальцу), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровКомитенту))
	|				ТОГДА -(СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл 
	|					+ СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл
	|					+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл)
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДавальцу), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровКомитенту),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений))
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|				+ СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл
	|				+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		КОНЕЦ,
	|		0 КАК ПриходКорректировкаНДС,
	|		0 КАК РасходКорректировкаНДС,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
	|		И СебестоимостьТоваров.Организация В(&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваровОстатки.Организация,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваровОстатки.ВидЗапасов,
	|		СебестоимостьТоваровОстатки.РазделУчета,
	|		0,
	|		0,
    |       0 КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваровОстатки.СтоимостьРеглОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглОстаток
	|				+ СебестоимостьТоваровОстатки.ДопРасходыРеглОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглОстаток
	|				+ СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглОстаток
	|		КОНЕЦ,
	|		0
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(&НачалоПериода, Организация В (&МассивОрганизаций)) КАК СебестоимостьТоваровОстатки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваровОстатки.Организация,
	|		СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваровОстатки.ВидЗапасов,
	|		СебестоимостьТоваровОстатки.РазделУчета,
	|		0,
	|		0,
    |       0 КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		0,
	|		СебестоимостьТоваровОстатки.СтоимостьРеглОстаток + СебестоимостьТоваровОстатки.СтоимостьЗабалансоваяРеглОстаток
	|			+ СебестоимостьТоваровОстатки.ДопРасходыРеглОстаток + СебестоимостьТоваровОстатки.ТрудозатратыРеглОстаток
	|			+ СебестоимостьТоваровОстатки.ПостатейныеПостоянныеРеглОстаток + СебестоимостьТоваровОстатки.ПостатейныеПеременныеРеглОстаток
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров.Остатки(&КонецПериодаОстатков, Организация В (&МассивОрганизаций)) КАК СебестоимостьТоваровОстатки) КАК Подзапрос
	|ГДЕ
	|	НЕ Подзапрос.РазделУчета В (
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.АналитикаУчетаНоменклатуры,
	|	Подзапрос.ВидЗапасов,
	|	Подзапрос.РазделУчета
	|
	|ИМЕЮЩИЕ
	|	СУММА(Подзапрос.НачальныйОстаток) <> 0
	|		ИЛИ СУММА(Подзапрос.Приход) <> 0
	|		ИЛИ СУММА(Подзапрос.Расход) <> 0
	|		ИЛИ СУММА(Подзапрос.КонечныйОстаток) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОстаткиИОбороты.Организация КАК Организация,
	|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения КАК ТипМестаХранения,
	|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|		ТОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК Склад,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение,НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		СебестоимостьТоваровОстаткиИОбороты.ВидЗапасов.ГруппаФинансовогоУчета
	|	ИНАЧЕ
	|		СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.Приход) КАК Приход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.Расход) КАК Расход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.КонечныйОстаток) КАК КонечныйОстаток,
	|	СебестоимостьТоваровОстаткиИОбороты.РазделУчета
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваров
	|ИЗ
	|	ВТ_СебестоимостьТоваровОстаткиИОбороты КАК СебестоимостьТоваровОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОстаткиИОбороты.Организация,
	|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения,
	|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|		ТОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение,НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		СебестоимостьТоваровОстаткиИОбороты.ВидЗапасов.ГруппаФинансовогоУчета
	|	ИНАЧЕ
	|		СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ,
	|	СебестоимостьТоваровОстаткиИОбороты.РазделУчета
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	Подразделение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СебестоимостьТоваров.Организация КАК Организация,
	|	ВТ_СебестоимостьТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_СебестоимостьТоваров.Подразделение КАК Подразделение,
	|	ВТ_СебестоимостьТоваров.Склад КАК Склад,
	|	ВТ_СебестоимостьТоваров.Валюта КАК Валюта,
	|	ВТ_СебестоимостьТоваров.РазделУчета,
	|	ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВЫБОР
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПередачаВПереработку)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА НЕ ЕСТЬNULL(ВТ_СебестоимостьТоваров.Склад.ЦеховаяКладовая, ЛОЖЬ) И ВТ_СебестоимостьТоваров.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение) И ВТ_СебестоимостьТоваров.РазделУчета В
	|			(ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи))
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА (ЕСТЬNULL(ВТ_СебестоимостьТоваров.Склад.ЦеховаяКладовая, ЛОЖЬ) ИЛИ ВТ_СебестоимостьТоваров.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)) И ВТ_СебестоимостьТоваров.РазделУчета В
	|			(ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи))
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВПроизводстве)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦУХранителей)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦКСписанию)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА НЕ ЕСТЬNULL(ВТ_СебестоимостьТоваров.Склад.ЦеховаяКладовая, ЛОЖЬ) И ВТ_СебестоимостьТоваров.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение) И ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработку)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА (ЕСТЬNULL(ВТ_СебестоимостьТоваров.Склад.ЦеховаяКладовая, ЛОЖЬ) ИЛИ ВТ_СебестоимостьТоваров.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)) И ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработкуВПроизводстве)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) И НЕ ВТ_СебестоимостьТоваров.ТипМестаХранения В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер), ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация))
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыНаСкладе)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) И ВТ_СебестоимостьТоваров.ТипМестаХранения В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер), ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация))
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыПереданныеНаКомиссию)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НоменклатураПереданная)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗатратыНаПриобретениеТМЦ)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		ИНАЧЕ МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|	КОНЕЦ КАК Счет
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровНастройки
	|ИЗ
	|	ВТ_СебестоимостьТоваров КАК ВТ_СебестоимостьТоваров
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоМестуУчета
	|	ПО 
	|		НастройкиПоМестуУчета.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПередачаВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦУХранителей),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦКСписанию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыНаСкладе),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработкуВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыПереданныеНаКомиссию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НоменклатураПереданная),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗатратыНаПриобретениеТМЦ),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		И НастройкиПоМестуУчета.Организация = ВТ_СебестоимостьТоваров.Организация
	|		И НастройкиПоМестуУчета.АналитикаУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|		И НастройкиПоМестуУчета.МестоУчета = ВТ_СебестоимостьТоваров.Склад
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|	ПО 
	|		НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПередачаВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦУХранителей),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦКСписанию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыНаСкладе),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработкуВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыПереданныеНаКомиссию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НоменклатураПереданная),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗатратыНаПриобретениеТМЦ),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		И НастройкиПоОрганизации.Организация = ВТ_СебестоимостьТоваров.Организация
	|		И НастройкиПоОрганизации.АналитикаУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|		И НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПередачаВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦУХранителей),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦКСписанию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыНаСкладе),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработкуВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыПереданныеНаКомиссию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НоменклатураПереданная),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗатратыНаПриобретениеТМЦ),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И НастройкиПоАналитике.АналитикаУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СебестоимостьТоваров.Организация,
	|	ВТ_СебестоимостьТоваров.Номенклатура,
	|	ВТ_СебестоимостьТоваров.Склад,
	|	ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета,
	|	ВТ_СебестоимостьТоваров.Подразделение,
	|	ВТ_СебестоимостьТоваров.Валюта,
	|	ВТ_СебестоимостьТоваров.РазделУчета,
	|	ВТ_СебестоимостьТоваров.ТипМестаХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.Субконто2,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_СебестоимостьНоменклатурыРегл
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|													&НачалоПериода, 
	|													&КонецПериода
	|													,
	|													,
	|													,
	|													,
	|													&ВидыСубконтоНоменклатураСклад, 
	|													Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Подразделение, НЕОПРЕДЕЛЕНО),
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|													&НачалоПериода, 
	|													&КонецПериода
	|													,
	|													,
	|													,
	|													Счет В (Выбрать Т.Счет ИЗ Счета_НоменклатураБезСклада КАК Т),
	|													ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура), 
	|													Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	2 КАК РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Аналитика2,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ,
	|	СУММА(Подзапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(Подзапрос.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	СУММА(Подзапрос.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_СебестоимостьТоваровНастройки.Организация КАК Организация,
	|		ВТ_СебестоимостьТоваровНастройки.Номенклатура КАК Аналитика1,
	|		ВЫБОР
	|			КОГДА НЕ Счета_НоменклатураБезСклада.Счет ЕСТЬ NULL
	|				ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|			ИНАЧЕ ВТ_СебестоимостьТоваровНастройки.Склад
	|		КОНЕЦ КАК Аналитика2,
	|		ВЫБОР
	|			КОГДА ПланХозрасчетный.УчетПоПодразделениям
	|				ТОГДА ВТ_СебестоимостьТоваровНастройки.Подразделение
	|			ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		КОНЕЦ КАК Подразделение,
	|		ВТ_СебестоимостьТоваровНастройки.Счет КАК СчетБУ,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.НачальныйОстаток, 0) КАК НачальныйОстаток,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.Приход, 0) КАК Приход,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.Расход, 0) КАК Расход,
	|		ЕСТЬNULL(ВТ_СебестоимостьТоваров.КонечныйОстаток, 0) КАК КонечныйОстаток,
	|		0 КАК НачальноеСальдо,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт,
	|		0 КАК КонечноеСальдо
	|	ИЗ
	|		ВТ_СебестоимостьТоваровНастройки КАК ВТ_СебестоимостьТоваровНастройки
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СебестоимостьТоваров КАК ВТ_СебестоимостьТоваров
	|			ПО ВТ_СебестоимостьТоваровНастройки.Организация = ВТ_СебестоимостьТоваров.Организация
	|				И ВТ_СебестоимостьТоваровНастройки.Номенклатура = ВТ_СебестоимостьТоваров.Номенклатура
	|				И ВТ_СебестоимостьТоваровНастройки.Подразделение = ВТ_СебестоимостьТоваров.Подразделение
	|				И ВТ_СебестоимостьТоваровНастройки.РазделУчета = ВТ_СебестоимостьТоваров.РазделУчета
	|				И ВТ_СебестоимостьТоваровНастройки.Валюта = ВТ_СебестоимостьТоваров.Валюта
	|				И ВТ_СебестоимостьТоваровНастройки.Склад = ВТ_СебестоимостьТоваров.Склад
	|				И ВТ_СебестоимостьТоваровНастройки.ГруппаФинансовогоУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ ПланХозрасчетный КАК ПланХозрасчетный
	|			ПО ВТ_СебестоимостьТоваровНастройки.Счет = ПланХозрасчетный.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Счета_НоменклатураБезСклада КАК Счета_НоменклатураБезСклада
	|			ПО ВТ_СебестоимостьТоваровНастройки.Счет = Счета_НоменклатураБезСклада.Счет
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ВТ_СебестоимостьНоменклатурыРегл.Организация,
	|		ВТ_СебестоимостьНоменклатурыРегл.Субконто1,
	|		ВТ_СебестоимостьНоменклатурыРегл.Субконто2,
	|		ВТ_СебестоимостьНоменклатурыРегл.Подразделение,
	|		ВТ_СебестоимостьНоменклатурыРегл.Счет,
	|		0,
	|		0,
	|		0,
	|		0,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаНачальныйОстаток,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаОборотДт,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаОборотКт,
	|		ВТ_СебестоимостьНоменклатурыРегл.СуммаКонечныйОстаток
	|	ИЗ
	|		ВТ_СебестоимостьНоменклатурыРегл КАК ВТ_СебестоимостьНоменклатурыРегл) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Аналитика2,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ
	|ИМЕЮЩИЕ
	|	НЕ (СУММА(Подзапрос.НачальныйОстаток) = 0
	|		И СУММА(Подзапрос.Приход) = 0
	|		И СУММА(Подзапрос.Расход) = 0
	|		И СУММА(Подзапрос.КонечныйОстаток) = 0
	|		И СУММА(Подзапрос.НачальноеСальдо) = 0
	|		И СУММА(Подзапрос.ОборотДт) = 0
	|		И СУММА(Подзапрос.ОборотКт) = 0
	|		И СУММА(Подзапрос.КонечноеСальдо) = 0)";
	
КонецФункции

Функция ТекстЗапросаСебестоимостьПоРегистраторам()
	
	Возврат
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Счет
	|ПОМЕСТИТЬ Счета_Номенклатура
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура)
	|	И НЕ ХозрасчетныйВидыСубконто.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеНеоборотныеМатериальныеАктивыГруппа), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИзносАмортизацияНеоборотныхАктивов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Счет
	|ПОМЕСТИТЬ Счета_НоменклатураСклад
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Счета_Номенклатура КАК Счета_Номенклатура
	|		ПО ХозрасчетныйВидыСубконто.Ссылка = Счета_Номенклатура.Счет
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады)
	|	И НЕ ХозрасчетныйВидыСубконто.Ссылка В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеНеоборотныеМатериальныеАктивыГруппа), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ИзносАмортизацияНеоборотныхАктивов))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Счета_Номенклатура.Счет КАК Счет
	|ПОМЕСТИТЬ Счета_НоменклатураБезСклада
	|ИЗ
	|	Счета_Номенклатура КАК Счета_Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Счета_НоменклатураСклад КАК Счета_НоменклатураСклад
	|		ПО Счета_Номенклатура.Счет = Счета_НоменклатураСклад.Счет
	|ГДЕ
	|	Счета_НоменклатураСклад.Счет ЕСТЬ NULL
	|;
	|
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Подзапрос.Организация,
	|	Подзапрос.АналитикаУчетаНоменклатуры,
	|	Подзапрос.ПодразделениеПродаж КАК Подразделение,
	|	Подзапрос.ВидЗапасов,
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Регистратор,
	|	СУММА(Подзапрос.Приход + Подзапрос.ПриходКорректировкаНДС) КАК Приход,
	|	СУММА(Подзапрос.Расход + Подзапрос.РасходКорректировкаНДС) КАК Расход
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровОстаткиИОбороты
	|ИЗ
	|	(ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация КАК Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры КАК АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.Подразделение КАК ПодразделениеПродаж,
	|		СебестоимостьТоваров.ВидЗапасов КАК ВидЗапасов,
	|		СебестоимостьТоваров.РазделУчета КАК РазделУчета,
	|		ВЫБОР
	|			КОГДА (СебестоимостьТоваров.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров ИЛИ СебестоимостьТоваров.РасчетСебестоимости)
	|				И СебестоимостьТоваров.ДокументДвижения <> НЕОПРЕДЕЛЕНО	
	|				ТОГДА СебестоимостьТоваров.ДокументДвижения
	|			ИНАЧЕ СебестоимостьТоваров.Регистратор
	|		КОНЕЦ КАК Регистратор,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений))
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|				+ СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|		КОНЕЦ КАК Приход,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратИзПроизводства), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзПроизводства),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратМатериаловИзКладовой),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровОтКлиента), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОтПереработчика))
	|				ТОГДА -(СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл 
	|					+ СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл
	|					+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК Расход,
	|		ВЫБОР 
    |           КОГДА (СебестоимостьТоваров.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений)
	|		        И ((СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Облагаемая) 
	|	   		        И СебестоимостьТоваров.НалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.Необлагаемая))
	|		          ИЛИ (СебестоимостьТоваров.КорНалоговоеНазначение.ВидДеятельностиНДС = ЗНАЧЕНИЕ(Перечисление.ВидыДеятельностиНДС.ПропорциональноОблагаемая) 
	|	   		        И СебестоимостьТоваров.НалоговоеНазначение = ЗНАЧЕНИЕ(Справочник.НалоговыеНазначенияАктивовИЗатрат.НДС_НеоблагаемаяНеХозДеятельность))
    |               )
    |            )
	|			ТОГДА СебестоимостьТоваров.НДСРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПриходКорректировкаНДС,
    |       0 КАК РасходКорректировкаНДС,
	|		0 КАК НачальныйОстаток,
	|		0 КАК КонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
	|		И НЕ СебестоимостьТоваров.РазделУчета В (
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|		И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		СебестоимостьТоваров.Организация,
	|		СебестоимостьТоваров.АналитикаУчетаНоменклатуры,
	|		СебестоимостьТоваров.Подразделение,
	|		СебестоимостьТоваров.ВидЗапасов,
	|		СебестоимостьТоваров.РазделУчета,
	|		ВЫБОР
	|			КОГДА (СебестоимостьТоваров.Регистратор ССЫЛКА Документ.РасчетСебестоимостиТоваров ИЛИ СебестоимостьТоваров.РасчетСебестоимости)
	|				И СебестоимостьТоваров.ДокументДвижения <> НЕОПРЕДЕЛЕНО	
	|				ТОГДА СебестоимостьТоваров.ДокументДвижения
	|			ИНАЧЕ СебестоимостьТоваров.Регистратор
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДавальцу), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровКомитенту))
	|				ТОГДА -(СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл 
	|					+ СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл
	|					+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл + СебестоимостьТоваров.ПостатейныеПеременныеРегл)
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА СебестоимостьТоваров.ХозяйственнаяОперация В (
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДавальцу), 
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратТоваровКомитенту),
	|									ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.КорректировкаНалоговыхНазначений))
	|				ТОГДА 0
	|			ИНАЧЕ СебестоимостьТоваров.СтоимостьРегл + СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|				+ СебестоимостьТоваров.ДопРасходыРегл + СебестоимостьТоваров.ТрудозатратыРегл + СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|		КОНЕЦ,
	|		0 КАК ПриходКорректировкаНДС,
	|		0 КАК РасходКорректировкаНДС,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|	ГДЕ
	|		СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И СебестоимостьТоваров.Активность
	|		И НЕ СебестоимостьТоваров.РазделУчета В (
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
	|							ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|		И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.АналитикаУчетаНоменклатуры,
	|	Подзапрос.ПодразделениеПродаж,
	|	Подзапрос.ВидЗапасов,
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СебестоимостьТоваровОстаткиИОбороты.Организация КАК Организация,
	|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения КАК ТипМестаХранения,
	|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ КАК Склад,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение,СебестоимостьТоваровОстаткиИОбороты.Подразделение)
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		СебестоимостьТоваровОстаткиИОбороты.ВидЗапасов.ГруппаФинансовогоУчета
	|	ИНАЧЕ
	|		СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ КАК ГруппаФинансовогоУчета,
	|	НЕОПРЕДЕЛЕНО КАК Валюта,
	|	СебестоимостьТоваровОстаткиИОбороты.Регистратор КАК Регистратор,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.Приход) КАК Приход,
	|	СУММА(СебестоимостьТоваровОстаткиИОбороты.Расход) КАК Расход,
	|	СебестоимостьТоваровОстаткиИОбороты.РазделУчета
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваров
	|ИЗ
	|	ВТ_СебестоимостьТоваровОстаткиИОбороты КАК СебестоимостьТоваровОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваровОстаткиИОбороты.Организация,
	|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения,
	|	СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)
	|			ТОГДА СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Подразделение
	|		ИНАЧЕ ЕСТЬNULL(СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение,СебестоимостьТоваровОстаткиИОбороты.Подразделение)
	|	КОНЕЦ,
	|	ВЫБОР КОГДА &ФормироватьВидыЗапасовПоГруппамФинансовогоУчета ТОГДА
	|		СебестоимостьТоваровОстаткиИОбороты.ВидЗапасов.ГруппаФинансовогоУчета
	|	ИНАЧЕ
	|		СебестоимостьТоваровОстаткиИОбороты.АналитикаУчетаНоменклатуры.Номенклатура.ГруппаФинансовогоУчета
	|	КОНЕЦ,
	|	СебестоимостьТоваровОстаткиИОбороты.РазделУчета,
	|	СебестоимостьТоваровОстаткиИОбороты.Регистратор
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Номенклатура,
	|	Подразделение,
	|	Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СебестоимостьТоваров.Организация КАК Организация,
	|	ВТ_СебестоимостьТоваров.Номенклатура КАК Номенклатура,
	|	ВТ_СебестоимостьТоваров.Подразделение КАК Подразделение,
	|	ВТ_СебестоимостьТоваров.Склад КАК Склад,
	|	ВТ_СебестоимостьТоваров.Валюта КАК Валюта,
	|	ВТ_СебестоимостьТоваров.РазделУчета,
	|	ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВТ_СебестоимостьТоваров.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеПереработчику)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПередачаВПереработку)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА НЕ ЕСТЬNULL(ВТ_СебестоимостьТоваров.Склад.ЦеховаяКладовая, ЛОЖЬ) И ВТ_СебестоимостьТоваров.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение) И ВТ_СебестоимостьТоваров.РазделУчета В
	|			(ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи))
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА (ЕСТЬNULL(ВТ_СебестоимостьТоваров.Склад.ЦеховаяКладовая, ЛОЖЬ) ИЛИ ВТ_СебестоимостьТоваров.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)) И ВТ_СебестоимостьТоваров.РазделУчета В
	|			(ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение), ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажи))
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВПроизводстве)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиПереданныеПартнерам)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦУХранителей)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыНаХраненииСПравомПродажиКОформлениюСписания)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦКСписанию)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА НЕ ЕСТЬNULL(ВТ_СебестоимостьТоваров.Склад.ЦеховаяКладовая, ЛОЖЬ) И ВТ_СебестоимостьТоваров.ТипМестаХранения <> ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение) И ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработку)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА (ЕСТЬNULL(ВТ_СебестоимостьТоваров.Склад.ЦеховаяКладовая, ЛОЖЬ) ИЛИ ВТ_СебестоимостьТоваров.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Подразделение)) И ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.МатериалыПринятыеВПереработку)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработкуВПроизводстве)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) И НЕ ВТ_СебестоимостьТоваров.ТипМестаХранения В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер), ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация))
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыНаСкладе)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаКомиссию) И ВТ_СебестоимостьТоваров.ТипМестаХранения В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Партнер), ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Организация))
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыПереданныеНаКомиссию)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыВПути)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПереданныеНаКомиссию)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НоменклатураПереданная)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		КОГДА ВТ_СебестоимостьТоваров.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.СобственныеТоварыВПути)
	|			ТОГДА МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗатратыНаПриобретениеТМЦ)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|		ИНАЧЕ МАКСИМУМ(
	|						ВЫБОР КОГДА ЕСТЬNULL(НастройкиПоМестуУчета.ВидСчета, ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО))) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе)
	|						ТОГДА ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, НЕОПРЕДЕЛЕНО))) ИНАЧЕ НЕОПРЕДЕЛЕНО КОНЕЦ)
	|	КОНЕЦ КАК Счет
	|ПОМЕСТИТЬ ВТ_СебестоимостьТоваровНастройки
	|ИЗ
	|	ВТ_СебестоимостьТоваров КАК ВТ_СебестоимостьТоваров
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоМестуУчета
	|	ПО 
	|		НастройкиПоМестуУчета.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПередачаВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦУХранителей),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦКСписанию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыНаСкладе),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработкуВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыПереданныеНаКомиссию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НоменклатураПереданная),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗатратыНаПриобретениеТМЦ),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		И НастройкиПоМестуУчета.Организация = ВТ_СебестоимостьТоваров.Организация
	|		И НастройкиПоМестуУчета.АналитикаУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|		И НастройкиПоМестуУчета.МестоУчета = ВТ_СебестоимостьТоваров.Склад
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|	ПО 
	|		НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПередачаВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦУХранителей),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦКСписанию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыНаСкладе),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработкуВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыПереданныеНаКомиссию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НоменклатураПереданная),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗатратыНаПриобретениеТМЦ),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		И НастройкиПоОрганизации.Организация = ВТ_СебестоимостьТоваров.Организация
	|		И НастройкиПоОрганизации.АналитикаУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|		И НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ПередачаВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦнаскладах),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦУХранителей),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦКСписанию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработку),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыНаСкладе),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТМЦВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.МатериалыПринятыеВПереработкуВПроизводстве),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ТоварыПереданныеНаКомиссию),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НоменклатураПереданная),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЗатратыНаПриобретениеТМЦ),
	|											ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НаСкладе))
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И НастройкиПоАналитике.АналитикаУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СебестоимостьТоваров.Организация,
	|	ВТ_СебестоимостьТоваров.Номенклатура,
	|	ВТ_СебестоимостьТоваров.Склад,
	|	ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета,
	|	ВТ_СебестоимостьТоваров.Подразделение,
	|	ВТ_СебестоимостьТоваров.Валюта,
	|	ВТ_СебестоимостьТоваров.РазделУчета,
	|	ВТ_СебестоимостьТоваров.ТипМестаХранения,
	|	ВТ_СебестоимостьТоваров.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.Субконто2,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт
	|ПОМЕСТИТЬ ВТ_СебестоимостьНоменклатурыРегл
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|											&НачалоПериода, 
	|											&КонецПериода, 
	|											Регистратор,
	|											,
	|											&ВидыСубконтоНоменклатураСклад, 
	|											Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка),
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Подразделение, НЕОПРЕДЕЛЕНО),
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|											&НачалоПериода, 
	|											&КонецПериода, 
	|											Регистратор,
	|											Счет В (Выбрать Т.Счет ИЗ Счета_НоменклатураБезСклада КАК Т),
	|											ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура),
	|											Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СебестоимостьТоваровНастройки.Организация КАК Организация,
	|	ВТ_СебестоимостьТоваровНастройки.Номенклатура КАК Аналитика1,
	|	ВЫБОР
	|		КОГДА НЕ Счета_НоменклатураБезСклада.Счет ЕСТЬ NULL
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
	|		ИНАЧЕ ВТ_СебестоимостьТоваровНастройки.Склад
	|	КОНЕЦ КАК Аналитика2,
	|	ВЫБОР
	|		КОГДА ПланХозрасчетный.УчетПоПодразделениям
	|			ТОГДА ВТ_СебестоимостьТоваровНастройки.Подразделение
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|	КОНЕЦ КАК Подразделение,
	|	ВТ_СебестоимостьТоваровНастройки.Счет КАК СчетБУ,
	|	ВТ_СебестоимостьТоваров.Регистратор КАК Регистратор,
	|	ЕСТЬNULL(ВТ_СебестоимостьТоваров.Приход, 0) КАК Приход,
	|	ЕСТЬNULL(ВТ_СебестоимостьТоваров.Расход, 0) КАК Расход,
	|	0 КАК ОборотДт,
	|	0 КАК ОборотКт
	|ПОМЕСТИТЬ ВТ_СверкаОборотов
	|ИЗ
	|	ВТ_СебестоимостьТоваровНастройки КАК ВТ_СебестоимостьТоваровНастройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СебестоимостьТоваров КАК ВТ_СебестоимостьТоваров
	|		ПО ВТ_СебестоимостьТоваровНастройки.Организация = ВТ_СебестоимостьТоваров.Организация
	|			И ВТ_СебестоимостьТоваровНастройки.Номенклатура = ВТ_СебестоимостьТоваров.Номенклатура
	|			И ВТ_СебестоимостьТоваровНастройки.Подразделение = ВТ_СебестоимостьТоваров.Подразделение
	|			И ВТ_СебестоимостьТоваровНастройки.Валюта = ВТ_СебестоимостьТоваров.Валюта
	|			И ВТ_СебестоимостьТоваровНастройки.Склад = ВТ_СебестоимостьТоваров.Склад
	|			И ВТ_СебестоимостьТоваровНастройки.РазделУчета = ВТ_СебестоимостьТоваров.РазделУчета
	|			И ВТ_СебестоимостьТоваровНастройки.ГруппаФинансовогоУчета = ВТ_СебестоимостьТоваров.ГруппаФинансовогоУчета
	|			И ВТ_СебестоимостьТоваровНастройки.Регистратор = ВТ_СебестоимостьТоваров.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланХозрасчетный КАК ПланХозрасчетный
	|		ПО ВТ_СебестоимостьТоваровНастройки.Счет = ПланХозрасчетный.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Счета_НоменклатураБезСклада КАК Счета_НоменклатураБезСклада
	|		ПО ВТ_СебестоимостьТоваровНастройки.Счет = Счета_НоменклатураБезСклада.Счет
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_СебестоимостьНоменклатурыРегл.Организация,
	|	ВТ_СебестоимостьНоменклатурыРегл.Субконто1,
	|	ВТ_СебестоимостьНоменклатурыРегл.Субконто2,
	|	ВТ_СебестоимостьНоменклатурыРегл.Подразделение,
	|	ВТ_СебестоимостьНоменклатурыРегл.Счет,
	|	ВТ_СебестоимостьНоменклатурыРегл.Регистратор,
	|	0,
	|	0,
	|	ВТ_СебестоимостьНоменклатурыРегл.СуммаОборотДт,
	|	ВТ_СебестоимостьНоменклатурыРегл.СуммаОборотКт
	|ИЗ
	|	ВТ_СебестоимостьНоменклатурыРегл КАК ВТ_СебестоимостьНоменклатурыРегл
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ОтражениеДокументовВРеглУчете.Статус) КАК Статус,
	|	ОтражениеДокументовВРеглУчете.Организация КАК Организация,
	|	ОтражениеДокументовВРеглУчете.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_СтатусыОтражения
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|ГДЕ
	|	ОтражениеДокументовВРеглУчете.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.Регистратор КАК Регистратор
	|			ИЗ
	|				ВТ_СверкаОборотов КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеДокументовВРеглУчете.Организация,
	|	ОтражениеДокументовВРеглУчете.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	2 КАК РазделУчета,
	|	ВТ_СверкаОборотов.Организация КАК Организация,
	|	ВТ_СверкаОборотов.Аналитика1 КАК Аналитика1,
	|	ВТ_СверкаОборотов.Аналитика2 КАК Аналитика2,
	|	ВТ_СверкаОборотов.Подразделение КАК Подразделение,
	|	ВТ_СверкаОборотов.СчетБУ КАК СчетБУ,
	|	ВТ_СверкаОборотов.Регистратор КАК Регистратор,
	|	СУММА(ВТ_СверкаОборотов.Приход) КАК Приход,
	|	СУММА(ВТ_СверкаОборотов.Расход) КАК Расход,
	|	СУММА(ВТ_СверкаОборотов.ОборотДт) КАК ОборотДт,
	|	СУММА(ВТ_СверкаОборотов.ОборотКт) КАК ОборотКт,
	|	ВТ_СтатусыОтражения.Статус КАК Статус
	|ИЗ
	|	ВТ_СверкаОборотов КАК ВТ_СверкаОборотов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыОтражения КАК ВТ_СтатусыОтражения
	|		ПО ВТ_СверкаОборотов.Организация = ВТ_СтатусыОтражения.Организация
	|			И ВТ_СверкаОборотов.Регистратор = ВТ_СтатусыОтражения.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СверкаОборотов.Организация,
	|	ВТ_СверкаОборотов.Аналитика1,
	|	ВТ_СверкаОборотов.Аналитика2,
	|	ВТ_СверкаОборотов.Подразделение,
	|	ВТ_СверкаОборотов.СчетБУ,
	|	ВТ_СверкаОборотов.Регистратор,
	|	ВТ_СтатусыОтражения.Статус
	|
	|ИМЕЮЩИЕ
	|	НЕ(СУММА(ВТ_СверкаОборотов.Приход) = 0
	|			И СУММА(ВТ_СверкаОборотов.Расход) = 0
	|			И СУММА(ВТ_СверкаОборотов.ОборотДт) = 0
	|			И СУММА(ВТ_СверкаОборотов.ОборотКт) = 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СтатусыОтражения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СверкаОборотов";

КонецФункции

Функция ТекстЗапросаДенежныеСредства()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.Организация КАК Организация,
	|	БанковскиеСчетаОрганизаций.Подразделение,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет КАК Аналитика1,
	|	ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетУчета,
	|	БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств КАК Валюта,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглНачальныйОстаток КАК НачальныйОстаток,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглПриход КАК Приход,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглРасход КАК Расход,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглКонечныйОстаток КАК КонечныйОстаток,
	|	0 КАК НачальноеСальдо,
	|	0 КАК ОборотДт,
	|	0 КАК ОборотКт,
	|	0 КАК КонечноеСальдо
	|ПОМЕСТИТЬ ВТ_ДенежныеСредстваИсходныеДанные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваБезналичныеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет = БанковскиеСчетаОрганизаций.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ДенежныеСредства)
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И НастройкиПоАналитике.АналитикаУчета = БанковскиеСчетаОрганизаций.Ссылка
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.Организация КАК Организация,
	|	Кассы.Подразделение,
	|	NULL,
	|	ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
	|	Кассы.ВалютаДенежныхСредств,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваНаличныеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	|		ПО ДенежныеСредстваНаличныеОстаткиИОбороты.Касса = Кассы.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ДенежныеСредства)
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И НастройкиПоАналитике.АналитикаУчета = Кассы.Ссылка
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.Организация,
	|	КассыККМ.Подразделение,
	|	NULL,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РозничнаяВыручкаВКассахККМ),
	|	КассыККМ.ВалютаДенежныхСредств,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваВКассахККМОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК КассыККМ
	|		ПО ДенежныеСредстваВКассахККМОстаткиИОбороты.КассаККМ = КассыККМ.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.ПодотчетноеЛицо,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Валюта,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеДокументыОстаткиИОбороты.Организация,
	|	ДенежныеДокументыОстаткиИОбороты.Подразделение,
	|	ДенежныеДокументыОстаткиИОбороты.ДенежныйДокумент,
	|	ВЫБОР
	|		КОГДА ДенежныеДокументы.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДенежныеДокументы.Валюта,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеДокументыОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДенежныеДокументы КАК ДенежныеДокументы
	|		ПО ДенежныеДокументыОстаткиИОбороты.ДенежныйДокумент = ДенежныеДокументы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	NULL,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу))
	|				И ДенежныеСредстваВПутиОстаткиИОбороты.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу))
	|						И ДенежныеСредстваВПутиОстаткиИОбороты.Валюта <> ВалютаРегламентированногоУчета.Значение
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|							ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|									ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РеализацияИностраннойВалюты)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПоступлениеОтБанкаПоЭквайрингу)
	|											ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам)
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Валюта,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглНачальныйОстаток,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглРасход,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваВПутиОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КлючиАналитики.Организация,
	|	ДанныеДоговора.Подразделение,
	|	ДанныеДоговора.БанковскийСчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДанныеДоговора.ВалютаВзаиморасчетов,
	|	РасчетыПоКредитамДепозитам.СуммаРеглНачальныйОстаток КАК СуммаРеглНачальныйОстаток,
	|	РасчетыПоКредитамДепозитам.СуммаРеглПриход КАК СуммаРеглПриход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглРасход КАК СуммаРеглРасход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглКонечныйОстаток КАК СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Договор.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Депозит)
	|				И (ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|					ИЛИ ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|						И Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговораКредитовИДепозитов.ДепозитВБанкеСКапитализацией))) КАК РасчетыПоКредитамДепозитам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыПоКредитамДепозитам.АналитикаУчетаПоПартнерам)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = РасчетыПоКредитамДепозитам.Договор)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалютеГруппа), 
	|				ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалютеГруппа))
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка)
	|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаКонтрагентов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаОрганизаций)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.ФизическиеЛица)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.ДенежныеДокументы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Валюта, ВалютаРегламентированногоУчета.Значение),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаВБанках), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДенежныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами)), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК РазделУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Организация,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Аналитика1,
	|	ВТ_ДенежныеСредстваИсходныеДанные.СчетУчета КАК СчетБУ,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Валюта,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.Приход) КАК Приход,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.Расход) КАК Расход,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.ОборотДт) КАК ОборотДт,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.ОборотКт) КАК ОборотКт,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	ВТ_ДенежныеСредстваИсходныеДанные КАК ВТ_ДенежныеСредстваИсходныеДанные
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДенежныеСредстваИсходныеДанные.Организация,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Аналитика1,
	|	ВТ_ДенежныеСредстваИсходныеДанные.СчетУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Валюта";
	
КонецФункции

Функция ТекстЗапросаДенежныеСредстваПоРегистраторам()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.Организация КАК Организация,
	|	БанковскиеСчетаОрганизаций.Подразделение,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет КАК Аналитика1,
	|	ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)) КАК СчетУчета,
	|	БанковскиеСчетаОрганизаций.ВалютаДенежныхСредств КАК Валюта,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.Регистратор КАК Регистратор,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглПриход КАК Приход,
	|	ДенежныеСредстваБезналичныеОстаткиИОбороты.СуммаРеглРасход КАК Расход,
	|	0 КАК ОборотДт,
	|	0 КАК ОборотКт
	|ПОМЕСТИТЬ ВТ_ДенежныеСредстваИсходныеДанные
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваБезналичныеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.БанковскиеСчетаОрганизаций КАК БанковскиеСчетаОрганизаций
	|		ПО ДенежныеСредстваБезналичныеОстаткиИОбороты.БанковскийСчет = БанковскиеСчетаОрганизаций.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ДенежныеСредства)
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И НастройкиПоАналитике.АналитикаУчета = БанковскиеСчетаОрганизаций.Ссылка
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.Организация КАК Организация,
	|	Кассы.Подразделение,
	|	NULL,
	|	ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)),
	|	Кассы.ВалютаДенежныхСредств,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.Регистратор,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваНаличныеОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваНаличныеОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Кассы КАК Кассы
	|		ПО ДенежныеСредстваНаличныеОстаткиИОбороты.Касса = Кассы.Ссылка
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ДенежныеСредства)
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И НастройкиПоАналитике.АналитикаУчета = Кассы.Ссылка
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.Организация,
	|	КассыККМ.Подразделение,
	|	NULL,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РозничнаяВыручкаВКассахККМ),
	|	КассыККМ.ВалютаДенежныхСредств,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.Регистратор,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваВКассахККМОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВКассахККМ.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваВКассахККМОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КассыККМ КАК КассыККМ
	|		ПО ДенежныеСредстваВКассахККМОстаткиИОбороты.КассаККМ = КассыККМ.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктураПредприятия.ПустаяСсылка),
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.ПодотчетноеЛицо,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицамиВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Валюта,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.Регистратор,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваУПодотчетныхЛиц.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваУПодотчетныхЛицОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеДокументыОстаткиИОбороты.Организация,
	|	ДенежныеДокументыОстаткиИОбороты.Подразделение,
	|	ДенежныеДокументыОстаткиИОбороты.ДенежныйДокумент,
	|	ВЫБОР
	|		КОГДА ДенежныеДокументы.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеДокументыВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДенежныеДокументы.Валюта,
	|	ДенежныеДокументыОстаткиИОбороты.Регистратор,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеДокументыОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеДокументы.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Организация В (&МассивОрганизаций)) КАК ДенежныеДокументыОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДенежныеДокументы КАК ДенежныеДокументы
	|		ПО ДенежныеДокументыОстаткиИОбороты.ДенежныйДокумент = ДенежныеДокументы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Организация,
	|	НЕОПРЕДЕЛЕНО,
	|	NULL,
	|	ВЫБОР
	|		КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу))
	|				И ДенежныеСредстваВПутиОстаткиИОбороты.Валюта = ВалютаРегламентированногоУчета.Значение
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалюте)
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств В (ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияВБанк), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеречислениеНаДругойСчет), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ИнкассацияИзБанка), ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПеремещениеВДругуюКассу))
	|						И ДенежныеСредстваВПутиОстаткиИОбороты.Валюта <> ВалютаРегламентированногоУчета.Значение
	|					ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалюте)
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПриобретениеВалюты)
	|							ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеИностраннойВалюты)
	|						ИНАЧЕ ВЫБОР
	|								КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.РеализацияВалюты)
	|									ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РеализацияИностраннойВалюты)
	|								ИНАЧЕ ВЫБОР
	|										КОГДА ДенежныеСредстваВПутиОстаткиИОбороты.ВидПереводаДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ВидыПереводовДенежныхСредств.ПоступлениеОтБанкаПоЭквайрингу)
	|											ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПродажиПоПлатежнымКартам)
	|									КОНЕЦ
	|							КОНЕЦ
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Валюта,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.Регистратор,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглПриход,
	|	ДенежныеСредстваВПутиОстаткиИОбороты.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваВПути.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Организация В (&МассивОрганизаций)) КАК ДенежныеСредстваВПутиОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КлючиАналитики.Организация,
	|	ДанныеДоговора.Подразделение,
	|	ДанныеДоговора.БанковскийСчетКонтрагента,
	|	ВЫБОР
	|		КОГДА ДанныеДоговора.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВНациональнойВалюте)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеСчетаВБанкеВИностраннойВалюте)
	|	КОНЕЦ,
	|	ДанныеДоговора.ВалютаВзаиморасчетов,
	|	РасчетыПоКредитамДепозитам.Регистратор,
	|	РасчетыПоКредитамДепозитам.СуммаРеглПриход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Движения,
	|			Договор.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Депозит)
	|				И (ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|					ИЛИ ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|						И Договор.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговораКредитовИДепозитов.ДепозитВБанкеСКапитализацией))) КАК РасчетыПоКредитамДепозитам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыПоКредитамДепозитам.АналитикаУчетаПоПартнерам)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = РасчетыПоКредитамДепозитам.Договор)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстаткиИОбороты.Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВНациональнойВалютеГруппа), 
	|				ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДенежныеСредстваВПутиВИностраннойВалютеГруппа))
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ХозрасчетныйОстаткиИОбороты.Подразделение
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаКонтрагентов)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.БанковскиеСчетаОрганизаций)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.ФизическиеЛица)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ХозрасчетныйОстаткиИОбороты.Субконто1) = ТИП(Справочник.ДенежныеДокументы)
	|			ТОГДА ХозрасчетныйОстаткиИОбороты.Субконто1
	|		ИНАЧЕ NULL
	|	КОНЕЦ,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ЕСТЬNULL(ХозрасчетныйОстаткиИОбороты.Валюта, ВалютаРегламентированногоУчета.Значение),
	|	ХозрасчетныйОстаткиИОбороты.Регистратор,
	|	0,
	|	0,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.Касса), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СчетаВБанках), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПрочиеДенежныеСредства), ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами)), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
	|		ПО (ИСТИНА)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ОтражениеДокументовВРеглУчете.Статус) КАК Статус,
	|	ОтражениеДокументовВРеглУчете.Организация КАК Организация,
	|	ОтражениеДокументовВРеглУчете.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_СтатусыОтражения
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|ГДЕ
	|	ОтражениеДокументовВРеглУчете.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.Регистратор КАК Регистратор
	|			ИЗ
	|				ВТ_ДенежныеСредстваИсходныеДанные КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеДокументовВРеглУчете.Организация,
	|	ОтражениеДокументовВРеглУчете.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК РазделУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Организация КАК Организация,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Аналитика1 КАК Аналитика1,
	|	ВТ_ДенежныеСредстваИсходныеДанные.СчетУчета КАК СчетБУ,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Валюта КАК Валюта,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Регистратор КАК Регистратор,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.Приход) КАК Приход,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.Расход) КАК Расход,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.ОборотДт) КАК ОборотДт,
	|	СУММА(ВТ_ДенежныеСредстваИсходныеДанные.ОборотКт) КАК ОборотКт,
	|	ВТ_СтатусыОтражения.Статус КАК Статус
	|ИЗ
	|	ВТ_ДенежныеСредстваИсходныеДанные КАК ВТ_ДенежныеСредстваИсходныеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыОтражения КАК ВТ_СтатусыОтражения
	|		ПО ВТ_ДенежныеСредстваИсходныеДанные.Организация = ВТ_СтатусыОтражения.Организация
	|			И ВТ_ДенежныеСредстваИсходныеДанные.Регистратор = ВТ_СтатусыОтражения.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДенежныеСредстваИсходныеДанные.Организация,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Подразделение,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Аналитика1,
	|	ВТ_ДенежныеСредстваИсходныеДанные.СчетУчета,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Валюта,
	|	ВТ_ДенежныеСредстваИсходныеДанные.Регистратор,
	|	ВТ_СтатусыОтражения.Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СтатусыОтражения";

КонецФункции

Функция ТекстЗапросаРасчетыСКонтрагентами()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОбъектыРасчетов.Организация КАК Организация,
	|	ОбъектыРасчетов.Подразделение КАК Подразделение,
	|	ОбъектыРасчетов.Контрагент КАК Контрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СУММА(РасчетыСПоставщиками.ДолгРеглНачальныйОстаток) КАК ДолгРеглНачальныйОстаток,
	|	СУММА(РасчетыСПоставщиками.ДолгРеглПриход) КАК ДолгРеглПриход,
	|	СУММА(РасчетыСПоставщиками.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	СУММА(РасчетыСПоставщиками.ДолгРеглНачальныйОстаток + РасчетыСПоставщиками.ДолгРеглПриход - РасчетыСПоставщиками.ДолгРеглРасход) КАК ДолгРеглКонечныйОстаток,
	|	СУММА(РасчетыСПоставщиками.ПредоплатаРеглНачальныйОстаток) КАК ПредоплатаРеглНачальныйОстаток,
	|	СУММА(РасчетыСПоставщиками.ПредоплатаРеглПриход) КАК ПредоплатаРеглПриход,
	|	СУММА(РасчетыСПоставщиками.ПредоплатаРеглРасход) КАК ПредоплатаРеглРасход,
	|	СУММА(РасчетыСПоставщиками.ПредоплатаРеглНачальныйОстаток + РасчетыСПоставщиками.ПредоплатаРеглПриход - РасчетыСПоставщиками.ПредоплатаРеглРасход) КАК ПредоплатаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщикамиРег
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику КАК ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоДокументам.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|		КОНЕЦ КАК ДолгРеглПриход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ДолгРеглРасход,
	|		0 КАК ДолгРеглНачальныйОстаток,
	|		0 КАК ДолгРеглКонечныйОстаток,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|		КОНЕЦ КАК ПредоплатаРеглПриход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПредоплатаРеглРасход,
	|		0 КАК ПредоплатаРеглНачальныйОстаток,
	|		0 КАК ПредоплатаРеглКонечныйОстаток,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация КАК ХозяйственнаяОперация
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоДокументам.Регистратор <> РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент
	|		ТОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|		ИНАЧЕ 0 КОНЕЦ,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		НЕ(РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности)
	|		И РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Регистратор = РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ДолгРеглОстаток
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ПредоплатаРеглОстаток
	|		КОНЕЦ,
	|		0,
	|		NULL
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам.Остатки(&НачалоПериода, ) КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоСрокам.Валюта,
	|		0,
	|		0,
	|		-РасчетыСПоставщикамиПоСрокам.ДолгРеглНачальныйОстаток,
	|		-РасчетыСПоставщикамиПоСрокам.ДолгРеглКонечныйОстаток,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглНачальныйОстаток,
	|		РасчетыСПоставщикамиПоСрокам.ПредоплатаРеглКонечныйОстаток,
	|		NULL
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК РасчетыСПоставщикамиПоСрокам
	|	ГДЕ
	|		&НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоСрокам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ДолгРегл,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл,
	|		0,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ХозяйственнаяОперация
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСПоставщикамиПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоСрокам.Активность
	|		И &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоСрокам.Валюта,
	|		РасчетыСПоставщикамиПоСрокам.ДолгРегл,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ХозяйственнаяОперация
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоСрокам.Активность
	|		И &НоваяАрхитектураВзаиморасчетов) КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ОбъектыРасчетов.Ссылка = РасчетыСПоставщиками.ОбъектРасчетов)
	|ГДЕ
	|	ОбъектыРасчетов.Организация В(&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыРасчетов.НаправлениеДеятельности,
	|	ОбъектыРасчетов.Организация,
	|	ОбъектыРасчетов.Контрагент,
	|	РасчетыСПоставщиками.ХозяйственнаяОперация,
	|	ОбъектыРасчетов.Подразделение,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияКонтрагентКонтрагент.НаправлениеДеятельности,
	|	ДвиженияКонтрагентКонтрагент.Организация,
	|	ДвиженияКонтрагентКонтрагент.Подразделение,
	|	ДвиженияКонтрагентКонтрагент.Контрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета,
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(0)
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И ТипСуммы В (ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный), ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику))
	|				И Организация В (&МассивОрганизаций)) КАК ДвиженияКонтрагентКонтрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ОбъектыРасчетов.Ссылка = ДвиженияКонтрагентКонтрагент.ОбъектРасчетов)
	|ГДЕ
	|	ДвиженияКонтрагентКонтрагент.Организация <> ОбъектыРасчетов.Организация
	|	И НЕ &НоваяАрхитектураВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияКонтрагентКонтрагент.ХозяйственнаяОперация,
	|	ДвиженияКонтрагентКонтрагент.Организация,
	|	ДвиженияКонтрагентКонтрагент.Контрагент,
	|	ДвиженияКонтрагентКонтрагент.Подразделение,
	|	ДвиженияКонтрагентКонтрагент.НаправлениеДеятельности,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОбъектыРасчетов.Организация КАК Организация,
	|	ОбъектыРасчетов.Подразделение КАК Подразделение,
	|	ОбъектыРасчетов.Контрагент КАК Контрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СУММА(РасчетыСКлиентами.ДолгРеглНачальныйОстаток) КАК ДолгРеглНачальныйОстаток,
	|	СУММА(РасчетыСКлиентами.ДолгРеглПриход) КАК ДолгРеглПриход,
	|	СУММА(РасчетыСКлиентами.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	СУММА(РасчетыСКлиентами.ДолгРеглКонечныйОстаток) КАК ДолгРеглКонечныйОстаток,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРеглНачальныйОстаток) КАК ПредоплатаРеглНачальныйОстаток,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРеглПриход) КАК ПредоплатаРеглПриход,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРеглРасход) КАК ПредоплатаРеглРасход,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРеглКонечныйОстаток) КАК ПредоплатаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентамиРег
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента КАК ОбъектРасчетов,
	|		РасчетыСКлиентамиПоДокументам.Валюта КАК Валюта,
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл КАК ДолгРеглПриход,
	|		0 КАК ДолгРеглРасход,
	|		0 КАК ДолгРеглНачальныйОстаток,
	|		0 КАК ДолгРеглКонечныйОстаток,
	|		ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоДокументам.Регистратор <> РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|		ТОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|		ИНАЧЕ 0 КОНЕЦ КАК ПредоплатаРеглПриход,
	|		0 КАК ПредоплатаРеглРасход,
	|		0 КАК ПредоплатаРеглНачальныйОстаток,
	|		0 КАК ПредоплатаРеглКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0
	|				ТОГДА -РасчетыСКлиентамиПоДокументам.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ДолгРегл
	|		КОНЕЦ,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА -РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|		КОНЕЦ,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		НЕ(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|					ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Регистратор = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл - РасчетыСКлиентамиПоДокументам.ДолгРегл,
	|		0,
	|		0,
	|		0,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		0,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ДолгРеглОстаток
	|		КОНЕЦ,
	|		0,
	|		0,
	|		0,
	|		ВЫБОР
	|			КОГДА &НачалоПериода = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ПредоплатаРеглОстаток
	|		КОНЕЦ,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&НачалоПериода, ) КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		0,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.ДолгРеглОстаток,
	|		0,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРеглОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам.Остатки(&КонецПериодаОстатков, ) КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСКлиентамиПоСрокам.Валюта,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоСрокам.ДолгРеглНачальныйОстаток,
	|		РасчетыСКлиентамиПоСрокам.ДолгРеглКонечныйОстаток,
	|		0,
	|		0,
	|		-РасчетыСКлиентамиПоСрокам.ПредоплатаРеглНачальныйОстаток,
	|		-РасчетыСКлиентамиПоСрокам.ПредоплатаРеглКонечныйОстаток
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК РасчетыСКлиентамиПоСрокам
	|	ГДЕ
	|		&НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСКлиентамиПоСрокам.Валюта,
	|		РасчетыСКлиентамиПоСрокам.ДолгРегл,
	|		0,
	|		0,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоСрокам.ПредоплатаРегл,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|	ГДЕ
	|		РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоСрокам.Активность
	|		И &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСКлиентамиПоСрокам.Валюта,
	|		0,
	|		РасчетыСКлиентамиПоСрокам.ДолгРегл,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоСрокам.ПредоплатаРегл,
	|		0,
	|		0,
	|		0
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|	ГДЕ
	|		РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоСрокам.Активность
	|		И &НоваяАрхитектураВзаиморасчетов) КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ОбъектыРасчетов.Ссылка = РасчетыСКлиентами.ОбъектРасчетов)
	|ГДЕ
	|	ОбъектыРасчетов.Организация В(&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыРасчетов.НаправлениеДеятельности,
	|	ОбъектыРасчетов.Организация,
	|	ОбъектыРасчетов.Подразделение,
	|	ОбъектыРасчетов.Контрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияКонтрагентКонтрагент.НаправлениеДеятельности,
	|	ДвиженияКонтрагентКонтрагент.Организация,
	|	ДвиженияКонтрагентКонтрагент.Подразделение,
	|	ДвиженияКонтрагентКонтрагент.КорКонтрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета,
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(0)
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И ТипСуммы В (ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный), ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента))
	|				И Организация В (&МассивОрганизаций)) КАК ДвиженияКонтрагентКонтрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ОбъектыРасчетов.Ссылка = ДвиженияКонтрагентКонтрагент.ОбъектРасчетов)
	|ГДЕ
	|	ДвиженияКонтрагентКонтрагент.Организация <> ОбъектыРасчетов.Организация
	|	И НЕ &НоваяАрхитектураВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияКонтрагентКонтрагент.НаправлениеДеятельности,
	|	ДвиженияКонтрагентКонтрагент.Организация,
	|	ДвиженияКонтрагентКонтрагент.КорКонтрагент,
	|	ДвиженияКонтрагентКонтрагент.Подразделение,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиАналитики.Организация КАК Организация,
	|	КлючиАналитики.Контрагент КАК Контрагент,
	|	РасчетыПоКредитамДепозитам.ТипСуммы КАК ТипСуммы,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДоговора.ХарактерДоговора КАК ХарактерДоговора,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеДоговора.Подразделение КАК Подразделение,
	|	СУММА(РасчетыПоКредитамДепозитам.СуммаРеглНачальныйОстаток) КАК СуммаРеглНачальныйОстаток,
	|	СУММА(РасчетыПоКредитамДепозитам.СуммаРеглПриход) КАК СуммаРеглПриход,
	|	СУММА(РасчетыПоКредитамДепозитам.СуммаРеглРасход) КАК СуммаРеглРасход,
	|	СУММА(РасчетыПоКредитамДепозитам.СуммаРеглКонечныйОстаток) КАК СуммаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыПоКредитамДепозитамРег
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , ,
	|		Договор.ХарактерДоговора <> ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Депозит)
	|		ИЛИ ТипСуммы <> ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|		И (Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.ТипыДоговораКредитовИДепозитов.ДепозитВБанкеСКапитализацией)
	|		ИЛИ ТипСуммы <> ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты))) КАК РасчетыПоКредитамДепозитам
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыПоКредитамДепозитам.АналитикаУчетаПоПартнерам)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = РасчетыПоКредитамДепозитам.Договор)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДоговора.ХарактерДоговора,
	|	ДанныеДоговора.ГруппаФинансовогоУчета,
	|	РасчетыПоКредитамДепозитам.ТипСуммы,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	КлючиАналитики.Контрагент,
	|	ДанныеДоговора.Подразделение,
	|	КлючиАналитики.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиАналитики.Организация КАК Организация,
	|	КлючиАналитики.Контрагент КАК Контрагент,
	|	РасчетыПоЛизингу.ТипСуммы КАК ТипСуммы,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеДоговора.Подразделение КАК Подразделение,
	|	СУММА(РасчетыПоЛизингу.СуммаРеглНачальныйОстаток) КАК СуммаРеглНачальныйОстаток,
	|	СУММА(РасчетыПоЛизингу.СуммаРеглПриход) КАК СуммаРеглПриход,
	|	СУММА(РасчетыПоЛизингу.СуммаРеглРасход) КАК СуммаРеглРасход,
	|	СУММА(РасчетыПоЛизингу.СуммаРеглКонечныйОстаток) КАК СуммаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыПоЛизингуРег
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК РасчетыПоЛизингу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыПоЛизингу.АналитикаУчетаПоПартнерам)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыЛизинга КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = РасчетыПоЛизингу.Договор)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДоговора.ГруппаФинансовогоУчета,
	|	КлючиАналитики.Контрагент,
	|	РасчетыПоЛизингу.ТипСуммы,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	ДанныеДоговора.Подразделение,
	|	КлючиАналитики.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НеотфактурованныеПоставки.Организация КАК Организация,
	|	АналитикаПартии.Контрагент КАК Контрагент,
	|	АналитикаПартии.Договор КАК Договор,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	ДанныеДоговора.Подразделение КАК Подразделение,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СУММА(НеотфактурованныеПоставки.СтоимостьРеглНачальныйОстаток) КАК СтоимостьРеглНачальныйОстаток,
	|	СУММА(НеотфактурованныеПоставки.СтоимостьРеглПриход) КАК СтоимостьРеглПриход,
	|	СУММА(НеотфактурованныеПоставки.СтоимостьРеглРасход) КАК СтоимостьРеглРасход,
	|	СУММА(НеотфактурованныеПоставки.СтоимостьРеглКонечныйОстаток) КАК СтоимостьРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_НеотфактурованныеПоставкиРег
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Организация В (&МассивОрганизаций)
	|				И РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)) КАК НеотфактурованныеПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад КАК АналитикаПартии
	|		ПО (АналитикаПартии.Ссылка = НеотфактурованныеПоставки.Партия)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = АналитикаПартии.Договор)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДоговора.ГруппаФинансовогоУчета,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	АналитикаПартии.Контрагент,
	|	АналитикаПартии.Договор,
	|	НеотфактурованныеПоставки.Организация,
	|	ДанныеДоговора.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСПоставщикамиРег.Организация КАК Организация,
	|	ВТ_РасчетыСПоставщикамиРег.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|					КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|						ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|					ИНАЧЕ &ПустойСчет
	|				КОНЕЦ) КАК СчетУчетаРасчетов,	
	|	МАКСИМУМ(ВЫБОР
	|					КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)
	|						ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|					ИНАЧЕ &ПустойСчет
	|				КОНЕЦ) КАК СчетУчетаАванса,
	|	ВТ_РасчетыСПоставщикамиРег.Подразделение КАК Подразделение,
	|	ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглНачальныйОстаток) КАК ДолгРеглНачальныйОстаток,
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглПриход) КАК ДолгРеглПриход,
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглКонечныйОстаток) КАК ДолгРеглКонечныйОстаток,
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглНачальныйОстаток) КАК ПредоплатаРеглНачальныйОстаток,
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглПриход) КАК ПредоплатаРеглПриход,
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглРасход) КАК ПредоплатаРеглРасход,
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглКонечныйОстаток) КАК ПредоплатаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщиками
	|ИЗ
	|	ВТ_РасчетыСПоставщикамиРег КАК ВТ_РасчетыСПоставщикамиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)))
	|			И (НастройкиПоОрганизации.Организация = ВТ_РасчетыСПоставщикамиРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыСПоставщикамиРег.Организация,
	|	ВТ_РасчетыСПоставщикамиРег.Контрагент,
	|	ВТ_РасчетыСПоставщикамиРег.Подразделение,
	|	ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглНачальныйОстаток),
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглПриход),
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглРасход),
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглКонечныйОстаток),
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглНачальныйОстаток),
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглПриход),
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглРасход),
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглКонечныйОстаток)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСКлиентамиРег.Организация КАК Организация,
	|	ВТ_РасчетыСКлиентамиРег.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|				ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|			ИНАЧЕ &ПустойСчет
	|		КОНЕЦ) КАК СчетУчетаРасчетов,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)
	|				ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|			ИНАЧЕ &ПустойСчет
	|		КОНЕЦ) КАК СчетУчетаАванса,
	|	ВТ_РасчетыСКлиентамиРег.Подразделение КАК Подразделение,
	|	ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглНачальныйОстаток) КАК ДолгРеглНачальныйОстаток,
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглПриход) КАК ДолгРеглПриход,
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглКонечныйОстаток) КАК ДолгРеглКонечныйОстаток,
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглНачальныйОстаток) КАК ПредоплатаРеглНачальныйОстаток,
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглПриход) КАК ПредоплатаРеглПриход,
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглРасход) КАК ПредоплатаРеглРасход,
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглКонечныйОстаток) КАК ПредоплатаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентами
	|ИЗ
	|	ВТ_РасчетыСКлиентамиРег КАК ВТ_РасчетыСКлиентамиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)))
	|			И (НастройкиПоОрганизации.Организация = ВТ_РасчетыСКлиентамиРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыСКлиентамиРег.Организация,
	|	ВТ_РасчетыСКлиентамиРег.Контрагент,
	|	ВТ_РасчетыСКлиентамиРег.Подразделение,
	|	ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглНачальныйОстаток),
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглПриход),
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглРасход),
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглКонечныйОстаток),
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглНачальныйОстаток),
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглПриход),
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглРасход),
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглКонечныйОстаток)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыПоКредитамДепозитамРег.Организация КАК Организация,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиОсновнойДолг)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиПроценты)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиКомиссия)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора <> ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиОсновнойДолг)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора <> ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиПроценты)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора <> ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиКомиссия)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|	КОНЕЦ КАК Счет,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Подразделение КАК Подразделение,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглНачальныйОстаток) КАК СуммаРеглНачальныйОстаток,
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглПриход) КАК СуммаРеглПриход,
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглРасход) КАК СуммаРеглРасход,
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглКонечныйОстаток) КАК СуммаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыПоКредитамДепозитам
	|ИЗ
	|	ВТ_РасчетыПоКредитамДепозитамРег КАК ВТ_РасчетыПоКредитамДепозитамРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиОсновнойДолг), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиКомиссия), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиПроценты), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиОсновнойДолг), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиКомиссия), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиПроценты)))
	|			И (НастройкиПоОрганизации.Организация = ВТ_РасчетыПоКредитамДепозитамРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиОсновнойДолг), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиКомиссия), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиПроценты), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиОсновнойДолг), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиКомиссия), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиПроценты)))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоКредитамДепозитамРег.Организация,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Контрагент,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Подразделение,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглНачальныйОстаток),
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглПриход),
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглРасход),
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглКонечныйОстаток)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыПоЛизингуРег.Организация КАК Организация,
	|	ВТ_РасчетыПоЛизингуРег.Контрагент КАК Контрагент,
	|	ВЫБОР ВТ_РасчетыПоЛизингуРег.ТипСуммы
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоЛизингу.ЛизинговыйПлатеж)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЛизинговыеУслуги)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоЛизингу.ВыкупПредметаЛизинга)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ВыкупПредметаЛизинга)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоЛизингу.ОбеспечительныйПлатеж)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ОбеспечительныйПлатежПоЛизингу)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоЛизингу.АрендныеОбязательства)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АрендныеОбязательстваПоЛизингу)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|	КОНЕЦ КАК Счет,
	|	ВТ_РасчетыПоЛизингуРег.Подразделение КАК Подразделение,
	|	ВТ_РасчетыПоЛизингуРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглНачальныйОстаток) КАК СуммаРеглНачальныйОстаток,
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглПриход) КАК СуммаРеглПриход,
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглРасход) КАК СуммаРеглРасход,
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглКонечныйОстаток) КАК СуммаРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыПоЛизингу
	|ИЗ
	|	ВТ_РасчетыПоЛизингуРег КАК ВТ_РасчетыПоЛизингуРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЛизинговыеУслуги), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ОбеспечительныйПлатежПоЛизингу), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ВыкупПредметаЛизинга), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АрендныеОбязательстваПоЛизингу)))
	|			И (НастройкиПоОрганизации.Организация = ВТ_РасчетыПоЛизингуРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_РасчетыПоЛизингуРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЛизинговыеУслуги), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ОбеспечительныйПлатежПоЛизингу), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ВыкупПредметаЛизинга), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АрендныеОбязательстваПоЛизингу)))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_РасчетыПоЛизингуРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоЛизингуРег.Организация,
	|	ВТ_РасчетыПоЛизингуРег.Контрагент,
	|	ВТ_РасчетыПоЛизингуРег.Подразделение,
	|	ВТ_РасчетыПоЛизингуРег.ТипСуммы,
	|	ВТ_РасчетыПоЛизингуРег.ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглНачальныйОстаток),
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглПриход),
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглРасход),
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглКонечныйОстаток)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НеотфактурованныеПоставкиРег.Организация КАК Организация,
	|	ВТ_НеотфактурованныеПоставкиРег.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет)) КАК Счет,
	|	ВТ_НеотфактурованныеПоставкиРег.Подразделение КАК Подразделение,
	|	ВТ_НеотфактурованныеПоставкиРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВТ_НеотфактурованныеПоставкиРег.СтоимостьРеглНачальныйОстаток КАК СтоимостьРеглНачальныйОстаток,
	|	ВТ_НеотфактурованныеПоставкиРег.СтоимостьРеглПриход КАК СтоимостьРеглПриход,
	|	ВТ_НеотфактурованныеПоставкиРег.СтоимостьРеглРасход КАК СтоимостьРеглРасход,
	|	ВТ_НеотфактурованныеПоставкиРег.СтоимостьРеглКонечныйОстаток КАК СтоимостьРеглКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_НеотфактурованныеПоставки
	|ИЗ
	|	ВТ_НеотфактурованныеПоставкиРег КАК ВТ_НеотфактурованныеПоставкиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НеотфактурованныеПоставки))
	|			И (НастройкиПоОрганизации.Организация = ВТ_НеотфактурованныеПоставкиРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_НеотфактурованныеПоставкиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НеотфактурованныеПоставки))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_НеотфактурованныеПоставкиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	3 КАК РазделУчета,
	|	ХозрасчетныйОстаткиИОбороты.Организация КАК Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение КАК Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет КАК Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт КАК СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт КАК СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток
	|ПОМЕСТИТЬ ВТ_РасчетыСКонтрагентамиРегл
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов3), , Организация В (&МассивОрганизаций) 
	|															И НЕ Субконто2 Ссылка Справочник.ДоговорыКредитовИДепозитов
	|															И НЕ Субконто2 Ссылка Справочник.ДоговорыЛизинга) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов4), , Организация В (&МассивОрганизаций) 
	|															И НЕ Субконто2 Ссылка Справочник.ДоговорыКредитовИДепозитов
	|															И НЕ Субконто2 Ссылка Справочник.ДоговорыЛизинга) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов5), , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , Счет В ИЕРАРХИИ (&ВсеСчетаУчетаРасчетов) И НЕ Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов5), , Организация В (&МассивОрганизаций) И Субконто2 Ссылка Справочник.ДоговорыКредитовИДепозитов) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			,
	|			&ВидыСубконтоКонтрагентыДоговоры,
	|			Организация В (&МассивОрганизаций)
	|				И Субконто2 ССЫЛКА Справочник.ДоговорыЛизинга) КАК ХозрасчетныйОстаткиИОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Субконто1,
	|	ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотДт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаОборотКт,
	|	ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов7),
	|			,
	|			Организация В (&МассивОрганизаций)
	|				И НЕ Субконто2 Ссылка Справочник.ДоговорыКредитовИДепозитов
	|				И НЕ Субконто2 ССЫЛКА Справочник.ДоговорыЛизинга) КАК ХозрасчетныйОстаткиИОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСПоставщиками.СчетУчетаРасчетов В ИЕРАРХИИ (&СчетаУчетаРасчетов7)
	|			ТОГДА 7
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК РазделУчета,
	|	ВТ_РасчетыСПоставщиками.Организация КАК Организация,
	|	ВТ_РасчетыСПоставщиками.Подразделение КАК Подразделение,
	|	ВТ_РасчетыСПоставщиками.СчетУчетаРасчетов КАК СчетУчета,
	|	ВТ_РасчетыСПоставщиками.Контрагент КАК Аналитика1,
	|	ВТ_РасчетыСПоставщиками.ДолгРеглНачальныйОстаток КАК НачальныйОстаток,
	|	ВТ_РасчетыСПоставщиками.ДолгРеглПриход КАК Приход,
	|	ВТ_РасчетыСПоставщиками.ДолгРеглРасход КАК Расход,
	|	ВТ_РасчетыСПоставщиками.ДолгРеглКонечныйОстаток КАК КонечныйОстаток,
	|	0 КАК НачальноеСальдо,
	|	0 КАК ОборотДт,
	|	0 КАК ОборотКт,
	|	0 КАК КонечноеСальдо
	|ПОМЕСТИТЬ ВТ_Расчеты
	|ИЗ
	|	ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСПоставщиками.СчетУчетаАванса В ИЕРАРХИИ (&СчетаУчетаРасчетов7)
	|			ТОГДА 7
	|		ИНАЧЕ 3
	|	КОНЕЦ,
	|	ВТ_РасчетыСПоставщиками.Организация,
	|	ВТ_РасчетыСПоставщиками.Подразделение,
	|	ВТ_РасчетыСПоставщиками.СчетУчетаАванса,
	|	ВТ_РасчетыСПоставщиками.Контрагент,
	|	ВТ_РасчетыСПоставщиками.ПредоплатаРеглНачальныйОстаток,
	|	ВТ_РасчетыСПоставщиками.ПредоплатаРеглПриход,
	|	ВТ_РасчетыСПоставщиками.ПредоплатаРеглРасход,
	|	ВТ_РасчетыСПоставщиками.ПредоплатаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСКлиентами.СчетУчетаРасчетов В ИЕРАРХИИ (&СчетаУчетаРасчетов7)
	|			ТОГДА 7
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	ВТ_РасчетыСКлиентами.Организация,
	|	ВТ_РасчетыСКлиентами.Подразделение,
	|	ВТ_РасчетыСКлиентами.СчетУчетаРасчетов,
	|	ВТ_РасчетыСКлиентами.Контрагент,
	|	ВТ_РасчетыСКлиентами.ДолгРеглНачальныйОстаток,
	|	ВТ_РасчетыСКлиентами.ДолгРеглПриход,
	|	ВТ_РасчетыСКлиентами.ДолгРеглРасход,
	|	ВТ_РасчетыСКлиентами.ДолгРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСКлиентами.СчетУчетаАванса В ИЕРАРХИИ (&СчетаУчетаРасчетов7)
	|			ТОГДА 7
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	ВТ_РасчетыСКлиентами.Организация,
	|	ВТ_РасчетыСКлиентами.Подразделение,
	|	ВТ_РасчетыСКлиентами.СчетУчетаАванса,
	|	ВТ_РасчетыСКлиентами.Контрагент,
	|	ВТ_РасчетыСКлиентами.ПредоплатаРеглНачальныйОстаток,
	|	ВТ_РасчетыСКлиентами.ПредоплатаРеглПриход,
	|	ВТ_РасчетыСКлиентами.ПредоплатаРеглРасход,
	|	ВТ_РасчетыСКлиентами.ПредоплатаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	РасчетыПоКредитамДепозитам.Организация,
	|	РасчетыПоКредитамДепозитам.Подразделение,
	|	РасчетыПоКредитамДепозитам.Счет,
	|	РасчетыПоКредитамДепозитам.Контрагент,
	|	РасчетыПоКредитамДепозитам.СуммаРеглНачальныйОстаток КАК СуммаРеглНачальныйОстаток,
	|	РасчетыПоКредитамДепозитам.СуммаРеглПриход КАК СуммаРеглПриход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглРасход КАК СуммаРеглРасход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглКонечныйОстаток КАК СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыПоКредитамДепозитам КАК РасчетыПоКредитамДепозитам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	РасчетыПоЛизингу.Организация,
	|	РасчетыПоЛизингу.Подразделение,
	|	РасчетыПоЛизингу.Счет,
	|	РасчетыПоЛизингу.Контрагент,
	|	РасчетыПоЛизингу.СуммаРеглНачальныйОстаток,
	|	РасчетыПоЛизингу.СуммаРеглПриход,
	|	РасчетыПоЛизингу.СуммаРеглРасход,
	|	РасчетыПоЛизингу.СуммаРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыПоЛизингу КАК РасчетыПоЛизингу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	НеотфактурованныеПоставки.Организация,
	|	НеотфактурованныеПоставки.Подразделение,
	|	НеотфактурованныеПоставки.Счет,
	|	НеотфактурованныеПоставки.Контрагент,
	|	НеотфактурованныеПоставки.СтоимостьРеглНачальныйОстаток,
	|	НеотфактурованныеПоставки.СтоимостьРеглПриход,
	|	НеотфактурованныеПоставки.СтоимостьРеглРасход,
	|	НеотфактурованныеПоставки.СтоимостьРеглКонечныйОстаток,
	|	0,
	|	0,
	|	0,
	|	0
	|ИЗ
	|	ВТ_НеотфактурованныеПоставки КАК НеотфактурованныеПоставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РасчетыСКонтрагентамиРегл.РазделУчета,
	|	ВТ_РасчетыСКонтрагентамиРегл.Организация,
	|	ВТ_РасчетыСКонтрагентамиРегл.Подразделение,
	|	ВТ_РасчетыСКонтрагентамиРегл.Счет,
	|	ВТ_РасчетыСКонтрагентамиРегл.Субконто1,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВТ_РасчетыСКонтрагентамиРегл.СуммаНачальныйОстаток,
	|	ВТ_РасчетыСКонтрагентамиРегл.СуммаОборотДт,
	|	ВТ_РасчетыСКонтрагентамиРегл.СуммаОборотКт,
	|	ВТ_РасчетыСКонтрагентамиРегл.СуммаКонечныйОстаток
	|ИЗ
	|	ВТ_РасчетыСКонтрагентамиРегл КАК ВТ_РасчетыСКонтрагентамиРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.РазделУчета КАК РазделУчета,
	|	Подзапрос.Организация КАК Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета КАК СчетБУ,
	|	Подзапрос.Аналитика1 КАК Аналитика1,
	|	СУММА(Подзапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(Подзапрос.НачальноеСальдо) КАК НачальноеСальдо,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	СУММА(Подзапрос.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	ВТ_Расчеты КАК Подзапрос
	|ГДЕ
	|	Подзапрос.РазделУчета = &РазделУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета,
	|	Подзапрос.Аналитика1
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Подзапрос.НачальныйОстаток) <> 0
	|		ИЛИ СУММА(Подзапрос.Приход) <> 0
	|		ИЛИ СУММА(Подзапрос.Расход) <> 0
	|		ИЛИ СУММА(Подзапрос.КонечныйОстаток) <> 0
	|		ИЛИ СУММА(Подзапрос.НачальноеСальдо) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотДт) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотКт) <> 0
	|		ИЛИ СУММА(Подзапрос.КонечноеСальдо) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета,
	|	Подзапрос.Аналитика1,
	|	СУММА(Подзапрос.НачальныйОстаток),
	|	СУММА(Подзапрос.Приход),
	|	СУММА(Подзапрос.Расход),
	|	СУММА(Подзапрос.КонечныйОстаток),
	|	СУММА(Подзапрос.НачальноеСальдо),
	|	СУММА(Подзапрос.ОборотДт),
	|	СУММА(Подзапрос.ОборотКт),
	|	СУММА(Подзапрос.КонечноеСальдо)
	|ИЗ
	|	ВТ_Расчеты КАК Подзапрос
	|ГДЕ
	|	&РазделУчета = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета,
	|	Подзапрос.Аналитика1
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Подзапрос.НачальныйОстаток) <> 0
	|		ИЛИ СУММА(Подзапрос.Приход) <> 0
	|		ИЛИ СУММА(Подзапрос.Расход) <> 0
	|		ИЛИ СУММА(Подзапрос.КонечныйОстаток) <> 0
	|		ИЛИ СУММА(Подзапрос.НачальноеСальдо) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотДт) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотКт) <> 0
	|		ИЛИ СУММА(Подзапрос.КонечноеСальдо) <> 0)";
	
КонецФункции

Функция ТекстЗапросаРасчетыСКонтрагентамиПоРегистраторам()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОбъектыРасчетов.Организация КАК Организация,
	|	ОбъектыРасчетов.Подразделение КАК Подразделение,
	|	ОбъектыРасчетов.Контрагент КАК Контрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СУММА(РасчетыСПоставщиками.ДолгРеглПриход) КАК ДолгРеглПриход,
	|	СУММА(РасчетыСПоставщиками.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	СУММА(РасчетыСПоставщиками.ПредоплатаРеглПриход) КАК ПредоплатаРеглПриход,
	|	СУММА(РасчетыСПоставщиками.ПредоплатаРеглРасход) КАК ПредоплатаРеглРасход,
	|	РасчетыСПоставщиками.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщикамиРег
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику КАК ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоДокументам.Валюта КАК Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|		КОНЕЦ КАК ДолгРеглПриход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ДолгРегл < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументам.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ДолгРеглРасход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|		КОНЕЦ КАК ПредоплатаРеглПриход,
	|		ВЫБОР
	|			КОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА -РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПредоплатаРеглРасход,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ДолгРегл,
	|		0,
	|		ВЫБОР
	|		КОГДА РасчетыСПоставщикамиПоДокументам.Регистратор <> РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент
	|		ТОГДА РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл
	|		ИНАЧЕ 0 КОНЕЦ,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		НЕ(РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
	|					ИЛИ РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности)
	|		И РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Регистратор = РасчетыСПоставщикамиПоДокументам.РасчетныйДокумент
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоДокументам.ЗаказПоставщику,
	|		РасчетыСПоставщикамиПоДокументам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		-РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоДокументам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоДокументам КАК РасчетыСПоставщикамиПоДокументам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаПриобретения
	|		И РасчетыСПоставщикамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоДокументам.Активность
	|		И РасчетыСПоставщикамиПоДокументам.ПредоплатаРегл <> 0
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоСрокам.Валюта,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ДолгРегл,
	|		РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСПоставщикамиПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоСрокам.Активность
	|		И &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСПоставщикамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСПоставщикамиПоСрокам.Валюта,
	|		РасчетыСПоставщикамиПоСрокам.ДолгРегл,
	|		0,
	|		0,
	|		РасчетыСПоставщикамиПоСрокам.ПредоплатаРегл,
	|		РасчетыСПоставщикамиПоСрокам.ХозяйственнаяОперация,
	|		РасчетыСПоставщикамиПоСрокам.ДокументРегистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщикамиПоСрокам КАК РасчетыСПоставщикамиПоСрокам
	|	ГДЕ
	|		РасчетыСПоставщикамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСПоставщикамиПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСПоставщикамиПоСрокам.Активность
	|		И &НоваяАрхитектураВзаиморасчетов) КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ОбъектыРасчетов.Ссылка = РасчетыСПоставщиками.ОбъектРасчетов)
	|ГДЕ
	|	ОбъектыРасчетов.Организация В(&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщиками.Регистратор,
	|	ОбъектыРасчетов.НаправлениеДеятельности,
	|	ОбъектыРасчетов.Организация,
	|	ОбъектыРасчетов.Контрагент,
	|	ОбъектыРасчетов.Подразделение,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияКонтрагентКонтрагент.НаправлениеДеятельности,
	|	ДвиженияКонтрагентКонтрагент.Организация,
	|	ДвиженияКонтрагентКонтрагент.Подразделение,
	|	ДвиженияКонтрагентКонтрагент.Контрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ДвиженияКонтрагентКонтрагент.Регистратор
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И ТипСуммы В (ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансВыданный), ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгПоставщику))
	|				И Организация В (&МассивОрганизаций)) КАК ДвиженияКонтрагентКонтрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ОбъектыРасчетов.Ссылка = ДвиженияКонтрагентКонтрагент.ОбъектРасчетов)
	|ГДЕ
	|	ДвиженияКонтрагентКонтрагент.Организация <> ОбъектыРасчетов.Организация
	|	И НЕ &НоваяАрхитектураВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияКонтрагентКонтрагент.Регистратор,
	|	ДвиженияКонтрагентКонтрагент.Контрагент,
	|	ДвиженияКонтрагентКонтрагент.Подразделение,
	|	ДвиженияКонтрагентКонтрагент.Организация,
	|	ДвиженияКонтрагентКонтрагент.НаправлениеДеятельности,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОбъектыРасчетов.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ОбъектыРасчетов.Организация КАК Организация,
	|	ОбъектыРасчетов.Подразделение КАК Подразделение,
	|	ОбъектыРасчетов.Контрагент КАК Контрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СУММА(РасчетыСКлиентами.ДолгРеглПриход) КАК ДолгРеглПриход,
	|	СУММА(РасчетыСКлиентами.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРеглПриход) КАК ПредоплатаРеглПриход,
	|	СУММА(РасчетыСКлиентами.ПредоплатаРеглРасход) КАК ПредоплатаРеглРасход,
	|	РасчетыСКлиентами.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентамиРег
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента КАК ОбъектРасчетов,
	|		РасчетыСКлиентамиПоДокументам.Валюта КАК Валюта,
	|		РасчетыСКлиентамиПоДокументам.ДолгРегл КАК ДолгРеглПриход,
	|		0 КАК ДолгРеглРасход,
	|		ВЫБОР
	|		КОГДА РасчетыСКлиентамиПоДокументам.Регистратор <> РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|		ТОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|		ИНАЧЕ 0 КОНЕЦ КАК ПредоплатаРеглПриход,
	|		0 КАК ПредоплатаРеглРасход,
	|		РасчетыСКлиентамиПоДокументам.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0
	|				ТОГДА -РасчетыСКлиентамиПоДокументам.ДолгРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ДолгРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ДолгРегл
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА -РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|			ИНАЧЕ 0
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА РасчетыСКлиентамиПоДокументам.ПредоплатаРегл < 0
	|				ТОГДА 0
	|			ИНАЧЕ РасчетыСКлиентамиПоДокументам.ПредоплатаРегл
	|		КОНЕЦ,
	|		РасчетыСКлиентамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		НЕ(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|					ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.ХозяйственнаяОперация <> ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносАванса)
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		НЕ(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|					ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВзаимозачетЗадолженности)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Регистратор = РасчетыСКлиентамиПоДокументам.РасчетныйДокумент
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл - РасчетыСКлиентамиПоДокументам.ДолгРегл,
	|		0,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоДокументам.ЗаказКлиента,
	|		РасчетыСКлиентамиПоДокументам.Валюта,
	|		0,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		-РасчетыСКлиентамиПоДокументам.ПредоплатаРегл,
	|		0,
	|		РасчетыСКлиентамиПоДокументам.Регистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоДокументам КАК РасчетыСКлиентамиПоДокументам
	|	ГДЕ
	|		(РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.КорректировкаРеализации
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровОтКлиента
	|				ИЛИ РасчетыСКлиентамиПоДокументам.Регистратор ССЫЛКА Документ.ВозвратТоваровМеждуОрганизациями)
	|		И РасчетыСКлиентамиПоДокументам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоДокументам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоДокументам.Активность
	|		И РасчетыСКлиентамиПоДокументам.ПредоплатаРегл <> 0
	|		И НЕ &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСКлиентамиПоСрокам.Валюта,
	|		РасчетыСКлиентамиПоСрокам.ДолгРегл,
	|		0,
	|		0,
	|		РасчетыСКлиентамиПоСрокам.ПредоплатаРегл,
	|		РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|	ГДЕ
	|		РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		И РасчетыСКлиентамиПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоСрокам.Активность
	|		И &НоваяАрхитектураВзаиморасчетов
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасчетыСКлиентамиПоСрокам.ОбъектРасчетов,
	|		РасчетыСКлиентамиПоСрокам.Валюта,
	|		0,
	|		РасчетыСКлиентамиПоСрокам.ДолгРегл,
	|		РасчетыСКлиентамиПоСрокам.ПредоплатаРегл,
	|		0,
	|		РасчетыСКлиентамиПоСрокам.ДокументРегистратор
	|	ИЗ
	|		РегистрНакопления.РасчетыСКлиентамиПоСрокам КАК РасчетыСКлиентамиПоСрокам
	|	ГДЕ
	|		РасчетыСКлиентамиПоСрокам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		И РасчетыСКлиентамиПоСрокам.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|		И РасчетыСКлиентамиПоСрокам.Активность
	|		И &НоваяАрхитектураВзаиморасчетов) КАК РасчетыСКлиентами
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ОбъектыРасчетов.Ссылка = РасчетыСКлиентами.ОбъектРасчетов)
	|ГДЕ
	|	ОбъектыРасчетов.Организация В(&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыРасчетов.Организация,
	|	ОбъектыРасчетов.Подразделение,
	|	ОбъектыРасчетов.НаправлениеДеятельности,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета,
	|	РасчетыСКлиентами.Регистратор,
	|	ОбъектыРасчетов.Контрагент
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияКонтрагентКонтрагент.НаправлениеДеятельности,
	|	ДвиженияКонтрагентКонтрагент.Организация,
	|	ДвиженияКонтрагентКонтрагент.Подразделение,
	|	ДвиженияКонтрагентКонтрагент.КорКонтрагент,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияКонтрагентКонтрагент.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный)
	|				ТОГДА ДвиженияКонтрагентКонтрагент.СуммаРеглОборот
	|			ИНАЧЕ 0
	|		КОНЕЦ),
	|	ДвиженияКонтрагентКонтрагент.Регистратор
	|ИЗ
	|	РегистрНакопления.ДвиженияКонтрагентКонтрагент.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности)
	|				И ТипСуммы В (ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.АвансПолученный), ЗНАЧЕНИЕ(Перечисление.ТипыСуммЗадолженности.ДолгКлиента))
	|				И Организация В (&МассивОрганизаций)) КАК ДвиженияКонтрагентКонтрагент
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО (ОбъектыРасчетов.Ссылка = ДвиженияКонтрагентКонтрагент.ОбъектРасчетов)
	|ГДЕ
	|	ДвиженияКонтрагентКонтрагент.Организация <> ОбъектыРасчетов.Организация
	|	И НЕ &НоваяАрхитектураВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияКонтрагентКонтрагент.Регистратор,
	|	ДвиженияКонтрагентКонтрагент.Организация,
	|	ДвиженияКонтрагентКонтрагент.НаправлениеДеятельности,
	|	ДвиженияКонтрагентКонтрагент.КорКонтрагент,
	|	ДвиженияКонтрагентКонтрагент.Подразделение,
	|	ОбъектыРасчетов.ГруппаФинансовогоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиАналитики.Организация КАК Организация,
	|	КлючиАналитики.Контрагент КАК Контрагент,
	|	РасчетыПоКредитамДепозитам.ТипСуммы КАК ТипСуммы,
	|	ДанныеДоговора.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ДанныеДоговора.ХарактерДоговора КАК ХарактерДоговора,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеДоговора.Подразделение КАК Подразделение,
	|	СУММА(РасчетыПоКредитамДепозитам.СуммаРеглПриход) КАК СуммаРеглПриход,
	|	СУММА(РасчетыПоКредитамДепозитам.СуммаРеглРасход) КАК СуммаРеглРасход,
	|	РасчетыПоКредитамДепозитам.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыПоКредитамДепозитамРег
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения,
	|		Договор.ХарактерДоговора <> ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.Депозит)
	|		ИЛИ ТипСуммы <> ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|		И (Договор.ТипДоговора <> ЗНАЧЕНИЕ(Перечисление.ТипыДоговораКредитовИДепозитов.ДепозитВБанкеСКапитализацией)
	|		ИЛИ ТипСуммы <> ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты))) КАК РасчетыПоКредитамДепозитам
	|		
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыПоКредитамДепозитам.АналитикаУчетаПоПартнерам)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКредитовИДепозитов КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = РасчетыПоКредитамДепозитам.Договор)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константы КАК Константы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеДоговора.ГруппаФинансовогоУчета,
	|	КлючиАналитики.Организация,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	ДанныеДоговора.Подразделение,
	|	КлючиАналитики.Контрагент,
	|	ДанныеДоговора.ХарактерДоговора,
	|	РасчетыПоКредитамДепозитам.Регистратор,
	|	РасчетыПоКредитамДепозитам.ТипСуммы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлючиАналитики.Организация КАК Организация,
	|	КлючиАналитики.Контрагент КАК Контрагент,
	|	РасчетыПоЛизингу.ТипСуммы КАК ТипСуммы,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ДанныеДоговора.Подразделение КАК Подразделение,
	|	СУММА(РасчетыПоЛизингу.СуммаРеглПриход) КАК СуммаРеглПриход,
	|	СУММА(РасчетыПоЛизингу.СуммаРеглРасход) КАК СуммаРеглРасход,
	|	РасчетыПоЛизингу.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыПоЛизингуРег
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, ) КАК РасчетыПоЛизингу
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитики
	|		ПО (КлючиАналитики.Ссылка = РасчетыПоЛизингу.АналитикаУчетаПоПартнерам)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыЛизинга КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = РасчетыПоЛизингу.Договор)
	|ГДЕ
	|	КлючиАналитики.Организация В(&МассивОрганизаций)
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоЛизингу.Регистратор,
	|	КлючиАналитики.Организация,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	КлючиАналитики.Контрагент,
	|	РасчетыПоЛизингу.ТипСуммы,
	|	ДанныеДоговора.ГруппаФинансовогоУчета,
	|	ДанныеДоговора.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НеотфактурованныеПоставки.Организация КАК Организация,
	|	АналитикаПартии.Контрагент КАК Контрагент,
	|	АналитикаПартии.Договор КАК Договор,
	|	ДанныеДоговора.Подразделение КАК Подразделение,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	ДанныеДоговора.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	СУММА(НеотфактурованныеПоставки.СтоимостьРеглПриход) КАК СтоимостьРеглПриход,
	|	СУММА(НеотфактурованныеПоставки.СтоимостьРеглРасход) КАК СтоимостьРеглРасход,
	|	НеотфактурованныеПоставки.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_НеотфактурованныеПоставкиРег
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Движения,
	|			Организация В (&МассивОрганизаций)
	|				И РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НеотфактурованныеПоставки)) КАК НеотфактурованныеПоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровНаСклад КАК АналитикаПартии
	|		ПО (АналитикаПартии.Ссылка = НеотфактурованныеПоставки.ВидЗапасов)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
	|		ПО (ДанныеДоговора.Ссылка = АналитикаПартии.Договор)
	|
	|СГРУППИРОВАТЬ ПО
	|	АналитикаПартии.Договор,
	|	НеотфактурованныеПоставки.Организация,
	|	ДанныеДоговора.НаправлениеДеятельности,
	|	ДанныеДоговора.Подразделение,
	|	НеотфактурованныеПоставки.Регистратор,
	|	АналитикаПартии.Контрагент,
	|	ДанныеДоговора.ГруппаФинансовогоУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСПоставщикамиРег.Организация КАК Организация,
	|	ВТ_РасчетыСПоставщикамиРег.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|					КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками)
	|						ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|					ИНАЧЕ &ПустойСчет
	|				КОНЕЦ) КАК СчетУчетаРасчетов,	
	|	МАКСИМУМ(ВЫБОР
	|					КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)
	|						ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|					ИНАЧЕ &ПустойСчет
	|				КОНЕЦ) КАК СчетУчетаАванса,
	|	ВТ_РасчетыСПоставщикамиРег.Подразделение КАК Подразделение,
	|	ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглПриход) КАК ДолгРеглПриход,
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглПриход) КАК ПредоплатаРеглПриход,
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглРасход) КАК ПредоплатаРеглРасход,
	|	ВТ_РасчетыСПоставщикамиРег.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСПоставщиками
	|ИЗ
	|	ВТ_РасчетыСПоставщикамиРег КАК ВТ_РасчетыСПоставщикамиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)))
	|			И (НастройкиПоОрганизации.Организация = ВТ_РасчетыСПоставщикамиРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСПоставщиками), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыВыданные)))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыСПоставщикамиРег.Организация,
	|	ВТ_РасчетыСПоставщикамиРег.Контрагент,
	|	ВТ_РасчетыСПоставщикамиРег.Подразделение,
	|	ВТ_РасчетыСПоставщикамиРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыСПоставщикамиРег.Регистратор,
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглПриход),
	|	(ВТ_РасчетыСПоставщикамиРег.ДолгРеглРасход),
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглПриход),
	|	(ВТ_РасчетыСПоставщикамиРег.ПредоплатаРеглРасход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыСКлиентамиРег.Организация КАК Организация,
	|	ВТ_РасчетыСКлиентамиРег.Контрагент КАК Контрагент,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами)
	|				ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|			ИНАЧЕ &ПустойСчет
	|		КОНЕЦ) КАК СчетУчетаРасчетов,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)
	|				ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|			ИНАЧЕ &ПустойСчет
	|		КОНЕЦ) КАК СчетУчетаАванса,
	|	ВТ_РасчетыСКлиентамиРег.Подразделение КАК Подразделение,
	|	ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглПриход) КАК ДолгРеглПриход,
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглРасход) КАК ДолгРеглРасход,
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглПриход) КАК ПредоплатаРеглПриход,
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглРасход) КАК ПредоплатаРеглРасход,
	|	ВТ_РасчетыСКлиентамиРег.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыСКлиентами
	|ИЗ
	|	ВТ_РасчетыСКлиентамиРег КАК ВТ_РасчетыСКлиентамиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)))
	|			И (НастройкиПоОрганизации.Организация = ВТ_РасчетыСКлиентамиРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКлиентами), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АвансыПолученные)))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыСКлиентамиРег.Организация,
	|	ВТ_РасчетыСКлиентамиРег.Контрагент,
	|	ВТ_РасчетыСКлиентамиРег.Подразделение,
	|	ВТ_РасчетыСКлиентамиРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыСКлиентамиРег.Регистратор,
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглПриход),
	|	(ВТ_РасчетыСКлиентамиРег.ДолгРеглРасход),
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглПриход),
	|	(ВТ_РасчетыСКлиентамиРег.ПредоплатаРеглРасход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыПоКредитамДепозитамРег.Организация КАК Организация,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиОсновнойДолг)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиПроценты)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора = ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиКомиссия)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора <> ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиОсновнойДолг)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора <> ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Проценты)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиПроценты)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора <> ЗНАЧЕНИЕ(Перечисление.ХарактерыДоговоровФинансовыхИнструментов.КредитИлиЗайм)
	|				И ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы = ЗНАЧЕНИЕ(Перечисление.ТипыСуммГрафикаКредитовИДепозитов.Комиссия)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиКомиссия)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|	КОНЕЦ КАК Счет,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Подразделение КАК Подразделение,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглПриход) КАК СуммаРеглПриход,
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглРасход) КАК СуммаРеглРасход,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыПоКредитамДепозитам
	|ИЗ
	|	ВТ_РасчетыПоКредитамДепозитамРег КАК ВТ_РасчетыПоКредитамДепозитамРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиОсновнойДолг), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиКомиссия), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиПроценты), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиОсновнойДолг), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиКомиссия), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиПроценты)))
	|			И (НастройкиПоОрганизации.Организация = ВТ_РасчетыПоКредитамДепозитамРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиОсновнойДолг), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиКомиссия), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСКредиторамиПроценты), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиОсновнойДолг), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиКомиссия), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.РасчетыСДебиторамиПроценты)))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоКредитамДепозитамРег.Организация,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Контрагент,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Подразделение,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ХарактерДоговора,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ТипСуммы,
	|	ВТ_РасчетыПоКредитамДепозитамРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыПоКредитамДепозитамРег.Регистратор,
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглПриход),
	|	(ВТ_РасчетыПоКредитамДепозитамРег.СуммаРеглРасход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РасчетыПоЛизингуРег.Организация КАК Организация,
	|	ВТ_РасчетыПоЛизингуРег.Контрагент КАК Контрагент,
	|	ВЫБОР ВТ_РасчетыПоЛизингуРег.ТипСуммы
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоЛизингу.ЛизинговыйПлатеж)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЛизинговыеУслуги)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоЛизингу.ВыкупПредметаЛизинга)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ВыкупПредметаЛизинга)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоЛизингу.ОбеспечительныйПлатеж)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ОбеспечительныйПлатежПоЛизингу)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|		КОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПлатежейПоЛизингу.АрендныеОбязательства)
	|			ТОГДА МАКСИМУМ(ВЫБОР
	|						КОГДА ЕСТЬNULL(НастройкиПоОрганизации.ВидСчета, ЕСТЬNULL(НастройкиПоАналитике.ВидСчета, НЕОПРЕДЕЛЕНО)) = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АрендныеОбязательстваПоЛизингу)
	|							ТОГДА ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет))
	|						ИНАЧЕ &ПустойСчет
	|					КОНЕЦ)
	|	КОНЕЦ КАК Счет,
	|	ВТ_РасчетыПоЛизингуРег.Подразделение КАК Подразделение,
	|	ВТ_РасчетыПоЛизингуРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглПриход) КАК СуммаРеглПриход,
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглРасход) КАК СуммаРеглРасход,
	|	ВТ_РасчетыПоЛизингуРег.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_РасчетыПоЛизингу
	|ИЗ
	|	ВТ_РасчетыПоЛизингуРег КАК ВТ_РасчетыПоЛизингуРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЛизинговыеУслуги), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ОбеспечительныйПлатежПоЛизингу), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ВыкупПредметаЛизинга), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АрендныеОбязательстваПоЛизингу)))
	|			И (НастройкиПоОрганизации.Организация = ВТ_РасчетыПоЛизингуРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_РасчетыПоЛизингуРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета В (ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ЛизинговыеУслуги), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ОбеспечительныйПлатежПоЛизингу), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.ВыкупПредметаЛизинга), ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.АрендныеОбязательстваПоЛизингу)))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_РасчетыПоЛизингуРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РасчетыПоЛизингуРег.Организация,
	|	ВТ_РасчетыПоЛизингуРег.Контрагент,
	|	ВТ_РасчетыПоЛизингуРег.Подразделение,
	|	ВТ_РасчетыПоЛизингуРег.ТипСуммы,
	|	ВТ_РасчетыПоЛизингуРег.ГруппаФинансовогоУчета,
	|	ВТ_РасчетыПоЛизингуРег.Регистратор,
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглПриход),
	|	(ВТ_РасчетыПоЛизингуРег.СуммаРеглРасход)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_НеотфактурованныеПоставкиРег.Организация КАК Организация,
	|	ВТ_НеотфактурованныеПоставкиРег.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, &ПустойСчет)) КАК Счет,
	|	ВТ_НеотфактурованныеПоставкиРег.Подразделение КАК Подразделение,
	|	ВТ_НеотфактурованныеПоставкиРег.ГруппаФинансовогоУчета КАК ГруппаФинансовогоУчета,
	|	ВТ_НеотфактурованныеПоставкиРег.СтоимостьРеглПриход КАК СтоимостьРеглПриход,
	|	ВТ_НеотфактурованныеПоставкиРег.СтоимостьРеглРасход КАК СтоимостьРеглРасход,
	|	ВТ_НеотфактурованныеПоставкиРег.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_НеотфактурованныеПоставки
	|ИЗ
	|	ВТ_НеотфактурованныеПоставкиРег КАК ВТ_НеотфактурованныеПоставкиРег
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|		ПО (НастройкиПоОрганизации.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НеотфактурованныеПоставки))
	|			И (НастройкиПоОрганизации.Организация = ВТ_НеотфактурованныеПоставкиРег.Организация)
	|			И (НастройкиПоОрганизации.АналитикаУчета = ВТ_НеотфактурованныеПоставкиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|		ПО (НастройкиПоАналитике.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.НеотфактурованныеПоставки))
	|			И (НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|			И (НастройкиПоАналитике.АналитикаУчета = ВТ_НеотфактурованныеПоставкиРег.ГруппаФинансовогоУчета)
	|			И (НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	3 КАК РазделУчета,
	|	ХозрасчетныйОбороты.Организация КАК Организация,
	|	ХозрасчетныйОбороты.Подразделение КАК Подразделение,
	|	ХозрасчетныйОбороты.Счет КАК Счет,
	|	ХозрасчетныйОбороты.Субконто1 КАК Субконто1,
	|	ХозрасчетныйОбороты.Регистратор КАК Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт КАК СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт КАК СуммаОборотКт
	|ПОМЕСТИТЬ ВТ_РасчетыСКонтрагентамиРегл
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов3), , Организация В (&МассивОрганизаций)
	|															И НЕ Субконто2 Ссылка Справочник.ДоговорыКредитовИДепозитов
	|															И НЕ Субконто2 Ссылка Справочник.ДоговорыЛизинга, , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов4), , Организация В (&МассивОрганизаций)
	|															И НЕ Субконто2 Ссылка Справочник.ДоговорыКредитовИДепозитов
	|															И НЕ Субконто2 Ссылка Справочник.ДоговорыЛизинга, , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов5), , Организация В (&МассивОрганизаций), , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Счет В ИЕРАРХИИ (&ВсеСчетаУчетаРасчетов) И НЕ Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов5), , Организация В (&МассивОрганизаций) И Субконто2 Ссылка Справочник.ДоговорыКредитовИДепозитов, , ) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			,
	|			&ВидыСубконтоКонтрагентыДоговоры,
	|			Организация В (&МассивОрганизаций)
	|				И Субконто2 ССЫЛКА Справочник.ДоговорыЛизинга,
	|			,
	|			) КАК ХозрасчетныйОбороты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7,
	|	ХозрасчетныйОбороты.Организация,
	|	ХозрасчетныйОбороты.Подразделение,
	|	ХозрасчетныйОбороты.Счет,
	|	ХозрасчетныйОбороты.Субконто1,
	|	ХозрасчетныйОбороты.Регистратор,
	|	ХозрасчетныйОбороты.СуммаОборотДт,
	|	ХозрасчетныйОбороты.СуммаОборотКт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			Регистратор,
	|			Счет В ИЕРАРХИИ (&СчетаУчетаРасчетов7),
	|			,
	|			Организация В (&МассивОрганизаций)
	|				И НЕ Субконто2 Ссылка Справочник.ДоговорыКредитовИДепозитов
	|				И НЕ Субконто2 ССЫЛКА Справочник.ДоговорыЛизинга,
	|			,
	|			) КАК ХозрасчетныйОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтражениеДокументовВРеглУчете.Регистратор КАК Регистратор,
	|	ОтражениеДокументовВРеглУчете.Организация КАК Организация,
	|	МИНИМУМ(ОтражениеДокументовВРеглУчете.Статус) КАК Статус
	|ПОМЕСТИТЬ ВТ_СтатусыОтражения
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|ГДЕ
	|	ОтражениеДокументовВРеглУчете.Регистратор В
	|			(ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыСПоставщиками КАК Т
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыСКлиентами КАК Т
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыПоКредитамДепозитам КАК Т
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыПоЛизингу КАК Т
	|		
	|			ОБЪЕДИНИТЬ ВСЕ
	|		
	|			ВЫБРАТЬ
	|				Т.Регистратор
	|			ИЗ
	|				ВТ_РасчетыСКонтрагентамиРегл КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеДокументовВРеглУчете.Организация,
	|	ОтражениеДокументовВРеглУчете.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСПоставщиками.СчетУчетаРасчетов В ИЕРАРХИИ (&СчетаУчетаРасчетов7)
	|			ТОГДА 7
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК РазделУчета,
	|	ВТ_РасчетыСПоставщиками.Организация КАК Организация,
	|	ВТ_РасчетыСПоставщиками.Подразделение КАК Подразделение,
	|	ВТ_РасчетыСПоставщиками.СчетУчетаРасчетов КАК СчетУчета,
	|	ВТ_РасчетыСПоставщиками.Контрагент КАК Аналитика1,
	|	ВТ_РасчетыСПоставщиками.Регистратор КАК Регистратор,
	|	ВТ_РасчетыСПоставщиками.ДолгРеглПриход КАК Приход,
	|	ВТ_РасчетыСПоставщиками.ДолгРеглРасход КАК Расход,
	|	0 КАК ОборотДт,
	|	0 КАК ОборотКт
	|ПОМЕСТИТЬ ВТ_Расчеты
	|ИЗ
	|	ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСПоставщиками.СчетУчетаАванса В ИЕРАРХИИ (&СчетаУчетаРасчетов7)
	|			ТОГДА 7
	|		ИНАЧЕ 3
	|	КОНЕЦ,
	|	ВТ_РасчетыСПоставщиками.Организация,
	|	ВТ_РасчетыСПоставщиками.Подразделение,
	|	ВТ_РасчетыСПоставщиками.СчетУчетаАванса,
	|	ВТ_РасчетыСПоставщиками.Контрагент,
	|	ВТ_РасчетыСПоставщиками.Регистратор,
	|	ВТ_РасчетыСПоставщиками.ПредоплатаРеглПриход,
	|	ВТ_РасчетыСПоставщиками.ПредоплатаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыСПоставщиками КАК ВТ_РасчетыСПоставщиками
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСКлиентами.СчетУчетаРасчетов В ИЕРАРХИИ (&СчетаУчетаРасчетов7)
	|			ТОГДА 7
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	ВТ_РасчетыСКлиентами.Организация,
	|	ВТ_РасчетыСКлиентами.Подразделение,
	|	ВТ_РасчетыСКлиентами.СчетУчетаРасчетов,
	|	ВТ_РасчетыСКлиентами.Контрагент,
	|	ВТ_РасчетыСКлиентами.Регистратор,
	|	ВТ_РасчетыСКлиентами.ДолгРеглПриход,
	|	ВТ_РасчетыСКлиентами.ДолгРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ВТ_РасчетыСКлиентами.СчетУчетаАванса В ИЕРАРХИИ (&СчетаУчетаРасчетов7)
	|			ТОГДА 7
	|		ИНАЧЕ 4
	|	КОНЕЦ,
	|	ВТ_РасчетыСКлиентами.Организация,
	|	ВТ_РасчетыСКлиентами.Подразделение,
	|	ВТ_РасчетыСКлиентами.СчетУчетаАванса,
	|	ВТ_РасчетыСКлиентами.Контрагент,
	|	ВТ_РасчетыСКлиентами.Регистратор,
	|	ВТ_РасчетыСКлиентами.ПредоплатаРеглПриход,
	|	ВТ_РасчетыСКлиентами.ПредоплатаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыСКлиентами КАК ВТ_РасчетыСКлиентами
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5,
	|	РасчетыПоКредитамДепозитам.Организация,
	|	РасчетыПоКредитамДепозитам.Подразделение,
	|	РасчетыПоКредитамДепозитам.Счет,
	|	РасчетыПоКредитамДепозитам.Контрагент,
	|	РасчетыПоКредитамДепозитам.Регистратор,
	|	РасчетыПоКредитамДепозитам.СуммаРеглПриход,
	|	РасчетыПоКредитамДепозитам.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыПоКредитамДепозитам КАК РасчетыПоКредитамДепозитам
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6,
	|	РасчетыПоЛизингу.Организация,
	|	РасчетыПоЛизингу.Подразделение,
	|	РасчетыПоЛизингу.Счет,
	|	РасчетыПоЛизингу.Контрагент,
	|	РасчетыПоЛизингу.Регистратор,
	|	РасчетыПоЛизингу.СуммаРеглПриход,
	|	РасчетыПоЛизингу.СуммаРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	ВТ_РасчетыПоЛизингу КАК РасчетыПоЛизингу
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3,
	|	НеотфактурованныеПоставки.Организация,
	|	НеотфактурованныеПоставки.Подразделение,
	|	НеотфактурованныеПоставки.Счет,
	|	НеотфактурованныеПоставки.Контрагент,
	|	НеотфактурованныеПоставки.Регистратор,
	|	НеотфактурованныеПоставки.СтоимостьРеглПриход,
	|	НеотфактурованныеПоставки.СтоимостьРеглРасход,
	|	0,
	|	0
	|ИЗ
	|	ВТ_НеотфактурованныеПоставки КАК НеотфактурованныеПоставки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_РасчетыСКонтрагентамиРегл.РазделУчета,
	|	ВТ_РасчетыСКонтрагентамиРегл.Организация,
	|	ВТ_РасчетыСКонтрагентамиРегл.Подразделение,
	|	ВТ_РасчетыСКонтрагентамиРегл.Счет,
	|	ВТ_РасчетыСКонтрагентамиРегл.Субконто1,
	|	ВТ_РасчетыСКонтрагентамиРегл.Регистратор,
	|	0,
	|	0,
	|	ВТ_РасчетыСКонтрагентамиРегл.СуммаОборотДт,
	|	ВТ_РасчетыСКонтрагентамиРегл.СуммаОборотКт
	|ИЗ
	|	ВТ_РасчетыСКонтрагентамиРегл КАК ВТ_РасчетыСКонтрагентамиРегл
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Подзапрос.РазделУчета КАК РазделУчета,
	|	Подзапрос.Организация КАК Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета КАК СчетБУ,
	|	Подзапрос.Аналитика1 КАК Аналитика1,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	Подзапрос.Регистратор КАК Регистратор,
	|	СтатусыОтражения.Статус КАК Статус
	|ИЗ
	|	ВТ_Расчеты КАК Подзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыОтражения КАК СтатусыОтражения
	|		ПО Подзапрос.Организация = СтатусыОтражения.Организация
	|			И Подзапрос.Регистратор = СтатусыОтражения.Регистратор
	|ГДЕ
	|	Подзапрос.РазделУчета = &РазделУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Регистратор,
	|	СтатусыОтражения.Статус
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Подзапрос.Приход) <> 0
	|		ИЛИ СУММА(Подзапрос.Расход) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотДт) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотКт) <> 0)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета,
	|	Подзапрос.Аналитика1,
	|	СУММА(Подзапрос.Приход),
	|	СУММА(Подзапрос.Расход),
	|	СУММА(Подзапрос.ОборотДт),
	|	СУММА(Подзапрос.ОборотКт),
	|	Подзапрос.Регистратор,
	|	СтатусыОтражения.Статус
	|ИЗ
	|	ВТ_Расчеты КАК Подзапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтатусыОтражения КАК СтатусыОтражения
	|		ПО Подзапрос.Организация = СтатусыОтражения.Организация
	|			И Подзапрос.Регистратор = СтатусыОтражения.Регистратор
	|ГДЕ
	|	&РазделУчета = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетУчета,
	|	Подзапрос.Аналитика1,
	|	Подзапрос.Регистратор,
	|	СтатусыОтражения.Статус
	|
	|ИМЕЮЩИЕ
	|	(СУММА(Подзапрос.Приход) <> 0
	|		ИЛИ СУММА(Подзапрос.Расход) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотДт) <> 0
	|		ИЛИ СУММА(Подзапрос.ОборотКт) <> 0)";
	
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатраты()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СебестоимостьТоваров.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|		ИНАЧЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения
	|	КОНЕЦ КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	СУММА(СебестоимостьТоваров.СтоимостьРеглОстаток 
	|			+ СебестоимостьТоваров.ДопРасходыРеглОстаток 
	|			+ СебестоимостьТоваров.ТрудозатратыРеглОстаток
	|			+ СебестоимостьТоваров.ПостатейныеПостоянныеРеглОстаток
	|			+ СебестоимостьТоваров.ПостатейныеПеременныеРеглОстаток) КАК НачальныйОстаток,
	|	0 КАК КонечныйОстаток
	|ПОМЕСТИТЬ ВтРасходыОстатки
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&НачалоПериода,
	|			РазделУчета В (
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|				И Организация В (&МассивОрганизаций)) КАК СебестоимостьТоваров
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.Организация,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|		ИНАЧЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СебестоимостьТоваров.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|		ИНАЧЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения
	|	КОНЕЦ КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	0 КАК НачальныйОстаток,
	|	СУММА(СебестоимостьТоваров.СтоимостьРеглОстаток 
	|			+ СебестоимостьТоваров.ДопРасходыРеглОстаток 
	|			+ СебестоимостьТоваров.ТрудозатратыРеглОстаток
	|			+ СебестоимостьТоваров.ПостатейныеПостоянныеРеглОстаток
	|			+ СебестоимостьТоваров.ПостатейныеПеременныеРеглОстаток) КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров.Остатки(
	|			&КонецПериодаОстатков,
	|			РазделУчета В (
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
	|				ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|				И Организация В (&МассивОрганизаций)) КАК СебестоимостьТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СебестоимостьТоваров.Организация,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	|		ИНАЧЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПартииПрочихРасходовОстатки.Организация КАК Организация,
	|	ПартииПрочихРасходовОстатки.Подразделение КАК Подразделение,
	|	ПартииПрочихРасходовОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета,
	|	СУММА(ПартииПрочихРасходовОстатки.СтоимостьРеглОстаток) КАК НачальныйОстаток,
	|	0 КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов.Остатки(&НачалоПериода, 
	|		Организация В (&МассивОрганизаций) 
	|		И СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов 
	|		И ВЫРАЗИТЬ(СтатьяРасходов КАК ПланВидовХарактеристик.СтатьиРасходов).ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) КАК ПартииПрочихРасходовОстатки
	|	
	|СГРУППИРОВАТЬ ПО
	|	ПартииПрочихРасходовОстатки.Организация,
	|	ПартииПрочихРасходовОстатки.Подразделение,
	|	ПартииПрочихРасходовОстатки.СтатьяРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПартииПрочихРасходовОстатки.Организация КАК Организация,
	|	ПартииПрочихРасходовОстатки.Подразделение КАК Подразделение,
	|	ПартииПрочихРасходовОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета,
	|	0 КАК НачальныйОстаток,
	|	СУММА(ПартииПрочихРасходовОстатки.СтоимостьРеглОстаток) КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов.Остатки(&КонецПериодаОстатков, 
	|		Организация В (&МассивОрганизаций) 
	|		И СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов 
	|		И ВЫРАЗИТЬ(СтатьяРасходов КАК ПланВидовХарактеристик.СтатьиРасходов).ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)) КАК ПартииПрочихРасходовОстатки
	|	
	|СГРУППИРОВАТЬ ПО
	|	ПартииПрочихРасходовОстатки.Организация,
	|	ПартииПрочихРасходовОстатки.Подразделение,
	|	ПартииПрочихРасходовОстатки.СтатьяРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеРасходыОстатки.Организация КАК Организация,
	|	ПрочиеРасходыОстатки.Подразделение КАК Подразделение,
	|	ПрочиеРасходыОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета,
	|	СУММА(ПрочиеРасходыОстатки.СуммаРеглОстаток) КАК НачальныйОстаток,
	|	0 КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(&НачалоПериода, 
	|		Организация В (&МассивОрганизаций)) КАК ПрочиеРасходыОстатки
	|	
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыОстатки.Организация,
	|	ПрочиеРасходыОстатки.Подразделение,
	|	ПрочиеРасходыОстатки.СтатьяРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеРасходыОстатки.Организация КАК Организация,
	|	ПрочиеРасходыОстатки.Подразделение КАК Подразделение,
	|	ПрочиеРасходыОстатки.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета,
	|	0 КАК НачальныйОстаток,
	|	СУММА(ПрочиеРасходыОстатки.СуммаРеглОстаток) КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы.Остатки(&КонецПериодаОстатков, 
	|		Организация В (&МассивОрганизаций)) КАК ПрочиеРасходыОстатки
	|	
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыОстатки.Организация,
	|	ПрочиеРасходыОстатки.Подразделение,
	|	ПрочиеРасходыОстатки.СтатьяРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеРасходыНезавершенногоПроизводства.Организация КАК Организация,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение КАК Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	СУММА(ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРеглОстаток) КАК НачальныйОстаток,
	|	0 КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(&НачалоПериода, 
	|		Организация В (&МассивОрганизаций)) КАК ПрочиеРасходыНезавершенногоПроизводства
	|	
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыНезавершенногоПроизводства.Организация,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПрочиеРасходыНезавершенногоПроизводства.Организация КАК Организация,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение КАК Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	0 КАК НачальныйОстаток,
	|	СУММА(ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРеглОстаток) КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства.Остатки(&КонецПериодаОстатков, 
	|		Организация В (&МассивОрганизаций)) КАК ПрочиеРасходыНезавершенногоПроизводства
	|	
	|СГРУППИРОВАТЬ ПО
	|	ПрочиеРасходыНезавершенногоПроизводства.Организация,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТрудозатратыНезавершенногоПроизводства.Организация КАК Организация,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	СУММА(ТрудозатратыНезавершенногоПроизводства.СтоимостьРеглОстаток) КАК НачальныйОстаток,
	|	0 КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(&НачалоПериода, 
	|		Организация В (&МассивОрганизаций)) КАК ТрудозатратыНезавершенногоПроизводства
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТрудозатратыНезавершенногоПроизводства.Организация,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТрудозатратыНезавершенногоПроизводства.Организация КАК Организация,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	0 КАК НачальныйОстаток,
	|	СУММА(ТрудозатратыНезавершенногоПроизводства.СтоимостьРеглОстаток) КАК КонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства.Остатки(&КонецПериодаОстатков, 
	|		Организация В (&МассивОрганизаций)) КАК ТрудозатратыНезавершенногоПроизводства
	|	
	|СГРУППИРОВАТЬ ПО
	|	ТрудозатратыНезавершенногоПроизводства.Организация,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|			ТОГДА СебестоимостьТоваров.Регистратор
	|		ИНАЧЕ СебестоимостьТоваров.ДокументДвижения
	|	КОНЕЦ КАК Регистратор,
	|	СебестоимостьТоваров.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА СебестоимостьТоваров.АналитикаУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	//++ НЕ УТКА
	|		КОГДА СебестоимостьТоваров.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|			ТОГДА ВЫРАЗИТЬ(СебестоимостьТоваров.Регистратор КАК Документ.ПоступлениеОтПереработчика).Подразделение
	|		КОГДА СебестоимостьТоваров.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(СебестоимостьТоваров.Регистратор КАК Документ.ОтчетПереработчика).Подразделение
	//-- НЕ УТКА
	|		ИНАЧЕ СебестоимостьТоваров.АналитикаУчетаНоменклатуры.МестоХранения
	|	КОНЕЦ КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл
	|			+ СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|			+ СебестоимостьТоваров.ДопРасходыРегл 
	|			+ СебестоимостьТоваров.ТрудозатратыРегл
	|			+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|			+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл
	|			+ СебестоимостьТоваров.СтоимостьЗабалансоваяРегл
	|			+ СебестоимостьТоваров.ДопРасходыРегл 
	|			+ СебестоимостьТоваров.ТрудозатратыРегл
	|			+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|			+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ПОМЕСТИТЬ втРасходыОбороты
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|ГДЕ
	|	СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|	И СебестоимостьТоваров.Активность
	|	И СебестоимостьТоваров.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПартииПрочихРасходов.ДокументПоступленияРасходов = ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|			ТОГДА ПартииПрочихРасходов.Регистратор
	|		ИНАЧЕ ПартииПрочихРасходов.ДокументПоступленияРасходов
	|	КОНЕЦ КАК Регистратор,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	ПартииПрочихРасходов.Подразделение КАК Подразделение,
	|	ПартииПрочихРасходов.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА ПартииПрочихРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ПартииПрочихРасходов.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА ПартииПрочихРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПартииПрочихРасходов.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|ГДЕ
	|	ПартииПрочихРасходов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииПрочихРасходов.Организация В (&МассивОрганизаций)
	|	И ПартииПрочихРасходов.Активность
	|	И ПартииПрочихРасходов.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов 
	|	И ВЫРАЗИТЬ(ПартииПрочихРасходов.СтатьяРасходов КАК ПланВидовХарактеристик.СтатьиРасходов).ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПрочиеРасходы.ДокументДвижения = ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|			ТОГДА ПрочиеРасходы.Регистратор
	|		ИНАЧЕ ПрочиеРасходы.ДокументДвижения
	|	КОНЕЦ КАК Регистратор,
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.Подразделение КАК Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА ПрочиеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА ПрочиеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|			ТОГДА ПрочиеРасходыНезавершенногоПроизводства.Регистратор
	|		ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения
	|	КОНЕЦ КАК Регистратор,
	|	ПрочиеРасходыНезавершенногоПроизводства.Организация КАК Организация,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение КАК Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
	|
	|ГДЕ
	|	ПрочиеРасходыНезавершенногоПроизводства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПрочиеРасходыНезавершенногоПроизводства.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходыНезавершенногоПроизводства.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТрудозатратыНезавершенногоПроизводства.Регистратор КАК Регистратор,
	|	ТрудозатратыНезавершенногоПроизводства.Организация КАК Организация,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА ТрудозатратыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТрудозатратыНезавершенногоПроизводства.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА ТрудозатратыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ТрудозатратыНезавершенногоПроизводства.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНезавершенногоПроизводства
	|ГДЕ
	|	ТрудозатратыНезавершенногоПроизводства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТрудозатратыНезавершенногоПроизводства.Организация В (&МассивОрганизаций)
	|	И ТрудозатратыНезавершенногоПроизводства.Активность
	|;
	|
	|/////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	8 КАК РазделУчета,
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ,
	|	СУММА(Подзапрос.НачальныйОстаток) КАК НачальныйОстаток,
	|	СУММА(Подзапрос.Приход) КАК Приход,
	|	СУММА(Подзапрос.Расход) КАК Расход,
	|	СУММА(Подзапрос.КонечныйОстаток) КАК КонечныйОстаток,
	|	СУММА(Подзапрос.НачальныеСальдо) КАК НачальноеСальдо,
	|	СУММА(Подзапрос.ОборотДт) КАК ОборотДт,
	|	СУММА(Подзапрос.ОборотКт) КАК ОборотКт,
	|	СУММА(Подзапрос.КонечноеСальдо) КАК КонечноеСальдо
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасходыОстатки.Организация КАК Организация,
	|		РасходыОстатки.Подразделение КАК Подразделение,
	|		ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)))) КАК СчетБУ,
	|		РасходыОстатки.НачальныйОстаток КАК НачальныйОстаток,
	|		0 КАК Приход,
	|		0 КАК Расход,
	|		РасходыОстатки.КонечныйОстаток КАК КонечныйОстаток,
	|		0 КАК НачальныеСальдо,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт,
	|		0 КАК КонечноеСальдо
	|	ИЗ
	|		втРасходыОстатки КАК РасходыОстатки
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоМестуУчета
	|	ПО 
	|		НастройкиПоМестуУчета.ВидСчета = РасходыОстатки.ВидСчета
	|		И НастройкиПоМестуУчета.Организация = РасходыОстатки.Организация
	|		И (НастройкиПоМестуУчета.АналитикаУчета = РасходыОстатки.СтатьяРасходов ИЛИ РасходыОстатки.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоМестуУчета.МестоУчета = РасходыОстатки.Подразделение
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|	ПО 
	|		НастройкиПоОрганизации.ВидСчета = РасходыОстатки.ВидСчета
	|		И НастройкиПоОрганизации.Организация = РасходыОстатки.Организация
	|		И (НастройкиПоОрганизации.АналитикаУчета = РасходыОстатки.СтатьяРасходов ИЛИ РасходыОстатки.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета = РасходыОстатки.ВидСчета
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И (НастройкиПоАналитике.АналитикаУчета = РасходыОстатки.СтатьяРасходов ИЛИ РасходыОстатки.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РасходыОбороты.Организация КАК Организация,
	|		РасходыОбороты.Подразделение КАК Подразделение,
	|		ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)))) КАК СчетБУ,
	|		0 КАК НачальныйОстаток,
	|		РасходыОбороты.Приход КАК Приход,
	|		РасходыОбороты.Расход КАК Расход,
	|		0 КАК КонечныйОстаток,
	|		0 КАК НачальныеСальдо,
	|		0 КАК ОборотДт,
	|		0 КАК ОборотКт,
	|		0 КАК КонечноеСальдо
	|	ИЗ
	|		втРасходыОбороты КАК РасходыОбороты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоМестуУчета
	|	ПО 
	|		НастройкиПоМестуУчета.ВидСчета = РасходыОбороты.ВидСчета
	|		И НастройкиПоМестуУчета.Организация = РасходыОбороты.Организация
	|		И (НастройкиПоМестуУчета.АналитикаУчета = РасходыОбороты.СтатьяРасходов ИЛИ РасходыОбороты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоМестуУчета.МестоУчета = РасходыОбороты.Подразделение
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|	ПО 
	|		НастройкиПоОрганизации.ВидСчета = РасходыОбороты.ВидСчета
	|		И НастройкиПоОрганизации.Организация = РасходыОбороты.Организация
	|		И (НастройкиПоОрганизации.АналитикаУчета = РасходыОбороты.СтатьяРасходов ИЛИ РасходыОбороты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета = РасходыОбороты.ВидСчета
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И (НастройкиПоАналитике.АналитикаУчета = РасходыОбороты.СтатьяРасходов ИЛИ РасходыОбороты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ХозрасчетныйОстаткиИОбороты.Организация,
	|		ХозрасчетныйОстаткиИОбороты.Подразделение,
	|		ХозрасчетныйОстаткиИОбороты.Счет,
	|		0,
	|		0,
	|		0,
	|		0,
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаНачальныйОстаток),
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт),
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт),
	|		СУММА(ХозрасчетныйОстаткиИОбороты.СуммаКонечныйОстаток)
	|	ИЗ
	|		РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , Движения, 
	|						Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство), 
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), 
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АдминистративныеРасходы),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), 
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаСбыт),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗатратыБудущихПериодов),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФинансовыеЗатраты),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПотериОтУчастияВКапитале),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеЗатратыДеятельности))
    |						И Счет НЕ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованныхПроизводственныхЗапасов))
	|										, , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ХозрасчетныйОстаткиИОбороты.Подразделение,
	|		ХозрасчетныйОстаткиИОбороты.Счет,
	|		ХозрасчетныйОстаткиИОбороты.Организация) КАК Подзапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Подзапрос.Организация,
	|	Подзапрос.Подразделение,
	|	Подзапрос.СчетБУ";
	
КонецФункции

Функция ТекстЗапросаПроизводственныеЗатратыПоРегистраторам()
	
	Возврат
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА СебестоимостьТоваров.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|			ТОГДА СебестоимостьТоваров.Регистратор
	|		ИНАЧЕ СебестоимостьТоваров.ДокументДвижения
	|	КОНЕЦ КАК Регистратор,
	|	СебестоимостьТоваров.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА КлючиАналитикиУчетаНоменклатуры.ТипМестаХранения = ЗНАЧЕНИЕ(Перечисление.ТипыМестХранения.Склад)
	|			ТОГДА КлючиАналитикиУчетаНоменклатуры.СкладскаяТерритория.Подразделение
	//++ НЕ УТКА
	|		КОГДА СебестоимостьТоваров.Регистратор ССЫЛКА Документ.ПоступлениеОтПереработчика
	|			ТОГДА ВЫРАЗИТЬ(СебестоимостьТоваров.Регистратор КАК Документ.ПоступлениеОтПереработчика).Подразделение
	|		КОГДА СебестоимостьТоваров.Регистратор ССЫЛКА Документ.ОтчетПереработчика
	|			ТОГДА ВЫРАЗИТЬ(СебестоимостьТоваров.Регистратор КАК Документ.ОтчетПереработчика).Подразделение
	//-- НЕ УТКА
	|		ИНАЧЕ КлючиАналитикиУчетаНоменклатуры.МестоХранения
	|	КОНЕЦ КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл
	|			+ СебестоимостьТоваров.ДопРасходыРегл 
	|			+ СебестоимостьТоваров.ТрудозатратыРегл
	|			+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|			+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА СебестоимостьТоваров.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|		ТОГДА СебестоимостьТоваров.СтоимостьРегл
	|			+ СебестоимостьТоваров.ДопРасходыРегл 
	|			+ СебестоимостьТоваров.ТрудозатратыРегл
	|			+ СебестоимостьТоваров.ПостатейныеПостоянныеРегл
	|			+ СебестоимостьТоваров.ПостатейныеПеременныеРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ПОМЕСТИТЬ втРасходыОбороты
	|ИЗ
	|	РегистрНакопления.СебестоимостьТоваров КАК СебестоимостьТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КлючиАналитикиУчетаНоменклатуры
	|		ПО СебестоимостьТоваров.АналитикаУчетаНоменклатуры = КлючиАналитикиУчетаНоменклатуры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорКлючиАналитикиУчетаНоменклатуры
	|		ПО СебестоимостьТоваров.КорАналитикаУчетаНоменклатуры = КорКлючиАналитикиУчетаНоменклатуры.Ссылка
	|ГДЕ
	|	СебестоимостьТоваров.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СебестоимостьТоваров.Организация В (&МассивОрганизаций)
	|	И СебестоимостьТоваров.Активность
	|	И СебестоимостьТоваров.РазделУчета В (
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ПроизводственныеЗатраты),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.ТоварыПринятыеНаОтветхранение),
	|		ЗНАЧЕНИЕ(Перечисление.РазделыУчетаСебестоимостиТоваров.НезавершенноеПроизводство))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПартииПрочихРасходов.ДокументПоступленияРасходов = ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|			ТОГДА ПартииПрочихРасходов.Регистратор
	|		ИНАЧЕ ПартииПрочихРасходов.ДокументПоступленияРасходов
	|	КОНЕЦ КАК Регистратор,
	|	ПартииПрочихРасходов.Организация КАК Организация,
	|	ПартииПрочихРасходов.Подразделение КАК Подразделение,
	|	ПартииПрочихРасходов.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА ПартииПрочихРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ПартииПрочихРасходов.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА ПартииПрочихРасходов.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПартииПрочихРасходов.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	РегистрНакопления.ПартииПрочихРасходов КАК ПартииПрочихРасходов
	|ГДЕ
	|	ПартииПрочихРасходов.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПартииПрочихРасходов.Организация В (&МассивОрганизаций)
	|	И ПартииПрочихРасходов.Активность
	|	И ПартииПрочихРасходов.СтатьяРасходов ССЫЛКА ПланВидовХарактеристик.СтатьиРасходов 
	|	И ВЫРАЗИТЬ(ПартииПрочихРасходов.СтатьяРасходов КАК ПланВидовХарактеристик.СтатьиРасходов).ВариантРаспределенияРасходовРегл = ЗНАЧЕНИЕ(Перечисление.ВариантыРаспределенияРасходов.НаСебестоимостьТоваров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПрочиеРасходы.ДокументДвижения = ЗНАЧЕНИЕ(Документ.РаспределениеПрочихЗатрат.ПустаяСсылка)
	|			ТОГДА ПрочиеРасходы.Регистратор
	|		ИНАЧЕ ПрочиеРасходы.ДокументДвижения
	|	КОНЕЦ КАК Регистратор,
	|	ПрочиеРасходы.Организация КАК Организация,
	|	ПрочиеРасходы.Подразделение КАК Подразделение,
	|	ПрочиеРасходы.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Расходы) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА ПрочиеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА ПрочиеРасходы.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПрочиеРасходы.СуммаРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходы КАК ПрочиеРасходы
	|ГДЕ
	|	ПрочиеРасходы.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПрочиеРасходы.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходы.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения = НЕОПРЕДЕЛЕНО
	|			ТОГДА ПрочиеРасходыНезавершенногоПроизводства.Регистратор
	|		ИНАЧЕ ПрочиеРасходыНезавершенногоПроизводства.ДокументДвижения
	|	КОНЕЦ КАК Регистратор,
	|	ПрочиеРасходыНезавершенногоПроизводства.Организация КАК Организация,
	|	ПрочиеРасходыНезавершенногоПроизводства.Подразделение КАК Подразделение,
	|	ПрочиеРасходыНезавершенногоПроизводства.СтатьяРасходов КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА ПрочиеРасходыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ПрочиеРасходыНезавершенногоПроизводства.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	РегистрНакопления.ПрочиеРасходыНезавершенногоПроизводства КАК ПрочиеРасходыНезавершенногоПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорКлючиАналитикиУчетаНоменклатуры
	|		ПО ПрочиеРасходыНезавершенногоПроизводства.АналитикаУчетаПродукции = КорКлючиАналитикиУчетаНоменклатуры.Ссылка

	|ГДЕ
	|	ПрочиеРасходыНезавершенногоПроизводства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ПрочиеРасходыНезавершенногоПроизводства.Организация В (&МассивОрганизаций)
	|	И ПрочиеРасходыНезавершенногоПроизводства.Активность
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТрудозатратыНезавершенногоПроизводства.Регистратор КАК Регистратор,
	|	ТрудозатратыНезавершенногоПроизводства.Организация КАК Организация,
	|	ТрудозатратыНезавершенногоПроизводства.Подразделение КАК Подразделение,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка) КАК СтатьяРасходов,
	|	ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство) КАК ВидСчета,
	|	ВЫБОР 
	|		КОГДА ТрудозатратыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТрудозатратыНезавершенногоПроизводства.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Приход,
	|	ВЫБОР 
	|		КОГДА ТрудозатратыНезавершенногоПроизводства.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ТрудозатратыНезавершенногоПроизводства.СтоимостьРегл
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Расход
	|ИЗ
	|	РегистрНакопления.ТрудозатратыНезавершенногоПроизводства КАК ТрудозатратыНезавершенногоПроизводства
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК КорКлючиАналитикиУчетаНоменклатуры
	|		ПО ТрудозатратыНезавершенногоПроизводства.КорАналитикаУчетаПродукции = КорКлючиАналитикиУчетаНоменклатуры.Ссылка
	|ГДЕ
	|	ТрудозатратыНезавершенногоПроизводства.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ТрудозатратыНезавершенногоПроизводства.Организация В (&МассивОрганизаций)
	|	И ТрудозатратыНезавершенногоПроизводства.Активность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РасходыОбороты.Организация КАК Организация,
	|	РасходыОбороты.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(НастройкиПоМестуУчета.СчетУчета, ЕСТЬNULL(НастройкиПоОрганизации.СчетУчета, ЕСТЬNULL(НастройкиПоАналитике.СчетУчета, ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)))) КАК СчетБУ,
	|	РасходыОбороты.Приход КАК Приход,
	|	РасходыОбороты.Расход КАК Расход,
	|	0 КАК ОборотДт,
	|	0 КАК ОборотКт,
	|	РасходыОбороты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ втСверкаОборотов
	|ИЗ
	|	втРасходыОбороты КАК РасходыОбороты
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоМестуУчета
	|	ПО 
	|		НастройкиПоМестуУчета.ВидСчета = РасходыОбороты.ВидСчета
	|		И НастройкиПоМестуУчета.Организация = РасходыОбороты.Организация
	|		И (НастройкиПоМестуУчета.АналитикаУчета = РасходыОбороты.СтатьяРасходов ИЛИ РасходыОбороты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоМестуУчета.МестоУчета = РасходыОбороты.Подразделение
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоОрганизации
	|	ПО 
	|		НастройкиПоОрганизации.ВидСчета = РасходыОбороты.ВидСчета
	|		И НастройкиПоОрганизации.Организация = РасходыОбороты.Организация
	|		И (НастройкиПоОрганизации.АналитикаУчета = РасходыОбороты.СтатьяРасходов ИЛИ РасходыОбороты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоОрганизации.МестоУчета = НЕОПРЕДЕЛЕНО
	|	
	|	ЛЕВОЕ СОЕДИНЕНИЕ 
	|		РегистрСведений.ПорядокОтраженияНаСчетахУчета КАК НастройкиПоАналитике
	|	ПО 
	|		НастройкиПоАналитике.ВидСчета = РасходыОбороты.ВидСчета
	|		И НастройкиПоАналитике.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|		И (НастройкиПоАналитике.АналитикаУчета = РасходыОбороты.СтатьяРасходов ИЛИ РасходыОбороты.ВидСчета = ЗНАЧЕНИЕ(Перечисление.ВидыСчетовРеглУчета.Производство))
	|		И НастройкиПоАналитике.МестоУчета = НЕОПРЕДЕЛЕНО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	0,
	|	0,
	|	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотДт),
	|	СУММА(ХозрасчетныйОстаткиИОбороты.СуммаОборотКт),
	|	ХозрасчетныйОстаткиИОбороты.Регистратор
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, Движения, 
	|										Счет В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОсновноеПроизводство),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОбщепроизводственныеРасходы), 
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.АдминистративныеРасходы),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.БракВПроизводстве), 
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.РасходыНаСбыт),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ЗатратыБудущихПериодов),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеЗатратыОперационнойДеятельностиГруппа),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ФинансовыеЗатраты),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПотериОтУчастияВКапитале),
	|										 ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ДругиеЗатратыДеятельности))
    |										И Счет НЕ В ИЕРАРХИИ (ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СебестоимостьРеализованныхПроизводственныхЗапасов))
	|									, , Организация В (&МассивОрганизаций)) КАК ХозрасчетныйОстаткиИОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстаткиИОбороты.Подразделение,
	|	ХозрасчетныйОстаткиИОбороты.Счет,
	|	ХозрасчетныйОстаткиИОбороты.Организация,
	|	ХозрасчетныйОстаткиИОбороты.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ОтражениеДокументовВРеглУчете.Статус) КАК Статус,
	|	ОтражениеДокументовВРеглУчете.Регистратор КАК Регистратор,
	|	ОтражениеДокументовВРеглУчете.Организация КАК Организация
	|ПОМЕСТИТЬ втСтатусыОтражения
	|ИЗ
	|	РегистрСведений.ОтражениеДокументовВРеглУчете КАК ОтражениеДокументовВРеглУчете
	|ГДЕ
	|	ОтражениеДокументовВРеглУчете.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.Регистратор КАК Регистратор
	|			ИЗ
	|				втРасходыОбороты КАК Т)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОтражениеДокументовВРеглУчете.Регистратор,
	|	ОтражениеДокументовВРеглУчете.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	8 КАК РазделУчета,
	|	втСверкаОборотов.Организация КАК Организация,
	|	втСверкаОборотов.Подразделение КАК Подразделение,
	|	втСверкаОборотов.СчетБУ КАК СчетБУ,
	|	СУММА(втСверкаОборотов.Приход) КАК Приход,
	|	СУММА(втСверкаОборотов.Расход) КАК Расход,
	|	СУММА(втСверкаОборотов.ОборотДт) КАК ОборотДт,
	|	СУММА(втСверкаОборотов.ОборотКт) КАК ОборотКт,
	|	втСверкаОборотов.Регистратор КАК Регистратор,
	|	втСтатусыОтражения.Статус КАК Статус
	|ИЗ
	|	втСверкаОборотов КАК втСверкаОборотов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСтатусыОтражения КАК втСтатусыОтражения
	|		ПО втСверкаОборотов.Организация = втСтатусыОтражения.Организация
	|			И втСверкаОборотов.Регистратор = втСтатусыОтражения.Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	втСверкаОборотов.Организация,
	|	втСверкаОборотов.Подразделение,
	|	втСверкаОборотов.СчетБУ,
	|	втСверкаОборотов.Регистратор,
	|	втСтатусыОтражения.Статус
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втСтатусыОтражения";
	
КонецФункции

#КонецОбласти 

#Область ДоработкаТабличногоДокумента

Функция ДокументыВРегламентированномУчетеОтражены(Дата)

	СтруктураВозврата = Новый Структура("ДанныеАктуальны, ЧислоДокументов, ГраницаОтражения", Истина);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = ЗакрытиеМесяцаСервер.ТекстЗапросаСостояниеОтраженияДокументов();
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	Для каждого ЗапросПакета Из СхемаЗапроса.ПакетЗапросов Цикл
		Если ТипЗнч(ЗапросПакета) = Тип("ЗапросВыбораСхемыЗапроса") Тогда
			ЗапросПакета.ВыбиратьРазрешенные = Истина;
		КонецЕсли;
	КонецЦикла;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ДатаОкончания = ?(ЗначениеЗаполнено(Дата), Дата, Дата(3999, 1, 1));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("МассивОрганизаций", ЭтотОбъект.МассивОрганизаций);
	Запрос.УстановитьПараметр("ПоВсемОрганизациям", Ложь);
	Запрос.УстановитьПараметр("РазделУчета", ЭтотОбъект.РазделУчета);
	
	УстановитьПривилегированныйРежим(Истина);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	ВыборкаКОтражениюВУчете = МассивРезультатов[1].Выбрать();
	ВыборкаНеОтраженоВУчете = МассивРезультатов[2].Выбрать();
	ВыборкаКОтражениюНеПроверены = МассивРезультатов[3].Выбрать();
	
	ЕстьДокументыНеОтраженныеВУчете = ВыборкаНеОтраженоВУчете.Следующий();
	ЕстьДокументыКОтражению = ВыборкаКОтражениюВУчете.Следующий();
	ЕстьДокументыКОтражениюНеПроверенные = ВыборкаКОтражениюНеПроверены.Следующий();
	
	Если ЕстьДокументыКОтражению И ВыборкаКОтражениюВУчете.ДатаНачала <= ДатаОкончания Тогда 
		
		СтруктураВозврата.ДанныеАктуальны = Ложь;
		СтруктураВозврата.ЧислоДокументов = ВыборкаКОтражениюВУчете.Количество;
		СтруктураВозврата.ГраницаОтражения = ВыборкаКОтражениюВУчете.ДатаНачала;
		
	ИначеЕсли ЕстьДокументыНеОтраженныеВУчете И ВыборкаНеОтраженоВУчете.ДатаНачала <= ДатаОкончания Тогда
		
		СтруктураВозврата.ДанныеАктуальны = Ложь;
		СтруктураВозврата.ЧислоДокументов = ВыборкаНеОтраженоВУчете.Количество;
		СтруктураВозврата.ГраницаОтражения = ВыборкаНеОтраженоВУчете.ДатаНачала;
		
	ИначеЕсли ЕстьДокументыКОтражениюНеПроверенные И ВыборкаКОтражениюНеПроверены.ДатаНачала <= ДатаОкончания Тогда
		
		СтруктураВозврата.ДанныеАктуальны = Ложь;
		СтруктураВозврата.ЧислоДокументов = ВыборкаКОтражениюНеПроверены.Количество;
		СтруктураВозврата.ГраницаОтражения = ВыборкаКОтражениюНеПроверены.ДатаНачала;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

Функция ДоступныеОрганизации(Организация = Неопределено)
	СписокОрганизаций = Новый СписокЗначений;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеСправочника.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК ДанныеСправочника
		|ГДЕ
		|	ДанныеСправочника.Ссылка = &Организация
		|	И ДанныеСправочника.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ДанныеСправочника.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК ДанныеСправочника
		|ГДЕ
		|	&Организация В (ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
		|	И ДанныеСправочника.Ссылка <> ЗНАЧЕНИЕ(Справочник.Организации.УправленческаяОрганизация)");
		Запрос.УстановитьПараметр("Организация", Организация);
		МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
		СписокОрганизаций.ЗагрузитьЗначения(МассивОрганизаций);
	Иначе
		СписокОрганизаций.Добавить(Организация);
	КонецЕсли;
	Возврат СписокОрганизаций;
КонецФункции

Процедура ПостОбработка(ТабДок, ДанныеРасшифровки, КлючВарианта)
	
	СостояниеОтраженияДокументов = ДокументыВРегламентированномУчетеОтражены(ЭтотОбъект.КонецПериода);
	Если Не СостояниеОтраженияДокументов.ДанныеАктуальны Тогда
		ТабДок.Область("R1C1").Текст = НСтр("ru='Не все документы отражены в регламентированном учете, поэтому данные отчета могут быть неактуальны';uk='Не всі документи відображені в регламентованому обліку, тому дані звіту можуть бути неактуальні'");;
		ТабДок.Область("R1C1").ЦветТекста = Метаданные.ЭлементыСтиля.ЦветТекстаПроблема.Значение;
	КонецЕсли;                                                               
	
	СписокЯчеек = Новый СписокЗначений;
	СписокЯчеек.Добавить("Начальный остаток");
	СписокЯчеек.Добавить("Приход");
	СписокЯчеек.Добавить("Расход");
	СписокЯчеек.Добавить("Конечный остаток");
	СписокЯчеек.Добавить("Показатели");
	
	ОбъединяемыеЯчейки = Новый СписокЗначений;
	ОбъединяемыеЯчейки.Добавить("Оперативный учет");
	ОбъединяемыеЯчейки.Добавить("Бухгалтерский учет");
	ОбъединяемыеЯчейки.Добавить("Отклонение (ОУ-БУ)");
	ОбъединяемыеЯчейки.Добавить("Начальный остаток");
	ОбъединяемыеЯчейки.Добавить("Начальное сальдо");
	ОбъединяемыеЯчейки.Добавить("Отклонение (начальный остаток)");
	ОбъединяемыеЯчейки.Добавить("Приход");
	ОбъединяемыеЯчейки.Добавить("Оборот Дт");
	ОбъединяемыеЯчейки.Добавить("Отклонение (приход)");
	ОбъединяемыеЯчейки.Добавить("Расход");
	ОбъединяемыеЯчейки.Добавить("Оборот Кт");
	ОбъединяемыеЯчейки.Добавить("Отклонение (расход)");
	ОбъединяемыеЯчейки.Добавить("Конечный остаток");
	ОбъединяемыеЯчейки.Добавить("Конечное сальдо");
	ОбъединяемыеЯчейки.Добавить("Отклонение (конечный остаток)");
	
	
	Для индСтр = 1 По ТабДок.ВысотаТаблицы Цикл
		МаксимальнаяВысотаШапки = 0;
		Для индКол = 1 По ТабДок.ШиринаТаблицы Цикл
			
			Если ТабДок.Область(индСтр, 1).Текст = "Итого" Тогда
				ТабДок.Область(индСтр, индКол).Расшифровка = Неопределено;
			КонецЕсли;

			Если ОбъединятьЯчейки(ТабДок, индСтр, индКол, СписокЯчеек, КлючВарианта) Тогда
				ТекстЗаголовка = ТабДок.Область(индСтр, индКол).Текст;
				Если КлючВарианта = "СверкаПоРегистраторам" Тогда
					ОбъединяемаяОбласть = ТабДок.Область(индСтр, индКол, Макс(индСтр, ТабДок.ФиксацияСверху), индКол);
				Иначе
					ВысотаШапки = 0;
					Для Индекс = 1 По 5 Цикл
						СледующаяЯчейка = ТабДок.Область(индСтр+Индекс, индКол, индСтр+Индекс, индКол).Текст;
						Если ОбъединяемыеЯчейки.НайтиПоЗначению(СледующаяЯчейка) <> Неопределено Тогда
							ВысотаШапки = ВысотаШапки + 1;
						КонецЕсли;
					КонецЦикла;
					ОбъединяемаяОбласть = ТабДок.Область(индСтр - 1, индКол, индСтр + ВысотаШапки, индКол);
					МаксимальнаяВысотаШапки = Макс(МаксимальнаяВысотаШапки, ВысотаШапки);
				КонецЕсли;
				ОбъединяемаяОбласть.Объединить();
				ОбъединяемаяОбласть.Текст = ТекстЗаголовка;
				ОбъединяемаяОбласть.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
				
				Если СписокЯчеек.Количество() = 0 Тогда 
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		индСтр = индСтр + МаксимальнаяВысотаШапки;
	КонецЦикла;

КонецПроцедуры

Функция ОбъединятьЯчейки(ТабДок, индСтр, индКол, СписокЯчеек, КлючВарианта)

	Ячейка = ТабДок.Область(индСтр, индКол);
	ЯчейкаКОбъединению = СписокЯчеек.НайтиПоЗначению(Ячейка.Текст);
	Если ЯчейкаКОбъединению <> Неопределено Тогда
		Если КлючВарианта = "СверкаПоРегистраторам" Тогда
			СписокЯчеек.Удалить(ЯчейкаКОбъединению);
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли