
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	СуммаКоэффициентов =
		Коэффициент1
		+ Коэффициент2
		+ Коэффициент3
		+ Коэффициент4
		+ Коэффициент5
		+ Коэффициент6
		+ Коэффициент7
		+ Коэффициент8
		+ Коэффициент9
		+ Коэффициент10
		+ Коэффициент11
		+ Коэффициент12;
	
	Если СуммаКоэффициентов = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Необходимо заполнить один или несколько коэффициентов годового графика амортизации';
				|en = 'Fill in one or several factors of the annual depreciation schedule'"),
			ЭтотОбъект, "Коэффициент1",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли