
Функция А_ПолучитьОрганизациюУпр() Экспорт
	
	Возврат Справочники.Организации.НайтиПоРеквизиту("КодПоЕДРПОУ","40645273"); //ТОВ "ІНДАСТРІАЛБУД"
	
КонецФункции //

 Функция А_ПроверкаВыбораЗаказаВДокументахПрихода(ЗаказПоставщику) Экспорт
 
 	     Запрос = Новый Запрос;
		 Запрос.УстановитьПараметр("ЗаказПоставщику",ЗаказПоставщику);
		 Запрос.Текст =   "ВЫБРАТЬ
		                  |	ПоступлениеТоваровНаСклад.Ссылка КАК Ссылка
		                  |ИЗ
		                  |	Документ.ПриобретениеТоваровУслуг КАК ПоступлениеТоваровНаСклад
		                  |ГДЕ
		                  |	ПоступлениеТоваровНаСклад.ЗаказПоставщику = &ЗаказПоставщику
		                  |	И ПоступлениеТоваровНаСклад.Проведен" ;
		 
		 Пустой = Запрос.Выполнить().Пустой();
		 Если НЕ Пустой Тогда
		 
		 	 Возврат Истина
			 
		 Иначе
			 Возврат Ложь;
		 
		 КонецЕсли; 
 
 КонецФункции // ()