#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(0));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
		
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2017УФ";
	НоваяФорма.ОписаниеОтчета     = "Затверджена наказом Міністерства доходів і сборів України від 18.01.2016  № 8 (зі змінами згідно наказу Мінфина №468 від 28.04.2017)";
	НоваяФорма.ДатаНачалоДействия = '2016-01-01';
	НоваяФорма.ДатаКонецДействия  = '2017-12-31';	
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2019УФ";
	НоваяФорма.ОписаниеОтчета     = "Затверджена наказом Міністерства фінансів України від 18.01.2016  № 8 (зі змінами згідно наказів Мінфина №468 від 28.04.2017 та №242 від 10.06.2019)";
	НоваяФорма.ДатаНачалоДействия = '2018-01-01';
	НоваяФорма.ДатаКонецДействия  = '2019-12-31';	
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2021УФ";
	НоваяФорма.ОписаниеОтчета     = "Затверджена наказом Міністерства фінансів України від 18.01.2016 №8 (зі змінами згідно наказів №468 від 28.04.2017, №242 від 10.06.2019, №841 від 31.12.2020)";
	НоваяФорма.ДатаНачалоДействия = '2020-01-01';
	НоваяФорма.ДатаКонецДействия  = '2022-12-31';	
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2024УФ";
	НоваяФорма.ОписаниеОтчета     = "Затверджена наказом Міністерства фінансів України від 18.01.2016 №8 (зі змінами згідно наказів №673 від 07.12.2023 та №725 від 27.12.2023)";
	НоваяФорма.ДатаНачалоДействия = '2023-01-01';
	НоваяФорма.ДатаКонецДействия  = Неопределено;
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДеревоФормИФорматов() Экспорт
	
	ФормыИФорматы = Новый ДеревоЗначений;
	ФормыИФорматы.Колонки.Добавить("Код");
	ФормыИФорматы.Колонки.Добавить("ДатаПриказа");
	ФормыИФорматы.Колонки.Добавить("НомерПриказа");
	ФормыИФорматы.Колонки.Добавить("ДатаНачалаДействия");
	ФормыИФорматы.Колонки.Добавить("ДатаОкончанияДействия");
	ФормыИФорматы.Колонки.Добавить("ИмяОбъекта");
	ФормыИФорматы.Колонки.Добавить("Описание");          
	
	Возврат ФормыИФорматы;
	
КонецФункции

//Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
//			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
//	
//	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
//	НовСтр.Код = СокрЛП(Код);
//	НовСтр.ДатаПриказа = ДатаПриказа;
//	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
//	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
//	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
//	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
//	НовСтр.Описание = СокрЛП(Описание);
//	Возврат НовСтр;
//	
//КонецФункции

#КонецЕсли