#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	БухгалтерскиеОтчетыПереопределяемый.ПередПроверкойЗаполнения(ЭтотОбъект);
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
	Для Каждого ВидСубконто Из СписокВидовСубконто Цикл
		Если НЕ ЗначениеЗаполнено(ВидСубконто.Значение) Тогда
			ТекстСообщения = НСтр("ru = 'Список видов субконто не заполнен';
									|en = 'List of the extra dimension types is not filled in'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.СписокВидовСубконто",, Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ВидСубконто Из СписокВидовКорСубконто Цикл
		Если НЕ ЗначениеЗаполнено(ВидСубконто.Значение) Тогда
			ТекстСообщения = НСтр("ru = 'Список видов кор. субконто не заполнен';
									|en = 'List of cor extra dimension types is not filled in'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.СписокВидовКорСубконто",, Отказ);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	МаксКоличествоСубконто = БухгалтерскийУчет.МаксимальноеКоличествоСубконто();
	Если СписокВидовСубконто.Количество() > МаксКоличествоСубконто Тогда
		ТекстСообщения = НСтр("ru = 'Выбрано слишком много видов субконто, максимально допустимо %1';
								|en = 'Too many extra dimension types are selected, maximum allowed number is %1'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстСообщения, МаксКоличествоСубконто),, "Отчет.СписокВидовСубконто",, Отказ);
	КонецЕсли;
	
	Если СписокВидовКорСубконто.Количество() > МаксКоличествоСубконто Тогда
		ТекстСообщения = НСтр("ru = 'Выбрано слишком много видов кор. субконто, максимально допустимо %1';
								|en = 'Too many cor. extra dimension types are selected, maximum allowed number is %1'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(ТекстСообщения, МаксКоличествоСубконто),, "Отчет.СписокВидовКорСубконто",, Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли