////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПолучениеШаблонов

// Возвращает Структуру параметров для заполнения разделов и позиций в смете.
//
// Параметры:
//     ЛокальнаяСмета - ДокументСсылкаСсылка.СМ_ЛокальнаяСмета - документ для выбора шаблонов.
//
// Возвращаемое значение:
//     СтруктураДерева - Структура - содержит поля:
//          * ЗаполнитьИзШаблона	- Булево - удалось или нет получить шаблон.
//			* ДеревоРазделов		- ДеревоЗначений - дерево для создания разделов.
//			* НаборШифров			- ТаблицаЗначений - таблица для создания позиций в разделах.
//
Функция ПолучитьДанныеИзХранилищаДереваРазделов(ЛокальнаяСмета) ЭКспорт 
	
	ХранилищеДереваСметы = Неопределено;
	ХранилищеДереваРазделов = Неопределено;
	
	СтруктураДерева = Новый Структура();
	СтруктураДерева.Вставить("ЗаполнитьИзШаблона", Ложь);
	СтруктураДерева.Вставить("ДеревоРазделов", Неопределено);
	СтруктураДерева.Вставить("НаборШифров", Неопределено);
	
	Если ЗначениеЗаполнено(ЛокальнаяСмета.ШаблонСметы) Тогда
	
		ХранилищеДереваСметы = ЛокальнаяСмета.ШаблонСметы.ХранилищеДереваРазделов.Получить();
		Если ХранилищеДереваСметы = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось заполнить состав сметы. Некорректно заполнен шаблон сметы.'"));
			Возврат СтруктураДерева;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЛокальнаяСмета.ШаблонРазделовСметы) Тогда
	
		ХранилищеДереваРазделов = ЛокальнаяСмета.ШаблонРазделовСметы.ХранилищеДереваРазделов.Получить();
		Если ХранилищеДереваРазделов = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось заполнить состав сметы. Некорректно заполнен шаблон разделов сметы.'"));
			Возврат СтруктураДерева;
		КонецЕсли;
		
	КонецЕсли;

	Если (ХранилищеДереваРазделов = Неопределено) и (ХранилищеДереваСметы = Неопределено) Тогда
		Возврат СтруктураДерева;
	КонецЕсли;
			
	Если ХранилищеДереваРазделов <> Неопределено Тогда
		
		Если ХранилищеДереваРазделов.Свойство("ДеревоРазделов")
			И ХранилищеДереваРазделов.ДеревоРазделов = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось заполнить состав сметы. Некорректно заполнен шаблон разделов сметы.'"));
			Возврат СтруктураДерева;
		Иначе
			СтруктураДерева.ДеревоРазделов = ХранилищеДереваРазделов.ДеревоРазделов;
		КонецЕсли;
		
	ИначеЕсли ХранилищеДереваСметы <> Неопределено Тогда
		
		Если ХранилищеДереваСметы.Свойство("ДеревоРазделов")
			И ХранилищеДереваСметы.ДеревоРазделов = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось заполнить состав сметы. Некорректно заполнен шаблон сметы.'"));
			Возврат СтруктураДерева;
		Иначе
			СтруктураДерева.ДеревоРазделов = ХранилищеДереваСметы.ДеревоРазделов;
		КонецЕсли;
		
		Если ХранилищеДереваСметы.Свойство("НаборШифров")
			И ХранилищеДереваСметы.НаборШифров = Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось заполнить состав сметы. Некорректно заполнен шаблон сметы.'"));
			Возврат СтруктураДерева;
		Иначе	
			СтруктураДерева.НаборШифров = ХранилищеДереваСметы.НаборШифров;
			
			// ЗначениеВРеквизитФормы(ХранилищеДереваРазделов.НаборШифров, "НаборШифров");
		КонецЕсли;
	КонецЕсли; 
	
	СтруктураДерева.ЗаполнитьИзШаблона = (ХранилищеДереваРазделов <> Неопределено) ИЛИ (ХранилищеДереваСметы <> Неопределено);
	
	Возврат СтруктураДерева;
		
КонецФункции

#КонецОбласти

#Область КонтрольШаблонов

// Проверяет - соответствует ли раздел шаблону сметы.
//
// Параметры:
//     ЛокальнаяСмета 	- ДокументСсылка.СМ_ЛокальнаяСмета - документ для выбора шаблонов.
//     ВыбранныйРаздел 	- СправочникСсылка.СМ_РазделыЛокальнойСметы - добавляемый раздел.
//     РазделРодитель 	- ДокументСсылка.СМ_РазделЛокальнойСметы - раздел, куда вставляется,
//						  если не заполнен или равен смете - вставляем в корень.
//
// Возвращаемое значение:
//     ВключенВШаблон - Булево - Истина, если проверка пройдена.
//
Функция РазделСоответствуетШаблону(ЛокальнаяСмета, ВыбранныйРаздел, РазделРодитель = Неопределено) Экспорт 
	
	Если (Не ЗначениеЗаполнено(ЛокальнаяСмета.ШаблонРазделовСметы)) Или
		(ЛокальнаяСмета.ШаблонРазделовСметы.НеКонтролироватьСметы) Тогда
		// если шаблона нет или отключен контроль - он пройден. 
		Возврат Истина;
	КонецЕсли;
	
	ХранилищеДереваРазделов = ЛокальнаяСмета.ШаблонРазделовСметы.ХранилищеДереваРазделов.Получить();
	Если ХранилищеДереваРазделов = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось заполнить состав сметы. Некорректно заполнен шаблон разделов сметы.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ДеревоРазделов = Новый ДеревоЗначений();
	
	Если ХранилищеДереваРазделов.Свойство("ДеревоРазделов")
		И ХранилищеДереваРазделов.ДеревоРазделов = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не удалось заполнить состав сметы. Некорректно заполнен шаблон разделов сметы.'"));
		Возврат Ложь;
	Иначе
		ДеревоРазделов = ХранилищеДереваРазделов.ДеревоРазделов;
	КонецЕсли;

	ПараметрыОтбора = Новый Структура();
	ПараметрыОтбора.Вставить("Раздел", ВыбранныйРаздел);
	МассивСтрок = ДеревоРазделов.Строки.НайтиСтроки(ПараметрыОтбора, Истина);	
	
	Если МассивСтрок.Количество() > 0 Тогда
		// в дереве найдены разделы, сравним с родителем.
		Если (Не ЗначениеЗаполнено(РазделРодитель)) или (ТипЗнч(РазделРодитель)<>Тип("ДокументСсылка.СМ_РазделЛокальнойСметы")) Тогда
			Родитель = Неопределено;
		ИначеЕсли (Не ЗначениеЗаполнено(РазделРодитель.Раздел)) Тогда
			Родитель = Неопределено;
		Иначе
			Родитель = РазделРодитель.Раздел;
		КонецЕсли;
		ВключенВШаблон = Ложь;
		Для Каждого СтрокаМассива Из МассивСтрок Цикл
			Если Не ВключенВШаблон Тогда
				// Еще не найдено.
				Если (СтрокаМассива.Родитель = Неопределено) Тогда
					ВключенВШаблон = (Родитель = Неопределено);	
				ИначеЕсли (СтрокаМассива.Родитель = ДеревоРазделов.Строки[0]) Тогда
					ВключенВШаблон = (Родитель = Неопределено);
				Иначе
					ВключенВШаблон = (СтрокаМассива.Родитель.Раздел = Родитель); 
				КонецЕсли;
				Если ВключенВШаблон Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Возврат ВключенВШаблон;
	Иначе
		// в шаблоне раздел не разрешен.
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

#КонецОбласти

#КонецОбласти

