
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументУтверждения") Тогда
		
		Сценарий = Параметры.ДокументУтверждения.КопияСценария;
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Сценарий",Сценарий);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_СтроительныеРаботы.ВидРабот КАК ВидРабот
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
		|ГДЕ
		|	УСОERP_СтроительныеРаботы.Владелец = &Сценарий
		|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
		|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
		|	И УСОERP_СтроительныеРаботы.ВидРабот <> ЗНАЧЕНИЕ(Справочник.УСОERP_ВидыРабот.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_СтроительныеРаботы.ВидРабот";
		
		СписокЗначений = Новый СписокЗначений;
		СписокЗначений.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидРабот"));
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", СписокЗначений, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		
	КонецЕсли;
	
КонецПроцедуры
