
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
//++ НЕ УТ
	УстановитьПривилегированныйРежим(Истина);
	
//++ НЕ УТКА
	ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
	ПараметрыНабора.Используется = Константы.ИспользоватьУправлениеПроизводством.Получить();
	
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_ЗаказНаПроизводство", ПараметрыНабора);
	УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Документ_МаршрутныйЛистПроизводства", ПараметрыНабора);
	
	ПланированиеПроизводства.ПроверитьОтключитьРегламентноеЗаданиеРасчетГрафикаПроизводства();
	
	ВариантОбособления = Константы.ВариантОбособленияМатериаловВПроизводстве.Получить();
	Если ЭтотОбъект.Значение И Не Константы.ИспользоватьУправлениеПроизводством2_2.Получить()
		И ВариантОбособления <> Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НаправлениеДеятельности
		И ВариантОбособления <> Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции Тогда
		
		Константы.ВариантОбособленияМатериаловВПроизводстве.Установить(
			Перечисления.ВариантыОбособленияМатериаловВПроизводстве.НазначениеПродукции);
		
	КонецЕсли;
	
	Справочники.СтруктураПредприятия.ЗаполнитьИспользуемыеМетодикиУправления();
//-- НЕ УТКА
	
	УстановитьПривилегированныйРежим(Ложь);
//-- НЕ УТ
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
