#Область ПрограммныйИнтерфейс

// Информация о внешней компоненте по идентификатору и версии.
//
// Параметры:
//  Идентификатор - Строка - идентификатор объекта внешней компоненты.
//  Версия - Строка - (необязательный) версия компоненты. 
//
// Возвращаемое значение:
//  Структура - информация о компоненте
//      * Существует - Булево - признак отсутствия компоненты.
//      * ОписаниеОшибки - Строка - краткое описание ошибки.
//      * Идентификатор - Строка - идентификатор объекта внешней компоненты.
//      * Версия - Строка - версия компоненты.
//      * Наименование - Строка - наименование и краткая информация о компоненте.
//
// Пример:
//
//  Результат = ВнешниеКомпонентыВызовСервера.ИнформацияОКомпоненте("InputDevice", "8.1.7.10");
//
//  Если Результат.Существует Тогда
//      Идентификатор = Результат.Идентификатор;
//      Версия        = Результат.Версия;
//      Наименование  = Результат.Наименование;
//  Иначе
//      ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ОписаниеОшибки);
//  КонецЕсли;
//
Функция ИнформацияОКомпоненте(Идентификатор, Версия = Неопределено) Экспорт
	
	Результат = РезультатИнформацияОКомпоненте();
	Результат.Идентификатор = Идентификатор;
	Результат.Существует = Ложь;
	
	Информация = ВнешниеКомпонентыСлужебный.ИнформацияОСохраненнойКомпоненте(Идентификатор, Версия);
	
	Если Информация.Состояние = "НеНайдена"
		Или Информация.Состояние = "НайденаВОбщемХранилище" Тогда
		Результат.ОписаниеОшибки = НСтр("ru='Внешняя компонента не найдена';uk='Зовнішня компонента не знайдена'");
		Возврат Результат;
	КонецЕсли;
	
	Результат.Существует = Истина;
	
	Если Информация.Состояние = "ОтключенаАдминистратором" Тогда
		Результат.ОписаниеОшибки = НСтр("ru='Внешняя компонента отключена';uk='Зовнішня компонента відключена'");
	КонецЕсли;
	
	Результат.Версия = Информация.Реквизиты.Версия;
	Результат.Наименование = Информация.Реквизиты.Наименование;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РезультатИнформацияОКомпоненте()
	
	Результат = Новый Структура;
	Результат.Вставить("Существует");
	Результат.Вставить("Идентификатор");
	Результат.Вставить("Версия");
	Результат.Вставить("Наименование");
	Результат.Вставить("ОписаниеОшибки");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти