#Область СлужебныеПроцедурыИФункции

Функция ПечатьПротокола(ТаблСтрок,ЛС) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
	ПростойШаблон = Обработки.СМ_ПодменаБазы.ПолучитьМакет("ПростойШаблон");
	ОбластьЗаголовок = ПростойШаблон.ПолучитьОбласть("Заголовок");
	ОбластьЗаголовок.Параметры.НаименованиеСметы = СокрЛП(ЛС.НомерСметы) + "   " + СокрЛП(ЛС.Наименование);
	ТабличныйДокумент.Присоединить(ОбластьЗаголовок);
	ОбластьЗаголовок = ПростойШаблон.ПолучитьОбласть("Шапка");
	ТабличныйДокумент.Присоединить(ОбластьЗаголовок);
	ОбластьДетальная = ПростойШаблон.ПолучитьОбласть("ДетальнаяСтрока");
	ОбластьРаздел = ПростойШаблон.ПолучитьОбласть("Раздел");
	Если ТаблСтрок.Количество() = 0 Тогда
		НаимРаздела = НСтр("ru='Все расценки найдены'");
		ОбластьРаздел.Параметры.НаимРаздела = НаимРаздела;
		ТабличныйДокумент.Присоединить(ОбластьРаздел);
	Иначе		
		ТаблСтрок.Сортировать("НомерВДереве");
		СохрРодитель = "";
		Для Каждого Позиция Из ТаблСтрок Цикл
			Если СохрРодитель <> Позиция.Родитель Тогда
				Если ТипЗнч(Позиция.Родитель) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
					НаимРаздела = СокрЛП(Позиция.Родитель.НаименованиеДляПечати);
					ОбластьРаздел.Параметры.НаимРаздела = НаимРаздела;
					СохрРодитель = Позиция.Родитель;
					ТабличныйДокумент.Присоединить(ОбластьРаздел);
				КонецЕсли;	
			КонецЕсли;
			ОбластьДетальная.Параметры.НомерВДереве = Позиция.НомерПозиции;
			ОбластьДетальная.Параметры.Шифр = Позиция.Шифр;
			ОбластьДетальная.Параметры.Наименование = Позиция.Наименование;
			ОбластьДетальная.Параметры.РегиональнаяБаза =  СокрЛП(Позиция.РегиональнаяБаза.Наименование);
			ТабличныйДокумент.Присоединить(ОбластьДетальная);
		КонецЦикла;
	КонецЕсли;
	Возврат ТабличныйДокумент;
	
КонецФункции	

#КонецОбласти