&НаКлиенте
Перем КэшированныеЗначения; 
Перем м_тзВершиныГрафа, м_тзРебраГрафа,м_тзТаблицаЗавершенностиРабот,м_тзДоступныеРесурсы; //тз вершины графа ,тз ребра графа ,тз таблица завершенности работ ,тз доступные ресурсы ;
//Перем ДатаСтарта;
Перем м_тзГрафики; //тз графики ;
Перем м_тзРаботы;//для расчета Критичности работ
Перем м_тзРебраГрафаКопия;//для рассчета работ "как можно позже"
Перем м_ДатаНачалаСценария,м_ДатаОкончанияСценария; // дата начала сценария , дата окончания сценария ;
Перем м_УчитыватьРесурсы;
Перем м_ВыводитьСообщения;
Перем м_ФатальнаяОшибка;

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДопПараметрыПоПеременнымМодуля()
	
	ДопПараметры = Новый Структура;
	
	ДопПараметры.Вставить("м_тзВершиныГрафа", м_тзВершиныГрафа);
	ДопПараметры.Вставить("м_тзРебраГрафа", м_тзРебраГрафа);
	ДопПараметры.Вставить("м_тзТаблицаЗавершенностиРабот", м_тзТаблицаЗавершенностиРабот);
	ДопПараметры.Вставить("м_тзДоступныеРесурсы", м_тзДоступныеРесурсы);
	
	ДопПараметры.Вставить("м_тзГрафики", м_тзГрафики);
	ДопПараметры.Вставить("м_тзРаботы", м_тзРаботы);
	ДопПараметры.Вставить("м_тзРебраГрафаКопия", м_тзРебраГрафаКопия);
	
	ДопПараметры.Вставить("м_ДатаНачалаСценария", м_ДатаНачалаСценария);
	ДопПараметры.Вставить("м_ДатаОкончанияСценария", м_ДатаОкончанияСценария);
	
	//ДопПараметры.Вставить("м_ДатаСтарта", м_ДатаСтарта);
	ДопПараметры.Вставить("м_УчитыватьРесурсы", м_УчитыватьРесурсы);
	ДопПараметры.Вставить("м_ВыводитьСообщения", м_ВыводитьСообщения);
	ДопПараметры.Вставить("м_ФатальнаяОшибка", м_ФатальнаяОшибка);
	
	Возврат ДопПараметры;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры)
	
	м_тзВершиныГрафа = ДопПараметры.м_тзВершиныГрафа;
	м_тзРебраГрафа = ДопПараметры.м_тзРебраГрафа;
	м_тзТаблицаЗавершенностиРабот = ДопПараметры.м_тзТаблицаЗавершенностиРабот;
	м_тзДоступныеРесурсы = ДопПараметры.м_тзДоступныеРесурсы;
	
	м_тзГрафики = ДопПараметры.м_тзГрафики;
	м_тзРаботы = ДопПараметры.м_тзРаботы;
	м_тзРебраГрафаКопия = ДопПараметры.м_тзРебраГрафаКопия;
	
	м_ДатаНачалаСценария = ДопПараметры.м_ДатаНачалаСценария;
	м_ДатаОкончанияСценария = ДопПараметры.м_ДатаОкончанияСценария;
	
	//м_ДатаСтарта = ДопПараметры.м_ДатаСтарта;
	м_УчитыватьРесурсы = ДопПараметры.м_УчитыватьРесурсы;
	м_ВыводитьСообщения = ДопПараметры.м_ВыводитьСообщения;
	м_ФатальнаяОшибка = ДопПараметры.м_ФатальнаяОшибка;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ОбъектСтроительства 		= Параметры.ОбъектСтроительства;
	СценарийПланирования 		= Параметры.СценарийПланирования;	
	Организация                 = СценарийПланирования.Организация;
	ВидПланирования         	= Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Календарный;
	ТекущийПользователь 		= Пользователи.ТекущийПользователь();
	ЕдиницыИзмеренияВремениЧас 	= Перечисления.ЕдиницыИзмеренияВремени.Час;
	ГлубинаДереваРаботСтарая    = 0;
	ТекущаяОрганизация			= Организация;
	
	//НаДату = ТекущаяДата();
	
	
	Если НЕ ЗначениеЗаполнено(СценарийПланирования) Тогда 
		Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда 
			СценарийПланирования	= Параметры.Отбор.Владелец;	
			Организация				= Параметры.Отбор.Владелец.Организация;
		КонецЕсли;	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ОбъектСтроительства) И ЗначениеЗаполнено(СценарийПланирования) Тогда 
		ОбъектСтроительства	= СценарийПланирования.Владелец;	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ОбъектСтроительства) И ЗначениеЗаполнено(СценарийПланирования) Тогда 
		ОбъектСтроительства	= СценарийПланирования.Владелец;	
	КонецЕсли;	
	
	
	ЭтаФорма.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сценарий планирования ""%2"" объекта строительства ""%1""'"),
		Строка(ОбъектСтроительства), Строка(СценарийПланирования));
			
	РеквизитыОбъектаСтроительства = Новый Структура;
	РеквизитыОбъектаСтроительства.Вставить("Ссылка", 				ОбъектСтроительства);
	РеквизитыОбъектаСтроительства.Вставить("ПлановаяДатаНачала",    ОбъектСтроительства.НачалоСтроительства);
	РеквизитыОбъектаСтроительства.Вставить("ПлановаяДатаОкончания", ОбъектСтроительства.НачалоСтроительства);
	РеквизитыОбъектаСтроительства.Вставить("ГрафикРаботы",          ОбъектСтроительства.ГрафикРаботы);
	
	РеквизитыСценарияПланирования = Новый Структура;
	РеквизитыСценарияПланирования.Вставить("Ссылка", 				СценарийПланирования);
	РеквизитыСценарияПланирования.Вставить("ПлановаяДатаНачала",    СценарийПланирования.НачалоСтроительства);
	РеквизитыСценарияПланирования.Вставить("ПлановаяДатаОкончания", СценарийПланирования.ОкончаниеСтроительства);
	РеквизитыСценарияПланирования.Вставить("ВидСценария",          	СценарийПланирования.ВидСценария);
	
	АдресДанныхДереваРабот = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	НаДату = ПолучитьПоследнююДатуРедактированияСценария(СценарийПланирования);
	
	ЗаполнитьДеревоРабот();
	
	УстановитьУсловноеОформление();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Для Каждого Строка Из ДеревоРабот.ПолучитьЭлементы() Цикл
		Элементы.ДеревоРабот.Развернуть(Строка.ПолучитьИдентификатор(), Истина);
	КонецЦикла;	
	
	Элементы.ДеревоРаботОтобразитьМатериалы.Пометка = Ложь;
	Элементы.ГруппаМатериалы.Видимость 				= Ложь;	
	Элементы.ДеревоРаботОтобразитьРесурсы.Пометка 	= Ложь;
	Элементы.ГруппаРесурсы.Видимость 				= Ложь;	
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененаРабота" И Параметр.СценарийПланирования = СценарийПланирования  Тогда 
		
		Индекс = -1;
		УСОERP_УправлениеСтроительнымПроизводствомКлиент.НайтиРаботуВДеревеПоСсылке(ДеревоРабот.ПолучитьЭлементы(), Параметр.Работа, Индекс);
		
		НайденнаяСтрока = ДеревоРабот.НайтиПоИдентификатору(Индекс);
		Если НайденнаяСтрока = Неопределено ИЛИ Параметр.Родитель <> НайденнаяСтрока.РодительскаяРабота Тогда 
			ОбновитьДеревоРабот();
		Иначе	
			ОбновитьИзмененныеСтрокиРабот(Параметр.МассивИзмененныхРабот);
		КонецЕсли;	
		
	КонецЕсли;	
		
	Если ИмяСобытия = "СозданаРабота" И Параметр.СценарийПланирования = СценарийПланирования Тогда  	
		
		Если ЗначениеЗаполнено(Параметр.Родитель) Тогда 
			Индекс = -1;
			УСОERP_УправлениеСтроительнымПроизводствомКлиент.НайтиРаботуВДеревеПоСсылке(ДеревоРабот.ПолучитьЭлементы(), Параметр.Родитель, Индекс);
			
			НоваяСтрока = ДеревоРабот.НайтиПоИдентификатору(Индекс).ПолучитьЭлементы().Добавить();
		Иначе
			НоваяСтрока = ДеревоРабот.ПолучитьЭлементы().Добавить();
		КонецЕсли;	
		НоваяСтрока.Ссылка	= Параметр.Работа;
		Элементы.ДеревоРабот.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		
		МассивИзмененныхРабот = Новый Массив;
		МассивИзмененныхРабот.Добавить(Параметр.Работа);
		
		Для Каждого Строка Из Параметр.МассивИзмененныхРабот Цикл
			МассивИзмененныхРабот.Добавить(Строка);
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Параметр.Родитель) Тогда 
			МассивИзмененныхРабот.Добавить(Параметр.Родитель);	
		КонецЕсли;	
		
		ОбновитьИзмененныеСтрокиРабот(МассивИзмененныхРабот);
		
	КонецЕсли;
		

КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	ОбъектСтроительстваПриИзмененииНаСервере();
	СценарийПланированияПриИзмененииНаСервере();
	
	ОбновитьКнопкиСвернутьДоУровня();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.НаДату.Доступность = ВариантДаты = 1;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследнююДатуРедактированияСценария(Сценарий)
	
	Если НЕ ЗначениеЗаполнено(Сценарий) Тогда
		Возврат НачалоДня(ТекущаяДатаСеанса());
	КонецЕсли;  	
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Сценарий",Сценарий);	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(УСОERP_ПараметрыВыполненияРаботСрезПоследних.Период) КАК Период,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.Владелец
	|ИЗ
	|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
	|			,
	|			Работа.Владелец = &Сценарий
	|				И НЕ Утверждена
	|				И ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Календарный)) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.Владелец";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Период;
		
	КонецЕсли;	
	
	Возврат НачалоДня(ТекущаяДатаСеанса());	
	
КонецФункции



&НаКлиенте
Процедура СценарийПланированияПриИзменении(Элемент)
	
	СценарийПланированияПриИзмененииНаСервере();
	
		
	ОбновитьКнопкиСвернутьДоУровня();
	
КонецПроцедуры

#Область ПроцедурыДерева
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕРЕВО Работ
&НаСервере
Процедура ОбъектСтроительстваПриИзмененииНаСервере()
	
	Если НЕ ОбъектСтроительства = СценарийПланирования.Владелец Или ЗначениеЗаполнено(СценарийПланирования) Тогда 
		СценарийПланирования	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(ОбъектСтроительства, Организация);
	КонецЕсли;	
	РеквизитыОбъектаСтроительства.Ссылка                = ОбъектСтроительства;
	РеквизитыОбъектаСтроительства.ПлановаяДатаНачала    = ОбъектСтроительства.НачалоСтроительства;
	РеквизитыОбъектаСтроительства.ПлановаяДатаОкончания = ОбъектСтроительства.ОкончаниеСтроительства;
	РеквизитыОбъектаСтроительства.ГрафикРаботы          = ОбъектСтроительства.ГрафикРаботы;
	
	ТекущийСценарийПланирования = СценарийПланирования;
	
КонецПроцедуры

&НаСервере
Процедура СценарийПланированияПриИзмененииНаСервере()
	
	НаДату = ПолучитьПоследнююДатуРедактированияСценария(СценарийПланирования);
	
	ЭтаФорма.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сценарий планирования ""%2"" объекта строительства ""%1""'"),
		Строка(ОбъектСтроительства), Строка(СценарийПланирования));

	РеквизитыСценарияПланирования.Ссылка                = СценарийПланирования;
	РеквизитыСценарияПланирования.ПлановаяДатаНачала    = СценарийПланирования.НачалоСтроительства;
	РеквизитыСценарияПланирования.ПлановаяДатаОкончания = СценарийПланирования.ОкончаниеСтроительства;
	РеквизитыСценарияПланирования.ВидСценария          	= СценарийПланирования.ВидСценария;
	
	ЗаполнитьДеревоРабот();
	
	Т = ГрафикиРаботы.РасписанияРаботыНаПериод(РеквизитыОбъектаСтроительства.ГрафикРаботы, РеквизитыСценарияПланирования.ПлановаяДатаНачала, РеквизитыСценарияПланирования.ПлановаяДатаОкончания);	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоРабот()
	
	Если НЕ Организация.Пустая()
		И НЕ ОбъектСтроительства.Пустая() 
		И НЕ СценарийПланирования.Пустая() Тогда
		
		УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ЗаполнитьДеревоРабот(ЭтотОбъект);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокуДереваИзРаботы(ЭлементДерева, Работа, ТекущиеПредшественники) Экспорт
	
	Если ТипЗнч(ЭлементДерева) = Тип("Число") Тогда 
		ЭлементДерева = ДеревоРабот.НайтиПоИдентификатору(ЭлементДерева);
	КонецЕсли;	
	
	СписокРеквизитов1 = 
	"Наименование, 
	|Родитель,
	|КодСДР, 
	|ВерсияДанных,	
	|Владелец, 
	|СуммарнаяРабота,	
	|Ссылка,
	|ГрафикРаботы,		
	|ПометкаУдаления";
	
	СписокРеквизитов2 = 
	"ОбъемРаботы,
	|ЕдиницаОбъема,	
	|ПиктограммаИнформацииОбЗанесенииВМесячныеПланыИНедельноСуточныеПланы,	
	|НачалоРаботыПлан, 
	|ОкончаниеРаботыПлан, 
	|ЕдиницаДлительности,	
	|ДлительностьПлан,
	|КритическаяРабота"; 
	
	
	Если ТипЗнч(Работа) = Тип("СправочникСсылка.УСОERP_СтроительныеРаботы") Тогда 
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Работа, СписокРеквизитов1);	
		
		ДанныеРаботы = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Работа, ВидПланирования, КонецДня(НаДату));
		СтруктураРеквизитов2 = Новый Структура(СписокРеквизитов2);
		Для Каждого Строка Из СтруктураРеквизитов2 Цикл
			Если Строка.Ключ = "ПиктограммаИнформацииОбЗанесенииВМесячныеПланыИНедельноСуточныеПланы" Тогда 
				Продолжить;
			КонецЕсли;	
			Реквизиты.Вставить(Строка.Ключ, ДанныеРаботы[Строка.Ключ]);
		КонецЦикла;	
		ДанныеРаботыМ = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Работа, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.Месячный, КонецДня(НаДату));
		ДанныеРаботыН = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Работа, Перечисления.УСОERP_ВидыПланированияСтроительныхРабот.НедельноСуточный, КонецДня(НаДату));
		ПиктограммаИнформацииОбЗанесенииВМесячныеПланыИНедельноСуточныеПланы = "";
		Если ЗначениеЗаполнено(ДанныеРаботыМ.ВидПланирования) Тогда 
			ПиктограммаИнформацииОбЗанесенииВМесячныеПланыИНедельноСуточныеПланы = "" + "М";	
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДанныеРаботыН.ВидПланирования) Тогда 
			ПиктограммаИнформацииОбЗанесенииВМесячныеПланыИНедельноСуточныеПланы = ПиктограммаИнформацииОбЗанесенииВМесячныеПланыИНедельноСуточныеПланы + "Н";	
		КонецЕсли;	
		Реквизиты.Вставить("ПиктограммаИнформацииОбЗанесенииВМесячныеПланыИНедельноСуточныеПланы", ПиктограммаИнформацииОбЗанесенииВМесячныеПланыИНедельноСуточныеПланы);
	Иначе
		Реквизиты = Работа;
	КонецЕсли;	
	
	СписокРеквизитов	= СписокРеквизитов1 + "," + СписокРеквизитов2;
	СписокРеквизитов 	= СтрЗаменить(СписокРеквизитов, "Родитель,", "");
	
	ЗаполнитьЗначенияСвойств(ЭлементДерева, Реквизиты, СписокРеквизитов);
	
	ЭлементДерева.ИндексКартинки 		= ?(ЭлементДерева.ПометкаУдаления, 3, 2);
	ЭлементДерева.РодительскаяРабота 	= Реквизиты.Родитель;
	ЭлементДерева.Наименование		 	= Реквизиты.Наименование; 
	
	//длительность
	ПодписьДлительность = ПолучитьПодписьДлительности(Реквизиты.ДлительностьПлан, Реквизиты.ЕдиницаДлительности);
	ЭлементДерева.ПодписьДлительность = Строка(Реквизиты.ДлительностьПлан) + " " + ПодписьДлительность;
		
	// предшественники
	ЭлементДерева.Предшественники.Очистить();
	Для Каждого СтрокаТаблЧасти Из ТекущиеПредшественники Цикл
		СтрокаТаблицыЗначений	= ЭлементДерева.Предшественники.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗначений, СтрокаТаблЧасти);
	КонецЦикла;	
	ЭлементДерева.ПодписьПредшественники = ПредставлениеПредшественников(ЭлементДерева.Предшественники, ОбъектСтроительства);

КонецПроцедуры	

&НаСервере
Процедура ОбновитьИзмененныеСтрокиРабот(МассивИзмененныхРабот)

	ОбновленныеРаботы = Новый Массив;
	
	Для Каждого ИзмененнаяРабота Из МассивИзмененныхРабот Цикл
		
		Если ОбновленныеРаботы.Найти(ИзмененнаяРабота) <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		ОбновленныеРаботы.Добавить(ИзмененнаяРабота);
		
		Предшественники	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьСвязиМеждуРаботами(ИзмененнаяРабота, КонецДня(НаДату)); 
		
		Индекс = -1;
		УСОERP_УправлениеСтроительнымПроизводством.НайтиРаботуВДеревеПоСсылке(ДеревоРабот.ПолучитьЭлементы(), ИзмененнаяРабота, Индекс);
		Если Индекс > -1 Тогда 
			СтрокаДерева = ДеревоРабот.НайтиПоИдентификатору(Индекс);
			ЗаполнитьСтрокуДереваИзРаботы(СтрокаДерева, ИзмененнаяРабота, Предшественники);
		КонецЕсли;	
		
	КонецЦикла;	
	
	//ЗаполнитьДиаграммуГанта();
	
КонецПроцедуры	

&НаСервереБезКонтекста
Функция ПредставлениеПредшественников(Предшественники, ОбъектСтроительства)
	
	ПодписьПредшественники = "";
	Для Каждого СтрокаТаблЧасти Из Предшественники Цикл
		
		Если СтрокаТаблЧасти.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало Тогда
			ТипЗависимости = "";
		ИначеЕсли СтрокаТаблЧасти.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.ОкончаниеОкончание Тогда
			ТипЗависимости = НСтр("ru = 'ОО'");
		ИначеЕсли СтрокаТаблЧасти.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.НачалоОкончание Тогда
			ТипЗависимости = НСтр("ru = 'НО'");
		ИначеЕсли СтрокаТаблЧасти.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.НачалоНачало Тогда
			ТипЗависимости = НСтр("ru = 'НН'");
		КонецЕсли;
		
		Задержка = "";
		Если СтрокаТаблЧасти.Задержка > 0 Тогда
			Задержка = " + " + СтрокаТаблЧасти.Задержка + " " + ПолучитьПодписьДлительности(СтрокаТаблЧасти.Задержка, СтрокаТаблЧасти.ЕдиницаЗадержки);
		КонецЕсли;
		
		ПредшественникКодСДР	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблЧасти.РаботаПредшественник, "КодСДР");
		ПодписьПредшественники 	= ПодписьПредшественники
			+ ?(СтрокаТаблЧасти.ОбъектСтроительстваПредшественника = ОбъектСтроительства, "", "Е") + ПредшественникКодСДР 
			+ ТипЗависимости + Задержка +", ";
		
	КонецЦикла;	
	
	Если ПодписьПредшественники <> "" Тогда 
		ПодписьПредшественники = Лев(ПодписьПредшественники, СтрДлина(ПодписьПредшественники)-2);
	КонецЕсли;
	
	Возврат ПодписьПредшественники;
	
КонецФункции	

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьПодписьДлительности(Длительность, ЕдиницаДлительности)
	
	ПодписьДлительность = "";
	
	ЦелаяЧастьДлительность = Цел(Длительность);
	Если ЕдиницаДлительности = ПредопределенноеЗначение("Перечисление.УСОERP_ЕдиницыДлительности.Час") Тогда
		ПодписьДлительность = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПодписьЧасов(ЦелаяЧастьДлительность);		
	ИначеЕсли ЕдиницаДлительности = ПредопределенноеЗначение("Перечисление.УСОERP_ЕдиницыДлительности.День") Тогда
		ПодписьДлительность = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПодписьДней(ЦелаяЧастьДлительность);		
	Иначе
		ПодписьДлительность = НРег(Строка(ЕдиницаДлительности));
	КонецЕсли;
	
	Возврат ПодписьДлительность;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДанныеДоступностиКомандПеремещения(ДеревоРабот, ЭлементыФормы)
	
	ДеревоРаботВверх 			= Истина;
	ДеревоРаботВниз 			= Истина;
	ДеревоРаботНаУровеньВыше 	= Истина;
	ДеревоРаботНаУровеньНиже 	= Истина;
	
	ВыделенныеСтроки = ЭлементыФормы.ДеревоРабот.ВыделенныеСтроки;
	ВыделенныеСтрокиКоличество = ВыделенныеСтроки.Количество();
	
	Для Каждого ВыделеннаяСтрока Из ВыделенныеСтроки Цикл
		СтрокаТекущая 	= ДеревоРабот.НайтиПоИдентификатору(ВыделеннаяСтрока);
		СтрокаРодитель 	= СтрокаТекущая.ПолучитьРодителя();
		
		ДеревоРаботНаУровеньВыше = ДеревоРаботНаУровеньВыше 
			И (СтрокаРодитель <> Неопределено)
			И ВыделенныеСтрокиКоличество = 1
			И Не СтрокаТекущая.ПометкаУдаления;
			
		Если СтрокаРодитель = Неопределено Тогда
			СтрокаРодитель = ДеревоРабот;
		КонецЕсли;
		
		ДеревоРаботНаУровеньНиже = ДеревоРаботНаУровеньНиже 
			И СтрокаРодитель.ПолучитьЭлементы().Индекс(СтрокаТекущая) > 0
			И ВыделенныеСтрокиКоличество = 1
			И Не СтрокаТекущая.ПометкаУдаления;
		
		ДеревоРаботВверх = ДеревоРаботВверх
			И СтрокаРодитель.ПолучитьЭлементы().Индекс(СтрокаТекущая) > 0
			И Не СтрокаТекущая.ПометкаУдаления;
			
		ДеревоРаботВниз = ДеревоРаботВниз
			И СтрокаРодитель.ПолучитьЭлементы().Индекс(СтрокаТекущая) < 
				СтрокаРодитель.ПолучитьЭлементы().Количество() - 1
			И Не СтрокаТекущая.ПометкаУдаления;
			
	КонецЦикла;
	
	ДанныеВозврата = Новый Структура;
	ДанныеВозврата.Вставить("ДеревоРаботВверх", 		ДеревоРаботВверх);
	ДанныеВозврата.Вставить("ДеревоРаботВниз", 			ДеревоРаботВниз);
	ДанныеВозврата.Вставить("ДеревоРаботНаУровеньВыше", ДеревоРаботНаУровеньВыше);
	ДанныеВозврата.Вставить("ДеревоРаботНаУровеньНиже", ДеревоРаботНаУровеньНиже);
		
	Возврат ДанныеВозврата;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандПеремещения(ТекущаяПроектнаяРабота, ДеревоРабот, Элементы)
	
	ДанныеДоступности = ПолучитьДанныеДоступностиКомандПеремещения(ДеревоРабот, Элементы);
	
	Элементы.ДеревоРаботВверх.Доступность 	= ДанныеДоступности.ДеревоРаботВверх;
	Элементы.ДеревоРаботВниз.Доступность 	= ДанныеДоступности.ДеревоРаботВниз;
	
	Элементы.ФормаНаУровеньВыше.Доступность = ДанныеДоступности.ДеревоРаботНаУровеньВыше;
	Элементы.ФормаНаУровеньНиже.Доступность = ДанныеДоступности.ДеревоРаботНаУровеньНиже;
	
КонецПроцедуры

&НаСервере
Процедура НаУровеньНижеСервер(Ссылка, Родитель)
	
	// Вычисляем наличие соседней Работы, в которую помещается текущая Работа
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтроительныеРаботы.Ссылка
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
		|ГДЕ
		|	СтроительныеРаботы.Родитель = &Родитель
		|	И СтроительныеРаботы.Владелец = &СценарийПланирования
		|	И НЕ СтроительныеРаботы.ПометкаУдаления
		|	И СтроительныеРаботы.НомерРаботыВУровне = &НомерВУровне - 1";
		
	Запрос.УстановитьПараметр("Родитель", 				Родитель);
	Запрос.УстановитьПараметр("НомерВУровне", 			Ссылка.НомерРаботыВУровне);
	Запрос.УстановитьПараметр("СценарийПланирования", 	Ссылка.Владелец);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		
		ОбъектРабота 	= Ссылка.ПолучитьОбъект();
		РодительРаботы 	= ОбъектРабота.Родитель;
		ЭтоБылПоследний = ОбъектРабота.НомерРаботыВУровне =  УСОERP_УправлениеСтроительнымПроизводством.ПолучитьМаксимальныйНомерРаботыУровня(
			Ссылка.Владелец,РодительРаботы);
			
		ОбъектРабота.Родитель 			= Выборка.Ссылка;
		ОбъектРабота.НомерРаботыВУровне = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьМаксимальныйНомерРаботыУровня(
			Ссылка.Владелец,
			ОбъектРабота.Родитель) + 1;
			
			ОбъектРабота.КодСДР = ОбъектРабота.Родитель.КодСДР+"."+ОбъектРабота.НомерРаботыВУровне;
			
			ОбъектРабота.Записать();
		
		//УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРРабот(Ссылка.Владелец);
		
		Если НЕ ЭтоБылПоследний Тогда
			Если ЗначениеЗаполнено(РодительРаботы) ТОгда
				УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(РодительРаботы);
			Иначе
				УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРРабот(Ссылка.Владелец); 				
			КонецЕсли;
		КонецЕсли;
		УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(ОбъектРабота.Родитель);	
		
		ПроверитьОчиститьПредшественниковПоследоватей(ОбъектРабота.Ссылка);
		
		УСОERP_УправлениеСтроительнымПроизводством.РассчитатьСценарияПланированияПроектовСтроительстваПоРаботе(ОбъектРабота.Ссылка,ВидПланирования,НаДату,Истина,Новый Массив);
				
		ЗаполнитьДеревоРабот();
		СписокРаскрытыхРабот.Добавить(ТекущаяРабота.Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьОчиститьПредшественниковПоследоватей(Работа)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Работа",Работа);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Ссылка = &Работа
	|ИТОГИ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	ТЗ.Свернуть("Ссылка");
	МассивРодителей = ТЗ.ВыгрузитьКолонку("Ссылка");
	Запрос.УстановитьПараметр("МассивРодителей",МассивРодителей);
	Запрос.УстановитьПараметр("Дата",НаДату);
	РаботаВМассиве = Новый Массив;
	РаботаВМассиве.Добавить(Работа);
	Запрос.УстановитьПараметр("РаботаВМассиве",РаботаВМассиве);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УСОERP_СвязиМеждуРаботамиСрезПоследних.РаботаПоследователь,
	|	УСОERP_СвязиМеждуРаботамиСрезПоследних.РаботаПредшественник,
	|	УСОERP_СвязиМеждуРаботамиСрезПоследних.ТипЗависимости
	|ИЗ
	|	РегистрСведений.УСОERP_СвязиМеждуРаботами.СрезПоследних(
	|			&Дата,
	|			РаботаПоследователь В(&РаботаВМассиве)
	|				И РаботаПредшественник В (&МассивРодителей)) КАК УСОERP_СвязиМеждуРаботамиСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьМенеджерЗаписи();
		МЗ.ОбъектСтроительстваПредшественника = СценарийПланирования.Владелец;
		МЗ.РаботаПоследователь = Работа;
		МЗ.РаботаПредшественник = Выборка.РаботаПредшественник;
		МЗ.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.ПустаяСсылка();
		МЗ.АвторИзмерения = ТекущийПользователь;
		МЗ.Период = НаДату;
		МЗ.Записать(Истина); 		
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивРодителей",РаботаВМассиве);
	Запрос.УстановитьПараметр("Работа",МассивРодителей);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МЗ = РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьМенеджерЗаписи();
		МЗ.ОбъектСтроительстваПредшественника = СценарийПланирования.Владелец;
		МЗ.РаботаПоследователь = Работа;
		МЗ.РаботаПредшественник = Выборка.РаботаПредшественник;
		МЗ.АвторИзмерения = ТекущийПользователь;
		МЗ.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.ПустаяСсылка();
		МЗ.Период = НаДату;
		МЗ.Записать(Истина); 		
		
	КонецЦикла;	
	
КонецПроцедуры


&НаСервере
Процедура НаУровеньВышеСервер(Ссылка, Родитель)
	
	// Выбор всех Работы одного с родителем уровня и сдвигаем номера на один вниз
	МассивРаботУровняРодителя = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьМассивРаботОдногоУровняСУказанной(Ссылка.Владелец, Родитель);
		
	// Подготовка номера для вставки подчиненной Работы на один уровень вверх
	КоличествоЭлементов = МассивРаботУровняРодителя.Количество(); 
	Для Счетчик = 0 по КоличествоЭлементов - 1 Цикл
		Индекс = КоличествоЭлементов - Счетчик - 1;
		Работа = МассивРаботУровняРодителя[Индекс];
		Если Работа.НомерРаботыВУровне > Родитель.НомерРаботыВУровне Тогда
			РаботаОбъект = Работа.ПолучитьОбъект();
			РаботаОбъект.НомерРаботыВУровне = РаботаОбъект.НомерРаботыВУровне + 1;
		Конецесли;
	КонецЦикла;
		
	РаботаОбъект = Ссылка.ПолучитьОбъект();
	РодительРаботы = РаботаОбъект.Родитель;
	РаботаОбъект.Родитель = Родитель.Родитель;
	РаботаОбъект.НомерРаботыВУровне = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьМаксимальныйНомерРаботыУровня(Ссылка.Владелец,РаботаОбъект.Родитель)+1;
	//РаботаОбъект.НомерРаботыВУровне = Родитель.НомерРаботыВУровне + 1;
	РаботаОбъект.КодСДР = ?(ЗначениеЗаполнено(РаботаОбъект.Родитель),РаботаОбъект.Родитель.КодСДР+"."+РаботаОбъект.НомерРаботыВУровне,""+РаботаОбъект.НомерРаботыВУровне);
	
	РаботаОбъект.Записать();
		
	//УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРРабот(Ссылка.Владелец);
	УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(РодительРаботы);
	Если ЗначениеЗаполнено(РаботаОбъект.Родитель) Тогда
		УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(РаботаОбъект.Родитель);
	Иначе  		
		УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(РаботаОбъект.Ссылка); 
	КонецЕсли; 	
		
	ЗаполнитьДеревоРабот();
	СписокРаскрытыхРабот.Добавить(ТекущаяРабота.Родитель);
	
КонецПроцедуры

&НаСервере
Процедура ВверхСервер()
	
	МассивСсылок = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоРабот.ВыделенныеСтроки Цикл
		Ссылка = ДеревоРабот.НайтиПоИдентификатору(ВыделеннаяСтрока).Ссылка;
		Индекс = Неопределено;
		Для Каждого Элемент Из МассивСсылок Цикл
			Если Элемент.НомерРаботыВУровне > Ссылка.НомерРаботыВУровне Тогда
				Индекс = МассивСсылок.Найти(Элемент);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Индекс = Неопределено Тогда
			МассивСсылок.Добавить(Ссылка);
		Иначе
			МассивСсылок.Вставить(Индекс, Ссылка); 
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		// Получение Работы с номером в уровне, меньшим на 1, чем текущий
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СтроительныеРаботы.Ссылка
			|ИЗ
			|	Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
			|ГДЕ
			|	СтроительныеРаботы.Владелец = &Владелец
			|	И СтроительныеРаботы.Родитель = &Родитель
			|	И Не ПометкаУдаления
			|	И СтроительныеРаботы.НомерРаботыВУровне = &НомерРаботыВУровне";
		Запрос.УстановитьПараметр("Владелец", 			Ссылка.Владелец);
		Запрос.УстановитьПараметр("Родитель", 			Ссылка.Родитель);
		Запрос.УстановитьПараметр("НомерРаботыВУровне", Ссылка.НомерРаботыВУровне - 1);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			// сдвиг строк в дереве
			Идентификатор = -1;
			УСОERP_УправлениеСтроительнымПроизводством.НайтиРаботуВДеревеПоСсылке(ДеревоРабот.ПолучитьЭлементы(), Ссылка, Идентификатор);
				
			СтрокаТекущейРаботы = ДеревоРабот.НайтиПоИдентификатору(Идентификатор);
			СтрокаРодительскойРаботы = СтрокаТекущейРаботы.ПолучитьРодителя();
			Если СтрокаРодительскойРаботы = Неопределено Тогда
				СтрокаРодительскойРаботы = ДеревоРабот;	
			КонецЕсли;
			
			ИндексТекущейРаботы = СтрокаРодительскойРаботы.ПолучитьЭлементы().Индекс(СтрокаТекущейРаботы);
			СтрокаРодительскойРаботы.ПолучитьЭлементы().Сдвинуть(ИндексТекущейРаботы, -1);
			
			// изменение реквизитов объектов
			ТекущаяРаботаОбъект    = Ссылка.ПолучитьОбъект();
			ПредыдущаяРаботаОбъект = Выборка.Ссылка.ПолучитьОбъект();		
			
			
			Буфер                                     = ТекущаяРаботаОбъект.НомерРаботыВУровне;
			ТекущаяРаботаОбъект.НомерРаботыВУровне    = ПредыдущаяРаботаОбъект.НомерРаботыВУровне;
			ПредыдущаяРаботаОбъект.НомерРаботыВУровне = Буфер;

			БуферСДР                      = ТекущаяРаботаОбъект.КодСДР;
			ТекущаяРаботаОбъект.КодСДР    = ПредыдущаяРаботаОбъект.КодСДР;
			ПредыдущаяРаботаОбъект.КодСДР = БуферСДР;
			
			ТекущаяРаботаОбъект.Записать();
			ПредыдущаяРаботаОбъект.Записать();		
			
			
			ИзмененныеРаботы = Новый Массив;
			ИзмененныеРаботы.Добавить(ТекущаяРаботаОбъект.Ссылка);
			ИзмененныеРаботы.Добавить(ПредыдущаяРаботаОбъект.Ссылка);
			
						
			ИзмененныеРаботы =  ПолучитьМассивПодчиненныхПоИерархии(ИзмененныеРаботы);
			
			
			// заполнение кодов СДР
			Если ЗначениеЗаполнено(ТекущаяРаботаОбъект.Ссылка.Родитель) И ЗначениеЗаполнено(ПредыдущаяРаботаОбъект.Ссылка.Родитель) Тогда
				УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(ТекущаяРаботаОбъект.Ссылка, ИзмененныеРаботы);
				УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(ПредыдущаяРаботаОбъект.Ссылка, ИзмененныеРаботы);
			Иначе
				УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРРабот(СценарийПланирования);
			КонецЕсли;
			
			УСОERP_УправлениеСтроительнымПроизводством.РассчитатьСценарияПланированияПроектовСтроительстваПоРаботе(ПредыдущаяРаботаОбъект.Ссылка,ВидПланирования,НаДату,Истина,Новый Массив);
			УСОERP_УправлениеСтроительнымПроизводством.РассчитатьСценарияПланированияПроектовСтроительстваПоРаботе(ТекущаяРаботаОбъект.Ссылка,ВидПланирования,НаДату,Истина,Новый Массив);
			// обновление последователей
			ЗаполнитьДанныеОПоследователяхСпискаРабот(ИзмененныеРаботы, ИзмененныеРаботы);
			ОбновитьИзмененныеСтрокиРабот(ИзмененныеРаботы);
			
			СписокРаскрытыхРабот.Добавить(ТекущаяРабота.Родитель);
 		КонецЕсли;
	КонецЦикла;
	УстановитьДоступностьКомандПеремещения(ТекущаяРабота, ДеревоРабот, Элементы);
	//ЗаполнитьДиаграммуГанта();
	 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивПодчиненныхПоИерархии(МассивРодителей)
	
	ЗапросПоРаботам = Новый Запрос;
	ЗапросПоРаботам.УстановитьПараметр("Родитель",МассивРодителей);
	ЗапросПоРаботам.Текст = 
	
	"ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботы.Ссылка
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Ссылка В ИЕРАРХИИ(&Родитель)
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления";
	МассивРаботПоРодителям = ЗапросПоРаботам.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Возврат МассивРаботПоРодителям;  
	
КонецФункции


&НаСервере
Процедура ВнизСервер()
	
	МассивСсылок = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоРабот.ВыделенныеСтроки Цикл
		Ссылка = ДеревоРабот.НайтиПоИдентификатору(ВыделеннаяСтрока).Ссылка;
		Индекс = Неопределено;
		Для Каждого Элемент Из МассивСсылок Цикл
			Если Элемент.НомерРаботыВУровне < Ссылка.НомерРаботыВУровне Тогда
				Индекс = МассивСсылок.Найти(Элемент);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если Индекс = Неопределено Тогда
			МассивСсылок.Добавить(Ссылка);
		Иначе
			МассивСсылок.Вставить(Индекс, Ссылка); 
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Ссылка Из МассивСсылок Цикл
		// Получение Работы с номером в уровне, меньшим на 1, чем текущий
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	СтроительныеРаботы.Ссылка
			|ИЗ
			|	Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
			|ГДЕ
			|	СтроительныеРаботы.Владелец = &Владелец
			|	И СтроительныеРаботы.Родитель = &Родитель
			|	И Не ПометкаУдаления
			|	И СтроительныеРаботы.НомерРаботыВУровне = &НомерРаботыВУровне";
			
		Запрос.УстановитьПараметр("Владелец", 			Ссылка.Владелец);
		Запрос.УстановитьПараметр("Родитель", 			Ссылка.Родитель);
		Запрос.УстановитьПараметр("НомерРаботыВУровне", Ссылка.НомерРаботыВУровне + 1);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			// сдвиг строк в дереве	
			Идентификатор = -1;
			УСОERP_УправлениеСтроительнымПроизводством.НайтиРаботуВДеревеПоСсылке(
				ДеревоРабот.ПолучитьЭлементы(),
				Ссылка,
				Идентификатор);
			СтрокаТекущейРаботы = ДеревоРабот.НайтиПоИдентификатору(Идентификатор);
			СтрокаРодительскойРаботы = СтрокаТекущейРаботы.ПолучитьРодителя();
			Если СтрокаРодительскойРаботы = Неопределено Тогда
				СтрокаРодительскойРаботы = ДеревоРабот;	
			КонецЕсли;
			ИндексТекущейРаботы = СтрокаРодительскойРаботы.ПолучитьЭлементы().Индекс(СтрокаТекущейРаботы);
			СтрокаРодительскойРаботы.ПолучитьЭлементы().Сдвинуть(ИндексТекущейРаботы, 1);
			
			// изменение реквизитов объектов
			ТекущаяРаботаОбъект = Ссылка.ПолучитьОбъект();
			СледующаяРаботаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Буфер = ТекущаяРаботаОбъект.НомерРаботыВУровне;
			ТекущаяРаботаОбъект.НомерРаботыВУровне = СледующаяРаботаОбъект.НомерРаботыВУровне;
			СледующаяРаботаОбъект.НомерРаботыВУровне = Буфер;

			БуферСДР = ТекущаяРаботаОбъект.КодСДР;
			ТекущаяРаботаОбъект.КодСДР = СледующаяРаботаОбъект.КодСДР;
			СледующаяРаботаОбъект.КодСДР = БуферСДР;

			ТекущаяРаботаОбъект.Записать();
			СледующаяРаботаОбъект.Записать();
			
			ИзмененныеРаботы = Новый Массив;
			ИзмененныеРаботы.Добавить(ТекущаяРаботаОбъект.Ссылка);
			ИзмененныеРаботы.Добавить(СледующаяРаботаОбъект.Ссылка);
			
			ИзмененныеРаботы =  ПолучитьМассивПодчиненныхПоИерархии(ИзмененныеРаботы); 
			
			// заполнение кодов СДР
			Если ЗначениеЗаполнено(ТекущаяРаботаОбъект.Ссылка.Родитель) И ЗначениеЗаполнено(СледующаяРаботаОбъект.Ссылка.Родитель) Тогда
				
				УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(ТекущаяРаботаОбъект.Ссылка, ИзмененныеРаботы);
				УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(СледующаяРаботаОбъект.Ссылка, ИзмененныеРаботы);	
				
			Иначе
				
				УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРРабот(СценарийПланирования);
				
			КонецЕсли;
			
			//УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(ТекущаяРаботаОбъект.Ссылка, ИзмененныеРаботы);
			//УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(СледующаяРаботаОбъект.Ссылка, ИзмененныеРаботы);
			УСОERP_УправлениеСтроительнымПроизводством.РассчитатьСценарияПланированияПроектовСтроительстваПоРаботе(СледующаяРаботаОбъект.Ссылка,ВидПланирования,НаДату,Истина,Новый Массив);
			УСОERP_УправлениеСтроительнымПроизводством.РассчитатьСценарияПланированияПроектовСтроительстваПоРаботе(ТекущаяРаботаОбъект.Ссылка,ВидПланирования,НаДату,Истина,Новый Массив);
			// обновление последователей
			ЗаполнитьДанныеОПоследователяхСпискаРабот(ИзмененныеРаботы, ИзмененныеРаботы);
			ОбновитьИзмененныеСтрокиРабот(ИзмененныеРаботы);
			
			СписокРаскрытыхРабот.Добавить(ТекущаяРабота.Родитель);		
		КонецЕсли;
	КонецЦикла;
	УстановитьДоступностьКомандПеремещения(ТекущаяРабота, ДеревоРабот, Элементы);
	//ЗаполнитьДиаграммуГанта();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеОПоследователяхСпискаРабот(МассивПоследователей, МассивРабот)
	
	Для Каждого Элемент Из МассивРабот Цикл
		МассивПоследователейРаботы = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьВсехПоследователей(Элемент, КонецДня(НаДату), ВидПланирования).ВыгрузитьКолонку("Работа");
		Для Каждого ЭлементПоследователь Из МассивПоследователейРаботы Цикл 
			Если МассивПоследователей.Найти(ЭлементПоследователь) = Неопределено Тогда
				МассивПоследователей.Добавить(ЭлементПоследователь);	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПолейДереваРабот(Режим)
	
	Если Режим = "ВСписке" Тогда 
		Элементы.Состояние.ТолькоПросмотр = Истина;
		Элементы.ТрудозатратыФактСтр.ТолькоПросмотр = Истина;
		Элементы.ДеревоРаботИзменить.Видимость = Ложь;
		Элементы.ДеревоРаботОткрытьКарточку.Видимость = Истина;
	Иначе
		Элементы.Состояние.ТолькоПросмотр = Ложь;
		Элементы.ТрудозатратыФактСтр.ТолькоПросмотр = Ложь;
		Элементы.ДеревоРаботИзменить.Видимость = Истина;
		Элементы.ДеревоРаботОткрытьКарточку.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Функция ПолучитьЧисловуюЧасть(Знач Строка) 
	
	Строка = СокрЛП(Строка);
	Если ПустаяСтрока(Строка) Тогда 
		Возврат "0";
	КонецЕсли;	
	
	ЧисловаяЧасть = "";
	
	ДопустимыеСимволы = "0123456789., ";
	Для Инд = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка,Инд,1);
		Если Найти(ДопустимыеСимволы, Символ) > 0 Тогда 
			ЧисловаяЧасть = ЧисловаяЧасть + Символ;
		Иначе	
			Прервать;
		КонецЕсли;	
	КонецЦикла;	
	
	ЧисловаяЧасть = СтрЗаменить(ЧисловаяЧасть, " ", "");
	
	Возврат ЧисловаяЧасть;
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьДеревоРабот()
	
	СписокРаскрытыхРабот.Очистить();
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.ПолучитьМассивРаскрытыхРабот(Элементы.ДеревоРабот, ДеревоРабот.ПолучитьЭлементы(), СписокРаскрытыхРабот);
		
	ЗаполнитьДеревоРабот();
	
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьРазвернутостьЭлементовДерева(Элементы.ДеревоРабот, ДеревоРабот, СписокРаскрытыхРабот);
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьТекущуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, ТекущаяРабота);
	
	ОбновитьКнопкиСвернутьДоУровня();
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьКнопкиСвернутьДоУровня()
	
	ПолучитьМаксимальнуюГлубинуДерева(); 

	ДобавитьКнопкиСвернутьУровняНаФорму();
	
	ГлубинаДереваРаботСтарая = ГлубинаДереваРабот;
	
КонецПроцедуры	

&НаСервере
Процедура ДобавитьКнопкиСвернутьУровняНаФорму()
	
	Для инд = 1 По ГлубинаДереваРаботСтарая Цикл
		ИмяКоманды = "ДеревоРаботСвернутьДоУровня" + СтрЗаменить(инд, Символы.НПП, "");	
		ЭтаФорма.Элементы.Удалить(ЭтаФорма.Элементы[ИмяКоманды]);
		ЭтаФорма.Команды.Удалить(ЭтаФорма.Команды[ИмяКоманды]);
	КонецЦикла;	
	
	Для инд = 1 По ГлубинаДереваРабот Цикл
		ИмяКоманды = "ДеревоРаботСвернутьДоУровня" + СтрЗаменить(инд, Символы.НПП, "");	
		
		НоваяКомандаФормы = ЭтаФорма.Команды.Добавить(ИмяКоманды);
		НоваяКомандаФормы.Заголовок = "Свернуть до уровня";
		НоваяКомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
		НоваяКомандаФормы.Действие = "СвернутьДоУровня";
		
		НоваяКнопка             = ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ЭтаФорма.Элементы.ДеревоРаботСвернутьДоУровня);       
		НоваяКнопка.Заголовок  	= СтрЗаменить(инд, Символы.НПП, "");   
		НоваяКнопка.ИмяКоманды  = ИмяКоманды;		
	КонецЦикла;	
	
КонецПроцедуры


&НаКлиенте
Процедура СвернутьДоУровня(Команда)

	СвернутьДоУровня = Число(СтрЗаменить(Команда.Имя, "ДеревоРаботСвернутьДоУровня", ""));	
	СвернутьДрервоДоУровня(0, ДеревоРабот);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьМаксимальнуюГлубинуДерева(Знач Уровень = 0, ДеревоСтроки = Неопределено) 

	Если ДеревоСтроки = Неопределено Тогда 
		ДеревоСтроки = ДеревоРабот.ПолучитьЭлементы();
		ГлубинаДереваРабот = 0;
	КонецЕсли;
	Уровень = Уровень + 1;

	Если ДеревоСтроки.Количество() > 0 И Уровень > ГлубинаДереваРабот Тогда 
		ГлубинаДереваРабот = Уровень;	
	КонецЕсли;
	
	Для Каждого Стр Из ДеревоСтроки Цикл 
		ПолучитьМаксимальнуюГлубинуДерева(Уровень, Стр.ПолучитьЭлементы());		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДрервоДоУровня(Знач Уровень = 0, ТекущаяСтрока) 

	ДеревоСтроки = ТекущаяСтрока.ПолучитьЭлементы();

	Уровень = Уровень + 1;	
	Для Каждого Стр Из ДеревоСтроки Цикл 
		Если Уровень < СвернутьДоУровня Тогда 
			ИдентификаторСтроки	= Стр.ПолучитьИдентификатор();
			Элементы.ДеревоРабот.Развернуть(ИдентификаторСтроки);
			СвернутьДрервоДоУровня(Уровень, Стр);
		Иначе 	
			ИдентификаторСтроки	= Стр.ПолучитьИдентификатор();
			Элементы.ДеревоРабот.Свернуть(ИдентификаторСтроки);
			СвернутьДрервоДоУровня(Уровень, Стр);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	
	МассивРабот = Новый Массив;
	Для Каждого СтрокаДерева Из ПараметрыПеретаскивания.Значение Цикл
		МассивРабот.Добавить(Новый Структура("Работа, ИдентификаторСтроки", СтрокаДерева.Ссылка, СтрокаДерева.ПолучитьИдентификатор()));
		
		Родитель = СтрокаДерева.ПолучитьРодителя();
		Если Не Родитель = Неопределено Тогда
			ПодчиненныеСтроки = Родитель.ПолучитьЭлементы();
			Если ПодчиненныеСтроки.Количество() = 0
				И Родитель.СуммарнаяРабота Тогда
				Родитель.СуммарнаяРабота = Ложь;
				ЗаписатьСтроительнуюРаботуИзСтрокиДерева(Родитель.ПолучитьИдентификатор(), );
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ОбработатьРезультатПеретаскивания(МассивРабот);
	
	ОбновитьДеревоРабот();
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРезультатПеретаскивания(МассивРабот)
	
	мДеревоРабот = РеквизитФормыВЗначение("ДеревоРабот", Тип("ДеревоЗначений"));
	
	ТаблицаИзмененныхРабот = Новый ТаблицаЗначений;
	ТаблицаИзмененныхРабот.Колонки.Добавить("Работа", Новый ОписаниеТипов("СправочникСсылка.УСОERP_СтроительныеРаботы"));
	
	Для Каждого мРабота Из МассивРабот Цикл
		
		//Добавлено для пересчета кодов СДР 
		НоваяСтрока = ТаблицаИзмененныхРабот.Добавить();
		НоваяСтрока.Работа = мРабота.Работа.Родитель;
		//
		
		СтрокиДереваРабот = мДеревоРабот.Строки.НайтиСтроки(Новый Структура("Ссылка", мРабота.Работа), Истина);
		Если СтрокиДереваРабот.Количество()<>0 Тогда
			РодительСтроки = СтрокиДереваРабот[0].Родитель;
			СтрокиДереваРабот[0].РодительскаяРабота = ?(РодительСтроки = Неопределено, Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка(), РодительСтроки.Ссылка);
			
			ЗаписатьСтроительнуюРаботуИзСтрокиДерева(мРабота.ИдентификаторСтроки, СтрокиДереваРабот[0],);
			
			Если НЕ РодительСтроки = Неопределено Тогда 
								
				 НоваяСтрока = ТаблицаИзмененныхРабот.Добавить();
				 НоваяСтрока.Работа = РодительСтроки.Ссылка;
				 
			 КонецЕсли;   

		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаИзмененныхРабот.Свернуть("Работа");
	
	Для Каждого СтрокаРабот Из ТаблицаИзмененныхРабот Цикл
		
	//	МассивСтрок = мДеревоРабот.Строки.НайтиСтроки(Новый Структура("Ссылка", СтрокаРабот.Работа), Истина);
	//	Для Каждого СтрокаДерева Из МассивСтрок Цикл
	//		Если СтрокаДерева.Строки.Количество()>0  
	//			И СтрокаДерева.СуммарнаяРабота = Ложь Тогда
	//			СтрокаДерева.СуммарнаяРабота = Истина;
	//			ЗаписатьСтроительнуюРаботуИзСтрокиДерева(, СтрокаДерева,);
	//		КонецЕсли;
	//	КонецЦикла;
	
	УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(СтрокаРабот.Работа);
	
КонецЦикла;
	
	ЗначениеВРеквизитФормы(мДеревоРабот, "ДеревоРабот"); 	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДиаграммаГанта
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДИАГРАММА ГАНТА

&НаСервере
Процедура ЗаполнитьДиаграммуГанта() Экспорт
		
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем диаграмму и запрещаем на время заполнения ее обновление.
	// В случае большого объема данных это существенно ускорит выполнение.
	Диаграмма = ДиаграммаГанта;
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();
	Диаграмма.ИнтервалыФона.Очистить();
	
	Для Каждого Шкала Из Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы Цикл
		Шкала.Метки.Очистить();
	КонецЦикла;	
	
	Диаграмма.ОтображатьЛегенду = Ложь;
	Диаграмма.ОтображатьЗаголовок = Ложь;
	Диаграмма.ОбластьПостроения.Право = 1;
	
	// Создаем таблицу значений, в которую, по мере обхода запроса, будем заносить связи.
	Связи = Новый ТаблицаЗначений;
	Связи.Колонки.Добавить("Конец");
	Связи.Колонки.Добавить("Начало");
	Связи.Колонки.Добавить("ТипЗависимости");
	
	// Серия будет одна.
	Серия = Диаграмма.Серии.Добавить();
	Серия.Цвет	= WebЦвета.СероСиний;
	
	// Заводим переменные для определения максимальной и минимальной дат работ.
	МаксимальнаяДата = NULL;
	МинимальнаяДата = NULL;
	
	Строки = ДеревоРабот.ПолучитьЭлементы();
	СписокРабот = Новый СписокЗначений;
	Для Каждого СтрокаДерева Из Строки Цикл
		ЗаполнитьОднуТочкуДиаграммыГанта(СтрокаДерева, Связи, Серия, МаксимальнаяДата, МинимальнаяДата);
		СписокРабот.Добавить(СтрокаДерева.Ссылка);
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_ЗначенияКритичностиРабот.Работа,
	|	УСОERP_ЗначенияКритичностиРабот.РасчетКалендарногоПлана,
	|	УСОERP_ЗначенияКритичностиРабот.ДНКМР,
	|	УСОERP_ЗначенияКритичностиРабот.ДОКМР,
	|	УСОERP_ЗначенияКритичностиРабот.ДНКМП,
	|	УСОERP_ЗначенияКритичностиРабот.ДОКМП,
	|	УСОERP_ЗначенияКритичностиРабот.КритическаяРабота,
	|	УСОERP_ЗначенияКритичностиРабот.ЗапасВремениДни,
	|	УСОERP_ЗначенияКритичностиРабот.ЗапасВремениЧасы
	|ПОМЕСТИТЬ ВремТаб
	|ИЗ
	|	РегистрСведений.УСОERP_ЗначенияКритичностиРабот КАК УСОERP_ЗначенияКритичностиРабот
	|ГДЕ
	|	УСОERP_ЗначенияКритичностиРабот.Работа В(&Работы)
	|	И НЕ УСОERP_ЗначенияКритичностиРабот.Работа.Владелец = &СценарийПланированияТекущий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_СвязиМеждуРаботамиСрезПоследних.РаботаПредшественник КАК Ссылка,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.НачалоРаботыПлан,
	|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.ОкончаниеРаботыПлан,
	|	УСОERP_СвязиМеждуРаботамиСрезПоследних.РаботаПредшественник.Наименование КАК Наименование,
	|	ВремТаб.КритическаяРабота
	|ИЗ
	|	РегистрСведений.УСОERP_СвязиМеждуРаботами.СрезПоследних(
	|			,
	|			РаботаПоследователь В (&Работы)
	|				И НЕ РаботаПредшественник.Владелец = &СценарийПланированияТекущий
	|				И НЕ ТипЗависимости = &ТипЗависимости) КАК УСОERP_СвязиМеждуРаботамиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(, ВидПланирования = &ВидПланирования) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
	|		ПО УСОERP_СвязиМеждуРаботамиСрезПоследних.РаботаПредшественник = УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВремТаб КАК ВремТаб
	|		ПО УСОERP_СвязиМеждуРаботамиСрезПоследних.РаботаПредшественник = ВремТаб.Работа";
	
	Запрос.УстановитьПараметр("Работы", 						СписокРабот);
	Запрос.УстановитьПараметр("СценарийПланированияТекущий", 	СценарийПланирования);
	Запрос.УстановитьПараметр("ТипЗависимости", 				Перечисления.УСОERP_ТипыЗависимостейРабот.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидПланирования", 				ВидПланирования);

	РезультатЗапроса = Запрос.Выполнить();
	
	РаботыДругогоВладельца = РезультатЗапроса.Выбрать();
	
	Пока РаботыДругогоВладельца.Следующий() Цикл
		ЗаполнитьОднуТочкуДиаграммыГанта(РаботыДругогоВладельца, Связи, Серия, МаксимальнаяДата, МинимальнаяДата, Истина);
	КонецЦикла;
	
	// Теперь в интервале минимальной и максимальной дат заполняем интервалы выходных дней.
	Если МинимальнаяДата <> NULL Тогда
		
		День = 3600 * 24;
		Неделя = 3600 * 24 * 7;
		МаксимальнаяДата = МаксимальнаяДата + Неделя * 4;
		
		ГрафикРаботы = ОбъектСтроительства.ГрафикРаботы;
		
		РабочиеДни = Справочники.Календари.ПрочитатьДанныеГрафикаИзРегистра(ГрафикРаботы, Год(МинимальнаяДата));
		Если Год(МаксимальнаяДата) > Год(МинимальнаяДата) Тогда 
			ТекГод = Год(МинимальнаяДата) + 1;
			Пока ТекГод <= Год(МаксимальнаяДата) Цикл
				врРабочиеДни = Справочники.Календари.ПрочитатьДанныеГрафикаИзРегистра(ГрафикРаботы, ТекГод);
				Для Каждого Элемент Из врРабочиеДни Цикл
					РабочиеДни.Вставить(Элемент.Ключ, Элемент.Значение);
				КонецЦикла;	
				ТекГод = ТекГод + 1;
			КонецЦикла;	
		КонецЕсли;	 
		
		ТекДата = МинимальнаяДата;
		Пока ТекДата <= МаксимальнаяДата Цикл;
			
			РабочийДень = (РабочиеДни.Получить(НачалоДня(ТекДата)) <> Неопределено);
			
			Если Не РабочийДень Тогда
			
				Кон = КонецДня(ТекДата);
				Нач = НачалоДня(ТекДата);
				Диаграмма.ИнтервалыФона.Добавить(Нач, Кон);
				
			КонецЕсли;	
			
			ТекДата = ТекДата + День;
			
		КонецЦикла;		
		
	КонецЕсли;
	
	// По заполненной таблице создаем связи.
	СоздатьСвязиНаДиаграммеГанта(Связи, Диаграмма, Серия);
	
	// Находим элемент шкалы времени для непериодических меток.
	ЭлементМеток = ПолучитьЭлементДляМеток(Диаграмма);
	
	// Создаем метку - текущая дата
	Метка = ЭлементМеток.Метки.Добавить(ТекущаяДата());
	Метка.Текст = НСтр("ru = 'Текущая дата'");
	Метка.ЦветТекста = WebЦвета.СинеСерый;
	Метка.ЦветЛинии = Метка.ЦветТекста;
	
	// Развертываем первую точку - рекурсивно. 
	Если Диаграмма.Точки.Количество() > 0 Тогда
		Диаграмма.РазвернутьТочку(Диаграмма.Точки.Получить(0), Истина);
	КонецЕсли;
	
	// Включаем обновление диаграммы.
	Диаграмма.Обновление = Истина;
	
	Диаграмма.ПоддержкаМасштаба = ПоддержкаМасштабаДиаграммыГанта.Авто;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОднуТочкуДиаграммыГанта(СтрокаДерева, Связи, Серия, МаксимальнаяДата, МинимальнаяДата, РаботыДругогоВладельца = Ложь)
	
	Диаграмма = ДиаграммаГанта;
	
	ЦветЗапланированного 		= WebЦвета.Васильковый;
	ЦветНеПросроченного  		= ЦветаСтиля.ОтметкаПоложительногоВыполненияЗадачи;
	ЦветПросроченного    		= ЦветаСтиля.ПоясняющийОшибкуТекст;
	ЦветВыполненного     		= ЦветаСтиля.ЗавершенныйБизнесПроцесс; 
	ЦветНеНазначенного   		= WebЦвета.НейтральноКоричневый;
	ЦветРодителя         		= WebЦвета.Черный;
	ЦветРаботыДругогоВладельца 	= WebЦвета.ЗеленоватоЖелтый;
	ЦветРаботыКритическая		= WebЦвета.Кирпичный;
	ЦветСерииПоУмолчанию		= WebЦвета.СероСиний;
	
	ДатаНачала 		= СтрокаДерева.НачалоРаботыПлан;
	ДатаОкончания 	= СтрокаДерева.ОкончаниеРаботыПлан;

	
	
	НужноДобавитьСтроку = Истина;
	
	// Если даты не заполнены и нет дочерних Работ - не добавляем точку
	Если Не ЗначениеЗаполнено(ДатаНачала) И Не ЗначениеЗаполнено(ДатаОкончания)
		И СтрокаДерева.ПолучитьЭлементы().Количество() = 0 Тогда
		
		НужноДобавитьСтроку = Ложь;
		
	КонецЕсли;	
	
	Если НужноДобавитьСтроку Тогда
		
		// Поскольку серия одна, каждой работе соответствует одна точка и одно значение.
		
		// Инициализируем точку.
		Точка = Диаграмма.УстановитьТочку(СтрокаДерева.Ссылка, 
											?(РаботыДругогоВладельца, Неопределено, 
											 ?(СтрокаДерева.Ссылка.Родитель.Пустая(),
												//?(СтрокаДерева.РодительскаяРабота.Пустая(), 
				  									Неопределено,
													СтрокаДерева.Ссылка.Родитель))); 													
												//	СтрокаДерева.РодительскаяРабота)));
											
		Точка.Текст = СтрокаДерева.Наименование;
		
		Диаграмма.РазвернутьТочку(Точка, Истина);
		
		// Инициализируем значение.
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
		Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда	
			 
			Значение.Редактирование = Истина;
			
			// Добавляем интервал. В данном примере у каждой работы единственный интервал.
			Интервал = Значение.Добавить();
			Интервал.Начало = ДатаНачала;
			Интервал.Конец  = ДатаОкончания;
			
			// Формируем подпись.
			УстановитьТекстЗначения(Интервал);
						
			// Определяем статус Работы.
			Если ТипЗнч(СтрокаДерева) = Тип("ВыборкаИзРезультатаЗапроса") Тогда
				ЭтоРодитель = (СтрокаДерева.Ссылка.СуммарнаяРабота);
			Иначе
				ЭтоРодитель = (СтрокаДерева.ПолучитьЭлементы().Количество() <> 0);
			КонецЕсли;

			Если КритическиеЗадачи и СтрокаДерева.КритическаяРабота И НЕ ЭтоРодитель Тогда
				Значение.Цвет	= ЦветРаботыКритическая;		
			ИначеЕсли РаботыДругогоВладельца Тогда 
				Значение.Цвет = ЦветРаботыДругогоВладельца;
			Иначе				
				Если ЭтоРодитель Тогда
					Значение.Цвет = ЦветРодителя;
				ИначеЕсли ДатаОкончания < ТекущаяДатаСеанса() Тогда
					Значение.Цвет = ЦветПросроченного;
				ИначеЕсли ДатаНачала < ТекущаяДатаСеанса() Тогда 		
					Значение.Цвет = ЦветНеНазначенного;
				Иначе
					Значение.Цвет = ЦветЗапланированного;
				КонецЕсли;
			КонецЕсли;

			// Если надо, корректируем максимальную и минимальную даты.
			Если МаксимальнаяДата = NULL Или МаксимальнаяДата < ДатаОкончания Тогда
				МаксимальнаяДата = ДатаОкончания;
			КонецЕсли;				
			
			Если МинимальнаяДата = NULL Или МинимальнаяДата > ДатаНачала Тогда
				МинимальнаяДата = ДатаНачала;
			КонецЕсли;	
			
			// Получаем связи данной работы и заносим в таблицу.
			Если НЕ РаботыДругогоВладельца Тогда 
				Для Каждого СтрокаДереваПред Из СтрокаДерева.Предшественники Цикл
					Если ЗначениеЗаполнено(СтрокаДереваПред.РаботаПредшественник) И СтрокаДереваПред.РаботаПредшественник.ПометкаУдаления Тогда 
						Продолжить;
					КонецЕсли; 
					
					Связь = Связи.Добавить();
					Связь.Начало 		 = СтрокаДереваПред.РаботаПредшественник;
					Связь.Конец 		 = СтрокаДерева.Ссылка;
					Связь.ТипЗависимости = СтрокаДереваПред.ТипЗависимости;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ РаботыДругогоВладельца Тогда 
			Строки = СтрокаДерева.ПолучитьЭлементы();
			Для Каждого Строка Из Строки Цикл
				ЗаполнитьОднуТочкуДиаграммыГанта(Строка, Связи, Серия, МаксимальнаяДата, МинимальнаяДата);
			КонецЦикла;
			
		КонецЕсли;			
		
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Процедура СоздатьСвязиНаДиаграммеГанта(Связи, Диаграмма, Серия)
	
	ТекущаяТочка = NULL;
	Для Каждого Связь Из Связи Цикл 
		
		Если ТекущаяТочка = NULL Или ТекущаяТочка.Значение <> Связь.Конец Тогда
			ТекущаяТочка = Диаграмма.УстановитьТочку(Связь.Конец);
		КонецЕсли;			
		
		ТочкаНачала = Диаграмма.УстановитьТочку(Связь.Начало);
		Значение = Диаграмма.ПолучитьЗначение(ТочкаНачала, Серия);
		Для Каждого Интервал Из Значение Цикл
			ИнтервалНачала = Интервал;
			Прервать;
		КонецЦикла;				
		Значение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, Серия);
		Для Каждого Интервал Из Значение Цикл
			ИнтервалКонца = Интервал;
			Прервать;
		КонецЦикла;	
		
		ИнтервалыРавны = Ложь;
		Если ИнтервалНачала <> Неопределено И ИнтервалКонца <> Неопределено Тогда
			Если (ИнтервалНачала.Значение <> Неопределено И ИнтервалКонца.Значение <> Неопределено И 
				ИнтервалНачала.Значение.Текст = ИнтервалКонца.Значение.Текст)
				И ИнтервалНачала.Конец = ИнтервалКонца.Конец 
				И ИнтервалНачала.Начало = ИнтервалКонца.Начало Тогда
				ИнтервалыРавны = Истина;
			КонецЕсли;	
		КонецЕсли;
		
		Если ИнтервалНачала = Неопределено ИЛИ ИнтервалКонца = Неопределено 
			ИЛИ ИнтервалыРавны Тогда
			Продолжить;
		КонецЕсли;
		
		СвязьДобавленная = ИнтервалНачала.Добавить(ИнтервалКонца);
		
		Если Связь.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.НачалоНачало Тогда
			СвязьДобавленная.ТипСвязи = ТипСвязиДиаграммыГанта.НачалоНачало;
		ИначеЕсли Связь.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.НачалоОкончание Тогда
			СвязьДобавленная.ТипСвязи = ТипСвязиДиаграммыГанта.НачалоКонец;
		ИначеЕсли Связь.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало Тогда
			СвязьДобавленная.ТипСвязи = ТипСвязиДиаграммыГанта.КонецНачало;
		ИначеЕсли Связь.ТипЗависимости = Перечисления.УСОERP_ТипыЗависимостейРабот.ОкончаниеОкончание Тогда
			СвязьДобавленная.ТипСвязи = ТипСвязиДиаграммыГанта.КонецКонец;
		КонецЕсли;	
		
		Если ИнтервалНачала.Конец <= ИнтервалКонца.Начало Тогда
			СвязьДобавленная.Цвет = WebЦвета.Синий;
		Иначе			
			СвязьДобавленная.Цвет = WebЦвета.Красный;
		КонецЕсли;			
		
	КонецЦикла;				
	
КонецПроцедуры // СоздатьСвязи(Связи, Диаграмма, Серия)

&НаСервере
Процедура УстановитьТекстЗначения(Интервал)
	
	Интервал.Значение.Текст = Строка(День(Интервал.Начало)) + "." 
		+ Строка(Месяц(Интервал.Начало)) + "-" 
		+ Строка(День(Интервал.Конец)) + "." 
		+ Строка(Месяц(Интервал.Конец));
									 
КонецПроцедуры

&НаСервере
Функция ПолучитьЭлементДляМеток(Диаграмма)
	
	// Ищем элемент шкалы времени с ОтображатьПериодическиеМетки = Ложь
	Для Каждого Элемент Из Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы Цикл
		
		Если Элемент.ОтображатьПериодическиеМетки = Ложь Тогда
			ЭлементМеток = Элемент;
			Возврат ЭлементМеток;
		КонецЕсли;			
		
	КонецЦикла;						
	
	ЭлементМеток = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементМеток.Единица = ТипЕдиницыШкалыВремени.День;
	ЭлементМеток.ОтображатьПериодическиеМетки = Ложь;
	
	Возврат ЭлементМеток;
	
КонецФункции // ПолучитьЭлементДляМеток(Диаграмма)

&НаСервере
Процедура ИзменитьРаботуИзДиаграммыГанта(Работа, ИнтервалНачало, ИнтервалКонец)
			
	МассивИзмененныхРабот = Новый Массив;
	МассивИзмененныхРабот.Добавить(Работа.Ссылка);
	ОбновитьИзмененныеСтрокиРабот(МассивИзмененныхРабот);
	
КонецПроцедуры	

&НаКлиенте
Процедура ПолосаРегулированияПриИзменении(Элемент)
	ПолосаРегулированияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолосаРегулированияПриИзмененииНаСервере()
	
	ДиаграммаГанта.ПоддержкаМасштаба 					= ПоддержкаМасштабаДиаграммыГанта.Период;
	ДиаграммаГанта.ЕдиницаПериодическогоВарианта 		= ТипЕдиницыШкалыВремени["День"];
	ДиаграммаГанта.КратностьПериодическогоВарианта 		= ?(ПолосаРегулированияДиаграммыГанта < 1, 1, ПолосаРегулированияДиаграммыГанта);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийГанта
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ДИАГРАММЫ ГАНТА

&НаКлиенте
Процедура ДиаграммаГантаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	
	РаботаСсылка = Неопределено;
	
	Если ТипЗнч(Значения) = Тип("Массив") И Значения.Количество() > 0 Тогда
		
		Если ЗначениеЗаполнено(Значения[0].Точка.Значение) Тогда
			РаботаСсылка = Значения[0].Точка.Значение;
		КонецЕсли;	
		
	ИначеЕсли ТипЗнч(Значения) = Тип("ЗначениеДиаграммыГанта") Тогда	
		
		РаботаСсылка = Значения.Точка.Значение;
		
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(РаботаСсылка) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", РаботаСсылка);
		
		ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаГантаПриОкончанииРедактированияИнтервала(Элемент, Интервал, ОтменаРедактирования)
		
	Попытка
		Значение = Интервал.Значение.Точка.Значение;
		Начало = Интервал.Начало;
		Конец = Интервал.Конец;
		
		ИзменитьРаботуИзДиаграммыГанта(Значение, Начало, Конец);
	Исключение	
		ОтменаРедактирования = Истина;
		ВызватьИсключение;
	КонецПопытки;	

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандДерева
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ДЕРЕВА Работ

&НаКлиенте
Процедура ДобавитьПодчиненную(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоРабот.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда 
		
		НовыйЭлемент					= ДеревоРабот.ПолучитьЭлементы().Добавить();
		ПериодСценария 					= ПолучитьПериодСценария(СценарийПланирования);
		НовыйЭлемент.НачалоРаботыПлан	= ПериодСценария.НачалоСтроительства;
		
		Элементы.ДеревоРабот.ТекущаяСтрока 	= НовыйЭлемент.ПолучитьИдентификатор();
		Элементы.ДеревоРабот.ТекущийЭлемент = Элементы.ДеревоРаботРабота;
		Элементы.ДеревоРабот.ИзменитьСтроку();
		
		ОбновитьКнопкиСвернутьДоУровня();
		
	Иначе
		
		ЭлементДерева 	= ДеревоРабот.НайтиПоИдентификатору(ТекущаяСтрока);
		
		ПроверкаНаличияМатериалов = Материалы.НайтиСтроки(Новый Структура("Работа", ЭлементДерева.Ссылка));
		ПроверкаНаличияРесурсов = Ресурсы.НайтиСтроки(Новый Структура("Работа", ЭлементДерева.Ссылка));
		
		ПараметрыВопроса = Новый Структура;
		ПараметрыВопроса.Вставить("ЭлементДерева",ЭлементДерева);
		ПараметрыВопроса.Вставить("ПроверкаНаличияМатериалов",ПроверкаНаличияМатериалов);
		ПараметрыВопроса.Вставить("ПроверкаНаличияРесурсов",ПроверкаНаличияРесурсов);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьПодчиненнуюПродолжение",ЭтотОбъект,ПараметрыВопроса);
		
		
		Если ПроверкаНаличияМатериалов.Количество()>0
			ИЛИ ПроверкаНаличияРесурсов.Количество()>0 Тогда
			
			ПоказатьВопрос(ОписаниеОповещения,"Перед добавлением подчиненной материалы и ресурсы будут очищены. Продолжить?",РежимДиалогаВопрос.ДаНет);
			
		Иначе
			
			ДобавитьПодчиненнуюПродолжение(КодВозвратаДиалога.Да,ПараметрыВопроса);
			
		КонецЕсли; 		
		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодчиненнуюПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементДерева = ДопПараметры.ЭлементДерева;
	ПроверкаНаличияМатериалов = ДопПараметры.ПроверкаНаличияМатериалов;
	ПроверкаНаличияРесурсов = ДопПараметры.ПроверкаНаличияРесурсов; 	
	
	НовыйЭлемент 	= ЭлементДерева.ПолучитьЭлементы().Добавить();
	НовыйЭлемент.НачалоРаботыПлан	= ЭлементДерева.НачалоРаботыПлан;
	
	ОчиститьПотребностьВМатериалахИРесурсахПоРаботе(ЭлементДерева.Ссылка);
	Для Каждого СтрокаМатериалов Из ПроверкаНаличияМатериалов Цикл
		Материалы.Удалить(СтрокаМатериалов);
	КонецЦикла;
	Для Каждого СтрокаРесурсов Из ПроверкаНаличияРесурсов Цикл
		Ресурсы.Удалить(СтрокаРесурсов);
	КонецЦикла;
	
	ЭлементДерева.ИзмененоВручную = Истина;
	НовыйЭлемент.ИзмененоВручную = Истина;
	
	Элементы.ДеревоРабот.ТекущаяСтрока 	= НовыйЭлемент.ПолучитьИдентификатор();
	Элементы.ДеревоРабот.ТекущийЭлемент = Элементы.ДеревоРаботРабота;
	Элементы.ДеревоРабот.ИзменитьСтроку();
	
	ОбновитьКнопкиСвернутьДоУровня();	
	
КонецПроцедуры  

&НаКлиенте
Процедура ДобавитьПоследующую(Команда)
		
	ТекущаяСтрока = Элементы.ДеревоРабот.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда 
		НовыйЭлемент 					= ДеревоРабот.ПолучитьЭлементы().Добавить();
		ПериодСценария 					= ПолучитьПериодСценария(СценарийПланирования);
		НовыйЭлемент.НачалоРаботыПлан	= ПериодСценария.НачалоСтроительства;
	Иначе
		ЭлементДерева = ДеревоРабот.НайтиПоИдентификатору(ТекущаяСтрока);
		РодительЭлемента = ЭлементДерева.ПолучитьРодителя();
		
		Если РодительЭлемента = Неопределено Тогда 
			НовыйЭлемент = ДеревоРабот.ПолучитьЭлементы().Добавить();
		Иначе
			НовыйЭлемент = РодительЭлемента.ПолучитьЭлементы().Добавить();
		КонецЕсли;	
		
		НовыйЭлемент.НачалоРаботыПлан	= РеквизитыСценарияПланирования.ПлановаяДатаНачала;
		
		Предшественники = НовыйЭлемент.Предшественники;
		
		СтрокаПредшественник = Предшественники.Добавить();
		СтрокаПредшественник.ОбъектСтроительстваПредшественника = ОбъектСтроительства;
		СтрокаПредшественник.РаботаПредшественник 				= ЭлементДерева.Ссылка;
		СтрокаПредшественник.ТипЗависимости 					= ПредопределенноеЗначение("Перечисление.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало");
		
		НовыйЭлемент.ПодписьПредшественники = ПредставлениеПредшественников(Предшественники, ОбъектСтроительства);
	КонецЕсли;	
	
	Элементы.ДеревоРабот.ТекущаяСтрока 	= НовыйЭлемент.ПолучитьИдентификатор();
	Элементы.ДеревоРабот.ТекущийЭлемент = Элементы.ДеревоРаботРабота;
	Элементы.ДеревоРабот.ИзменитьСтроку();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПериодСценария(Сценарий) 
	Возврат Новый Структура("НачалоСтроительства, ОкончаниеСтроительства", Сценарий.НачалоСтроительства, Сценарий.ОкончаниеСтроительства);
КонецФункции

&НаКлиенте
Процедура НаУровеньНиже(Команда)
	
	ИзмененныеРаботы = Новый Массив;
	ИзмененныеРаботы.Добавить(ТекущаяРабота);
	ОбновитьИзмененныеСтрокиРабот(ИзмененныеРаботы);
	
	Если Элементы.ДеревоРабот.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокРаскрытыхРабот.Очистить();
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.ПолучитьМассивРаскрытыхРабот(Элементы.ДеревоРабот, ДеревоРабот.ПолучитьЭлементы(), СписокРаскрытыхРабот);
	ТекущаяРаботаДоПеремещения = ТекущаяРабота;
	МассивВыделенныхРабот = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоРабот.ВыделенныеСтроки Цикл
		Ссылка = ДеревоРабот.НайтиПоИдентификатору(ВыделеннаяСтрока).Ссылка;	
		МассивВыделенныхРабот.Добавить(Ссылка);
	КонецЦикла;
	
	НаУровеньНижеСервер(Элементы.ДеревоРабот.ТекущиеДанные.Ссылка, Элементы.ДеревоРабот.ТекущиеДанные.РодительскаяРабота);
		
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьРазвернутостьЭлементовДерева(Элементы.ДеревоРабот, ДеревоРабот, СписокРаскрытыхРабот);		
	Элементы.ДеревоРабот.ВыделенныеСтроки.Очистить();
	Для Каждого Ссылка Из МассивВыделенныхРабот Цикл
		УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьВыделеннуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, Ссылка);	
	КонецЦикла;
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьТекущуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, ТекущаяРаботаДоПеремещения);
	УстановитьДоступностьКомандПеремещения(ТекущаяРабота, ДеревоРабот, Элементы);
	
	ОбновитьКнопкиСвернутьДоУровня();

КонецПроцедуры

&НаКлиенте
Процедура НаУровеньВыше(Команда)
	
	ИзмененныеРаботы = Новый Массив;
	ИзмененныеРаботы.Добавить(ТекущаяРабота);
	ОбновитьИзмененныеСтрокиРабот(ИзмененныеРаботы);
	
	Если Элементы.ДеревоРабот.ТекущиеДанные = Неопределено 
		ИЛИ НЕ ЗначениеЗаполнено(Элементы.ДеревоРабот.ТекущиеДанные.РодительскаяРабота) Тогда
		Возврат;
	КонецЕсли;
	
	СписокРаскрытыхРабот.Очистить();
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.ПолучитьМассивРаскрытыхРабот(Элементы.ДеревоРабот, ДеревоРабот.ПолучитьЭлементы(), СписокРаскрытыхРабот);
	ТекущаяРаботаДоПеремещения = ТекущаяРабота;
	МассивВыделенныхРабот = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоРабот.ВыделенныеСтроки Цикл
		Ссылка = ДеревоРабот.НайтиПоИдентификатору(ВыделеннаяСтрока).Ссылка;	
		МассивВыделенныхРабот.Добавить(Ссылка);
	КонецЦикла;

	НаУровеньВышеСервер(Элементы.ДеревоРабот.ТекущиеДанные.Ссылка, Элементы.ДеревоРабот.ТекущиеДанные.РодительскаяРабота);
		
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьРазвернутостьЭлементовДерева(Элементы.ДеревоРабот, ДеревоРабот, СписокРаскрытыхРабот);		
	Элементы.ДеревоРабот.ВыделенныеСтроки.Очистить();
	Для Каждого Ссылка Из МассивВыделенныхРабот Цикл
		УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьВыделеннуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, Ссылка);	
	КонецЦикла;
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьТекущуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, ТекущаяРаботаДоПеремещения);
    УстановитьДоступностьКомандПеремещения(ТекущаяРабота, ДеревоРабот, Элементы);

	ОбновитьКнопкиСвернутьДоУровня();
	
КонецПроцедуры

&НаКлиенте
Процедура Вверх(Команда)
	
	Если Элементы.ДеревоРабот.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяРаботаДоПеремещения = ТекущаяРабота;
	МассивВыделенныхРабот = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоРабот.ВыделенныеСтроки Цикл
		Ссылка = ДеревоРабот.НайтиПоИдентификатору(ВыделеннаяСтрока).Ссылка;	
		МассивВыделенныхРабот.Добавить(Ссылка);
	КонецЦикла;
	
	ВверхСервер();
		
	Элементы.ДеревоРабот.ВыделенныеСтроки.Очистить();
	Для Каждого Ссылка Из МассивВыделенныхРабот Цикл
		УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьВыделеннуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, Ссылка);	
	КонецЦикла;
	
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьТекущуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, ТекущаяРаботаДоПеремещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Вниз(Команда)
	
	Если Элементы.ДеревоРабот.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяРаботаДоПеремещения = ТекущаяРабота;
	МассивВыделенныхРабот = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.ДеревоРабот.ВыделенныеСтроки Цикл
		Ссылка = ДеревоРабот.НайтиПоИдентификатору(ВыделеннаяСтрока).Ссылка;	
		МассивВыделенныхРабот.Добавить(Ссылка);
	КонецЦикла;
	
	ВнизСервер();
		
	Элементы.ДеревоРабот.ВыделенныеСтроки.Очистить();
	Для Каждого Ссылка Из МассивВыделенныхРабот Цикл
		УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьВыделеннуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, Ссылка);	
	КонецЦикла;
	
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьТекущуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот, ДеревоРабот, ТекущаяРаботаДоПеремещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьДеревоРабот();
		
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)
	
	РаботыКопировать.Очистить();
	ВыделенныеСтроки = Элементы.ДеревоРабот.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() <= 0 Тогда
		Возврат;
	КонецЕсли;	
	
	КопироватьНаСервере(ВыделенныеСтроки);

КонецПроцедуры

&НаСервере
Процедура КопироватьНаСервере(ВыделенныеСтроки)
	
	Для Каждого СтрокаТаблицы Из ВыделенныеСтроки Цикл
		СтрокаТаблицыРабота = ДеревоРабот.НайтиПоИдентификатору(СтрокаТаблицы);
		Если СтрокаТаблицыРабота = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		
		РаботаСсылка = СтрокаТаблицыРабота.Ссылка;
		Если РаботаСсылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;	
			
		РаботыКопировать.Добавить(РаботаСсылка);
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура Вставить(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоРабот.ТекущаяСтрока;
	Если Не ТекущаяСтрока = Неопределено И 
		РаботыКопировать.Количество() > 0 Тогда 
	    ВставитьНаСервере(ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВставитьНаСервере(ТекущаяСтрока)
	
	СтрокаТаблицыРабота = ДеревоРабот.НайтиПоИдентификатору(ТекущаяСтрока);
	Если СтрокаТаблицыРабота = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	РаботаТекущаяСсылка = СтрокаТаблицыРабота.Ссылка;
	Если РаботаТекущаяСсылка.Пустая() Тогда
		Возврат;
	КонецЕсли;	
	
	НачатьТранзакцию();
	
	Этап 						= РаботаТекущаяСсылка.Родитель;
	НомерТекущейРаботыВУровне 	= РаботаТекущаяСсылка.НомерРаботыВУровне;
	
	СтруктураДанных = Новый Структура("ВидПланирования, НачалоРаботыПлан, ОкончаниеРаботыПлан, ДлительностьПлан, ЕдиницаДлительности, ОбъемРаботы, ЕдиницаОбъема, АвторИзменения, Утверждена");
	СтруктураДанных.АвторИзменения 	= ТекущийПользователь;
	СтруктураДанных.Утверждена 		= Ложь;
	
	СоответствиеКопируемыхРаботКНовым = Новый Соответствие;
	Для Каждого Работа Из РаботыКопировать Цикл 
		НоваяРабота = Справочники.УСОERP_СтроительныеРаботы.СоздатьЭлемент();		
		ЗаполнитьЗначенияСвойств(НоваяРабота, Работа.Значение,, "Родитель, Код, КодСДР, НомерРаботыВУровне, СуммарнаяРабота");
		НоваяРабота.Родитель 			= Этап;  
		НоваяРабота.Владелец 			= СценарийПланирования;
		// получение кода СДР
		ДанныеКода = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДРИНомерРаботыВУровне(СценарийПланирования, Этап);
		НоваяРабота.КодСДР             	= ДанныеКода.КодСДР;
		НоваяРабота.НомерРаботыВУровне 	= ДанныеКода.НомерРаботыВУровне;
		Попытка
			НоваяРабота.Записать();
		Исключение			
			ОтменитьТранзакцию();	
			Сообщить(ОписаниеОшибки());
			Возврат;			
		КонецПопытки;	

		СоответствиеКопируемыхРаботКНовым.Вставить(Работа.Значение, НоваяРабота.Ссылка);
		
		ДанныеРаботы = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПараметрыВыполненияРаботы(Работа.Значение, ВидПланирования, КонецДня(НаДату));
		ЗаполнитьЗначенияСвойств(СтруктураДанных, ДанныеРаботы ,, "Утверждена");
		УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьПараметрыВыполненияРаботы(НоваяРабота.Ссылка, ВидПланирования, НачалоДня(НаДату), СтруктураДанных);	
	
	КонецЦикла;
		
	МатериалыКопируемыхРабот = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПотребностьВМатериалах(РаботыКопировать, ВидПланирования, КонецДня(НаДату));
	Для Каждого Стр Из МатериалыКопируемыхРабот Цикл 
		МенеджерЗаписи 	= РегистрыСведений.УСОERP_ПотребностьВМатериалах.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Стр);
		МенеджерЗаписи.Работа			= СоответствиеКопируемыхРаботКНовым.Получить(Стр.Работа);
		МенеджерЗаписи.ВидПланирования 	= ВидПланирования;	
		МенеджерЗаписи.Период			= НачалоДня(НаДату);
		МенеджерЗаписи.АвторИзмерения	= ТекущийПользователь;
		МенеджерЗаписи.Записать();		
	КонецЦикла;
	
	РесурсыКопируемыхРабот = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПотребностьВРесурсах(РаботыКопировать, ВидПланирования, КонецДня(НаДату));
	Для Каждого Стр Из РесурсыКопируемыхРабот Цикл 
		МенеджерЗаписи 	= РегистрыСведений.УСОERP_ПотребностьВРесурсах.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Стр);
		МенеджерЗаписи.Работа			= СоответствиеКопируемыхРаботКНовым.Получить(Стр.Работа);
		МенеджерЗаписи.ВидПланирования 	= ВидПланирования;	
		МенеджерЗаписи.Период			= НачалоДня(НаДату);
		МенеджерЗаписи.АвторИзмерения	= ТекущийПользователь;
		МенеджерЗаписи.Записать();		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СвязиМеждуРаботами.ОбъектСтроительстваПредшественника,
		|	СвязиМеждуРаботами.РаботаПредшественник,
		|	СвязиМеждуРаботами.РаботаПоследователь,
		|	СвязиМеждуРаботами.ТипЗависимости,
		|	СвязиМеждуРаботами.Задержка,
		|	СвязиМеждуРаботами.ЕдиницаЗадержки
		|ИЗ
		|	РегистрСведений.УСОERP_СвязиМеждуРаботами.СрезПоследних(
		|			,
		|			РаботаПоследователь В (&РаботыКопировать)
		|				И РаботаПредшественник В (&РаботыКопировать)) КАК СвязиМеждуРаботами
		|ГДЕ
		|	НЕ СвязиМеждуРаботами.ТипЗависимости = ЗНАЧЕНИЕ(Перечисление.УСОERP_ТипыЗависимостейРабот.пустаяссылка)";
	
	Запрос.УстановитьПараметр("РаботыКопировать", РаботыКопировать);	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи 	= РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
		МенеджерЗаписи.РаботаПредшественник	= СоответствиеКопируемыхРаботКНовым.Получить(Выборка.РаботаПредшественник);
		МенеджерЗаписи.РаботаПоследователь	= СоответствиеКопируемыхРаботКНовым.Получить(Выборка.РаботаПоследователь);		
		МенеджерЗаписи.Период				= НачалоДня(НаДату);
		МенеджерЗаписи.АвторИзмерения		= ТекущийПользователь;
		МенеджерЗаписи.Записать();	
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(СтроительныеРаботы.НомерРаботыВУровне) КАК НомерРаботыВУровнеМаксимум
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
		|ГДЕ
		|	СтроительныеРаботы.Родитель = &Родитель
		|	И НЕ СтроительныеРаботы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Родитель", Этап);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		НомерРаботыВУровнеМаксимум = Выборка.НомерРаботыВУровнеМаксимум;
		Сдвиг = НомерРаботыВУровнеМаксимум - НомерТекущейРаботыВУровне - СоответствиеКопируемыхРаботКНовым.Количество();
		
		Если Сдвиг > 0 Тогда  
			МассивСсылок = Новый Массив;
			Для Каждого Стр Из СоответствиеКопируемыхРаботКНовым Цикл
				Ссылка = Стр.Значение;
				Индекс = Неопределено;
				Для Каждого Элемент Из МассивСсылок Цикл
					Если Элемент.НомерРаботыВУровне > Ссылка.НомерРаботыВУровне Тогда
						Индекс = МассивСсылок.Найти(Элемент);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если Индекс = Неопределено Тогда
					МассивСсылок.Добавить(Ссылка);
				Иначе
					МассивСсылок.Вставить(Индекс, Ссылка); 
				КонецЕсли;	
			КонецЦикла;
			
			Пока Сдвиг > 0 Цикл 
				Сдвиг = Сдвиг - 1;
				Для Каждого Ссылка Из МассивСсылок Цикл
					// Получение Работы с номером в уровне, меньшим на 1, чем текущий
					Запрос = Новый Запрос;
					Запрос.Текст =
					"ВЫБРАТЬ
					|	СтроительныеРаботы.Ссылка
					|ИЗ
					|	Справочник.УСОERP_СтроительныеРаботы КАК СтроительныеРаботы
					|ГДЕ
					|	СтроительныеРаботы.Владелец = &Владелец
					|	И СтроительныеРаботы.Родитель = &Родитель
					|	И Не ПометкаУдаления
					|	И СтроительныеРаботы.НомерРаботыВУровне = &НомерРаботыВУровне";
					Запрос.УстановитьПараметр("Владелец", 			СценарийПланирования);
					Запрос.УстановитьПараметр("Родитель", 			Этап);
					Запрос.УстановитьПараметр("НомерРаботыВУровне", Ссылка.НомерРаботыВУровне - 1);
					
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
												
						// изменение реквизитов объектов
						ТекущаяРаботаОбъект    = Ссылка.ПолучитьОбъект();
						ПредыдущаяРаботаОбъект = Выборка.Ссылка.ПолучитьОбъект();
						
						Буфер                                     = ТекущаяРаботаОбъект.НомерРаботыВУровне;
						ТекущаяРаботаОбъект.НомерРаботыВУровне    = ПредыдущаяРаботаОбъект.НомерРаботыВУровне;
						ПредыдущаяРаботаОбъект.НомерРаботыВУровне = Буфер;
						
						БуферСДР                      = ТекущаяРаботаОбъект.КодСДР;
						ТекущаяРаботаОбъект.КодСДР    = ПредыдущаяРаботаОбъект.КодСДР;
						ПредыдущаяРаботаОбъект.КодСДР = БуферСДР;
												
						Попытка
							ТекущаяРаботаОбъект.Записать();
							ПредыдущаяРаботаОбъект.Записать();
						Исключение			
							ОтменитьТранзакцию();			
							Возврат;			
						КонецПопытки;
						
						ИзмененныеРаботы = Новый Массив;
						ИзмененныеРаботы.Добавить(ТекущаяРаботаОбъект.Ссылка);
						ИзмененныеРаботы.Добавить(ПредыдущаяРаботаОбъект.Ссылка);
						
						// заполнение кодов СДР
						УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(ТекущаяРаботаОбъект.Ссылка, ИзмененныеРаботы);
						УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(ПредыдущаяРаботаОбъект.Ссылка, ИзмененныеРаботы);
						
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;

		КонецЕсли;
	КонецЕсли;
	
	Для Каждого Стр из СоответствиеКопируемыхРаботКНовым Цикл 
		
		УСОERP_УправлениеСтроительнымПроизводством.РассчитатьПланСценарияПланированияПроектовСтроительства(Стр.Значение, ВидПланирования, НаДату);
		
	КонецЦикла;	
	ЗаполнитьДеревоРабот();	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьМатериалы(Команда)
	
	Элементы.ДеревоРаботОтобразитьМатериалы.Пометка = Не Элементы.ДеревоРаботОтобразитьМатериалы.Пометка;
	Элементы.ГруппаМатериалы.Видимость 				= Элементы.ДеревоРаботОтобразитьМатериалы.Пометка;
	ПересчитатьШиринуПодчиненныхЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьРесурсы(Команда)
	
	Элементы.ДеревоРаботОтобразитьРесурсы.Пометка 	= Не Элементы.ДеревоРаботОтобразитьРесурсы.Пометка;
	Элементы.ГруппаРесурсы.Видимость 				= Элементы.ДеревоРаботОтобразитьРесурсы.Пометка;
	ПересчитатьШиринуПодчиненныхЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьШиринуПодчиненныхЭлементов()
	
	Если Элементы.ДеревоРаботОтобразитьМатериалы.Пометка И Элементы.ДеревоРаботОтобразитьРесурсы.Пометка Тогда
		КоличествоТЧ = 2;
	Иначе
		КоличествоТЧ = 1;
	КонецЕсли;
	
	Если Элементы.ДеревоРаботОтобразитьМатериалы.Пометка Тогда
		Для Каждого ТекЭлемент Из Элементы.Материалы.ПодчиненныеЭлементы Цикл
			
			ТекЭлемент.Ширина = Окр(ЭтаФорма.Ширина / (Элементы.Материалы.ПодчиненныеЭлементы.Количество() * КоличествоТЧ) - 1, 0, РежимОкругления.Окр15как10);
			
			Если ТипЗнч(ТекЭлемент) = Тип("ГруппаФормы") Тогда
				Для Каждого ЭлементГруппы Из ТекЭлемент.ПодчиненныеЭлементы Цикл
					ЭлементГруппы.Ширина = Окр(ЭтаФорма.Ширина / (Элементы.Материалы.ПодчиненныеЭлементы.Количество() * КоличествоТЧ) - 2, 0, РежимОкругления.Окр15как10);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Если Элементы.ДеревоРаботОтобразитьРесурсы.Пометка Тогда
		Для Каждого ТекЭлемент Из Элементы.Ресурсы.ПодчиненныеЭлементы Цикл
			
			ТекЭлемент.Ширина = Окр(ЭтаФорма.Ширина / (Элементы.Ресурсы.ПодчиненныеЭлементы.Количество() * КоличествоТЧ) - 1, 0, РежимОкругления.Окр15как10);
			
			Если ТипЗнч(ТекЭлемент) = Тип("ГруппаФормы") Тогда
				Для Каждого ЭлементГруппы Из ТекЭлемент.ПодчиненныеЭлементы Цикл
					ЭлементГруппы.Ширина = Окр(ЭтаФорма.Ширина / (Элементы.Ресурсы.ПодчиненныеЭлементы.Количество() * КоличествоТЧ) - 2, 0, РежимОкругления.Окр15как10);
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СвязатьВыделенныеНаСервере(ВыделенныеСтроки)
	
	Этап = Неопределено;
	МассивВыделенныхРабот = Новый Массив; 
	Для Каждого СтрокаТаблицы Из ВыделенныеСтроки Цикл
		СтрокаТаблицыРабота = ДеревоРабот.НайтиПоИдентификатору(СтрокаТаблицы);
		Если СтрокаТаблицыРабота = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		
		РаботаСсылка = СтрокаТаблицыРабота.Ссылка;
		Если РаботаСсылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;	
		
		Если Не Этап = Неопределено И Не Этап = РаботаСсылка.Родитель Тогда 
			ТекстСообщения = НСтр("ru='Связать выделенные строки невозможно. Не все выделенные работы принадлежат одному этапу!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
			Возврат;
		КонецЕсли;	
		МассивВыделенныхРабот.Добавить(РаботаСсылка);
		Этап = РаботаСсылка.Родитель;
	КонецЦикла;	

	КоличествоСвязейДляВыделенныхСтрок 	= МассивВыделенныхРабот.Количество() - 1;
	Если КоличествоСвязейДляВыделенныхСтрок = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ТипЗависимости	= Перечисления.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало;	
	Для инд = 1 По КоличествоСвязейДляВыделенныхСтрок Цикл 
		МенеджерЗаписи 	= РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ОбъектСтроительстваПредшественника 	= ОбъектСтроительства;		
		МенеджерЗаписи.РаботаПредшественник 				= МассивВыделенныхРабот[инд-1];	
		МенеджерЗаписи.РаботаПоследователь					= МассивВыделенныхРабот[инд];
		МенеджерЗаписи.ТипЗависимости 						= ТипЗависимости;			
		МенеджерЗаписи.Период								= НачалоДня(НаДату);
		МенеджерЗаписи.АвторИзмерения						= ТекущийПользователь;
		МенеджерЗаписи.Записать();
	КонецЦикла;
	
	УСОERP_УправлениеСтроительнымПроизводством.РассчитатьПланСценарияПланированияПроектовСтроительства(МассивВыделенныхРабот[0], ВидПланирования, НаДату, МассивВыделенныхРабот);
	ОбновитьИзмененныеСтрокиРабот(МассивВыделенныхРабот);
		
КонецПроцедуры

&НаКлиенте
Процедура СвязатьВыделенные(Команда)
	
	ВыделенныеСтроки = Элементы.ДеревоРабот.ВыделенныеСтроки;
	Если ВыделенныеСтроки = Неопределено Или ВыделенныеСтроки.Количество() <= 0 Тогда
		Возврат;
	КонецЕсли;	

	СвязатьВыделенныеНаСервере(ВыделенныеСтроки);
	
	//ДеревоРаботДлительностьПланПриИзменении(Истина);
	ДеревоРаботПриОкончанииРедактирования(Истина, Ложь, Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура НоваяСвязь(Команда)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено И ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСтроительстваПредшественника", ОбъектСтроительства);
	ПараметрыФормы.Вставить("РаботаПоследователь", ТекущиеДанные.Ссылка);	
	ОткрытьФорму("РегистрСведений.УСОERP_СвязиМеждуРаботами.ФормаЗаписи", ПараметрыФормы, ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура Свернуть(Команда)
	
	СвернутьНаКлиенте(ДеревоРабот);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьНаКлиенте(ТекущаяСтрока)
	
	КоллекцияЭлементовДерева	= ТекущаяСтрока.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		ИдентификаторСтроки	= Строка.ПолучитьИдентификатор();
		Элементы.ДеревоРабот.Свернуть(ИдентификаторСтроки);
		СвернутьНаКлиенте(Строка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Развернуть(Команда)
	
	РазвернутьНаКлиенте(ДеревоРабот);

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьНаКлиенте(ТекущаяСтрока)
	
	КоллекцияЭлементовДерева	= ТекущаяСтрока.ПолучитьЭлементы();
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		ИдентификаторСтроки	= Строка.ПолучитьИдентификатор();
		Элементы.ДеревоРабот.Развернуть(ИдентификаторСтроки);
		РазвернутьНаКлиенте(Строка);
	КонецЦикла;

КонецПроцедуры
#КонецОбласти

#Область СобытияДерева
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ДЕРЕВА Работ

&НаСервереБезКонтекста
Процедура ЗаблокироватьСтрокуДляРедактирования(Ссылка, УникальныйИдентификатор)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		ЗаблокироватьДанныеДляРедактирования(Ссылка,,УникальныйИдентификатор);
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура РазблокироватьСтрокуДляРедактирования(Ссылка, УникальныйИдентификатор)
	
	Если ЗначениеЗаполнено(Ссылка) Тогда 
		РазблокироватьДанныеДляРедактирования(Ссылка, УникальныйИдентификатор);
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ДеревоРаботПриАктивизацииСтроки(Элемент)
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница <> Элементы.СтраницаРаботыОбъектаСтроительства Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		ТекущаяРабота = ПредопределенноеЗначение("Справочник.УСОERP_СтроительныеРаботы.ПустаяСсылка");
		Элементы.ДеревоРаботВверх.Доступность = Ложь;
		Элементы.ДеревоРаботВниз.Доступность= Ложь;
		Элементы.ФормаНаУровеньВыше.Доступность = Ложь;
		Элементы.ФормаНаУровеньНиже.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	
	Если КоличествоВыделенныхРабот <> Элементы.ДеревоРабот.ВыделенныеСтроки.Количество() 
		ИЛИ ТекущаяРабота <> Элемент.ТекущиеДанные.Ссылка Тогда
		КоличествоВыделенныхРабот 	= Элементы.ДеревоРабот.ВыделенныеСтроки.Количество();
		ТекущаяРабота 				= Элемент.ТекущиеДанные.Ссылка;
		УстановитьДоступностьКомандПеремещения(ТекущаяРабота, ДеревоРабот, Элементы);
	КонецЕсли;	

	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Элементы.ДеревоРаботНачалоРаботы.ТолькоПросмотр 	= ТекущиеДанные.СуммарнаяРабота;
	Элементы.ДеревоРаботОкончаниеРаботы.ТолькоПросмотр 	= ТекущиеДанные.СуммарнаяРабота;
	Элементы.ДеревоРаботДлительностьПлан.ТолькоПросмотр = ТекущиеДанные.СуммарнаяРабота;
	
	ФиксированнаяСтруктураРабота    = Новый ФиксированнаяСтруктура("Работа", ТекущаяРабота);
	Элементы.Материалы.ОтборСтрок 	= ФиксированнаяСтруктураРабота;
	Элементы.Ресурсы.ОтборСтрок 	= ФиксированнаяСтруктураРабота;

	Элементы.Материалы.ТолькоПросмотр = ТекущиеДанные.СуммарнаяРабота;
	Элементы.Ресурсы.ТолькоПросмотр = ТекущиеДанные.СуммарнаяРабота;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущаяСтрока = Элементы.ДеревоРабот.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда 
		НовыйЭлемент = ДеревоРабот.ПолучитьЭлементы().Добавить();
	Иначе
		ЭлементДерева		= ДеревоРабот.НайтиПоИдентификатору(ТекущаяСтрока);
		РодительЭлемента 	= ЭлементДерева.ПолучитьРодителя();
		
		Если РодительЭлемента = Неопределено Тогда 
			НовыйЭлемент = ДеревоРабот.ПолучитьЭлементы().Добавить();
		Иначе
			НовыйЭлемент = РодительЭлемента.ПолучитьЭлементы().Добавить();
		КонецЕсли;
		
		Если Копирование Тогда 
			НовыйЭлемент.Копирование = Истина;
			
			НовыйЭлемент.РодительскаяРабота = ЭлементДерева.РодительскаяРабота;
			
			НовыйЭлемент.Наименование 			= ЭлементДерева.Наименование;
			НовыйЭлемент.НачалоРаботыПлан 		= ЭлементДерева.НачалоРаботыПлан;
			НовыйЭлемент.ОкончаниеРаботыПлан 	= ЭлементДерева.ОкончаниеРаботыПлан;
			
			НовыйЭлемент.ДлительностьПлан 		= ЭлементДерева.ДлительностьПлан;
			НовыйЭлемент.ЕдиницаДлительности 	= ЭлементДерева.ЕдиницаДлительности;
			
			
			Для Каждого СтрокаПредшественник Из ЭлементДерева.Предшественники Цикл
				НоваяСтрока = НовыйЭлемент.Предшественники.Добавить();
				НоваяСтрока.РаботаПредшественник 				= СтрокаПредшественник.РаботаПредшественник;
				НоваяСтрока.ОбъектСтроительстваПредшественника 	= СтрокаПредшественник.ОбъектСтроительстваПредшественника;
				НоваяСтрока.ТипЗависимости 						= СтрокаПредшественник.ТипЗависимости;
				НоваяСтрока.Задержка 							= СтрокаПредшественник.Задержка;
				НоваяСтрока.ЕдиницаЗадержки 					= СтрокаПредшественник.ЕдиницаЗадержки;
			КонецЦикла;
			
			НовыйЭлемент.ПодписьПредшественники = ЭлементДерева.ПодписьПредшественники;				
		КонецЕсли;	
	КонецЕсли;	
	
	Элементы.ДеревоРабот.ТекущаяСтрока 	= НовыйЭлемент.ПолучитьИдентификатор();
	Элементы.ДеревоРабот.ТекущийЭлемент = Элементы.ДеревоРаботРабота;	
	Элементы.ДеревоРабот.ИзменитьСтроку();

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередНачаломИзменения(Элемент, Отказ)
		
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
		
	ЗаблокироватьСтрокуДляРедактирования(ТекущиеДанные.Ссылка, ЭтаФорма.УникальныйИдентификатор);
	
	Если ТекущиеДанные.Предшественники.Количество() > 1 Тогда 
		Элементы.ДеревоРаботПодписьПредшественники.РедактированиеТекста = Ложь; 
	Иначе	
		Элементы.ДеревоРаботПодписьПредшественники.РедактированиеТекста = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;		
	мВыделенныеСтроки = Элемент.ВыделенныеСтроки;
	Если мВыделенныеСтроки = Неопределено Или мВыделенныеСтроки.Количество() <= 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;		
	
	МассивСсылок = Новый Массив;
	Для КАждого СтрокаЭлт Из мВыделенныеСтроки Цикл
		Если ЗначениеЗаполнено(ДеревоРабот.НайтиПоИдентификатору(СтрокаЭлт).Ссылка) Тогда
			МассивСсылок.Добавить(СтрокаЭлт);
		КонецЕсли;
	КонецЦикла;
	Если МассивСсылок.Количество() = 0 Тогда
		Отказ = Ложь;
		Возврат;
	КонецЕсли;
	
	ВыделенныеСтроки = МассивСсылок;
	
	Если ПроверитьВозможностьУдалениеРабот(ВыделенныеСтроки, Отказ) Тогда 
		Возврат;
	КонецЕсли;	
	
	Режим = РежимДиалогаВопрос.ДаНет;
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);	
	Если ВыделенныеСтроки.Количество() = 1 Тогда 
		Если НЕ Элементы.ДеревоРабот.ТекущиеДанные.ПометкаУдаления Тогда
			ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Пометить ""%1"" на удаление?'"),
				Строка(Элементы.ДеревоРабот.ТекущиеДанные.Наименование));
			
			ПараметрыОповещения.Вставить("ПометкаУдаления", Истина);
			ОписаниеОповещения = Новый ОписаниеОповещения(
				"ДеревоРаботПередУдалениемПродолжение",
				ЭтотОбъект,
				ПараметрыОповещения);	
			
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Режим);
		КонецЕсли;
	ИначеЕсли ВыделенныеСтроки.Количество() > 1 Тогда
		ПометкаУдаления = Истина;
		Для Каждого СтрокаТаблицы Из ВыделенныеСтроки Цикл
			СтрокаТаблицыРабота = ДеревоРабот.НайтиПоИдентификатору(СтрокаТаблицы);
			Если СтрокаТаблицыРабота.ПометкаУдаления = Истина Тогда
				ПометкаУдаления = Ложь;
				Прервать;	
			КонецЕсли;
		КонецЦикла;
		
		Если ПометкаУдаления Тогда
			ПараметрыОповещения.Вставить("ПометкаУдаления", Истина);
			ОписаниеОповещения = Новый ОписаниеОповещения(
				"ДеревоРаботПередУдалениемПродолжение",
				ЭтотОбъект,
				ПараметрыОповещения);	
			
			ПоказатьВопрос(ОписаниеОповещения,
				НСтр("ru = 'Пометить выделенные элементы на удаление?'"), Режим);
		КонецЕсли;
	КонецЕсли;		

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПослеУдаления(Элемент)
	
	ПроверитьОбновитьКодыСДР();
	ОбновитьКнопкиСвернутьДоУровня();
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередУдалениемПродолжение(Результат, Параметры) Экспорт  
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;	
	
	НомерТекСтроки = 0;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.ЗагрузитьЗначения(Параметры.ВыделенныеСтроки);
	СписокЗначений.СортироватьПоЗначению();
	
	НомерТекСтроки = СписокЗначений.Получить(0).Значение;
		
	ТекРабота = Неопределено;
	Если ДеревоРабот.НайтиПоИдентификатору(НомерТекСтроки-1) <> Неопределено Тогда
		ТекРабота =  ДеревоРабот.НайтиПоИдентификатору(НомерТекСтроки-1).Ссылка;
	КонецЕсли; 	
	
	ВыделенныеСтроки 	= Параметры.ВыделенныеСтроки;
	ПометкаУдаления 	= Параметры.ПометкаУдаления;
	СписокРаскрытыхРабот.Очистить();
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.ПолучитьМассивРаскрытыхРабот(Элементы.ДеревоРабот, ДеревоРабот.ПолучитьЭлементы(), СписокРаскрытыхРабот);	
	ПометитьНаУдалениеСтроительныеРаботы(ВыделенныеСтроки, ПометкаУдаления);	
	УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьРазвернутостьЭлементовДерева(Элементы.ДеревоРабот, ДеревоРабот, СписокРаскрытыхРабот);	
	
	Если ТекРабота <> Неопределено Тогда
		
		Попытка
			
			УСОERP_УправлениеСтроительнымПроизводствомКлиент.УстановитьТекущуюРаботуВДеревеПоСсылке(Элементы.ДеревоРабот,ДеревоРабот,ТекРабота);
			
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПометитьНаУдалениеСтроительныеРаботы(ВыделенныеСтроки, ПометкаУдаления)
	
	Для Каждого СтрокаТаблицы Из ВыделенныеСтроки Цикл
		СтрокаТаблицыРабота = ДеревоРабот.НайтиПоИдентификатору(СтрокаТаблицы);
		Если СтрокаТаблицыРабота = Неопределено Тогда 
			Продолжить;
		КонецЕсли;	
		
		РаботаСсылка = СтрокаТаблицыРабота.Ссылка;
		Если РаботаСсылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;	
		
		РаботаОбъект = РаботаСсылка.ПолучитьОбъект();
		РаботаОбъект.УстановитьПометкуУдаления(ПометкаУдаления);
		
		//НаборЗаписей = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Работа.Установить(РаботаСсылка);
		//НаборЗаписей.Записать();
		//
		//НаборЗаписей = РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.РаботаПредшественник.Установить(РаботаСсылка);
		//НаборЗаписей.Записать();	
		//НаборЗаписей = РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.РаботаПоследователь.Установить(РаботаСсылка);
		//НаборЗаписей.Записать();
		//
		//НаборЗаписей = РегистрыСведений.УСОERP_ПотребностьВМатериалах.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Работа.Установить(РаботаСсылка);
		//НаборЗаписей.Записать();
		//
		//НаборЗаписей = РегистрыСведений.УСОERP_ПотребностьВРесурсах.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Работа.Установить(РаботаСсылка);
		//НаборЗаписей.Записать();
		
		//Добавлена очистка подчиненных элементов, при удалении родительской строки
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Работа",РаботаСсылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	УСОERP_СтроительныеРаботы.Ссылка КАК ПодРабота
		|ИЗ
		|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
		|ГДЕ
		|	УСОERP_СтроительныеРаботы.Ссылка В ИЕРАРХИИ(&Работа)";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
		НаборЗаписей = РегистрыСведений.УСОERP_ПараметрыВыполненияРабот.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Работа.Установить(Выборка.ПодРабота);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РаботаПредшественник.Установить(Выборка.ПодРабота);
		НаборЗаписей.Записать();	
		НаборЗаписей = РегистрыСведений.УСОERP_СвязиМеждуРаботами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.РаботаПоследователь.Установить(Выборка.ПодРабота);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.УСОERP_ПотребностьВМатериалах.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Работа.Установить(Выборка.ПодРабота);
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.УСОERP_ПотребностьВРесурсах.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Работа.Установить(Выборка.ПодРабота);
		НаборЗаписей.Записать(); 
			
		КонецЦикла;  	 
		
		
		Если ЗначениеЗаполнено(СтрокаТаблицыРабота.Ссылка.Родитель) Тогда
			
			УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРПодчиненныхРабот(СтрокаТаблицыРабота.Ссылка.Родитель);
			
		Иначе
			
			УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРРабот(СценарийПланирования);
			
		КонецЕсли;
	 
		
	КонецЦикла;
	
	ЗаполнитьДеревоРабот();
	
КонецФункции

&НаСервере
Функция ПроверитьВозможностьУдалениеРабот(ВыделенныеСтроки, Отказ = Ложь)
	
	СписокРабот = Новый СписокЗначений;
	Для Каждого СтрокаТаблицы из ВыделенныеСтроки Цикл 
		СтрокаТаблицыРабота = ДеревоРабот.НайтиПоИдентификатору(СтрокаТаблицы);
		Если СтрокаТаблицыРабота = Неопределено Тогда 
			Продолжить;
		КонецЕсли;			
		СписокРабот.Добавить(СтрокаТаблицыРабота.Ссылка);	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УСОERP_УчетВыполненныхРаботОбороты.Работа.Наименование КАК РаботаНаименование,
		|	УСОERP_УчетВыполненныхРаботОбороты.Работа.КодСДР КАК РаботаКодСДР,
		|	1 КАК Вид,
		|	УСОERP_УчетВыполненныхРаботОбороты.Работа.НомерРаботыВУровне КАК РаботаНомерРаботыВУровне
		|ИЗ
		|	РегистрНакопления.УСОERP_УчетВыполненныхРабот.Обороты(, , , Работа В ИЕРАРХИИ (&СписокРабот)) КАК УСОERP_УчетВыполненныхРаботОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_УчетВыполненныхРаботОбороты.Работа.КодСДР,
		|	УСОERP_УчетВыполненныхРаботОбороты.Работа.Наименование,
		|	УСОERP_УчетВыполненныхРаботОбороты.Работа.НомерРаботыВУровне
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УСОERP_ВыполнениеРаботЗаказчикаОстаткиИОбороты.Работа.Наименование,
		|	УСОERP_ВыполнениеРаботЗаказчикаОстаткиИОбороты.Работа.КодСДР,
		|	2,
		|	УСОERP_ВыполнениеРаботЗаказчикаОстаткиИОбороты.Работа.НомерРаботыВУровне
		|ИЗ
		|	РегистрНакопления.УСОERP_ВыполнениеРаботЗаказчика.Обороты(, , , Работа В ИЕРАРХИИ (&СписокРабот)) КАК УСОERP_ВыполнениеРаботЗаказчикаОстаткиИОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_ВыполнениеРаботЗаказчикаОстаткиИОбороты.Работа.Наименование,
		|	УСОERP_ВыполнениеРаботЗаказчикаОстаткиИОбороты.Работа.КодСДР,
		|	УСОERP_ВыполнениеРаботЗаказчикаОстаткиИОбороты.Работа.НомерРаботыВУровне
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа.Наименование,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа.КодСДР,
		|	3,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа.НомерРаботыВУровне
		|ИЗ
		|	РегистрНакопления.УСОERP_ВыполнениеРаботСубподрядчиком.Обороты(, , , Работа В ИЕРАРХИИ (&СписокРабот)) КАК УСОERP_ВыполнениеРаботСубподрядчикомОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа.Наименование,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа.КодСДР,
		|	УСОERP_ВыполнениеРаботСубподрядчикомОбороты.Работа.НомерРаботыВУровне
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.Наименование,
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.КодСДР,
		|	4,
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.НомерРаботыВУровне
		|ИЗ
		|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
		|			,
		|			Работа В ИЕРАРХИИ (&СписокРабот)
		|				И ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.Месячный)) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.Наименование,
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.КодСДР,
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.НомерРаботыВУровне
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.Наименование,
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.КодСДР,
		|	5,
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.НомерРаботыВУровне
		|ИЗ
		|	РегистрСведений.УСОERP_ПараметрыВыполненияРабот.СрезПоследних(
		|			,
		|			Работа В ИЕРАРХИИ (&СписокРабот)
		|				И ВидПланирования = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыПланированияСтроительныхРабот.НедельноСуточный)) КАК УСОERP_ПараметрыВыполненияРаботСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.Наименование,
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.КодСДР,
		|	УСОERP_ПараметрыВыполненияРаботСрезПоследних.Работа.НомерРаботыВУровне
		|
		|УПОРЯДОЧИТЬ ПО
		|	РаботаНомерРаботыВУровне,
		|	РаботаКодСДР,
		|	Вид";
	
	Запрос.УстановитьПараметр("СписокРабот", СписокРабот);
	
	РезультатЗапроса 	= Запрос.Выполнить();	
	Выборка 			= РезультатЗапроса.Выбрать();
	
	ЕстьСсылкиНаРаботу 	= Ложь;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Вид = 1 Тогда 
			Отказ = Истина;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='По работе ""%1"" есть  факт выполнения работ'"), Выборка.РаботаНаименование + "(" + Выборка.РаботаКодСДР + ")");
			ИначеЕсли Выборка.Вид = 2 Тогда 
				Отказ = Истина;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Работа ""%1"" включена в договор с Заказчиком""'"), Выборка.РаботаНаименование + "(" + Выборка.РаботаКодСДР + ")");
			ИначеЕсли Выборка.Вид = 3 Тогда 
				Отказ = Истина;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='Работа ""%1"" включена в договор с Субподрядчиком""'"), Выборка.РаботаНаименование + "(" + Выборка.РаботаКодСДР + ")");
			ИначеЕсли Выборка.Вид = 4 Тогда 
				Отказ = Истина;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='По работе ""%1"" есть  записи в регистре ""Параметры выполнения работ"" с Видом планирования = ""Месячный""'"), Выборка.РаботаНаименование + "(" + Выборка.РаботаКодСДР + ")");
			ИначеЕсли Выборка.Вид = 5 Тогда 
				Отказ = Истина;
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='По работе ""%1"" есть  записи в регистре ""Параметры выполнения работ"" с Видом планирования = ""Недельно-суточный""'"), Выборка.РаботаНаименование + "(" + Выборка.РаботаКодСДР + ")");
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		ЕстьСсылкиНаРаботу 	= Истина;
		Отказ = Истина;
	КонецЦикла;
	
	Возврат ЕстьСсылкиНаРаботу;
	
КонецФункции

&НаКлиенте
Процедура ДеревоРаботПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	    СтруктураСтроки = Новый Структура;
		СтруктураСтроки.Вставить("ОбъемРаботы",ТекущиеДанные.ОбъемРаботы);
		СтруктураСтроки.Вставить("ДлительностьПлан",ТекущиеДанные.ДлительностьПлан);
		СтруктураСтроки.Вставить("ЕдиницаДлительности",ТекущиеДанные.ЕдиницаДлительности);
		СтруктураСтроки.Вставить("ЕдиницаОбъема",ТекущиеДанные.ЕдиницаОбъема);
		СтруктураСтроки.Вставить("КритическаяРабота",ТекущиеДанные.КритическаяРабота);
		СтруктураСтроки.Вставить("Наименование",ТекущиеДанные.Наименование);
		СтруктураСтроки.Вставить("НачалоРаботыПлан",ТекущиеДанные.НачалоРаботыПлан);
		СтруктураСтроки.Вставить("ОкончаниеРаботыПлан",ТекущиеДанные.ОкончаниеРаботыПлан);
		СтруктураСтроки.Вставить("Предшественники",ТекущиеДанные.Предшественники);
		СтруктураСтроки.Вставить("Ссылка",ТекущиеДанные.Ссылка);
		//СтруктураСтроки.Вставить("ДлительностьПлан",ТекущиеДанные.ДлительностьПлан);
		
	
	ТекущаяСтрокаДерева = СтруктураСтроки;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Владелец) Тогда // изменяется новая строка
		ИндексСтроки = Элементы.ДеревоРабот.ТекущаяСтрока;
		
		ТекущиеДанные.Владелец = СценарийПланирования;
				
		Если Не ТекущиеДанные.Копирование Тогда 
		
		РодительЭлемента = ТекущиеДанные.ПолучитьРодителя();
		Если НЕ РодительЭлемента = Неопределено Тогда 
			ТекущиеДанные.РодительскаяРабота = РодительЭлемента.Ссылка;
		КонецЕсли;	
		
		ТекущиеДанные.ЕдиницаДлительности = ПредопределенноеЗначение("Перечисление.ЕдиницыИзмеренияВремени.День");
		
		КонецЕсли;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ОтменаРедактирования Тогда 
		
		ТекущаяСтрока = Элементы.ДеревоРабот.ТекущаяСтрока;
		ЭлементДерева = ДеревоРабот.НайтиПоИдентификатору(ТекущаяСтрока);
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
			
			Отказ = Истина;			
			РодительЭлемента = ЭлементДерева.ПолучитьРодителя();
			Если РодительЭлемента = Неопределено Тогда 
				ИндексЭлемента = ДеревоРабот.ПолучитьЭлементы().Индекс(ЭлементДерева);
				ДеревоРабот.ПолучитьЭлементы().Удалить(ИндексЭлемента);
			Иначе
				ИндексЭлемента = РодительЭлемента.ПолучитьЭлементы().Индекс(ЭлементДерева);
				РодительЭлемента.ПолучитьЭлементы().Удалить(ИндексЭлемента);
			КонецЕсли;	
			Возврат;  
			
		КонецЕсли;	
		
	Иначе	
		
	//	Если Не ЗначениеЗаполнено(ТекущиеДанные.Наименование) Тогда 
	//		ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Наименование""'");
	//		ПоказатьПредупреждение(, ТекстСообщения);
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;	
	//
	//	Если Не ЗначениеЗаполнено(ТекущиеДанные.НачалоРаботыПлан) Тогда 
	//		ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Начало работы""'");
	//		ПоказатьПредупреждение(, ТекстСообщения);
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
	//
	//	Если Не ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботыПлан) Тогда 
	//		ТекстСообщения = НСтр("ru = 'Не заполнено поле ""Окончание работы""'");
	//		ПоказатьПредупреждение(, ТекстСообщения);
	//		Отказ = Истина;
	//		Возврат;
	//	КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
//Процедура ЗаписатьСтроительнуюРаботуИзСтрокиДерева(ИндексСтроки, СтрокаДерева = Неопределено, СоответствиеИзмененныхРабот = Неопределено)
Процедура ЗаписатьСтроительнуюРаботуИзСтрокиДерева(ИндексСтроки, СтрокаДерева = Неопределено, СоответствиеИзмененныхРабот = Неопределено,НовыйЭлемент = Ложь)	
	Если НЕ СтрокаДерева = Неопределено Тогда
		ЭлементДерева = СтрокаДерева;
	Иначе
		ЭлементДерева = ДеревоРабот.НайтиПоИдентификатору(ИндексСтроки);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭлементДерева.Ссылка) Тогда 
		СтроительнаяРаботаОбъект = ЭлементДерева.Ссылка.ПолучитьОбъект();
		
		Если ЭлементДерева.ВерсияДанных <> ЭлементДерева.Ссылка.ВерсияДанных Тогда 
			РазблокироватьСтрокуДляРедактирования(СтроительнаяРаботаОбъект.Ссылка, ЭтаФорма.УникальныйИдентификатор);
			
			Предшественники	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьСвязиМеждуРаботами(СтроительнаяРаботаОбъект.Ссылка, КонецДня(НаДату)); 

			ЗаполнитьСтрокуДереваИзРаботы(ЭлементДерева, СтроительнаяРаботаОбъект.Ссылка, Предшественники);
			
			ТекстСообщения = НСтр("ru = 'Данные были изменены другим пользователем'");
			ВызватьИсключение ТекстСообщения; 
		КонецЕсли;	
	Иначе
		СтроительнаяРаботаОбъект = Справочники.УСОERP_СтроительныеРаботы.СоздатьЭлемент();
		
		ДанныеКода = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДРИНомерРаботыВУровне(ЭлементДерева.Владелец, ЭлементДерева.РодительскаяРабота);
		
		СтроительнаяРаботаОбъект.КодСДР 			= ДанныеКода.КодСДР;
		СтроительнаяРаботаОбъект.НомерРаботыВУровне = ДанныеКода.НомерРаботыВУровне;
		СтроительнаяРаботаОбъект.Родитель 			= ЭлементДерева.РодительскаяРабота;
		НовыйЭлемент = Истина;
	КонецЕсли;	
	
	
	
	Если Не ЗначениеЗаполнено(ЭлементДерева.ЕдиницаДлительности) Тогда 
		ЭлементДерева.ЕдиницаДлительности = Перечисления.ЕдиницыИзмеренияВремени.День;	
	КонецЕсли;
	
	СтроительнаяРаботаОбъект.Наименование 	= ЭлементДерева.Наименование;
	СтроительнаяРаботаОбъект.Владелец 		= ЭлементДерева.Владелец;
	
	Попытка
		//Если НовыйЭлемент ИЛИ СтроительнаяРаботаОбъект.Наименование 	<> ЭлементДерева.Наименование ИЛИ СтроительнаяРаботаОбъект.Владелец <> ЭлементДерева.Владелец 
		//	ИЛИ СтроительнаяРаботаОбъект.Родитель <> ЭлементДерева.РодительскаяРабота   Тогда
		//	СтроительнаяРаботаОбъект.Наименование 	= ЭлементДерева.Наименование;
		//	СтроительнаяРаботаОбъект.Владелец 		= ЭлементДерева.Владелец;
		//	СтроительнаяРаботаОбъект.Родитель       = ЭлементДерева.РодительскаяРабота;
			СтроительнаяРаботаОбъект.Записать();
		Если НЕ СоответствиеИзмененныхРабот = Неопределено Тогда
			СтруктураПоРаботе = НовыЙ Структура("НовыйЭлемент, Записан", ЭлементДерева.НовыйЭлемент, Истина);
			СоответствиеИзмененныхРабот.Вставить(СтроительнаяРаботаОбъект.Ссылка, СтруктураПоРаботе);
		КонецЕсли;
	//	КонецЕсли;
	Исключение
		ТекстСообщения = НСтр("ru = 'Не удалось записать элемент справочника строительных работ %Ссылка% по причине: %Причина%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Ссылка%", ЭлементДерева.Наименование);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Причина%", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), УровеньЖурналаРегистрации.Предупреждение,
		Метаданные.Справочники.УСОERP_СтроительныеРаботы, ЭлементДерева.Наименование, ТекстСообщения);
	КонецПопытки;
		
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВидПланирования", 		ВидПланирования);
	СтруктураДанных.Вставить("НачалоРаботыПлан", 		ЭлементДерева.НачалоРаботыПлан);
	СтруктураДанных.Вставить("ОкончаниеРаботыПлан", 	ЭлементДерева.ОкончаниеРаботыПлан);
	СтруктураДанных.Вставить("ДлительностьПлан", 		ЭлементДерева.ДлительностьПлан);
	СтруктураДанных.Вставить("ЕдиницаДлительности", 	ЭлементДерева.ЕдиницаДлительности);
	СтруктураДанных.Вставить("ОбъемРаботы", 		    ЭлементДерева.ОбъемРаботы);
	СтруктураДанных.Вставить("ЕдиницаОбъема", 	        ЭлементДерева.ЕдиницаОбъема);
	СтруктураДанных.Вставить("АвторИзменения",        	ТекущийПользователь);
	СтруктураДанных.Вставить("Утверждена", 				Ложь);	
	
	УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьПараметрыВыполненияРаботы(СтроительнаяРаботаОбъект.Ссылка, ВидПланирования, НачалоДня(НаДату), СтруктураДанных);
	Если ТипЗнч(ЭлементДерева) = Тип("СтрокаДереваЗначений") Тогда
		УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьСвязиМеждуРаботами(СтроительнаяРаботаОбъект.Ссылка, НачалоДня(НаДату), ЭлементДерева.Предшественники.Скопировать(), ТекущийПользователь);
	Иначе
		УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьСвязиМеждуРаботами(СтроительнаяРаботаОбъект.Ссылка, НачалоДня(НаДату), ЭлементДерева.Предшественники.Выгрузить(), ТекущийПользователь);
	КонецЕсли;
	
	ЭлементДерева.Ссылка 		= СтроительнаяРаботаОбъект.Ссылка;
	ЭлементДерева.ВерсияДанных 	= СтроительнаяРаботаОбъект.ВерсияДанных;
	ЭлементДерева.КодСДР 		= СтроительнаяРаботаОбъект.КодСДР;

	РазблокироватьСтрокуДляРедактирования(СтроительнаяРаботаОбъект.Ссылка, ЭтаФорма.УникальныйИдентификатор);
	
	// рассчитать план
	МассивИзмененныхРабот = Новый Массив;
	УСОERP_УправлениеСтроительнымПроизводством.РассчитатьПланСценарияПланированияПроектовСтроительства(СтроительнаяРаботаОбъект.Ссылка, ВидПланирования, НачалоДня(НаДату), МассивИзмененныхРабот);
	ОбновитьИзмененныеСтрокиРабот(МассивИзмененныхРабот);
	
КонецПроцедуры	

&НаКлиенте
Процедура ДеревоРаботПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	//Проверка на изменение данных в строке, для исключения лишней перезаписи 	
	ЕстьИзменения = Ложь;
	
	Для Каждого КлючИЗНачение ИЗ ТекущаяСтрокаДерева Цикл
		
		Если ТекущиеДанные[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
			
			ЕстьИзменения = Истина;
			Прервать;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	Если НЕ ЕстьИзменения Тогда
		
		Возврат;
		
	КонецЕсли;	
	//	
	
	Если ОтменаРедактирования Тогда 
		РазблокироватьСтрокуДляРедактирования(ТекущиеДанные.Ссылка, ЭтаФорма.УникальныйИдентификатор);
		
		МассивИзмененныхРабот = Новый Массив;
		МассивИзмененныхРабот.Добавить(ТекущиеДанные.Ссылка);
		ОбновитьИзмененныеСтрокиРабот(МассивИзмененныхРабот);
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
		НовыйЭлемент = Истина;
	Иначе
		НовыйЭлемент = Ложь;
	КонецЕсли;	
	
	ЗаписатьСтроительнуюРаботуИзСтрокиДерева(Элементы.ДеревоРабот.ТекущаяСтрока);

	Если НовыйЭлемент Тогда 
		ПоказатьОповещениеПользователя(
			"Создание:", 
			ПолучитьНавигационнуюСсылку(ТекущиеДанные.Ссылка),
			Строка(ТекущиеДанные.Ссылка),
			БиблиотекаКартинок.Информация32);
	Иначе
		ПоказатьОповещениеПользователя(
			"Изменение:", 
			ПолучитьНавигационнуюСсылку(ТекущиеДанные.Ссылка),
			Строка(ТекущиеДанные.Ссылка),
			БиблиотекаКартинок.Информация32);
	КонецЕсли;	
	
	ЗаписатьПотребностьВМатериалах(ТекущиеДанные.Ссылка);
	ЗаписатьПотребностьВРесурсах(ТекущиеДанные.Ссылка);
	
	//Добавлено для пересчета сроков
	
	МассивЗависимыхРабот = ПолучитьМассивСтрокДляИзменения(ТекущиеДанные.Ссылка);	
	
	Шаг = ?(МассивЗависимыхРабот.Количество(), 100/МассивЗависимыхРабот.Количество(),0);
	
	 Сч = 1;
	 
	МассивИзмРабот = Новый Массив;
	
	Для Каждого ЭлементМассива ИЗ МассивЗависимыхРабот Цикл
		
		Состояние("Пересчет сроков работ-последователей...",Шаг*Сч);
		
		МассивИзмененныхРабот = Новый Массив;
		
		УСОERP_УправлениеСтроительнымПроизводством.РассчитатьПланСценарияПланированияПроектовСтроительства(ЭлементМассива, ВидПланирования, НачалоДня(НаДату), МассивИзмененныхРабот);
		
		Для Каждого ЭлМассива ИЗ МассивИзмененныхРабот Цикл
			
			Если МассивИзмРабот.Найти(ЭлМассива) = Неопределено Тогда
				
				МассивИзмРабот.Добавить(ЭлМассива);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Сч = Сч+1;
		
	КонецЦикла;
	
	ОбновитьИзмененныеСтрокиРабот(МассивИзмРабот); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	//Если Строка <> Неопределено Тогда
	//	СтандартнаяОбработка = Ложь;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	//СтандартнаяОбработка = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботОбъемПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");

	МатериалыТекущейРаботы = Материалы.НайтиСтроки(Новый Структура("Работа",ТекущиеДанные.Ссылка));
	
	Для Каждого СтрокаТаблицы Из МатериалыТекущейРаботы Цикл 
		СтрокаТаблицы.КоличествоУпаковокНаОбъемРаботы	= Окр(СтрокаТаблицы.КоличествоУпаковокНаЕдиницуОбъема * ТекущиеДанные.ОбъемРаботы, 3);
		ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(СтрокаТаблицы, СтруктураДействий, КэшированныеЗначения);		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТрудоемкостьМашиноемкостьРесурсовНаКлиенте(ТекущиеДанные)

	РесурсыТекущейРаботы = Ресурсы.НайтиСтроки(Новый Структура("Работа",ТекущиеДанные.Ссылка));
	
	Для Каждого СтрокаТаблицы Из РесурсыТекущейРаботы Цикл 
		ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(СтрокаТаблицы, ТекущиеДанные);		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботДлительностьПланПриИзменении(Элемент)

	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		
		СтроительнаяРаботаСтруктура = Новый Структура;
		СтроительнаяРаботаСтруктура.Вставить("Владелец", 		ТекущиеДанные.Владелец);
		СтроительнаяРаботаСтруктура.Вставить("ГрафикРаботы", 	ТекущиеДанные.ГрафикРаботы);
		СтроительнаяРаботаСтруктура.Вставить("Ссылка", 			ТекущиеДанные.Ссылка);
		
		Если ЗначениеЗаполнено(ТекущиеДанные.НачалоРаботыПлан) Тогда 
			ТекущиеДанные.ОкончаниеРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьОкончаниеПериода(СтроительнаяРаботаСтруктура, 
				ТекущиеДанные.НачалоРаботыПлан, 
				ТекущиеДанные.ДлительностьПлан, 
				ТекущиеДанные.ЕдиницаДлительности);
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботыПлан) Тогда 		
			ТекущиеДанные.НачалоРаботыПлан    = УСОERP_УправлениеСтроительнымПроизводством.РассчитатьНачалоПериода(СтроительнаяРаботаСтруктура, 
				ТекущиеДанные.ОкончаниеРаботыПлан, 
				ТекущиеДанные.ДлительностьПлан, 
				ТекущиеДанные.ЕдиницаДлительности);
		КонецЕсли;
	КонецЕсли;	

	ПересчитатьТрудоемкостьМашиноемкостьРесурсовНаКлиенте(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботЕдиницаДлительностиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда 
		
		СтроительнаяРаботаСтруктура = Новый Структура;
		СтроительнаяРаботаСтруктура.Вставить("Владелец", 		ТекущиеДанные.Владелец);
		СтроительнаяРаботаСтруктура.Вставить("ГрафикРаботы", 	ТекущиеДанные.ГрафикРаботы);
		СтроительнаяРаботаСтруктура.Вставить("Ссылка", 			ТекущиеДанные.Ссылка);

		Если ЗначениеЗаполнено(ТекущиеДанные.НачалоРаботыПлан) И ТекущиеДанные.НачалоРаботыПлан = НачалоДня(ТекущиеДанные.НачалоРаботыПлан) Тогда
			
			ТекущиеДанные.НачалоРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПервоеРабочееВремяДня(ТекущиеДанные.ГрафикРаботы, ТекущиеДанные.НачалоРаботыПлан);
			
		КонецЕсли;
		
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.НачалоРаботыПлан) Тогда 	
			
			ТекущиеДанные.ДлительностьПлан	= 0;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботыПлан) Тогда 
			
			ТекущиеДанные.ДлительностьПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(СтроительнаяРаботаСтруктура, 
				ТекущиеДанные.НачалоРаботыПлан, 
				ТекущиеДанные.ОкончаниеРаботыПлан, 
				ТекущиеДанные.ЕдиницаДлительности);
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДлительностьПлан) Тогда 	
			
			ТекущиеДанные.ОкончаниеРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьОкончаниеПериода(СтроительнаяРаботаСтруктура, 
				ТекущиеДанные.НачалоРаботыПлан, 
				ТекущиеДанные.ДлительностьПлан, 
				ТекущиеДанные.ЕдиницаДлительности);
			
			КонецЕсли;
			
		ПересчитатьТрудоемкостьМашиноемкостьРесурсовНаКлиенте(ТекущиеДанные);
			
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботНачалоРаботыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда 	
		Если ЗначениеЗаполнено(ТекущиеДанные.НачалоРаботыПлан) 
			И ТекущиеДанные.НачалоРаботыПлан = НачалоДня(ТекущиеДанные.НачалоРаботыПлан) Тогда
			
			ГрафикРаботы = ?(ЗначениеЗаполнено(ТекущиеДанные.ГрафикРаботы), ТекущиеДанные.ГрафикРаботы, РеквизитыОбъектаСтроительства.ГрафикРаботы);
			
			ТекущиеДанные.НачалоРаботыПлан = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПервоеРабочееВремяДня(ГрафикРаботы, ТекущиеДанные.НачалоРаботыПлан);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.НачалоРаботыПлан) Тогда 	
			ТекущиеДанные.ДлительностьПлан = 0;
			
		ИначеЕсли Не ЗначениеЗаполнено(ТекущиеДанные.ДлительностьПлан) Тогда 
			ТекущиеДанные.ОкончаниеРаботыПлан = ТекущиеДанные.НачалоРаботыПлан;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДлительностьПлан) Тогда 	
			
			СтроительнаяРаботаСтруктура = Новый Структура;
			СтроительнаяРаботаСтруктура.Вставить("Владелец", 		ТекущиеДанные.Владелец);
			СтроительнаяРаботаСтруктура.Вставить("ГрафикРаботы", 	ТекущиеДанные.ГрафикРаботы);
			СтроительнаяРаботаСтруктура.Вставить("Ссылка", 			ТекущиеДанные.Ссылка);
			
			ТекущиеДанные.ОкончаниеРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьОкончаниеПериода(СтроительнаяРаботаСтруктура, 
			ТекущиеДанные.НачалоРаботыПлан, 
			ТекущиеДанные.ДлительностьПлан, 
			ТекущиеДанные.ЕдиницаДлительности);
			
		КонецЕсли;
		
		ПересчитатьТрудоемкостьМашиноемкостьРесурсовНаКлиенте(ТекущиеДанные);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботОкончаниеРаботыПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда 	
		
		Если НЕ ДоДатыОкончания Тогда
			
			Если ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботыПлан) 
			И ТекущиеДанные.ОкончаниеРаботыПлан = НачалоДня(ТекущиеДанные.ОкончаниеРаботыПлан) Тогда
			
			ГрафикРаботы = ?(ЗначениеЗаполнено(ТекущиеДанные.ГрафикРаботы), ТекущиеДанные.ГрафикРаботы, РеквизитыОбъектаСтроительства.ГрафикРаботы);
			
			ТекущиеДанные.ОкончаниеРаботыПлан = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПоследнееРабочееВремяДня(ГрафикРаботы, ТекущиеДанные.ОкончаниеРаботыПлан);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботыПлан) Тогда 	
			ТекущиеДанные.ДлительностьПлан = 0;	
			
		ИначеЕсли Не ЗначениеЗаполнено(ТекущиеДанные.ДлительностьПлан) Тогда 
			ТекущиеДанные.НачалоРаботыПлан = ТекущиеДанные.ОкончаниеРаботыПлан;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.НачалоРаботыПлан) Тогда 	
			
			СтроительнаяРаботаСтруктура = Новый Структура;
			СтроительнаяРаботаСтруктура.Вставить("Владелец", 		ТекущиеДанные.Владелец);
			СтроительнаяРаботаСтруктура.Вставить("ГрафикРаботы", 	ТекущиеДанные.ГрафикРаботы);
			СтроительнаяРаботаСтруктура.Вставить("Ссылка", 			ТекущиеДанные.Ссылка);
			
			ТекущиеДанные.ДлительностьПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(СтроительнаяРаботаСтруктура, 
				ТекущиеДанные.НачалоРаботыПлан, 
				ТекущиеДанные.ОкончаниеРаботыПлан, 
				ТекущиеДанные.ЕдиницаДлительности);
			
			КонецЕсли;
			
		ПересчитатьТрудоемкостьМашиноемкостьРесурсовНаКлиенте(ТекущиеДанные);
			
	Иначе	
		
		Если ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботыПлан) 
			И ТекущиеДанные.ОкончаниеРаботыПлан = НачалоДня(ТекущиеДанные.ОкончаниеРаботыПлан) Тогда
			
			ГрафикРаботы = ?(ЗначениеЗаполнено(ТекущиеДанные.ГрафикРаботы), ТекущиеДанные.ГрафикРаботы, РеквизитыОбъектаСтроительства.ГрафикРаботы);
			
			ТекущиеДанные.ОкончаниеРаботыПлан = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьПоследнееРабочееВремяДня(ГрафикРаботы, ТекущиеДанные.ОкончаниеРаботыПлан);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботыПлан) Тогда 	
			ТекущиеДанные.ДлительностьПлан = 0;	
			
		ИначеЕсли Не ЗначениеЗаполнено(ТекущиеДанные.ДлительностьПлан) Тогда 
			ТекущиеДанные.НачалоРаботыПлан = ТекущиеДанные.ОкончаниеРаботыПлан;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ОкончаниеРаботыПлан) Тогда 	
			
			СтроительнаяРаботаСтруктура = Новый Структура;
			СтроительнаяРаботаСтруктура.Вставить("Владелец", 		ТекущиеДанные.Владелец);
			СтроительнаяРаботаСтруктура.Вставить("ГрафикРаботы", 	ТекущиеДанные.ГрафикРаботы);
			СтроительнаяРаботаСтруктура.Вставить("Ссылка", 			ТекущиеДанные.Ссылка);
			
			
			ТекущиеДанные.НачалоРаботыПлан	= УСОERP_УправлениеСтроительнымПроизводством.РассчитатьНачалоПериода(СтроительнаяРаботаСтруктура, 
				ТекущиеДанные.ОкончаниеРаботыПлан, 
				ТекущиеДанные.ДлительностьПлан, 
				ТекущиеДанные.ЕдиницаДлительности);
			
			КонецЕсли;
			
		ПересчитатьТрудоемкостьМашиноемкостьРесурсовНаКлиенте(ТекущиеДанные);
		
		КонецЕсли; 
			
	КонецЕсли; 	

КонецПроцедуры

&НаСервере 
//Пересчитывает зависимые по предшественнику строки (серверный вариант)
//Параметры - работа, которую изменили первой.
Процедура ПересчитатьЗависимыеСтроки(Работа)	
	
	МассивИзмРабот = Новый Массив; 
	
	МассивСтрок = ПолучитьМассивСтрокДляИзменения(Работа); 
	
	Для Каждого ЭлементМассива ИЗ МассивСтрок Цикл
		
		МассивИзмененныхРабот = Новый Массив;
		УСОERP_УправлениеСтроительнымПроизводством.РассчитатьПланСценарияПланированияПроектовСтроительства(ЭлементМассива, ВидПланирования, НачалоДня(НаДату), МассивИзмененныхРабот);
		
		Для Каждого ЭлМассива ИЗ МассивИзмененныхРабот Цикл
			
			Если МассивИзмРабот.Найти(ЭлМассива) = Неопределено Тогда
				МассивИзмРабот.Добавить(ЭлМассива);
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;   
	
	ОбновитьИзмененныеСтрокиРабот(МассивИзмРабот);	
	
КонецПроцедуры

&НаСервере
//Возвращает всех последователей по предшественнику из дерева
//Параметры - работа
Функция ПолучитьМассивСтрокДляИзменения(Работа) 	 
	
	МассивСтрок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Работа",Работа);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УСОERP_СтроительныеРаботы.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	               |ГДЕ
	               |	УСОERP_СтроительныеРаботы.Ссылка = &Работа
	               |ИТОГИ ПО
	               |	Ссылка ИЕРАРХИЯ";
				   
				   ТЗ = Запрос.Выполнить().Выгрузить();
				   ТЗ.Свернуть("Ссылка");
				   МассивСтрок = Тз.ВыгрузитьКолонку("Ссылка");
	
	ПолучитьПоследователей(Работа,МассивСтрок);
	
	Возврат МассивСтрок; 	
	
КонецФункции  

&НаСервере 
//Получает  всех зависимых последователей для пересчета сроков (рекурсия)
//параметры - работа, для которой ищем
//массив с результатом
Процедура ПолучитьПоследователей(Работа,МассивРабот)
	
	ТЗ = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьВсехПоследователей(Работа,НаДату,ВидПланирования); 	
	
	Для Каждого СтрокаТЗ ИЗ ТЗ Цикл
		
		Если МассивРабот.Найти(СтрокаТЗ.Работа) = Неопределено Тогда
			
			МассивРабот.Добавить(СтрокаТЗ.Работа);
			
			Таб =  УСОERP_УправлениеСтроительнымПроизводством.ПолучитьВсехПоследователей(СтрокаТЗ.Работа,НаДату,ВидПланирования);
			
			Для Каждого СтрокаТаб ИЗ Таб Цикл
				
				Если МассивРабот.Найти(СтрокаТаб.Работа) = Неопределено Тогда
					
					МассивРабот.Добавить(СтрокаТаб.Работа);
					
					ПолучитьПоследователей(СтрокаТаб.Работа,МассивРабот);
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;		 
		
	КонецЦикла; 	 
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботРаботаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка =Ложь;
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
		ПараметрыФормы.Вставить("НаДату", НаДату);
		РазблокироватьСтрокуДляРедактирования(ТекущиеДанные.Ссылка, ЭтаФорма.УникальныйИдентификатор);

		ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область Материалы

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;

	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу",       ТекущаяСтрока.Характеристика);
	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу",    ТекущаяСтрока.Упаковка);

	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Материалы"));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте      
Процедура МатериалыХарактеристикаПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	
	СтруктураДействий	= Новый Структура;	
	СтруктураДействий.Вставить("ХарактеристикаПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти", ЭтаФорма.ИмяФормы, "Материалы"));

	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыУпаковкаПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	
	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаЕдиницуОбъема");
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоНаЕдиницуОбъемаУпаковокПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрока.КоличествоУпаковокНаОбъемРаботы	= Окр(ТекущаяСтрока.КоличествоУпаковокНаЕдиницуОбъема * ТекущиеДанные.ОбъемРаботы, 3);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаЕдиницуОбъема");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыКоличествоУпаковокНаОбъемРаботыПриИзменении(Элемент)
	
	ТекущаяСтрока	= Элементы.Материалы.ТекущиеДанные;	
	
	СтруктураДействий	= Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиницСуффикс", "НаОбъемРаботы");	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
	ТекСтрока = Элементы.ДеревоРабот.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		
		ТекущаяСтрока.КоличествоУпаковокНаЕдиницуОбъема = ТекущаяСтрока.КоличествоУпаковокНаОбъемРаботы/?(ТекСтрока.ОбъемРаботы = 0 ,1,ТекСтрока.ОбъемРаботы);
		ТекущаяСтрока.КоличествоНаЕдиницуОбъема = ТекущаяСтрока.КоличествоНаОбъемРаботы/?(ТекСтрока.ОбъемРаботы = 0,1,ТекСтрока.ОбъемРаботы);
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	//
	НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма, "МатериалыНоменклатураЕдиницаИзмерения", "Материалы.Упаковка");
	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма,"МатериалыХарактеристика", "Материалы.ХарактеристикиИспользуются");
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРабот.Имя);
    
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	НовыйШрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,Истина);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", НовыйШрифт); 
	
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Использование = Истина;

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРабот.Имя);
    
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.ПометкаУдаления");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	НовыйШрифт = Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста,,,,,,Истина);
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", НовыйШрифт); 
	
	//
	
	//Элемент = УсловноеОформление.Элементы.Добавить();
	//Элемент.Использование = Истина;

	//ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРабот.Имя);
	//
	//ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.ИзмененоВРучную");
	//ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	//ОтборЭлемента.ПравоеЗначение = Истина;
	//
	//Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоРозовый); 
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущаяСтрокаРабота 	= Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущаяСтрокаРабота = Неопределено Тогда 
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрокаМатериалы	= Элементы.Материалы.ТекущиеДанные;
	ТекущаяСтрокаРабота 	= Элементы.ДеревоРабот.ТекущиеДанные;

	Если НоваяСтрока Тогда 
		ТекущаяСтрокаМатериалы.Работа	= ТекущаяСтрокаРабота.Ссылка;
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ЗаписатьПотребностьВМатериалах(Работа)
	
	ТаблицаМатериалы	= РеквизитФормыВЗначение("Материалы");
	МатериалыТекущейРаботы	= ТаблицаМатериалы.НайтиСтроки(Новый Структура("Работа",Работа));	
	Если МатериалыТекущейРаботы.Количество()= 0 тогда
		МатериалыТекущейРаботы	= ТаблицаМатериалы.НайтиСтроки(Новый Структура("Работа, НаименованиеРаботы",Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка(), Работа.Наименование));	
	КонецЕсли;
	
	УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьПотребностьВМатериалах(Работа, ВидПланирования, НаДату, ТаблицаМатериалы.Скопировать(МатериалыТекущейРаботы), ТекущийПользователь);

КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ТекущиеМатериалы = Элементы.Материалы.ТекущиеДанные;
	Если Не  ТекущиеМатериалы = Неопределено Тогда
		ТекущиеМатериалы.НаименованиеРаботы = ТекущиеДанные.Наименование;
	КонецЕсли;
	  
	ЗаписатьПотребностьВМатериалах(ТекущиеДанные.Ссылка);

	ТекущиеДанные.ИзмененоВручную = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные.ИзмененоВручную = Истина;
	
	ЗаписатьПотребностьВМатериалах(ТекущиеДанные.Ссылка);

КонецПроцедуры

&НаСервере
Процедура ОчиститьПотребностьВМатериалахИРесурсахПоРаботе(Работа)
	
	ПотребностьВМатериалахПоРаботе = Материалы.НайтиСтроки(Новый Структура("Работа", Работа));
	Для Каждого ТекСтрокаПотребность Из ПотребностьВМатериалахПоРаботе Цикл		
		НаборЗаписейМатериалов = РегистрыСведений.УСОERP_ПотребностьВМатериалах.СоздатьНаборЗаписей();
		НаборЗаписейМатериалов.Отбор.Работа.Установить			(ТекСтрокаПотребность.Работа);
		НаборЗаписейМатериалов.Отбор.Номенклатура.Установить	(ТекСтрокаПотребность.Номенклатура);
		НаборЗаписейМатериалов.Отбор.Характеристика.Установить	(ТекСтрокаПотребность.Характеристика);
		НаборЗаписейМатериалов.Отбор.ВидПланирования.Установить	(ВидПланирования);
		НаборЗаписейМатериалов.Записать();
	КонецЦикла;
	
	ПотребностьВРесурсахПоРаботе = Ресурсы.НайтиСтроки(Новый Структура("Работа", Работа));
	Для Каждого ТекСтрокаПотребность Из ПотребностьВРесурсахПоРаботе Цикл		
		НаборЗаписейРесурсов = РегистрыСведений.УСОERP_ПотребностьВРесурсах.СоздатьНаборЗаписей();
		НаборЗаписейРесурсов.Отбор.Работа.Установить			(ТекСтрокаПотребность.Работа);
		НаборЗаписейРесурсов.Отбор.Ресурс.Установить			(ТекСтрокаПотребность.Ресурс);
		НаборЗаписейРесурсов.Отбор.ВидПланирования.Установить	(ВидПланирования);
		НаборЗаписейРесурсов.Записать();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Ресурсы

&НаКлиенте
Процедура РесурсыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрокаРесурсы	= Элементы.Ресурсы.ТекущиеДанные;
	ТекущаяСтрокаРабота 	= Элементы.ДеревоРабот.ТекущиеДанные;
	ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрокаРесурсы, ТекущаяСтрокаРабота);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоРесурсов(Ресурс)
	
	Возврат Новый Структура("Рабочие, Механизмы", Ресурс.Рабочие.Итог("Количество"), Ресурс.Механизмы.Итог("Количество"));
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрокаРесурсы, ТекущаяСтрокаРабота)
	
	Если НЕ ТекущаяСтрокаРесурсы = Неопределено И ТекущаяСтрокаРабота = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДлительностьПланЧас= ?(ТекущаяСтрокаРабота.ЕдиницаДлительности = ЕдиницыИзмеренияВремениЧас, ТекущаяСтрокаРабота.ДлительностьПлан,
							УСОERP_УправлениеСтроительнымПроизводством.РассчитатьДлительностьПериода(ТекущаяСтрокаРабота.Ссылка, 
							ТекущаяСтрокаРабота.НачалоРаботыПлан, 
							ТекущаяСтрокаРабота.ОкончаниеРаботыПлан, 
							ЕдиницыИзмеренияВремениЧас,
							?(ЗначениеЗаполнено(ТекущаяСтрокаРесурсы.ГрафикРаботы),ТекущаяСтрокаРесурсы.ГрафикРаботы, ?(ЗначениеЗаполнено(ТекущаяСтрокаРабота.ГрафикРаботы),ТекущаяСтрокаРабота.ГрафикРаботы, РеквизитыОбъектаСтроительства.ГрафикРаботы))));		
					
			
	КоличествоРабочих =  ПолучитьКоличествоРесурсов(ТекущаяСтрокаРесурсы.Ресурс);
		
	ТекущаяСтрокаРесурсы.Трудоемкость	= ТекущаяСтрокаРесурсы.Количество * ТекущаяСтрокаРесурсы.ЗагрузкаПроцент /100 
		* КоличествоРабочих.Рабочие* ДлительностьПланЧас;
		
	ТекущаяСтрокаРесурсы.Машиноемкость	= ТекущаяСтрокаРесурсы.Количество * ТекущаяСтрокаРесурсы.ЗагрузкаПроцент /100 
		* КоличествоРабочих.Механизмы * ДлительностьПланЧас;
		
КонецПроцедуры

&НаКлиенте
Процедура РесурсыЗагрузкаПроцентПриИзменении(Элемент)
	
	ТекущаяСтрокаРесурсы	= Элементы.Ресурсы.ТекущиеДанные;
	ТекущаяСтрокаРабота 	= Элементы.ДеревоРабот.ТекущиеДанные;
	ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрокаРесурсы, ТекущаяСтрокаРабота);
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыРесурсПриИзменении(Элемент)
	
	ТекущаяСтрокаРесурсы	= Элементы.Ресурсы.ТекущиеДанные;
	ТекущаяСтрокаРабота 	= Элементы.ДеревоРабот.ТекущиеДанные;
	ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрокаРесурсы, ТекущаяСтрокаРабота);
	
	Если  ТекущаяСтрокаРесурсы <> Неопределено И ТекущаяСтрокаРабота <> Неопределено Тогда 
		ТекущаяСтрокаРесурсы.ГрафикРаботы = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТекущаяСтрокаРабота.Ссылка,"ГрафикРаботы");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыГрафикРаботыПриИзменении(Элемент)
	
	ТекущаяСтрокаРесурсы	= Элементы.Ресурсы.ТекущиеДанные;
	ТекущаяСтрокаРабота 	= Элементы.ДеревоРабот.ТекущиеДанные;
	ПересчитатьТрудоемкостьМашиноемкостьНаКлиенте(ТекущаяСтрокаРесурсы, ТекущаяСтрокаРабота);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПотребностьВРесурсах(Работа)
	
	ТаблицаРесурсы	= РеквизитФормыВЗначение("Ресурсы");
	РесурсыТекущейРаботы	= ТаблицаРесурсы.НайтиСтроки(Новый Структура("Работа",Работа));
		
	Если РесурсыТекущейРаботы.Количество()= 0 тогда
		РесурсыТекущейРаботы	= ТаблицаРесурсы.НайтиСтроки(Новый Структура("Работа, НаименованиеРаботы",Справочники.УСОERP_СтроительныеРаботы.ПустаяСсылка(), Работа.Наименование));	
	КонецЕсли;
      
	УСОERP_УправлениеСтроительнымПроизводством.ЗаписатьПотребностьВРесурсах(Работа, ВидПланирования, НаДату, ТаблицаРесурсы.Скопировать(РесурсыТекущейРаботы), ТекущийПользователь);

КонецПроцедуры

&НаКлиенте
Процедура РесурсыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ТекущиеРесурсы = Элементы.Ресурсы.ТекущиеДанные;
	Если Не  ТекущиеРесурсы = Неопределено Тогда
		ТекущиеРесурсы.НаименованиеРаботы = ТекущиеДанные.Наименование;
	КонецЕсли;

	ЗаписатьПотребностьВРесурсах(ТекущиеДанные.Ссылка);
	
	ТекущиеДанные.ИзмененоВручную = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ТекущиеДанные.ИзмененоВручную = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущаяСтрокаРесурсы	= Элементы.Ресурсы.ТекущиеДанные;
	ТекущаяСтрокаРабота 	= Элементы.ДеревоРабот.ТекущиеДанные;

	Если НоваяСтрока Тогда 
		ТекущаяСтрокаРесурсы.Работа	= ТекущаяСтрокаРабота.Ссылка;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура РесурсыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	ТекущаяСтрокаРабота 	= Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущаяСтрокаРабота = Неопределено Тогда 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Предшественники

&НаКлиенте
Процедура ДеревоРаботПодписьПредшественникиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	ПараметрыФормы = Новый Структура;	
//	ПараметрыФормы.Вставить("Отбор", Новый Структура("Владелец, ПометкаУдаления", СценарийПланирования, Ложь));
	ПараметрыФормы.Вставить("СценарийПланирования",СценарийПланирования);
	ПараметрыФормы.Вставить("ПометкаУдаления",Ложь);
	
	Предшественники = ТекущиеДанные.Предшественники;
	Если Предшественники.Количество() = 1 Тогда 
		ПараметрыФормы.Вставить("ТекущаяСтрока", Предшественники[0].РаботаПредшественник);
	КонецЕсли;	
	
	ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПодписьПредшественникиАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
		ДанныеВыбора = УСОERP_УправлениеСтроительнымПроизводством.СформироватьДанныеВыбораРаботыСценарияПланирования(Текст, 
			СценарийПланирования, 
			?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Ссылка));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПодписьПредшественникиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Предшественники = ТекущиеДанные.Предшественники;
	Предшественники.Очистить();
	
	НоваяСтрока = Предшественники.Добавить();
	НоваяСтрока.ОбъектСтроительстваПредшественника 	= ОбъектСтроительства;
	НоваяСтрока.РаботаПредшественник 				= ВыбранноеЗначение;
	НоваяСтрока.ТипЗависимости 						= ПредопределенноеЗначение("Перечисление.УСОERP_ТипыЗависимостейРабот.ОкончаниеНачало");
	
	ТекущиеДанные.ПодписьПредшественники = ПредставлениеПредшественников(Предшественники, ОбъектСтроительства);
	ТекущиеДанные.ИзмененоВручную = Истина;
	ЗаписатьСтроительнуюРаботуИзСтрокиДерева(Элементы.ДеревоРабот.ТекущаяСтрока);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПодписьПредшественникиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекущиеДанные.ПодписьПредшественники) Тогда 
		Предшественники = ТекущиеДанные.Предшественники;
		Предшественники.Очистить();
		ТекущиеДанные.ПодписьПредшественники = "";
		ЗаписатьСтроительнуюРаботуИзСтрокиДерева(Элементы.ДеревоРабот.ТекущаяСтрока);	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПодписьПредшественникиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Текст) Тогда 
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
		ДанныеВыбора = УСОERP_УправлениеСтроительнымПроизводством.СформироватьДанныеВыбораРаботыСценарияПланирования(Текст, 
			СценарийПланирования, 
			?(ТекущиеДанные = Неопределено, Неопределено, ТекущиеДанные.Ссылка));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПодписьПредшественникиОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка =Ложь;
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Ссылка) Тогда 
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Ссылка);
		ПараметрыФормы.Вставить("ТекущаяЗакладкаПредшественники", Истина);
		РазблокироватьСтрокуДляРедактирования(ТекущиеДанные.Ссылка, ЭтаФорма.УникальныйИдентификатор);

		ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблонИзРабот(Команда)
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(СценарийПланирования) Тогда
			ФормаСозданияШаблона = ПолучитьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаСозданияШаблонаИзРабот");
			ФормаСозданияШаблона.Источник = Неопределено;
			ФормаСозданияШаблона.Открыть();				
		КонецЕсли; 
	Иначе
		ФормаСозданияШаблона = ПолучитьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаСозданияШаблонаИзРабот");
		МассивИндексовСтрок = Элементы.ДеревоРабот.ВыделенныеСтроки;
		СписокРабот = Новый СписокЗначений;
		Для Каждого ЭлементМассивИндексовСтрок Из МассивИндексовСтрок Цикл
			СтрокаДереваРабот = ДеревоРабот.НайтиПоИдентификатору(ЭлементМассивИндексовСтрок);
			СписокРабот.Добавить(СтрокаДереваРабот.Ссылка);
		КонецЦикла;
		ФормаСозданияШаблона.Источник = СписокРабот;
		ФормаСозданияШаблона.Открыть();		
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРаботыИзШаблона(Команда)
	ТекущиеДанные = Элементы.ДеревоРабот.ТекущиеДанные;
	
	ПередаваемыеПараметры = Новый Структура;
	
	Если Не ЗначениеЗаполнено(СценарийПланирования) Тогда 
			Сообщить(НСтр("ru='Не заполнен сценарий планирования.'"));
			Возврат;
	КонецЕсли;		
	
	Если ТекущиеДанные = Неопределено Тогда
		ПередаваемыеПараметры.Вставить("Родитель", Неопределено);
		ПередаваемыеПараметры.Вставить("Сценарий", СценарийПланирования);
	Иначе	
		Если Не ЭтоСуммарнаяРабота(ТекущиеДанные.Ссылка) Тогда
			Сообщить(НСтр("ru='Работа не может иметь потомков.'"));
			Возврат;
		КонецЕсли;
		ПередаваемыеПараметры.Вставить("Родитель", ТекущиеДанные.Ссылка);
		ПередаваемыеПараметры.Вставить("Сценарий", СценарийПланирования);
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьФормуПланаПроекта", ЭтаФорма);
	ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаСозданияРаботИзШаблона" ,ПередаваемыеПараметры,,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФормуПланаПроекта(Результат, Параметры) Экспорт
	ОбновитьДеревоРабот();
КонецПроцедуры	

&НаСервере
Функция ЭтоСуммарнаяРабота(ТекущаяРабота)
   Возврат ТекущаяРабота.СуммарнаяРабота;	
КонецФункции	

#КонецОбласти

#Область СохранениеОбновлениеДанных

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	
	СоответствиеИзмененныхРабот = Новый Соответствие;
		
	ЗаписатьИзмененияНаСервере(СоответствиеИзмененныхРабот);
	
	Для Каждого СтрокаСоотвРабот Из СоответствиеИзмененныхРабот Цикл
		Если СтрокаСоотвРабот.Значение.НовыйЭлемент 
			И СтрокаСоотвРабот.Значение.Записан Тогда 
			ПоказатьОповещениеПользователя(
				"Создание:", 
				ПолучитьНавигационнуюСсылку(СтрокаСоотвРабот.Ключ),
				Строка(СтрокаСоотвРабот.Ключ),
				БиблиотекаКартинок.Информация32);
		ИначеЕсли СтрокаСоотвРабот.Значение.Записан Тогда
			ПоказатьОповещениеПользователя(
				"Изменение:", 
				ПолучитьНавигационнуюСсылку(СтрокаСоотвРабот.Ключ),
				Строка(СтрокаСоотвРабот.Ключ),
				БиблиотекаКартинок.Информация32);
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьДанныеНаСервере();
	ОбновитьКнопкиСвернутьДоУровня();

КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере(СоответствиеИзмененныхРабот)
	
	//мДеревоРабот = РеквизитФормыВЗначение("ДеревоРабот");
	//
	//ИзмененныеСтроки = мДеревоРабот.Строки.НайтиСтроки(Новый Структура("ИзмененоВручную", Истина), Истина);
	//
	//Для Каждого ИзмененнаяСтрока из ИзмененныеСтроки Цикл
	//	
	//	ЗаписатьСтроительнуюРаботуИзСтрокиДерева(, ИзмененнаяСтрока, СоответствиеИзмененныхРабот);
	//	
	//	Если НовыйЭлемент Тогда 
	//		ПоказатьОповещениеПользователя(
	//			"Создание:", 
	//			ПолучитьНавигационнуюСсылку(ТекущиеДанные.Ссылка),
	//			Строка(ТекущиеДанные.Ссылка),
	//			БиблиотекаКартинок.Информация32);
	//	Иначе
	//		ПоказатьОповещениеПользователя(
	//			"Изменение:", 
	//			ПолучитьНавигационнуюСсылку(ТекущиеДанные.Ссылка),
	//			Строка(ТекущиеДанные.Ссылка),
	//			БиблиотекаКартинок.Информация32);
	//	КонецЕсли;	

	//	ЗаписатьПотребностьВМатериалах(ИзмененнаяСтрока.Ссылка);
	//	ЗаписатьПотребностьВРесурсах(ИзмененнаяСтрока.Ссылка);
	//	ИзмененнаяСтрока.ИзмененоВручную = Ложь;
	//КонецЦикла;
	//
	//ЗначениеВРеквизитФормы(мДеревоРабот, "ДеревоРабот");
	//
	//Индекс = -1;
	//УСОERP_УправлениеСтроительнымПроизводством.НайтиРаботуВДеревеПоСсылке(ДеревоРабот.ПолучитьЭлементы(), ТекущаяРабота, Индекс);
	//Если Индекс > -1 Тогда
	//	Элементы.ДеревоРабот.ТекущаяСтрока = Индекс;
	//КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	СценарийПланированияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные(Команда)
	
	ОбновитьДанныеНаСервере();
	ОбновитьКнопкиСвернутьДоУровня();
	
КонецПроцедуры

#КонецОбласти

#Область КритическийПуть

&НаКлиенте
Процедура РассчитатьКритическийПуть(Команда)
	РассчитатьКритическийПутьНаСервере();
	КритическиеЗадачи = Истина;
КонецПроцедуры


// расчитать критический путь 
// 
&НаСервере
Процедура РассчитатьКритическийПутьНаСервере()
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_РассчитатьКритическийПутьНаСервере(ЭтотОбъект, м_тзВершиныГрафа);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ ПРЯМОГО РАСЧЕТА

// получить вершину как можно позже ( )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Функция ПолучитьВершинуКакМожноПозже()
	НайденнаяСтрока = Неопределено;
	Для каждого Стр Из м_тзВершиныГрафа Цикл
		Если (Стр.ТипОграничения = Перечисления.УСОERP_ТипыОграничений.КакМожноПозже) и (Стр.КоличествоВходов <> -2)Тогда
			 Если НайденнаяСтрока = Неопределено Тогда
			    НайденнаяСтрока = Стр;
			 Иначе	
			    Если НайденнаяСтрока.ДатаНач < Стр.ДатаНач Тогда
				   НайденнаяСтрока = Стр;
				КонецЕсли; 
			 КонецЕсли; 
		КонецЕСли;	
	КонецЦикла; 	
    Возврат НайденнаяСтрока;
КонецФункции

// расчитать период выполнения работы как можно позже ( строка работы , время окончания   =   неопределено , перезапуск   =   ложь )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Функция РасчитатьПериодВыполненияРаботыКакМожноПозже(СтрокаРаботы,ВремяОкончания = Неопределено,Перезапуск = Ложь) Экспорт
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_РасчитатьПериодВыполненияРаботыКакМожноПозже(ЭтотОбъект, ДопПараметры, СтрокаРаботы,ВремяОкончания,Перезапуск);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции
 
// расставить работы как можно позже ( )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура РасставитьРаботыКакМожноПозже()
	СтрокаРаботы = ПолучитьВершинуКакМожноПозже();
	Пока ЗначениеЗаполнено(СтрокаРаботы) Цикл
		РасчитатьПериодВыполненияРаботыКакМожноПозже(СтрокаРаботы);
		СтрокаРаботы.КоличествоВходов = -2;
		СтрокаРаботы = ПолучитьВершинуКакМожноПозже();
	КонецЦикла; 
КонецПроцедуры 

// расчитать период выполнения работы ( строка работы ) 	
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура РасчитатьПериодВыполненияРаботы(СтрокаРаботы)	
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_РасчитатьПериодВыполненияРаботы(ЭтотОбъект, ДопПараметры, СтрокаРаботы);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры

// отметить время поступления последователей ( строка работы )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура ОтметитьВремяПоступленияПоследователей(СтрокаРаботы)
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ОтметитьВремяПоступленияПоследователей(ЭтотОбъект, ДопПараметры, СтрокаРаботы);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры

//когда выбраны учитываемые работы, у 
&НаСервере
Процедура ВосстановитьПрежнееВремяВыполненияУНеучитываемыхРабот()
	//Для каждого СтрокаРаботы Из м_тзВершиныГрафа Цикл
	//	Поз = УчитываемыеРаботы.Найти(СтрокаРаботы.Ссылка);
	//	Если Поз = Неопределено Тогда
	//		//смотрим дата нач и дата кон по прежнему расчету
	//		СтруктураОтбора = Новый Структура("Работа");
	//		СтруктураОтбора.Работа = СтрокаРаботы.Ссылка;
	//		
	//		ВыборкаЗначенийРабот = РегистрыСведений.ЗначенияРабот.Выбрать(СтруктураОтбора);
	//		ДатаНач = Неопределено;
	//		ДатаКон = Неопределено;
	//		
	//		РасчетКалендарногоПлана = СтрокаРаботы.Ссылка.Владелец.ОсновнойРасчетКалендарногоПлана;
	//		
	//		Пока ВыборкаЗначенийРабот.Следующий() Цикл   
	//			Если ВыборкаЗначенийРабот.РасчетКалендарногоПлана <> РасчетКалендарногоПлана Тогда
	//				Продолжить;
	//			КонецЕсли; 
	//			Если ДатаНач = Неопределено Тогда
	//				ДатаНач = ВыборкаЗначенийРабот.ДатаНач;
	//			КонецЕсли; 
	//			
	//			Если ДатаКон = Неопределено Тогда
	//				ДатаКон = ВыборкаЗначенийРабот.ДатаКон;
	//			КонецЕсли; 
	//			
	//			Если ВыборкаЗначенийРабот.ДатаНач < ДатаНач Тогда
	//				ДатаНач = ВыборкаЗначенийРабот.ДатаНач;
	//			КонецЕсли; 
	//			Если ВыборкаЗначенийРабот.ДатаКон > ДатаКон Тогда
	//				ДатаКон = ВыборкаЗначенийРабот.ДатаКон;
	//			КонецЕсли;  
	//		КонецЦикла; 
	//		
	//		Если НЕ ((ДатаНач = Неопределено) ИЛИ (ДатаКон = Неопределено)) Тогда 
	//			СтрокаРаботы.ДатаНач = ДатаНач;
	//			СтрокаРаботы.ДатаКон = ДатаКон;
	//			СообщитьЛОГ("Восстановили прежнее время выполнения работы "+СтрокаРаботы.Ссылка+"("+ДатаНач+"-"+ДатаКон+")");
	//		КонецЕсли; 
	//	КонецЕсли; 
	//КонецЦикла; 
КонецПроцедуры
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ДЛЯ ОБРАТНОГО РАСЧЕТА

// получить не рассчитанную вершину обратный расчет ( ) 	
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Функция ПолучитьНеРассчитаннуюВершинуОбратныйРасчет()	
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПолучитьНеРассчитаннуюВершинуОбратныйРасчет(ЭтотОбъект, ДопПараметры);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

// получить вершину как можно раньше ( )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Функция ПолучитьВершинуКакМожноРаньше()
	НайденнаяСтрока = Неопределено;
	Для каждого Стр Из м_тзВершиныГрафа Цикл
		Если (Стр.ТипОграничения = Перечисления.УСОERP_ТипыОграничений.КакМожноРаньше) и (Стр.КоличествоВыходов <> -2)Тогда
			 Если НайденнаяСтрока = Неопределено Тогда
			    НайденнаяСтрока = Стр;
			 Иначе	
			    Если НайденнаяСтрока.ДатаКон > Стр.ДатаКон Тогда
				   НайденнаяСтрока = Стр;
				КонецЕсли; 
			 КонецЕсли; 
		КонецЕСли;	
	КонецЦикла; 	
    Возврат НайденнаяСтрока;
КонецФункции

// расчитать период выполнения работы как можно раньше ( строка работы , время начала   =   неопределено , перезапуск   =   ложь )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Функция РасчитатьПериодВыполненияРаботыКакМожноРаньше(СтрокаРаботы,ВремяНачала = Неопределено,Перезапуск = Ложь) Экспорт
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_РасчитатьПериодВыполненияРаботыКакМожноРаньше(ЭтотОбъект, ДопПараметры, СтрокаРаботы,ВремяНачала,Перезапуск);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции 
 
// расставить работы как можно раньше ( )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура РасставитьРаботыКакМожноРаньше()
	СтрокаРаботы = ПолучитьВершинуКакМожноРаньше();
	Пока ЗначениеЗаполнено(СтрокаРаботы) Цикл
		РасчитатьПериодВыполненияРаботыКакМожноРаньше(СтрокаРаботы);
		СтрокаРаботы.КоличествоВыходов = -2;
		СтрокаРаботы = ПолучитьВершинуКакМожноРаньше();
	КонецЦикла; 
КонецПроцедуры 

// расчитать период выполнения работы обратный расчет ( строка работы ) 	
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура РасчитатьПериодВыполненияРаботыОбратныйРасчет(СтрокаРаботы)	
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_РасчитатьПериодВыполненияРаботыОбратныйРасчет(ЭтотОбъект, ДопПараметры, СтрокаРаботы);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры

// отметить время поступления прешественников ( строка работы )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура ОтметитьВремяПоступленияПрешественников(СтрокаРаботы)
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ОтметитьВремяПоступленияПрешественников(ЭтотОбъект, ДопПараметры, СтрокаРаботы);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПО РАБОТЕ С РЕСУРСАМИ

// прочитать таблицу доступных ресурсов ( )
// Параметры:
// 
// Возвращаемое значение: 
//
&НаСервере
Процедура ПрочитатьТаблицуДоступныхРесурсов()
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПрочитатьТаблицуДоступныхРесурсов(ЭтотОбъект, ДопПараметры);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры
 
// расчитать доступные ресурсы ( )   экспорт
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура РасчитатьДоступныеРесурсы() Экспорт
	//СписокУчитываемыхРесурсов = Новый СписокЗначений;  
	//СписокКалендарныхПланов = Новый СписокЗначений; 
	//Мас = СЦОбъект.УчитываемыеРесурсы.ВыгрузитьКолонку("Ресурс");
	//СписокУчитываемыхРесурсов.ЗагрузитьЗначения(Мас);
	//
	//СписокРасчетов = Новый СписокЗначений;
	//Для каждого Стр Из СЦОбъект.ЭлементыРасчетаДляРесурсов Цикл
	//	СписокКалендарныхПланов.Добавить(Стр.Сценарий);
	//	СписокРасчетов.Добавить(Стр.РасчетКалендарногоПлана);
	//КонецЦикла; 

	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ДоступныеРесурсы.Ресурс КАК Ресурс,
	//               |	ДоступныеРесурсы.Количество,
	//               |	ДоступныеРесурсы.Период КАК ДатаНач,
	//               |	NULL КАК ДатаКон,
	//               |	ДоступныеРесурсы.Подразделение,
	//               |	ДоступныеРесурсы.Организация
	//               |ИЗ
	//               |	РегистрСведений.ДоступныеРесурсы КАК ДоступныеРесурсы
	//               |ГДЕ
	//               |	ДоступныеРесурсы.Ресурс В(&СписокУчитываемыхРесурсов)";
	//			   
	// Запрос.УстановитьПараметр("СписокРасчетов",СписокРасчетов);
	// Запрос.УстановитьПараметр("СписокКалендарныхПланов",СписокКалендарныхПланов);					   
	// Запрос.УстановитьПараметр("СписокУчитываемыхРесурсов",СписокУчитываемыхРесурсов);
	// 
	// тзРесурсыДоступные = Запрос.Выполнить().Выгрузить();
	// 
	// Запрос.Текст = "ВЫБРАТЬ
	//                |	РаботыРесурсы.Ресурс,
	//                |	РаботыРесурсы.Количество,
	//                |	ЗначенияРабот.ДатаНач,
	//                |	ЗначенияРабот.ДатаКон,
	//                |	ВЫБОР
	//                |		КОГДА РаботыРесурсы.Ссылка.Исполнитель = НЕОПРЕДЕЛЕНО
	//                |			ТОГДА ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	//                |		ИНАЧЕ РаботыРесурсы.Ссылка.Исполнитель
	//                |	КОНЕЦ КАК Подразделение,
	//                |	РаботыРесурсы.Ссылка.Владелец.Владелец.Организация КАК Организация
	//                |ИЗ
	//                |	РегистрСведений.ЗначенияРабот КАК ЗначенияРабот
	//                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Работы.Ресурсы КАК РаботыРесурсы
	//                |		ПО ЗначенияРабот.Работа = РаботыРесурсы.Ссылка
	//                |ГДЕ
	//                |	ЗначенияРабот.РасчетКалендарногоПлана В(&СписокРасчетов)
	//                |	И ЗначенияРабот.Работа.Владелец В(&СписокКалендарныхПланов)
	//                |	И РаботыРесурсы.Ссылка.Владелец В(&СписокКалендарныхПланов)
	//                |	И РаботыРесурсы.Ресурс В(&СписокУчитываемыхРесурсов)
	//                |
	//                |УПОРЯДОЧИТЬ ПО
	//                |	РаботыРесурсы.Ресурс,
	//                |	ЗначенияРабот.ДатаНач";
	// тзРесурсыИспользуемые = Запрос.Выполнить().Выгрузить();
	// 
	//				
	// тзРесурсы = Новый ТаблицаЗначений;
	// тзРесурсы.Колонки.Добавить("Ресурс");
	// тзРесурсы.Колонки.Добавить("Организация");
	// тзРесурсы.Колонки.Добавить("Подразделение");
	// тзРесурсы.Колонки.Добавить("тзПериоды");
	// тзРесурсы.Колонки.Добавить("ВсегоРесурсов",Новый ОписаниеТипов("Число"));
	// 
	// Для каждого Стр Из тзРесурсыДоступные Цикл
	//	СтруктураПоиска = Новый Структура("Ресурс,Организация,Подразделение"); 
	//	СтруктураПоиска.Ресурс = Стр.Ресурс;
	//	СтруктураПоиска.Организация = Стр.Организация;
	//	СтруктураПоиска.Подразделение = Стр.Подразделение;
	//	Мас = тзРесурсы.НайтиСтроки(СтруктураПоиска);
	//    Если Мас.Количество() = 0 Тогда
	//	   СтрокаТзРесурсы = Неопределено;
	//	Иначе	
	//	   СтрокаТзРесурсы = Мас[0];
	//	КонецЕсли; 
	//    //СтрокаТзРесурсы = тзРесурсы.Найти(Стр.Ресурс,"Ресурс");
	//	Если СтрокаТзРесурсы = Неопределено Тогда
	//	    СтрокаТзРесурсы = тзРесурсы.Добавить();
	//		СтрокаТзРесурсы.Ресурс = Стр.Ресурс;
	//		СтрокаТзРесурсы.Организация = Стр.Организация;
	//        СтрокаТзРесурсы.Подразделение = Стр.Подразделение;
	//		СтрокаТзРесурсы.ВсегоРесурсов = Стр.Количество;

	//		тзПериоды = Новый ТаблицаЗначений;
	//		тзПериоды.Колонки.Добавить("Период");
	//        тзПериоды.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число"));
	//		тзПериоды.Колонки.Добавить("ВсегоРесурсов",Новый ОписаниеТипов("Число"));
	//		СтрокаТзРесурсы.тзПериоды = тзПериоды;
	//	КонецЕсли; 
	// 	
	//    тзПериоды = СтрокаТзРесурсы.тзПериоды;
	//	СтрокаТзПериоды = тзПериоды.Найти(Стр.ДатаНач,"Период");
	//	Если СтрокаТзПериоды = Неопределено Тогда
	//	    СтрокаТзПериоды = тзПериоды.Добавить();
	//		СтрокаТзПериоды.Период = Стр.ДатаНач;
	//		СтрокаТзПериоды.Количество = Стр.Количество;
	//		СтрокаТзПериоды.ВсегоРесурсов = Стр.Количество;

	//	КонецЕсли; 
	//	ИспРес = тзРесурсыИспользуемые.НайтиСтроки(СтруктураПоиска);
	//	Для каждого ИспользуемыйРесурс из ИспРес Цикл
	//		ТекДата = ИспользуемыйРесурс.ДатаНач;
	//		Пока ТекДата<ИспользуемыйРесурс.ДатаКон Цикл
	//			СтрокаТзПериоды = тзПериоды.Найти(ТекДата,"Период");
	//			Если СтрокаТзПериоды = Неопределено Тогда
	//				СтрокаТзПериоды = тзПериоды.Добавить();
	//				СтрокаТзПериоды.Период = ТекДата;
	//				СтрокаТзПериоды.Количество = Стр.Количество - ИспользуемыйРесурс.Количество;
	//				СтрокаТзПериоды.ВсегоРесурсов = Стр.Количество - ИспользуемыйРесурс.Количество;
	//			Иначе
	//				СтрокаТзПериоды.Количество = СтрокаТзПериоды.Количество - ИспользуемыйРесурс.Количество;	
	//				СтрокаТзПериоды.ВсегоРесурсов = СтрокаТзПериоды.Количество - ИспользуемыйРесурс.Количество;	
	//			КонецЕсли;
	//			ТекДата = ТекДата + 86400;	
	//		КонецЦикла;
	//		СтрокаТзПериоды = тзПериоды.Добавить();
	//		СтрокаТзПериоды.Период = ТекДата;
	//		СтрокаТзПериоды.Количество = Стр.Количество;
	//		СтрокаТзПериоды.ВсегоРесурсов = Стр.Количество;

	//	КонецЦикла;
	//	
	//	
	//	//Если Стр.ДатаКон = NULL Тогда
	//	//	Если СтрокаТзРесурсы.ВсегоРесурсов>Стр.Количество Тогда
	//	//		 СтрокаТзПериоды.Количество = -1*(СтрокаТзРесурсы.ВсегоРесурсов-Стр.Количество); 
	//	//	ИначеЕсли СтрокаТзРесурсы.ВсегоРесурсов<=Стр.Количество Тогда
	//	//		 СтрокаТзПериоды.Количество = Стр.Количество- СтрокаТзРесурсы.ВсегоРесурсов;
	//	//	КонецЕсли; 
	//	//	//СтрокаТзПериоды.Количество = Стр.Количество; 
	//	//	СтрокаТзПериоды.ВсегоРесурсов = Стр.Количество; 
	//	//Иначе
	//	//	СтрокаТзПериоды.Количество = -1*Стр.Количество; 
	//	//	
	//	//	СтрокаТзПериоды = тзПериоды.Найти(Стр.ДатаКон,"Период");
	//	//	Если СтрокаТзПериоды = Неопределено Тогда
	//	//		СтрокаТзПериоды = тзПериоды.Добавить();
	//	//		СтрокаТзПериоды.Период = Стр.ДатаКон;
	//	//		СтрокаТзПериоды.Количество = 0;
	//	//	КонецЕсли; 	
	//	//	СтрокаТзПериоды.Количество = Стр.Количество; 
	//	//КонецЕсли; 
	// КонецЦикла; 
	// 
	// 
	// //переписываем все в расчет КП
	// СЦОбъект.ДоступныеРесурсы.Очистить();
	// Для каждого Стр  Из тзРесурсы Цикл
	//    тзПериоды = Стр.тзПериоды;
	// 	тзПериоды.Сортировать("Период Возр");
	//	ТекущийОстаток = 0;
	//	Для каждого СтрПериод Из тзПериоды Цикл
	//	   ТекущийОстаток = Мин(Макс(ТекущийОстаток+СтрПериод.Количество,0),СтрПериод.ВсегоРесурсов);
	//	   //СтрПериод.Количество = ТекущийОстаток;  	
	//	   //прописываем все в таблицу ДоступныеРесурсы
	//       СтрДоступныеРесурсы = СЦОбъект.ДоступныеРесурсы.Добавить();
	//	   СтрДоступныеРесурсы.Ресурс = Стр.Ресурс;
	//	   СтрДоступныеРесурсы.Организация = Стр.Организация;
	//	   СтрДоступныеРесурсы.Подразделение = Стр.Подразделение;
	//	   СтрДоступныеРесурсы.Период = СтрПериод.Период;
	//	   СтрДоступныеРесурсы.Количество = СтрПериод.Количество;
	//    КонецЦикла;  
	// КонецЦикла; 
	//
КонецПроцедуры

// проверить доступность ресурсов ( результат , строка работы , для обратного расчета = ложь )   экспорт
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Функция ПроверитьДоступностьРесурсов(Результат,СтрокаРаботы,ДляОбратногоРасчета=Ложь) Экспорт
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПроверитьДоступностьРесурсов(ЭтотОбъект, ДопПараметры, Результат,СтрокаРаботы,ДляОбратногоРасчета);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции
 
// изменить доступность ресурсов ( строка работы , дата нач , дата кон , прибавление = ложь ) ;
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура ИзменитьДоступностьРесурсов(СтрокаРаботы,ДатаНач,ДатаКон,Прибавление=Ложь);
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ИзменитьДоступностьРесурсов(ЭтотОбъект, ДопПараметры, СтрокаРаботы,ДатаНач,ДатаКон,Прибавление);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры

&НаСервере
Функция РассчитатьПериод(Перем1 = Неопределено, Перем2 = Неопределено, Перем3 = Неопределено, Перем4 = Неопределено, Перем5 = Неопределено, Перем6 = Неопределено, ПеремСтрокаРаботы = Неопределено);
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_РассчитатьПериод(ЭтотОбъект, ДопПараметры, Перем1, Перем2, Перем3, Перем4, Перем5, Перем6, ПеремСтрокаРаботы);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции // ()

&НаСервере
Функция РассчитатьПериодОбратно(Перем1 = Неопределено, Перем2 = Неопределено, Перем3 = Неопределено, Перем4 = Неопределено, Перем5 = Неопределено, Перем6 = Неопределено,ПеремСтрокаРаботы = Неопределено)
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_РассчитатьПериодОбратно(ЭтотОбъект, ДопПараметры, Перем1, Перем2, Перем3, Перем4, Перем5, Перем6, ПеремСтрокаРаботы);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции // ()

// получить смещение простой алгоритм ( стр , строка работы , алгоритм = 1 )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Функция ПолучитьСмещениеПростойАлгоритм(Стр,СтрокаРаботы,Алгоритм=1)
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПолучитьСмещениеПростойАлгоритм(ЭтотОбъект, ДопПараметры, Стр,СтрокаРаботы,Алгоритм);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

// получить сетевой график ( )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура ПолучитьСетевойГрафик()
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПолучитьСетевойГрафик(ЭтотОбъект, ДопПараметры);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры

// расчет календарного плана ( расчет критического пути   =   ложь )   экспорт
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура РасчетКалендарногоПлана(РасчетКритическогоПути = Ложь) Экспорт
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_РасчетКалендарногоПлана(ЭтотОбъект, ДопПараметры, РасчетКритическогоПути);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры

// получить не рассчитанную вершину ( )
// Параметры:
// 
// Возвращаемое значение: 
//
&НаСервере
Функция ПолучитьНеРассчитаннуюВершину()
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПолучитьНеРассчитаннуюВершину(ЭтотОбъект, ДопПараметры);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПересчитатьТзПериодыСУчетомГрафиковРаботыРесурсов(СтрокаРаботы,тзПериоды0)
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	Результат = УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПересчитатьТзПериодыСУчетомГрафиковРаботыРесурсов(ЭтотОбъект, ДопПараметры, СтрокаРаботы,тзПериоды0);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СообщитьЛог(Текст,Статус = Неопределено)
	Если (Не м_ВыводитьСообщения) и  (Статус <> СтатусСообщения.ОченьВажное) Тогда
	    Возврат;
	КонецЕсли; 
	
	//возможно после будем записывать в файл сообщения
	Если Статус = Неопределено Тогда
	    Статус = СтатусСообщения.Обычное;
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	
	
КонецПроцедуры

// получить графики рабочего времени ( обратно   =   ложь )
// Параметры:
// 
// Возвращаемое значение: 
// 
&НаСервере
Процедура ПолучитьГрафикиРабочегоВремени(Обратно = Ложь) Экспорт
	
	ДопПараметры = ПолучитьДопПараметрыПоПеременнымМодуля();
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПолучитьГрафикиРабочегоВремени(ЭтотОбъект, ДопПараметры, Обратно);
	ЗаполнитьПеременныеМодуляИзДопПараметров(ДопПараметры);
	
КонецПроцедуры


&НаСервере
Процедура ВТЗНаСервере() Экспорт
   тДерево = РеквизитФормыВЗначение("ДеревоРабот");
   тТаблица = РеквизитФормыВЗначение("ТаблицаРабот");
   
   ПреобразоватьВТЗРекурсия(тДерево, тТаблица, Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
   тДерево.Строки.Очистить();
   
   ЗначениеВРеквизитФормы(тТаблица, "ТаблицаРабот");
   //ЗначениеВРеквизитФормы(тДерево, "ДеревоРабот");
КонецПроцедуры
 
&НаСервере
Процедура ПреобразоватьВТЗРекурсия(тДерево, тТаблица, ГУИД)
   Для Каждого тСтр Из тДерево.Строки Цикл
      нСтр = тТаблица.Добавить();
      ЗаполнитьЗначенияСвойств(нСтр, тСтр,,"Владелец");
	  //нСтр.Родитель = ГУИД;
	  //нСтр.ГУИД = Новый УникальныйИдентификатор();
 
      Если тСтр.Строки.Количество()>0 Тогда
         ПреобразоватьВТЗРекурсия(тСтр, тТаблица, нСтр.ГУИД);
      КонецЕсли;
   КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПроверитьОбновитьКодыСДР(СтрокаЭлементовДерева = Неопределено)
	
	Если СтрокаЭлементовДерева = Неопределено Тогда
		СтрокаЭлементовДерева = ДеревоРабот;
	КонецЕсли;
	
	ЭлементыКоллекции = СтрокаЭлементовДерева.ПолучитьЭлементы();
	
	НомерПП = 0;	
	Для Каждого СтрокаКоллекции Из ЭлементыКоллекции Цикл
		НомерПП = НомерПП + 1;
		мРодитель = СтрокаКоллекции.ПолучитьРодителя();
		Если мРодитель = Неопределено Тогда
			КодСДР_стр = "";
		Иначе
			КодСДР_стр = мРодитель.КодСДР;
		КонецЕсли;
		
		НомерРаботыВУровне = НомерПП;
		
		КодСДР = КодСДР_стр + ?(ЗначениеЗаполнено(КодСДР_стр), ".", "") + Строка(НомерРаботыВУровне);
		
		СтрокаКоллекции.КодСДР 			 = КодСДР;
		
		ПроверитьОбновитьКодыСДР(СтрокаКоллекции);
		
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область СобытияФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущаяОрганизация)
		И ТекущаяОрганизация = Организация Тогда
		СценарийПланирования = ТекущийСценарийПланирования;
	Иначе
		ОбъектСтроительстваПриИзмененииНаСервере();
		СценарийПланированияПриИзмененииНаСервере();
	КонецЕсли;
	
	ТекущаяОрганизация = Организация;
	
КонецПроцедуры

&НаСервере
Процедура ОбходДереваПоКритическимРаботам(Элемент, м_тзРаботы) Экспорт
	ПодчиненныйЭлемент				= Элемент.Строки;
	
	Для каждого СтрокаДерева из ПодчиненныйЭлемент Цикл		
		
		СтрокаТаблицы					= м_тзРаботы.найти(СтрокаДерева.Ссылка);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаДерева.КритическаяРабота	= СтрокаТаблицы.КритическаяРабота;
		КонецЕсли; 
		
		ОбходДереваПоКритическимРаботам(СтрокаДерева, м_тзРаботы);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьУдаленныеРаботыПриИзменении(Элемент)
	ОбновитьДанныеНаСервере();
	ОбновитьКнопкиСвернутьДоУровня();
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеМатериалы = Элементы.Материалы.ТекущиеДанные;
	
	Если НЕ ОтменаРедактирования Тогда
		
		Если  ЗначениеЗаполнено(ТекущиеМатериалы.Номенклатура)*
			
			ТекущиеМатериалы.КоличествоУпаковокНаЕдиницуОбъема*ТекущиеМатериалы.КоличествоНаОбъемРаботы = 0 Тогда
			Отказ = Истина;		
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РесурсыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	ТекущиеРесурсы = Элементы.Ресурсы.ТекущиеДанные;
	
	Если НЕ ОтменаРедактирования Тогда
		
		Если ЗначениеЗаполнено(ТекущиеРесурсы.ресурс)*ТекущиеРесурсы.Количество = 0 Тогда
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДиаграммуГанта(Команда)
	ЗаполнитьДиаграммуГанта();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКодыСДР(Команда)
	
	УСОERP_УправлениеСтроительнымПроизводством.ЗаполнитьКодыСДРРабот(СценарийПланирования);
	ОбновитьДанные(Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантДатыПриИзменении(Элемент)
	
	Если ВариантДаты = 0 Тогда
		НаДату = ПолучитьПоследнююДатуРедактированияСценария(СценарийПланирования);
	Иначе
		НаДату = НачалоДня(ТекущаяДата());
	КОнецЕсли;
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьКоличествоНаЕдиницуРаботНаСервере(СценарийПланирования)
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_СтроительныеРаботы_ПерерасчетКоличестваНаЕдиницуОбъема(
		СценарийПланирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКоличествоНаЕдиницуРабот(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПересчитатьКоличествоПродолжение",ЭтотОбъект);
	ПоказатьВопрос(ОписаниеОповещения,"Выполнить пересчет количества на единицу объема работ по сценарию "+СокрЛП(СценарийПланирования)+"?",РежимДиалогаВопрос.ДаНет,,,"ВНИМАНИЕ! ОПЕРАЦИЯ НЕОБРАТИМА!");
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьКоличествоПродолжение(Ответ,Параметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьКоличествоНаЕдиницуРаботНаСервере(СценарийПланирования);
	ЗаполнитьДеревоРабот();	
	
КонецПроцедуры 

#КонецОбласти



м_УчитыватьРесурсы = Ложь;
м_ВыводитьСообщения = Истина;
м_ФатальнаяОшибка	= Ложь;