
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает ссылки на базовый и рабочий сценарий по объекту строительства.
//
// Параметры:
//	Объект - СправочникОбъект.СМ_ОбъектыСтроительства - элемент справочника проектов строительства;
//
// Возвращаемое значение:
//               – Структура – структура с ключами:
//                             * БазовыйСценарийПланирования;
//                             * РабочийСценарийПланирования.
//
Функция ПолучитьБазовыйИРабочийСценарийПланирования(Объект) Экспорт
	
	СтруктураСценариев = Новый Структура("БазовыйСценарийПланирования, РабочийСценарийПланирования");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	УСОERP_СценарииПланированияПроектовСтроительства.Ссылка КАК Ссылка,
	|	УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария КАК ВидСценария
	|ИЗ
	|	Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
	|ГДЕ
	|	(УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Базовый)
	|			ИЛИ УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий))
	|	И УСОERP_СценарииПланированияПроектовСтроительства.Владелец = &Владелец
	|	И УСОERP_СценарииПланированияПроектовСтроительства.НомерВерсии = 0");
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	ТаблицаСценариев = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаСценарий Из ТаблицаСценариев Цикл
		
		Если СтрокаСценарий.ВидСценария = Перечисления.УСОERP_ВидыСценариевПланирования.Базовый Тогда
			СтруктураСценариев.Вставить("БазовыйСценарийПланирования", СтрокаСценарий.Ссылка);
		ИначеЕсли СтрокаСценарий.ВидСценария = Перечисления.УСОERP_ВидыСценариевПланирования.Рабочий Тогда
			СтруктураСценариев.Вставить("РабочийСценарийПланирования", СтрокаСценарий.Ссылка);
		КонецЕсли;
		
	КонецЦикла;

	Возврат СтруктураСценариев;

КонецФункции // ПолучитьБазовыйИРабочийСценарийПланирования()

// Создает сценарии планирования по умолчанию.
//
// Параметры:
//	Объект - СправочникОбъект.СМ_ОбъектыСтроительства - элемент справочника проектов строительства;
//  Отказ  - Булево - признак неудачного создания элементов.
//
Процедура СоздатьСценарииПланированияПоУмолчанию(Объект, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураСценариев = ПолучитьБазовыйИРабочийСценарийПланирования(Объект);
	
	НачатьТранзакцию();
	
	Если НЕ ЗначениеЗаполнено(СтруктураСценариев.БазовыйСценарийПланирования) Тогда
		
		НовыйСценарий                        = Справочники.УСОERP_СценарииПланированияПроектовСтроительства.СоздатьЭлемент();
		НовыйСценарий.Владелец               = Объект.Ссылка;
		НовыйСценарий.ВидСценария            = Перечисления.УСОERP_ВидыСценариевПланирования.Базовый;
		НовыйСценарий.Наименование           = "Базовый";
		НовыйСценарий.НачалоСтроительства    = Объект.НачалоСтроительства;
		НовыйСценарий.ОкончаниеСтроительства = Объект.ОкончаниеСтроительства;
		
		НовыйСценарий.ОбменДанными.Загрузка = Истина;
		
		Попытка
			НовыйСценарий.Записать();
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктураСценариев.РабочийСценарийПланирования) Тогда
		
		НовыйСценарий                        = Справочники.УСОERP_СценарииПланированияПроектовСтроительства.СоздатьЭлемент();
		НовыйСценарий.Владелец               = Объект.Ссылка;
		НовыйСценарий.ВидСценария            = Перечисления.УСОERP_ВидыСценариевПланирования.Рабочий;
		НовыйСценарий.Наименование           = "Рабочий";
		НовыйСценарий.НачалоСтроительства    = Объект.НачалоСтроительства;
		НовыйСценарий.ОкончаниеСтроительства = Объект.ОкончаниеСтроительства;
		
		НовыйСценарий.ОбменДанными.Загрузка = Истина;
		
		Попытка
			НовыйСценарий.Записать();
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	Если Отказ Тогда
		ОтменитьТранзакцию();
		Возврат;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
		
КонецПроцедуры // СоздатьСценарииПланированияПоУмолчанию()

Процедура СкопироватьСметы(ПараметрыВызоваСервера, АдресХранилища) Экспорт
	
	Стройка = ПараметрыВызоваСервера.Стройка;
	НоваяСтройка = ПараметрыВызоваСервера.НоваяСтройка;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СМ_ЛокальнаяСмета.Ссылка
	               |ИЗ
	               |	Документ.СМ_ЛокальнаяСмета КАК СМ_ЛокальнаяСмета
	               |ГДЕ
	               |	СМ_ЛокальнаяСмета.Стройка = &Стройка
	               |	И НЕ СМ_ЛокальнаяСмета.ПометкаУдаления
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СМ_ЛокальнаяСмета.МоментВремени";
	Запрос.УстановитьПараметр("Стройка",Стройка);
	Результат =  Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Структура = Новый Структура("ТекстСообщения",НСтр("ru = 'По объекту сметы не найдены'"));
	Иначе
		СМ_СметаВызовСервера.СкопироватьЛокальныеСметыОбъектаСтроительства(Результат,НоваяСтройка);
		Структура = Новый Структура("ТекстСообщения",НСтр("ru = 'Сметы скопированы'"));
	КонецЕсли;
	АдресХранилища = ПоместитьВоВременноеХранилище(Структура, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
