////////////////////////////////////////////////////////////////////////////////
// Вызов сервера
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Тестирование соединения с сервером
//
Функция ТестСоединенияССервером(Сервер, Порт, Логин, Пароль, ТекстОшибки) Экспорт
	
	ЗащищенноеСоединениеПорт = ?(Число(Порт) = 443, "s", "");
	
	АдресСтраницы = "http"+ЗащищенноеСоединениеПорт+"://"+СокрЛП(Сервер)+":"+Формат(Порт, "ЧН=0; ЧГ=0")+"/TestConnection?login="+Логин+"&pwd="+Пароль;
	
	ИмяФайла = КаталогВременныхФайлов()+"replic-result-"+Строка(Новый УникальныйИдентификатор())+".html";
		
	ПараметрыПолучения = Новый Структура;
	ПараметрыПолучения.Вставить("ПутьДляСохранения", ИмяФайла);
	
	РезультатСкачивания = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(АдресСтраницы,ПараметрыПолучения);
	Если НЕ РезультатСкачивания.Статус Тогда
		ТекстОшибки = НСтр("ru = 'Ошибка соединения с сервером репликации:'")+" "+РезультатСкачивания.СообщениеОбОшибке;
		Возврат Ложь;
	КонецЕсли;
	
	ТекстовыйДок = Новый ТекстовыйДокумент;
	ТекстовыйДок.Прочитать(ИмяФайла);
	
	Если ТекстовыйДок.КоличествоСтрок()=1 И ТекстовыйДок.ПолучитьСтроку(1) = "OK" Тогда
		Возврат Истина;
		
	Иначе
		ТекстОшибки = НСтр("ru = 'Ответ сервера:'")+" "+ТекстовыйДок.ПолучитьТекст();
		Возврат Ложь;		
	
	КонецЕсли;	

КонецФункции // ТестСоединенияССервером()

#КонецОбласти
