
//УКРАИНА
Процедура СформироватьДвиженияКатегорииЕСВ(РегистраторОбъект, Движения, ДанныеДляПроведения) Экспорт
	
	УчетСтраховыхВзносовВнутренний.СформироватьДвиженияКатегорииЕСВ(РегистраторОбъект, Движения, ДанныеДляПроведения);
	
КонецПроцедуры

Процедура ЗаполнитьКатегориюЕСВПоУмолчанию(Форма, ПутьКРеквизиту, Сотрудник, ДатаСобытия, Организация, ДолжностьПоШтатномуРасписанию) Экспорт
	
	Если Не ЗначениеЗаполнено(ДолжностьПоШтатномуРасписанию) Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, ПутьКРеквизиту, Неопределено);
		Возврат;
	КонецЕсли;
	
	КатегорияЕСВ = КатегорияЕСВПоУмолчанию(Организация);
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, "Инвалидность", ДатаСобытия);
	Если КадровыеДанные.Количество() > 0 Тогда
		Если ЗначениеЗаполнено(КадровыеДанные[0].Инвалидность) Тогда
			КатегорияЕСВ = Справочники.КатегорииЗастрахованныхЛицЕСВ.НаемныйРаботникИнвалид;
		КонецЕсли;
	КонецЕсли;
	
	Если ДолжностьПоШтатномуРасписанию.ЯвляетсяДолжностьюЛетногоЭкипажа Тогда
		КатегорияЕСВ = Справочники.КатегорииЗастрахованныхЛицЕСВ.НаемныйРаботникЛетчик;
	ИначеЕсли ДолжностьПоШтатномуРасписанию.ЯвляетсяДолжностьюСпециальныхРабот Тогда
		Если КатегорияЕСВ = Справочники.КатегорииЗастрахованныхЛицЕСВ.НаемныйРаботникИнвалид Тогда
			КатегорияЕСВ = Справочники.КатегорииЗастрахованныхЛицЕСВ.НаемныйРаботникИнвалидНаСпециальныхРаботах;
		Иначе	
			КатегорияЕСВ = Справочники.КатегорииЗастрахованныхЛицЕСВ.НаемныйРаботникНаСпециальныхРаботах;
		КонецЕсли;	
	КонецЕсли;	
	
	ОбщегоНазначенияКлиентСервер.УстановитьРеквизитФормыПоПути(Форма, ПутьКРеквизиту, КатегорияЕСВ);
	
КонецПроцедуры

Функция КатегорияЕСВПоУмолчанию(Организация) Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкиУчетаСтраховыхВзносов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Возврат Справочники.КатегорииЗастрахованныхЛицЕСВ.НаемныйРаботникНаОбщихОснованиях;
		
	Иначе	
		
		Если ЗначениеЗаполнено(НаборЗаписей[0].ОсновнаяКатегорияЗастрахованныхЛиц) Тогда
			Возврат НаборЗаписей[0].ОсновнаяКатегорияЗастрахованныхЛиц;
		Иначе
			Возврат Справочники.КатегорииЗастрахованныхЛицЕСВ.НаемныйРаботникНаОбщихОснованиях;
		Конецесли;	
		
	КонецЕсли;
	
КонецФункции

Функция СписокНалогиБезКоэффициента()
	
	МассивНалогиБезКоэффициента = Новый Массив();
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТГПХУТОГ);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТИнвалиды);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТИнвалиды50);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТИнвалидыУТОГУТОС);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТИнвалидыСР);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТБольничныеИнвалиды);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТБольничныеИнвалиды50);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТБольничныеУТОГ);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТДекретныеИнвалиды);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТДекретныеИнвалиды50);
	МассивНалогиБезКоэффициента.Добавить(Справочники.Налоги.ЕСВФОТДекретныеУТОГ);

	
	Возврат МассивНалогиБезКоэффициента;
		
КонецФункции

Функция СписокНалогиБезМинимальнойБазы()
	
	МассивНалогиБезБезМинимальнойБазы = Новый Массив();
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТГПХУТОГ);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТИнвалиды);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТИнвалиды50);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТИнвалидыУТОГУТОС);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТИнвалидыСР);	
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТРаботникиУТОГУТОС);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТБольничныеИнвалиды);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТБольничныеИнвалиды50);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТБольничныеУТОГ);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТДекретныеИнвалиды);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТДекретныеИнвалиды50);
	МассивНалогиБезБезМинимальнойБазы.Добавить(Справочники.Налоги.ЕСВФОТДекретныеУТОГ);

	
	Возврат МассивНалогиБезБезМинимальнойБазы;
		
КонецФункции


Функция РассчитатьУдержанныеНалоги(Регистратор, Организация, ДатаОперации, МенеджерТаблиц, ПериодРегистрации = Неопределено) Экспорт
	
	
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерТаблиц;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация));
	Запрос.УстановитьПараметр("Регистратор", Регистратор.Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаОперации", КонецДня(ДатаОперации));
	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ДатаОперации));
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	
	РезультатыРасчетов = Новый ТаблицаЗначений;
	РезультатыРасчетов.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатыРасчетов.Колонки.Добавить("ФизическоеЛицо",Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица"));
    РезультатыРасчетов.Колонки.Добавить("ПериодВзаиморасчетов",Новый ОписаниеТипов("Дата",,,Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	РезультатыРасчетов.Колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2)));
	
	ПараметрыПолученияЗарплатыКВыплате = ВзаиморасчетыССотрудниками.ПараметрыПолученияЗарплатыКВыплатеВедомости(Регистратор);
	
	Запрос.УстановитьПараметр("ЭтоУвольнение", ПараметрыПолученияЗарплатыКВыплате.ЭтоУвольнение);
	
	//Взносы могут не перечисляться
	Если ПараметрыПолученияЗарплатыКВыплате.ПорядокЗаполненияНалогов <> Перечисления.ПорядокЗаполненияНалогов.Взносы
		И  ПараметрыПолученияЗарплатыКВыплате.ПорядокЗаполненияНалогов <> Перечисления.ПорядокЗаполненияНалогов.НДФЛИВзносы Тогда
		Возврат РезультатыРасчетов;	
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 * ИЗ ВТСписокСотрудников КАК СписокСотрудников";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат РезультатыРасчетов
	КонецЕсли;
	
	Если ПараметрыПолученияЗарплатыКВыплате.СпособПолучения = Перечисления.СпособыПолученияЗарплатыКВыплате.ОкончательныйРасчет Тогда		
		//Заполнение по зарплате - приход по ФЛ минсу расход по ФЛ, но не больше остатков по организации
		Запрос.Текст =  
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокСотрудников.ФизическоеЛицо
		|ПОМЕСТИТЬ ВТОтборПоСотрудникам
		|ИЗ
		|	ВТСписокСотрудников КАК СписокСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСФондамиПоСтраховымВзносам.Организация КАК Организация,
		|	РасчетыСФондамиПоСтраховымВзносам.Налог КАК Налог,
		|	РасчетыСФондамиПоСтраховымВзносам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыСФондамиПоСтраховымВзносам.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСФондамиПоСтраховымВзносам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РасчетыСФондамиПоСтраховымВзносам.Сумма
		|			ИНАЧЕ -РасчетыСФондамиПоСтраховымВзносам.Сумма
		|		КОНЕЦ) КАК СуммаОстаток
		|ПОМЕСТИТЬ ВТПодробно
		|ИЗ
		|	ВТОтборПоСотрудникам КАК СписокСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК РасчетыСФондамиПоСтраховымВзносам
		|		ПО СписокСотрудников.ФизическоеЛицо = РасчетыСФондамиПоСтраховымВзносам.ФизическоеЛицо
		|			И (РасчетыСФондамиПоСтраховымВзносам.Организация = &Организация)
		|			И (РасчетыСФондамиПоСтраховымВзносам.Регистратор <> &Регистратор)
		|			И (РасчетыСФондамиПоСтраховымВзносам.Период <= &ДатаОперации)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСФондамиПоСтраховымВзносам.Организация,
		|	РасчетыСФондамиПоСтраховымВзносам.Налог,
		|	РасчетыСФондамиПоСтраховымВзносам.ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносам.ФизическоеЛицо
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА РасчетыСФондамиПоСтраховымВзносам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА РасчетыСФондамиПоСтраховымВзносам.Сумма
		|			ИНАЧЕ -РасчетыСФондамиПоСтраховымВзносам.Сумма
		|		КОНЕЦ) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСФондамиПоСтраховымВзносам.Организация КАК Организация,
		|	РасчетыСФондамиПоСтраховымВзносам.Налог КАК Налог,
		|	РасчетыСФондамиПоСтраховымВзносам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыСФондамиПоСтраховымВзносам.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносам.СуммаОстаток КАК Сумма
		|ИЗ
		|	ВТПодробно КАК РасчетыСФондамиПоСтраховымВзносам
		|";
		ОстаткиПоФизЛицам = Запрос.Выполнить().Выгрузить();
		
		Запрос.Текст =  
		"ВЫБРАТЬ
		|	РасчетыСФондамиПоСтраховымВзносам.Организация КАК Организация,
		|	РасчетыСФондамиПоСтраховымВзносам.Налог КАК Налог,
		|	РасчетыСФондамиПоСтраховымВзносам.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносам.СуммаОстаток КАК СуммаОстаток
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Остатки(&ДатаОперации, Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносам
		|ГДЕ
		|   РасчетыСФондамиПоСтраховымВзносам.СуммаОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСФондамиПоСтраховымВзносам.Организация КАК Организация,
		|	РасчетыСФондамиПоСтраховымВзносам.Налог КАК Налог,
		|	РасчетыСФондамиПоСтраховымВзносам.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	СУММА(РасчетыСФондамиПоСтраховымВзносам.СуммаОстаток) КАК СуммаОстаток
		|ПОМЕСТИТЬ ВТСуммыКСписанию
		|ИЗ
		|	ВТПодробно КАК РасчетыСФондамиПоСтраховымВзносам
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСФондамиПоСтраховымВзносам.Организация,
		|	РасчетыСФондамиПоСтраховымВзносам.Налог,
		|	РасчетыСФондамиПоСтраховымВзносам.ПериодВзаиморасчетов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СуммыКСписанию.Организация КАК Организация,
		|	СуммыКСписанию.Налог КАК Налог,
		|	СуммыКСписанию.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	ВЫБОР
		|		КОГДА &ЭтоУвольнение И СуммыКСписанию.ПериодВзаиморасчетов = &ПериодРегистрации 
		|		ТОГДА СуммыКСписанию.СуммаОстаток
		|		КОГДА ЕСТЬNULL(Остатки.СуммаОстаток,0) > СуммыКСписанию.СуммаОстаток
		|		ТОГДА СуммыКСписанию.СуммаОстаток
		|		ИНАЧЕ ЕСТЬNULL(Остатки.СуммаОстаток,0)
		|	КОНЕЦ КАК Сумма
		|ИЗ
		|	ВТСуммыКСписанию КАК СуммыКСписанию
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОстатки КАК Остатки
		|       ПО СуммыКСписанию.Организация = Остатки.Организация
		|        И СуммыКСписанию.Налог = Остатки.Налог
		|        И СуммыКСписанию.ПериодВзаиморасчетов = Остатки.ПериодВзаиморасчетов
		|";
		Остатки = Запрос.Выполнить().Выгрузить();
		
		
		//Доступные остатки распределяем пропорционально остаткам по физлицам
		ПоляРазрез = Новый Массив();
		ПоляРазрез.Добавить("ФизическоеЛицо");
		ПоляСвязи = Новый Структура();
		ПоляСвязи.Вставить("Организация","Организация");
		ПоляСвязи.Вставить("Налог","Налог");
		ПоляСвязи.Вставить("ПериодВзаиморасчетов","ПериодВзаиморасчетов");
		РезультатыРасчетов = ЗарплатаКадры.РаспределитьТаблицуПропорциональноТаблицеКоэффициентов(Остатки, "Сумма", ОстаткиПоФизЛицам, "Сумма", ПоляРазрез, ПоляСвязи,,Ложь);
		РезультатыРасчетов.Сортировать("ПериодВзаиморасчетов");
		
		Запрос.Текст =  
		"УНИЧТОЖИТЬ ВТОтборПоСотрудникам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТПодробно
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТСуммыКСписанию
		|";
		Запрос.Выполнить();
		
		
	ИначеЕсли ПараметрыПолученияЗарплатыКВыплате.СпособПолучения = Перечисления.СпособыПолученияЗарплатыКВыплате.ОтдельныйРасчет Тогда		
		//Заполнение по межрасчетным - приходы и расходы по документам-основаниям
		Запрос.Текст =  
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокСотрудников.ФизическоеЛицо,
		|	СписокСотрудников.ДокументОснование
		|ПОМЕСТИТЬ ВТОтборПоСотрудникам
		|ИЗ
		|	ВТСписокСотрудников КАК СписокСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ		
		|	ИсчисленныеСтраховыеВзносыАвансом.ФизическоеЛицо КАК ФизическоеЛицо,
		|	&ПериодРегистрации КАК ПериодВзаиморасчетов,
		|	ИсчисленныеСтраховыеВзносыАвансом.Налог КАК Налог,
		|	ИсчисленныеСтраховыеВзносыАвансом.Сумма КАК Сумма,
		|	ИсчисленныеСтраховыеВзносыАвансом.Регистратор КАК ДокументОснование
		|ПОМЕСТИТЬ ВТДвиженияПриход 
		|ИЗ
		|	ВТОтборПоСотрудникам КАК СписокСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИсчисленныеСтраховыеВзносыАвансом КАК ИсчисленныеСтраховыеВзносыАвансом
		|		ПО СписокСотрудников.ФизическоеЛицо = ИсчисленныеСтраховыеВзносыАвансом.ФизическоеЛицо
		|		 И (ИсчисленныеСтраховыеВзносыАвансом.Регистратор = СписокСотрудников.ДокументОснование)
		|			И (ИсчисленныеСтраховыеВзносыАвансом.Организация = &Организация)
		|			И (НАЧАЛОПЕРИОДА(ИсчисленныеСтраховыеВзносыАвансом.Период, МЕСЯЦ) = &ПериодРегистрации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСФондамиПоСтраховымВзносам.Налог КАК Налог,
		|	РасчетыСФондамиПоСтраховымВзносам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыСФондамиПоСтраховымВзносам.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносам.Сумма КАК Сумма,
		|	РасчетыСФондамиПоСтраховымВзносам.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТДвиженияРасход
		|ИЗ
		|	ВТОтборПоСотрудникам КАК СписокСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК РасчетыСФондамиПоСтраховымВзносам
		|		ПО СписокСотрудников.ФизическоеЛицо = РасчетыСФондамиПоСтраховымВзносам.ФизическоеЛицо
		|		 И (РасчетыСФондамиПоСтраховымВзносам.ДокументОснование = СписокСотрудников.ДокументОснование)
		|			И (РасчетыСФондамиПоСтраховымВзносам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (РасчетыСФондамиПоСтраховымВзносам.Организация = &Организация)
		|			И (РасчетыСФондамиПоСтраховымВзносам.Регистратор <> &Регистратор)
		|			И (РасчетыСФондамиПоСтраховымВзносам.Период <= &ДатаОперации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ		
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.Налог КАК Налог,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ДокументОснование КАК ДокументОснование,
		|	СУММА(РасчетыСФондамиПоСтраховымВзносамПриход.Сумма - ЕСТЬNULL(РасчетыСФондамиПоСтраховымВзносамРасход.Сумма, 0)) КАК Сумма
		|ИЗ
		|   ВТДвиженияПриход КАК РасчетыСФондамиПоСтраховымВзносамПриход
		|   ЛЕВОЕ СОЕДИНЕНИЕ
		|   ВТДвиженияРасход КАК РасчетыСФондамиПоСтраховымВзносамРасход
		|   ПО РасчетыСФондамиПоСтраховымВзносамПриход.ФизическоеЛицо = РасчетыСФондамиПоСтраховымВзносамРасход.ФизическоеЛицо
		|		 И (РасчетыСФондамиПоСтраховымВзносамПриход.ДокументОснование = РасчетыСФондамиПоСтраховымВзносамРасход.ДокументОснование)
		|		 И (РасчетыСФондамиПоСтраховымВзносамПриход.ПериодВзаиморасчетов = РасчетыСФондамиПоСтраховымВзносамРасход.ПериодВзаиморасчетов)
		|		 И (РасчетыСФондамиПоСтраховымВзносамПриход.Налог = РасчетыСФондамиПоСтраховымВзносамРасход.Налог)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ФизическоеЛицо,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.Налог,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ДокументОснование
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетыСФондамиПоСтраховымВзносамПриход.Сумма - ЕСТЬNULL(РасчетыСФондамиПоСтраховымВзносамРасход.Сумма, 0)) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|   РасчетыСФондамиПоСтраховымВзносамПриход.ФизическоеЛицо.Наименование, 
		|   РасчетыСФондамиПоСтраховымВзносамПриход.ПериодВзаиморасчетов
		|";
		РезультатыРасчетов = Запрос.Выполнить().Выгрузить();

		
	ИначеЕсли ПараметрыПолученияЗарплатыКВыплате.СпособПолучения = Перечисления.СпособыПолученияЗарплатыКВыплате.Аванс Тогда		
		//Заполнение по авансам- приходы и расходы по документам-основаниям плюс исчисленные авансом
		Запрос.Текст =  
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СписокСотрудников.ФизическоеЛицо,
		|	СписокСотрудников.ДокументОснование
		|ПОМЕСТИТЬ ВТОтборПоСотрудникам
		|ИЗ
		|	ВТСписокСотрудников КАК СписокСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ		
		|	ИсчисленныеСтраховыеВзносыАвансом.ФизическоеЛицо КАК ФизическоеЛицо,
		|	&ПериодРегистрации КАК ПериодВзаиморасчетов,
		|	ИсчисленныеСтраховыеВзносыАвансом.Налог КАК Налог,
		|	ИсчисленныеСтраховыеВзносыАвансом.Сумма КАК Сумма,
		|	ИсчисленныеСтраховыеВзносыАвансом.Регистратор КАК ДокументОснование
		|ПОМЕСТИТЬ ВТДвиженияПриход 
		|ИЗ
		|	ВТОтборПоСотрудникам КАК СписокСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ИсчисленныеСтраховыеВзносыАвансом КАК ИсчисленныеСтраховыеВзносыАвансом
		|		ПО СписокСотрудников.ФизическоеЛицо = ИсчисленныеСтраховыеВзносыАвансом.ФизическоеЛицо
		|		 И (ИсчисленныеСтраховыеВзносыАвансом.Регистратор = СписокСотрудников.ДокументОснование ИЛИ (СписокСотрудников.ДокументОснование = НЕОПРЕДЕЛЕНО И ИсчисленныеСтраховыеВзносыАвансом.Регистратор ССЫЛКА Документ.НачислениеЗаПервуюПоловинуМесяца))
		|			И (ИсчисленныеСтраховыеВзносыАвансом.Организация = &Организация)
		|			И (НАЧАЛОПЕРИОДА(ИсчисленныеСтраховыеВзносыАвансом.Период, МЕСЯЦ) = &ПериодРегистрации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыСФондамиПоСтраховымВзносам.Налог КАК Налог,
		|	РасчетыСФондамиПоСтраховымВзносам.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыСФондамиПоСтраховымВзносам.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносам.Сумма КАК Сумма,
		|	РасчетыСФондамиПоСтраховымВзносам.ДокументОснование КАК ДокументОснование
		|ПОМЕСТИТЬ ВТДвиженияРасход
		|ИЗ
		|	ВТОтборПоСотрудникам КАК СписокСотрудников
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам КАК РасчетыСФондамиПоСтраховымВзносам
		|		ПО СписокСотрудников.ФизическоеЛицо = РасчетыСФондамиПоСтраховымВзносам.ФизическоеЛицо
		|		 И (РасчетыСФондамиПоСтраховымВзносам.ДокументОснование = СписокСотрудников.ДокументОснование ИЛИ (СписокСотрудников.ДокументОснование = НЕОПРЕДЕЛЕНО И РасчетыСФондамиПоСтраховымВзносам.ДокументОснование ССЫЛКА Документ.НачислениеЗаПервуюПоловинуМесяца))
		|			И (РасчетыСФондамиПоСтраховымВзносам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))
		|			И (РасчетыСФондамиПоСтраховымВзносам.Организация = &Организация)
		|			И (РасчетыСФондамиПоСтраховымВзносам.Регистратор <> &Регистратор)
		|			И (РасчетыСФондамиПоСтраховымВзносам.Период <= &ДатаОперации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ		
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ФизическоеЛицо КАК ФизическоеЛицо,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.Налог КАК Налог,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ДокументОснование КАК ДокументОснование,
		|	СУММА(РасчетыСФондамиПоСтраховымВзносамПриход.Сумма - ЕСТЬNULL(РасчетыСФондамиПоСтраховымВзносамРасход.Сумма, 0)) КАК Сумма
		|ИЗ
		|   ВТДвиженияПриход КАК РасчетыСФондамиПоСтраховымВзносамПриход
		|   ЛЕВОЕ СОЕДИНЕНИЕ
		|   ВТДвиженияРасход КАК РасчетыСФондамиПоСтраховымВзносамРасход
		|   ПО РасчетыСФондамиПоСтраховымВзносамПриход.ФизическоеЛицо = РасчетыСФондамиПоСтраховымВзносамРасход.ФизическоеЛицо
		|		 И (РасчетыСФондамиПоСтраховымВзносамПриход.ДокументОснование = РасчетыСФондамиПоСтраховымВзносамРасход.ДокументОснование)
		|		 И (РасчетыСФондамиПоСтраховымВзносамПриход.ПериодВзаиморасчетов = РасчетыСФондамиПоСтраховымВзносамРасход.ПериодВзаиморасчетов)
		|		 И (РасчетыСФондамиПоСтраховымВзносамПриход.Налог = РасчетыСФондамиПоСтраховымВзносамРасход.Налог)
		|
		|СГРУППИРОВАТЬ ПО
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ФизическоеЛицо,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.Налог,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ПериодВзаиморасчетов,
		|	РасчетыСФондамиПоСтраховымВзносамПриход.ДокументОснование
		|
		|ИМЕЮЩИЕ
		|	СУММА(РасчетыСФондамиПоСтраховымВзносамПриход.Сумма - ЕСТЬNULL(РасчетыСФондамиПоСтраховымВзносамРасход.Сумма, 0)) > 0
		|
		|УПОРЯДОЧИТЬ ПО
		|   РасчетыСФондамиПоСтраховымВзносамПриход.ФизическоеЛицо.Наименование, 
		|   РасчетыСФондамиПоСтраховымВзносамПриход.ПериодВзаиморасчетов
		|";
		РезультатыРасчетов = Запрос.Выполнить().Выгрузить();
			
	КонецЕсли;
	
	Возврат РезультатыРасчетов;
	
КонецФункции



////////////////////////////////////////////////////////////////////////////////
// Важные даты

//Функция возвращает дату ввода Единого социального взноса
//
Функция ДатаВводаЕСВ() Экспорт
	
	Возврат Дата(2011,1,1);
	
КонецФункции

//Функция возвращает дату реформы Единого социального взноса
//
Функция ДатаИзмененияЕСВ1573() Экспорт
	
	Возврат Дата(2015,1,1);
	
КонецФункции

// Функция возвращает дату реформы Единого социального взноса
//
Функция ДатаИзмененияЕСВ1863() Экспорт
	
	Возврат Дата(2015,3,1);
	
КонецФункции

 // Функция возвращает дату реформы Единого социального взноса
//
Функция ДатаИзмененияЕСВ3688() Экспорт
	
	Возврат Дата(2016,1,1);
	
КонецФункции





#Область ПрограммныйИнтерфейс

// Формирует движения по регистрам подсистемы.
// Параметры:
//		Движения - коллекция движений регистратора.
//		Отказ - булево - признак отказа от заполнения движений.
//		Организация - СправочникСсылка.Организации - должно быть непустым значением.
//		РасчетыСФондом - таблица значений с колонками.
//			Период: должно быть непустым.
//          Сумма
//			ВидОбязательногоСтрахованияСотрудников: должно быть непустым
//          ЭтоСтраховыеВзносы
//          ГодЗадолженностиПоЕСН: должно быть непустым, если ЭтоСтраховыеВзносы = Ложь
//          ВидДвижения: ВидДвиженияНакопления.Расход или ВидДвиженияНакопления.Приход.
//          РасчетыПоПособиям - необязательная, может отсутствовать.
//			ПлатежноеПоручениеНомер - Строка - необязательно, но желательно для уплаты взносов в ФСС.
//			ПлатежноеПоручениеДата - Дата - необязательно, но желательно для уплаты взносов в ФСС.
//		Записывать - булево - признак того, надо ли записывать движения сразу, или они будут записаны позже.
//
Процедура СформироватьРасчетыСФондом(Движения, Отказ, Организация, РасчетыСФондом, Записывать = Ложь) Экспорт
	
	Если РасчетыСФондом <> Неопределено Тогда
		ЕстьНовыеСтроки = Ложь;
		Для Каждого СтрокаДанных Из РасчетыСФондом Цикл
			Если СтрокаДанных.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			ЕстьНовыеСтроки = Истина;
			НоваяСтрока = Движения.РасчетыСФондамиПоСтраховымВзносам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		КонецЦикла;
		Если ЕстьНовыеСтроки Тогда
			Если Записывать Тогда
				Движения.РасчетыСФондамиПоСтраховымВзносам.Записать();
				Движения.РасчетыСФондамиПоСтраховымВзносам.Записывать = Ложь;
			Иначе
				Движения.РасчетыСФондамиПоСтраховымВзносам.Записывать = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Формирует движения по регистрам подсистемы.
// Параметры:
//		Движения - коллекция движений регистратора.
//		Отказ - булево - признак отказа от заполнения движений.
//		Организация - СправочникСсылка.Организации - должно быть непустым значением.
//		ПериодРегистрации - дата -
//		ВзносыИсчисленные - ТаблицаЗначений - с обязательными колонками:
//			ФизическоеЛицо: должно быть непустым
//		ЗаписыватьИсчисленныеВзносы - булево - признак того, надо ли записывать движения сразу, или они будут записаны
//		                                       позже.
//		ЗаписыватьРасчеты - булево - признак того, надо ли записывать движения сразу, или они будут записаны позже.
//		ПоАктуПроверки - булево - признак того, что взносы изменены в связи с решением Фонда.
//		ОснованиеДляДоначисления - ПеречислениеСсылка.ОснованияДляДоначисленияСтраховыхВзносов - значение одноименного реквизита регистра ИсчисленныеСтраховыеВзносы.
//
Процедура СформироватьИсчисленныеВзносы(Движения, Отказ, Организация, ПериодРегистрации, ВзносыИсчисленные, ЗаписыватьИсчисленныеВзносы = Истина, ЗаписыватьРасчеты = Ложь, ПоАктуПроверки = Ложь, ОснованиеДляДоначисления = Неопределено, ВзносыПеречислены = Ложь) Экспорт
	
	
	Если ВзносыИсчисленные <> Неопределено Тогда
		ЕстьНовыеСтроки = Ложь;
		ФизическиеЛицаМассив = ОбщегоНазначения.ВыгрузитьКолонку(ВзносыИсчисленные, "ФизическоеЛицо", Истина);
		ТаблицаМестРаботы = КадровыйУчет.ТаблицаРабочихМестОсновныхСотрудников(ФизическиеЛицаМассив, Организация, ПериодРегистрации);
		
		Для Каждого СтрокаДанных Из ВзносыИсчисленные Цикл
			ЕстьНовыеСтроки = Истина;
			НоваяСтрока = Движения.ИсчисленныеСтраховыеВзносы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
			НоваяСтрока.Сумма = СтрокаДанных.Результат;
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация);
			Если Не ЗначениеЗаполнено(НоваяСтрока.Период) Тогда
				НоваяСтрока.Период = ПериодРегистрации;
			КонецЕсли;
			НоваяСтрока.ОснованиеДляДоначисления = ОснованиеДляДоначисления;
			НоваяСтрока.ДатаПолученияДохода = УчетСтраховыхВзносовКлиентСервер.ДатаПолученияДохода(?(ЗначениеЗаполнено(НоваяСтрока.ДатаПолученияДохода), НоваяСтрока.ДатаПолученияДохода, ПериодРегистрации));
			НоваяСтрока.НалоговыйПериод = УчетСтраховыхВзносовКлиентСервер.ДатаНалоговогоПериода(НоваяСтрока.ДатаНачала);
			СтрокаРабочееМесто = ТаблицаМестРаботы.Найти(СтрокаДанных.ФизическоеЛицо,"ФизическоеЛицо");
			Если СтрокаРабочееМесто <> Неопределено Тогда 
				НоваяСтрока.Подразделение	= СтрокаРабочееМесто.Подразделение;
			КонецЕсли;			
			
			ПериодДвижения = НоваяСтрока.Период;
			СтрокаНачисленияВзносов(Движения, Организация, ПериодДвижения, НоваяСтрока, ПоАктуПроверки);
			Если ВзносыПеречислены Тогда
				СтрокаПеречисленияВзносов(Движения, Организация, ПериодДвижения, НоваяСтрока, ПоАктуПроверки);
			КонецЕсли;	
			
		КонецЦикла;
		Если ЕстьНовыеСтроки Тогда
			Если ЗаписыватьИсчисленныеВзносы Тогда
				Движения.ИсчисленныеСтраховыеВзносы.Записать();
				Движения.ИсчисленныеСтраховыеВзносы.Записывать = Ложь;
			Иначе
				Движения.ИсчисленныеСтраховыеВзносы.Записывать = Истина;
			КонецЕсли;
			Если ЗаписыватьРасчеты Тогда
				Движения.РасчетыСФондамиПоСтраховымВзносам.Записать();
				Движения.РасчетыСФондамиПоСтраховымВзносам.Записывать = Ложь;
			Иначе
				Движения.РасчетыСФондамиПоСтраховымВзносам.Записывать = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьИсчисленныеВзносыАвансом(Движения, Отказ, Организация, ПериодРегистрации, ВзносыИсчисленные, ЗаписыватьИсчисленныеВзносы = Истина, ЗаписыватьРасчеты = Ложь, ПоАктуПроверки = Ложь, ОснованиеДляДоначисления = Неопределено) Экспорт
	
	
	Если ВзносыИсчисленные <> Неопределено Тогда
		ЕстьНовыеСтроки = Ложь;
		Для Каждого СтрокаДанных Из ВзносыИсчисленные Цикл
			
			ЕстьНовыеСтроки = Истина;
			НоваяСтрока = Движения.ИсчисленныеСтраховыеВзносыАвансом.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
			НоваяСтрока.Сумма = СтрокаДанных.Результат;
			НоваяСтрока.Организация = Организация;
			НоваяСтрока.ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация);
			Если Не ЗначениеЗаполнено(НоваяСтрока.Период) Тогда
				НоваяСтрока.Период = ПериодРегистрации;
			КонецЕсли;
			НоваяСтрока.ОснованиеДляДоначисления = ОснованиеДляДоначисления;
			НоваяСтрока.ДатаПолученияДохода = УчетСтраховыхВзносовКлиентСервер.ДатаПолученияДохода(?(ЗначениеЗаполнено(НоваяСтрока.ДатаПолученияДохода), НоваяСтрока.ДатаПолученияДохода, ПериодРегистрации));
			НоваяСтрока.НалоговыйПериод = УчетСтраховыхВзносовКлиентСервер.ДатаНалоговогоПериода(НоваяСтрока.ДатаНачала);
			
		КонецЦикла;
		Если ЕстьНовыеСтроки Тогда
			Если ЗаписыватьИсчисленныеВзносы Тогда
				Движения.ИсчисленныеСтраховыеВзносыАвансом.Записать();
				Движения.ИсчисленныеСтраховыеВзносыАвансом.Записывать = Ложь;
			Иначе
				Движения.ИсчисленныеСтраховыеВзносыАвансом.Записывать = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Формирует движения по регистрам подсистемы.
//	 
// Параметры:
//		Движения - коллекция движений регистратора.
//		Отказ - признак отказа от заполнения движений.
//		Организация - СправочникСсылка.Организации - должно быть непустым значением.
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит временные таблицы ВТНачисления и ВТНачисленияСДаннымиЕНВД
//      	поля таблицы ВТНачисления
//				Сотрудник
//				ПодразделениеОрганизации
//				Начисление
//				ДатаНачала 
//				СуммаДохода
//				СуммаВычетаВзносы
//     	         и, возможно, другими - см. описание метода СформироватьВТНачисленияСДаннымиУчета()
//      	поля таблицы ВТНачисленияСДаннымиЕНВД
//				Сотрудник
//				Начисление
//				Подразделение
//				ДатаНачала
//				ДоляЕНВД - число от 0 до 1
//	
//		ПроверятьЕНВД - булево -
//		Записывать - булево - признак того, надо ли записывать движения сразу, или они будут записаны позже.
//		ИсключаемыйРегистратор - ДокументСсылка -
//
Процедура СформироватьСведенияОДоходахСтраховыеВзносы(Движения, Отказ, Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ПроверятьЕНВД = Ложь, Записывать = Ложь, ИсключаемыйРегистратор = Неопределено) Экспорт
	
	СведенияОДоходахСтраховыеВзносы = СведенияОДоходахСтраховыеВзносы(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ИсключаемыйРегистратор);
	СформироватьДоходыСтраховыеВзносы(Движения, Отказ, Организация, ПериодРегистрации, СведенияОДоходахСтраховыеВзносы, Записывать);
	
КонецПроцедуры

// Формирует движения по регистрам подсистемы.
//      	 
// Параметры:
//		Движения - коллекция движений регистратора.
//		Отказ - признак отказа от заполнения движений.
//		Организация
//		ПериодРегистрации
//		Начисления - Таблица значений с колонками
//				ФизическоеЛицо: должно быть непустым.
//				ДатаПолученияДохода - необязательная, может отсутствовать
//				ВидДохода.
//      	    ОблагаетсяЕНВД - необязательная, может отсутствовать.
//      	    ОблагаетсяВзносамиНаДоплатуЛетчикам - необязательная, может отсутствовать.
//      	    ОблагаетсяВзносамиНаДоплатуШахтерам - необязательная, может отсутствовать.
//      	    ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией - необязательная, может отсутствовать.
//      	    КлассУсловийТруда - необязательная, может отсутствовать.
//      	    ЯвляетсяДоходомФармацевта - необязательная, может отсутствовать.
//				Сумма
//          	Скидка - необязательная, может отсутствовать.
//				Сотрудник - необязательная, может отсутствовать.
//      	    Начисление - необязательная, может отсутствовать.
//      	    Подразделение - необязательная, может отсутствовать.
//		Записывать - признак того, надо ли записывать движения сразу, или они будут записаны позже.
//
Процедура СформироватьДоходыСтраховыеВзносы(Движения, Отказ, Организация, ПериодРегистрации, Начисления, Записывать = Ложь, ПоАктуПроверки = Ложь) Экспорт
	
	Если Начисления.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из Начисления Цикл
		СтрокаНачисленияДоходов(Движения, Организация, ПериодРегистрации, ПоАктуПроверки, СтрокаДанных);
	КонецЦикла;
	
	Если Записывать Тогда
		Движения.СведенияОДоходахСтраховыеВзносы.Записать();
		Движения.СведенияОДоходахСтраховыеВзносы.Записывать = Ложь;
	Иначе
		Движения.СведенияОДоходахСтраховыеВзносы.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Формирует движения по регистру СтраховыеВзносыПоФизическимЛицам.
//
// Параметры:
//		Движения - коллекция движений регистратора.
//		Отказ - признак отказа от заполнения движений.
//		Организация
//		ПериодРегистрации
//		СтраховыеВзносыПоФизическимЛицам - таблица значений с колонками рег-ра накоплений СтраховыеВзносыПоФизическимЛицам.
//		Записывать - признак того, надо ли записывать движения сразу, или они будут записаны позже.
//
Процедура ЗаписатьСтраховыеВзносыПоФизическимЛицам(Движения, Отказ, Организация, ПериодРегистрации, СтраховыеВзносыПоФизическимЛицам, Записывать = Ложь) Экспорт

	Если СтраховыеВзносыПоФизическимЛицам = Неопределено Или СтраховыеВзносыПоФизическимЛицам.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из СтраховыеВзносыПоФизическимЛицам Цикл
		НоваяСтрока = Движения.СтраховыеВзносыПоФизическимЛицам.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
		НоваяСтрока.Организация = Организация;
		НоваяСтрока.Период = ПериодРегистрации;
		НоваяСтрока.Сумма = СтрокаДанных.Результат;
		НоваяСтрока.ДатаНачала = СтрокаДанных.ДатаНачалаНачисление;
	КонецЦикла;
	
	Если Записывать Тогда
		Движения.СтраховыеВзносыПоФизическимЛицам.Записать();
		Движения.СтраховыеВзносыПоФизическимЛицам.Записывать = Ложь;
	Иначе
		Движения.СтраховыеВзносыПоФизическимЛицам.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗаполнитьВзносы(ВременнаяСсылка, МенеджерВременныхТаблиц, Организация, МесяцНачисления, ПоВсемДокументам = Истина, БезУчетаУвольнений = Ложь) Экспорт
	

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("МесяцНачисления",МесяцНачисления);
	Запрос.УстановитьПараметр("МесяцПредыдущий",МесяцНачисления-1);
	Запрос.УстановитьПараметр("ВременнаяСсылка",ВременнаяСсылка);
	Запрос.УстановитьПараметр("БезУчетаУвольнений",БезУчетаУвольнений);	
	Запрос.УстановитьПараметр("ПоВсемДокументам",ПоВсемДокументам);	
	
	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
		|	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо,
		|	СведенияОДоходахСтраховыеВзносы.ВидЕСВ,
		|	СведенияОДоходахСтраховыеВзносы.ДокументОснование,
		|	СведенияОДоходахСтраховыеВзносы.НалоговыйПериод
		|ПОМЕСТИТЬ ВТНачисленияОбороты
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Обороты(
		|			НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ),
		|			КОНЕЦПЕРИОДА(&МесяцНачисления, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|            И ФизическоеЛицо В (ВЫБРАТЬ ФизическиеЛица.ФизическоеЛицо ИЗ ВТФизическиеЛица КАК ФизическиеЛица)
		|			) КАК СведенияОДоходахСтраховыеВзносы
		|ГДЕ
		|	СведенияОДоходахСтраховыеВзносы.ВидЕСВ <> ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НеУчитывается)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо,
		|	СведенияОДоходахСтраховыеВзносы.ВидЕСВ,
		|	СведенияОДоходахСтраховыеВзносы.ДокументОснование,
		|	СведенияОДоходахСтраховыеВзносы.НалоговыйПериод
		|ИЗ
		|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Обороты(
		|			,
		|			КОНЕЦПЕРИОДА(&МесяцПредыдущий, МЕСЯЦ),
		|			,
		|			Организация = &Организация
		|           И НалоговыйПериод = НАЧАЛОПЕРИОДА(&МесяцНачисления, МЕСЯЦ)
		|            И ФизическоеЛицо В (ВЫБРАТЬ ФизическиеЛица.ФизическоеЛицо ИЗ ВТФизическиеЛица КАК ФизическиеЛица)
		|			) КАК СведенияОДоходахСтраховыеВзносы
		|ГДЕ
		|	СведенияОДоходахСтраховыеВзносы.ВидЕСВ <> ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НеУчитывается)
		|";
	
	Если НЕ ПоВсемДокументам Тогда
		ПоляСуммирования = Новый Массив;
		Запрос.Текст = ЗарплатаКадры.ДобавитьОтборПоРегистраторуРегистрНакопленияОбороты(Запрос.Текст, ".Проведен", ПоляСуммирования, "ЕСТЬ NULL");
	КонецЕсли;	
	
	Запрос.Выполнить();
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачисленияОбороты.ФизическоеЛицо,
		|	НачисленияОбороты.ВидЕСВ,
		|	НачисленияОбороты.ДокументОснование,
		|	НачисленияОбороты.НалоговыйПериод
		|ПОМЕСТИТЬ ВТСтрокиРасчетаПредварительно
		|ИЗ ВТНачисленияОбороты КАК НачисленияОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	НачисленияОбороты.ФизическоеЛицо,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата),
		|	НачисленияОбороты.ДокументОснование,
		|	НачисленияОбороты.НалоговыйПериод
		|ИЗ ВТНачисленияОбороты КАК НачисленияОбороты
		|ГДЕ
		|   НачисленияОбороты.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.Больничные) ИЛИ НачисленияОбороты.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.Декретные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтрокиРасчетаПредварительно.ФизическоеЛицо,
		|	СтрокиРасчетаПредварительно.ВидЕСВ,
		|	СтрокиРасчетаПредварительно.ДокументОснование,
		|	СтрокиРасчетаПредварительно.НалоговыйПериод
		|ПОМЕСТИТЬ ВТСтрокиРасчета
		|ИЗ ВТСтрокиРасчетаПредварительно КАК СтрокиРасчетаПредварительно
		|";
	Запрос.Выполнить();
	
//Категории застрахованных лиц по данным кадрового учета	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСВДвижения.ФизическоеЛицо,
		|	ЕСВДвижения.Сотрудник,
		|	ЕСВДвижения.КатегорияЕСВ,
		|	ЕСВДвижения.Регистратор,
		|	ВЫБОР
		|		КОГДА ЕСВДвижения.Регистратор ССЫЛКА Документ.Увольнение
		|		ТОГДА КОНЕЦПЕРИОДА(ЕСВДвижения.Период, МЕСЯЦ)
		|		КОГДА ЕСВДвижения.Регистратор ССЫЛКА Документ.ПриемНаРаботу ИЛИ ЕСВДвижения.Регистратор ССЫЛКА Документ.ПриемНаРаботуСписком
		|		ТОГДА НАЧАЛОПЕРИОДА(ЕСВДвижения.Период, МЕСЯЦ)
		|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ЕСВДвижения.Период,ДЕНЬ,-1)
		|	КОНЕЦ КАК Период,
		|	ВЫБОР
		|		КОГДА ЕСВДвижения.Регистратор ССЫЛКА Документ.Увольнение
		|		ТОГДА КОНЕЦПЕРИОДА(ЕСВДвижения.Период, МЕСЯЦ)
		|		КОГДА ЕСВДвижения.Регистратор ССЫЛКА Документ.ПриемНаРаботу ИЛИ ЕСВДвижения.Регистратор ССЫЛКА Документ.ПриемНаРаботуСписком
		|		ТОГДА НАЧАЛОПЕРИОДА(ЕСВДвижения.Период, МЕСЯЦ)
		|		ИНАЧЕ ЕСВДвижения.Период
		|	КОНЕЦ КАК ПериодНачало
		|ПОМЕСТИТЬ ВТЕСВДвиженияВсе
		|ИЗ
		|	РегистрСведений.ЕСВСотрудников КАК ЕСВДвижения
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|    ВТФизическиеЛица КАК ФизическиеЛица
		|    ПО ЕСВДвижения.ФизическоеЛицо = ФизическиеЛица.ФизическоеЛицо
		|     И ЕСВДвижения.Сотрудник.ГоловнаяОрганизация = &Организация
		|ГДЕ
		|   НЕ (&БезУчетаУвольнений) ИЛИ НЕ (ЕСВДвижения.Регистратор ССЫЛКА Документ.Увольнение)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.НалоговыйПериод,
		|	ЕСВДвижения.Сотрудник,
		|	МАКСИМУМ(ЕСВДвижения.Период) КАК Период	
		|ПОМЕСТИТЬ ВТМаксимальныеПериоды
		|ИЗ
		|	ВТСтрокиРасчета КАК СтрокиРасчета
		|    ЛЕВОЕ СОЕДИНЕНИЕ
		|    ВТЕСВДвиженияВсе КАК ЕСВДвижения
		|    ПО СтрокиРасчета.ФизическоеЛицо = ЕСВДвижения.ФизическоеЛицо 
		|     И СтрокиРасчета.НалоговыйПериод >= ЕСВДвижения.Период
		|СГРУППИРОВАТЬ ПО
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.НалоговыйПериод,
		|	ЕСВДвижения.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаксимальныеПериоды.ФизическоеЛицо,
		|	МаксимальныеПериоды.Сотрудник,
		|	МаксимальныеПериоды.НалоговыйПериод,
		|	МаксимальныеПериоды.НалоговыйПериод КАК ДатаНачала,
		|	ЕСВДвижения.КатегорияЕСВ	
		|ПОМЕСТИТЬ ВТЕСВСрез
		|ИЗ
		|	ВТМаксимальныеПериоды КАК МаксимальныеПериоды
		|	ЛЕВОЕ СОЕДИНЕНИЕ ВТЕСВДвиженияВсе КАК ЕСВДвижения
		|    ПО МаксимальныеПериоды.ФизическоеЛицо = ЕСВДвижения.ФизическоеЛицо 
		|     И МаксимальныеПериоды.Период = ЕСВДвижения.Период
		|     И МаксимальныеПериоды.Сотрудник = ЕСВДвижения.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСВДвижения.ФизическоеЛицо,
		|	ЕСВДвижения.Сотрудник,
		|	СтрокиРасчета.НалоговыйПериод,
		|	ЕСВДвижения.КатегорияЕСВ,
		|	ЕСВДвижения.Период,
		|	ЕСВДвижения.ПериодНачало
		|ПОМЕСТИТЬ ВТЕСВДвижения
		|ИЗ
		|	ВТЕСВДвиженияВсе КАК ЕСВДвижения
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|    ВТСтрокиРасчета КАК СтрокиРасчета
		|     ПО ЕСВДвижения.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
		|      И ЕСВДвижения.Период >= СтрокиРасчета.НалоговыйПериод
		|      И ЕСВДвижения.Период <= КОНЕЦПЕРИОДА(СтрокиРасчета.НалоговыйПериод, МЕСЯЦ)
		|      И НЕ (ЕСВДвижения.Регистратор ССЫЛКА Документ.ПриемНаРаботу)
		|      И НЕ (ЕСВДвижения.Регистратор ССЫЛКА Документ.ПриемНаРаботуСписком)
		|      И &ПоВсемДокументам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСВСрез.ФизическоеЛицо,
		|	ЕСВСрез.Сотрудник,
		|	ЕСВСрез.НалоговыйПериод,
		|	ЕСВСрез.КатегорияЕСВ,
		|	ЕСВСрез.ДатаНачала КАК ДатаНачала	
		|ПОМЕСТИТЬ ВТЕСВНачало
		|ИЗ
		|	ВТЕСВСрез КАК ЕСВСрез
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЕСВДвижения.ФизическоеЛицо,
		|	ЕСВДвижения.Сотрудник,
		|	ЕСВДвижения.НалоговыйПериод,
		|	ЕСВДвижения.КатегорияЕСВ,
		|	ЕСВДвижения.ПериодНачало КАК ДатаНачала	
		|ИЗ
		|	ВТЕСВДвижения КАК ЕСВДвижения
		|ГДЕ
		|   ЕСВДвижения.КатегорияЕСВ <> ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.ПустаяСсылка)
		|   И ЕСВДвижения.КатегорияЕСВ <> ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.НеУчитывается)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСВНачало.ФизическоеЛицо,
		|	ЕСВНачало.Сотрудник,
		|	ЕСВНачало.КатегорияЕСВ,
		|	ЕСВНачало.ДатаНачала,
		|	ЕСВНачало.НалоговыйПериод,
		|	МИНИМУМ(ЕСВДвижения.Период) КАК ДатаОкончания	
		|ПОМЕСТИТЬ ВТМинимальныеПериоды
		|ИЗ
		|	ВТЕСВНачало КАК ЕСВНачало
		|    ЛЕВОЕ СОЕДИНЕНИЕ
		|    ВТЕСВДвижения КАК ЕСВДвижения
		|    ПО ЕСВНачало.ФизическоеЛицо = ЕСВДвижения.ФизическоеЛицо 
		|     И ЕСВНачало.Сотрудник = ЕСВДвижения.Сотрудник
		|     И ЕСВНачало.НалоговыйПериод = ЕСВДвижения.НалоговыйПериод
		|     И ЕСВНачало.КатегорияЕСВ <> ЕСВДвижения.КатегорияЕСВ
		|     И ЕСВНачало.ДатаНачала < ЕСВДвижения.Период
		|СГРУППИРОВАТЬ ПО
		|	ЕСВНачало.ФизическоеЛицо,
		|	ЕСВНачало.Сотрудник,
		|	ЕСВНачало.НалоговыйПериод,
		|	ЕСВНачало.КатегорияЕСВ,
		|	ЕСВНачало.ДатаНачала
		|";
     Запрос.Выполнить();
	 
	 Запрос.Текст ="ВЫБРАТЬ 
		|	ЕСВНачало.ФизическоеЛицо,
		|	ЕСВНачало.Сотрудник,
		|	ЕСВНачало.НалоговыйПериод,
		|	ЕСВНачало.КатегорияЕСВ,
		|	ЕСВНачало.ДатаНачала,
		|	ЕСТЬNULL(МинимальныеПериоды.ДатаОкончания, КОНЕЦПЕРИОДА(ЕСВНачало.ДатаНачала, МЕСЯЦ)) КАК ДатаОкончания,
		|	NULL КАК ДокументОснование
		|ПОМЕСТИТЬ ВТОсновныеКатегории
		|ИЗ
		|	ВТЕСВНачало КАК ЕСВНачало
		|   ЛЕВОЕ СОЕДИНЕНИЕ
		|    ВТМинимальныеПериоды КАК МинимальныеПериоды
		|    ПО ЕСВНачало.ФизическоеЛицо = МинимальныеПериоды.ФизическоеЛицо 
		|     И ЕСВНачало.НалоговыйПериод = МинимальныеПериоды.НалоговыйПериод
		|     И ЕСВНачало.Сотрудник = МинимальныеПериоды.Сотрудник
		|     И ЕСВНачало.КатегорияЕСВ = МинимальныеПериоды.КатегорияЕСВ
		|     И ЕСВНачало.ДатаНачала = МинимальныеПериоды.ДатаНачала
		|";
		
	Если МенеджерВременныхТаблиц.Таблицы.Найти("ВТНачисленияПоДоговорам") <> Неопределено Тогда
		Запрос.Текст = Запрос.Текст + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ 
			|	НачисленияПоДоговорам.ФизическоеЛицо,
			|	НачисленияПоДоговорам.Сотрудник,
			|	НачисленияПоДоговорам.ПериодДействия,
			|	НачисленияПоДоговорам.КатегорияЕСВ,
			|	НАЧАЛОПЕРИОДА(НачисленияПоДоговорам.ПериодДействия, МЕСЯЦ),
			|	КОНЕЦПЕРИОДА(НачисленияПоДоговорам.ПериодДействия, МЕСЯЦ),
			|	НачисленияПоДоговорам.Договор
			|ИЗ
			|	ВТНачисленияПоДоговорам КАК НачисленияПоДоговорам
			|
			|";
	КонецЕсли;		
	Запрос.Выполнить();	

	Запрос.Текст = "ВЫБРАТЬ
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.ВидЕСВ,
		|	СтрокиРасчета.НалоговыйПериод,
		|   МАКСИМУМ(ОплатаПоСреднемуЗаработку.КатегорияЕСВ) КАК КатегорияЕСВ
		|ПОМЕСТИТЬ ВТКатегорииМобилизованных
		|ИЗ
		|	ВТСтрокиРасчета КАК СтрокиРасчета
		|    ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|    Документ.ОплатаПоСреднемуЗаработку КАК ОплатаПоСреднемуЗаработку
		|    ПО СтрокиРасчета.ФизическоеЛицо = ОплатаПоСреднемуЗаработку.ФизическоеЛицо
		|     И СтрокиРасчета.НалоговыйПериод = НАЧАЛОПЕРИОДА(ОплатаПоСреднемуЗаработку.ДатаНачала, МЕСЯЦ)
		|     И СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НачисленияМобилизованным)
		|     И ОплатаПоСреднемуЗаработку.ВидРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НачисленияМобилизованным)
		|     И ОплатаПоСреднемуЗаработку.КатегорияЕСВ <> ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.ПустаяСсылка)
		|     И ОплатаПоСреднемуЗаработку.Проведен                                                                   
		|СГРУППИРОВАТЬ ПО
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.ВидЕСВ,
		|	СтрокиРасчета.НалоговыйПериод
		|";
	Запрос.Выполнить();	
	
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтрокиРасчета.ФизическоеЛицо.Наименование КАК Наименование,
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.ВидЕСВ,
		|	СтрокиРасчета.НалоговыйПериод,
		|	ВЫБОР 
		|		КОГДА СтрокиРасчета.ВидЕСВ = ОсновныеКатегории.КатегорияЕСВ.ВидЕСВ
		|	    ТОГДА ОсновныеКатегории.КатегорияЕСВ
		|		КОГДА СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НачисленияМобилизованным)
        |       ТОГДА
		|           ВЫБОР
		|       	 КОГДА НЕ (КатегорииМобилизованных.КатегорияЕСВ ЕСТЬ NULL)
		|        	 ТОГДА КатегорииМобилизованных.КатегорияЕСВ
		|       	 КОГДА ОсновныеКатегории.КатегорияЕСВ = ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.НаемныйРаботникИнвалид)
		|        	 ТОГДА ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.МобилизованныйРаботникИнвалид)
		|       	 ИНАЧЕ ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.МобилизованныйРаботник)
		|           КОНЕЦ
		|	    ИНАЧЕ ПараметрыКатегорийЕСВ.СвязаннаяКатегория
		|    КОНЕЦ КАК КатегорияЕСВ,
		|   ВЫБОР 
		|   	КОГДА ОсновныеКатегории.ДокументОснование ЕСТЬ NULL
		|			ТОГДА ОсновныеКатегории.ДатаНачала
		|		ИНАЧЕ НАЧАЛОПЕРИОДА(СтрокиРасчета.НалоговыйПериод, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаНачала,
		|   ВЫБОР 
		|   	КОГДА ОсновныеКатегории.ДокументОснование ЕСТЬ NULL
		|			ТОГДА ОсновныеКатегории.ДатаОкончания
		|		ИНАЧЕ КОНЕЦПЕРИОДА(СтрокиРасчета.НалоговыйПериод, МЕСЯЦ)
		|	КОНЕЦ КАК ДатаОкончания	
		|ПОМЕСТИТЬ ВТВзносыВсе
		|ИЗ
		|	ВТСтрокиРасчета КАК СтрокиРасчета
		|    ЛЕВОЕ СОЕДИНЕНИЕ
		|    ВТОсновныеКатегории КАК ОсновныеКатегории
		|    ПО СтрокиРасчета.ФизическоеЛицо = ОсновныеКатегории.ФизическоеЛицо
		|     И (СтрокиРасчета.НалоговыйПериод = ОсновныеКатегории.НалоговыйПериод
		|      ИЛИ СтрокиРасчета.ДокументОснование = ОсновныеКатегории.ДокументОснование)
		|    ЛЕВОЕ СОЕДИНЕНИЕ
		|    ВТКатегорииМобилизованных КАК КатегорииМобилизованных
		|    ПО СтрокиРасчета.ФизическоеЛицо = КатегорииМобилизованных.ФизическоеЛицо
		|     И СтрокиРасчета.НалоговыйПериод = КатегорииМобилизованных.НалоговыйПериод
		|     И СтрокиРасчета.ВидЕСВ = КатегорииМобилизованных.ВидЕСВ
		|    ЛЕВОЕ СОЕДИНЕНИЕ
		|    РегистрСведений.ПараметрыКатегорийЕСВ.СрезПоследних(&МесяцНачисления) КАК ПараметрыКатегорийЕСВ
		|    ПО ОсновныеКатегории.КатегорияЕСВ = ПараметрыКатегорийЕСВ.Категория
		|     И СтрокиРасчета.ВидЕСВ = ПараметрыКатегорийЕСВ.Вид
		|ГДЕ НЕ (ОсновныеКатегории.КатегорияЕСВ  ЕСТЬ NULL)
		|    И НЕ (ОсновныеКатегории.КатегорияЕСВ = ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.НеУчитывается))
		|    И НЕ ВЫБОР 
		|		КОГДА СтрокиРасчета.ВидЕСВ = ОсновныеКатегории.КатегорияЕСВ.ВидЕСВ
		|	    ТОГДА ОсновныеКатегории.КатегорияЕСВ
		|		КОГДА СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.НачисленияМобилизованным)
		|	    ТОГДА ЗНАЧЕНИЕ(Справочник.КатегорииЗастрахованныхЛицЕСВ.МобилизованныйРаботник)
		|	    ИНАЧЕ ПараметрыКатегорийЕСВ.СвязаннаяКатегория
		|   КОНЕЦ ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВзносыВсе.Наименование,
		|	ВзносыВсе.ФизическоеЛицо,
		|	ВзносыВсе.ВидЕСВ,
		|	ВзносыВсе.НалоговыйПериод,
		|	ВзносыВсе.КатегорияЕСВ,
		|	МИНИМУМ(ВзносыВсе.ДатаНачала) КАК ДатаНачала,
		|	МАКСИМУМ(ВзносыВсе.ДатаОкончания) КАК ДатаОкончания	
		|ПОМЕСТИТЬ ВТВзносы
		|ИЗ
		|	ВТВзносыВсе КАК ВзносыВсе
		|СГРУППИРОВАТЬ ПО 
		|	ВзносыВсе.Наименование,
		|	ВзносыВсе.ФизическоеЛицо,
		|	ВзносыВсе.ВидЕСВ,
		|	ВзносыВсе.НалоговыйПериод,
		|	ВзносыВсе.КатегорияЕСВ
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взносы.Наименование,
		|	Взносы.ФизическоеЛицо,
		|	Взносы.ВидЕСВ,
		|	Взносы.КатегорияЕСВ,
		|	Взносы.ДатаНачала,
		|	Взносы.ДатаОкончания	
		|ИЗ
		|	ВТВзносы КАК Взносы
		|   ЛЕВОЕ СОЕДИНЕНИЕ
	    |   РегистрСведений.ПараметрыКатегорийЕСВ.СрезПоследних(&МесяцНачисления) КАК ПараметрыКатегорийЕСВ
	    |    ПО Взносы.ВидЕСВ = ПараметрыКатегорийЕСВ.Вид
	    |     И Взносы.КатегорияЕСВ = ПараметрыКатегорийЕСВ.Категория
		|ГДЕ
		|   ЕСТЬNULL(ПараметрыКатегорийЕСВ.ЕСВ, ЗНАЧЕНИЕ(Справочник.Налоги.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Налоги.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО
		|	Взносы.Наименование,
		|	Взносы.ДатаНачала,
		|	Взносы.ВидЕСВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Взносы.Наименование,
		|	Взносы.ФизическоеЛицо,
		|	Взносы.ВидЕСВ,
		|	Взносы.КатегорияЕСВ,
		|	Взносы.ДатаНачала,
		|	Взносы.ДатаОкончания	
		|ИЗ
		|	ВТВзносы КАК Взносы
		|   ЛЕВОЕ СОЕДИНЕНИЕ
	    |   РегистрСведений.ПараметрыКатегорийЕСВ.СрезПоследних(&МесяцНачисления) КАК ПараметрыКатегорийЕСВ
	    |    ПО Взносы.ВидЕСВ = ПараметрыКатегорийЕСВ.Вид
	    |     И Взносы.КатегорияЕСВ = ПараметрыКатегорийЕСВ.Категория
		|ГДЕ
		|   ЕСТЬNULL(ПараметрыКатегорийЕСВ.ЕСВФОТ, ЗНАЧЕНИЕ(Справочник.Налоги.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Налоги.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО
		|	Взносы.Наименование,
		|	Взносы.ДатаНачала,
		|	Взносы.ВидЕСВ
		|";
	
	Взносы = Запрос.ВыполнитьПакет();   
	
	СтруктураВзносы = Новый Структура();
	СтруктураВзносы.Вставить("Взносы", Взносы[2].Выгрузить());
	СтруктураВзносы.Вставить("ВзносыФОТ", Взносы[3].Выгрузить());
	
	Запрос.Текст = 
		"УНИЧТОЖИТЬ ВТНачисленияОбороты
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТСтрокиРасчета
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТЕСВДвиженияВсе
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТМаксимальныеПериоды
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТЕСВСрез
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТЕСВДвижения
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТЕСВНачало
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТМинимальныеПериоды
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТОсновныеКатегории
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТВзносыВсе
	    |;
		|
		|////////////////////////////////////////////////////////////////////////////////
	    |УНИЧТОЖИТЬ ВТВзносы
	    |;
		|";
	Запрос.Выполнить();	
	
	
	Возврат СтруктураВзносы;
	
КонецФункции

// Рассчитывает взносы по уже записанным в учете данным о начислениях и 
// по переданным данным о начислениях.
// Возвращает таблицу значений с полями:
//		ФизическоеЛицо
//
// Параметры:
//      Ссылка
//		ПериодРегистрации - дата - определяет месяц, по который ведется расчет.
//		Организация
//      МенеджерВременныхТаблиц содержит вр. таблицы 
//      	ВТФизическиеЛица 
//				ФизическоеЛицо.
//		ИсключатьДоходыРегистратора - булево -
//		ДатаОкончанияРегистрацииДоходов - дата - определяет самую позднюю дату регистрации учитываемых доходов, 
//			относящихся к заданному ранее месяцу расчета.
//
Функция РассчитатьВзносы(Ссылка, Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ИсключатьДоходыРегистратора = Истина, ДатаОкончанияРегистрацииДоходов = Неопределено, ОкончательныйРасчетВзносов = Ложь) Экспорт


    ОкончательныйРасчет = (ТипЗнч(Ссылка) = Тип("ДокументСсылка.НачислениеЗарплаты"))
						ИЛИ (ТипЗнч(Ссылка) = Тип("ДокументСсылка.Увольнение"))
						ИЛИ (ТипЗнч(Ссылка) = Тип("ДокументСсылка.УвольнениеСписком"))
						ИЛИ (ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВыплатаБывшимСотрудникам"));
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Увольнение") Тогда
		ОкончательныйРасчет = ОкончательныйРасчетВзносов;
	КонецЕсли;	
						
	БезУчетаУвольнений = ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВыплатаБывшимСотрудникам");					

	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация);
	
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("Организация", Организация);
    Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("НачалоПредыдущегоГода", ДобавитьМесяц(НачалоГода(ПериодРегистрации), -12));
	Запрос.УстановитьПараметр("КонецГода", КонецГода(ПериодРегистрации));
	Запрос.УстановитьПараметр("ГодРасчета", Год(ПериодРегистрации));
	Запрос.УстановитьПараметр("МесяцРасчета", Месяц(ПериодРегистрации));
	Запрос.УстановитьПараметр("ПредыдущийМесяц", Месяц(ПериодРегистрации) - 1);
	Запрос.УстановитьПараметр("ПериодРегистрации", НачалоМесяца(ПериодРегистрации));
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ИсключаемыйРегистратор", ?(ИсключатьДоходыРегистратора, Ссылка, Неопределено));
	
	СтрокиКРасчету = ЗаполнитьВзносы(Ссылка, МенеджерВременныхТаблиц, Организация, ПериодРегистрации, ОкончательныйРасчет, БезУчетаУвольнений); 
	
	Если СтрокиКРасчету.Взносы.Количество() = 0 И СтрокиКРасчету.ВзносыФОТ.Количество() = 0 Тогда
		Возврат СтрокиКРасчету;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("МесяцПредыдущий",ДобавитьМесяц(ПериодРегистрации,-1));
	Запрос.УстановитьПараметр("Взносы",СтрокиКРасчету.Взносы);
	Запрос.УстановитьПараметр("ВзносыФОТ",СтрокиКРасчету.ВзносыФОТ);
	
	Запрос.УстановитьПараметр("НеПрименяетсяМинимальнаяБаза", ПериодРегистрации < ДатаИзмененияЕСВ1573());
	Запрос.УстановитьПараметр("НеПрименяетсяКоэффициентСтавки", ПериодРегистрации < ДатаИзмененияЕСВ1573());
	
	Применяется1863 = (ПериодРегистрации >= ДатаИзмененияЕСВ1863());
	
	Запрос.УстановитьПараметр("Применяется1863", Применяется1863);
	
	Запрос.УстановитьПараметр("МассивНалогиБезКоэффициента",СписокНалогиБезКоэффициента());
	Запрос.УстановитьПараметр("МассивНалогиБезМинимальнойБазы",СписокНалогиБезМинимальнойБазы());
	
	Запрос.УстановитьПараметр("ОкончательныйРасчет",ОкончательныйРасчет);
	
	Применяется3688 = (ПериодРегистрации >= ДатаИзмененияЕСВ3688());
	
	Запрос.УстановитьПараметр("Применяется3688", Применяется3688);
	
	Запрос.Текст = 
	   "ВЫБРАТЬ
	   |	Взносы.ФизическоеЛицо,
	   |	Взносы.ВидЕСВ,
	   |	НАЧАЛОПЕРИОДА(Взносы.ДатаНачала, МЕСЯЦ) КАК НалоговыйПериод,
	   |	Взносы.ДатаНачала,
	   |	Взносы.ДатаОкончания,
	   |	Взносы.КатегорияЕСВ
	   |ПОМЕСТИТЬ ВТСтрокиРасчетаВзносы
	   |ИЗ
	   |	&Взносы КАК Взносы
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Взносы.ФизическоеЛицо,
	   |	Взносы.ВидЕСВ,
	   |	НАЧАЛОПЕРИОДА(Взносы.ДатаНачала, МЕСЯЦ) КАК НалоговыйПериод,
	   |	КОНЕЦПЕРИОДА(Взносы.ДатаНачала, МЕСЯЦ) КАК ПериодУчета,
	   |	Взносы.ДатаНачала,
	   |	Взносы.ДатаОкончания,
	   |	Взносы.КатегорияЕСВ
	   |ПОМЕСТИТЬ ВТСтрокиРасчетаВзносыФОТ
	   |ИЗ
	   |	&ВзносыФОТ КАК Взносы
	   |;
       |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	Взносы.ФизическоеЛицо,
	   |	Взносы.ВидЕСВ,
	   |	Взносы.НалоговыйПериод,
	   |	Взносы.ДатаНачала,
	   |	Взносы.ДатаОкончания,
	   |	Взносы.КатегорияЕСВ
	   |ПОМЕСТИТЬ ВТСтрокиРасчета
	   |ИЗ
	   |	ВТСтрокиРасчетаВзносы КАК Взносы
	   |
	   |ОБЪЕДИНИТЬ ВСЕ
	   |
	   |ВЫБРАТЬ
	   |	Взносы.ФизическоеЛицо,
	   |	Взносы.ВидЕСВ,
	   |	Взносы.НалоговыйПериод,
	   |	Взносы.ДатаНачала,
	   |	Взносы.ДатаОкончания,
	   |	Взносы.КатегорияЕСВ
	   |ИЗ
	   |	ВТСтрокиРасчетаВзносыФОТ КАК Взносы";
	Запрос.Выполнить();
	
//Физические лица, у которых по основной зарплате в периоде несколько категорий, например при смене инвалидности в середине месяца
	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗЛИЧНЫЕ
	   |	Взносы1.ФизическоеЛицо
	   |ИЗ
	   |	ВТСтрокиРасчетаВзносыФОТ КАК Взносы1
	   |    ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	   |	ВТСтрокиРасчетаВзносыФОТ КАК Взносы2
	   |	ПО Взносы1.ФизическоеЛицо = Взносы2.ФизическоеЛицо
	   |	 И Взносы1.ВидЕСВ = Взносы2.ВидЕСВ
	   |	 И Взносы1.НалоговыйПериод = Взносы2.НалоговыйПериод
	   |	 И Взносы1.КатегорияЕСВ <> Взносы2.КатегорияЕСВ
	   |ГДЕ
	   |    Взносы1.НалоговыйПериод = &ПериодРегистрации
	   |    И Взносы1.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)
	   |";
	ФизЛицаСДублями = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ФизическоеЛицо");	
	
	
	//Получим список работающих по основному месту работы
	КадровыйУчет.СоздатьВТОсновныеМестаРаботыФизическихЛиц(МенеджерВременныхТаблиц, Истина, Организация, "ВТОсновныеМестаРаботы", "ВТСтрокиРасчетаВзносыФОТ", "ПериодУчета");
	
	//Запросы к данным регистров - начислениям сотрудников и удержанному ЕСВ.
	//Если не по всем документам - нужен отбор по регистратору
	Запрос.Текст = 
	   "////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо,
	   |	СведенияОДоходахСтраховыеВзносы.ВидЕСВ,
	   |	ВидыЕСВ.Порядок КАК ВидЕСВПорядок,
	   |	СведенияОДоходахСтраховыеВзносы.НалоговыйПериод,
	   |	СведенияОДоходахСтраховыеВзносы.СуммаОборот КАК База,
	   |	ВЫБОР 
	   |     КОГДА СведенияОДоходахСтраховыеВзносы.ЭтоОтпускные
	   |         И СведенияОДоходахСтраховыеВзносы.Период = &ПериодРегистрации
	   |     ТОГДА СведенияОДоходахСтраховыеВзносы.СуммаОборот
	   |     ИНАЧЕ 0
	   |    КОНЕЦ КАК БазаОтпускные
	   |
	   |ПОМЕСТИТЬ ВТНачисленияОбороты
	   |ИЗ
	   |	РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Обороты(
	   |			,
	   |			КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
	   |			МЕСЯЦ,
	   |			Организация = &Организация
	   |				И (ФизическоеЛицо В
	   |					(ВЫБРАТЬ
	   |						СтрокиРасчета.ФизическоеЛицо
	   |					ИЗ
	   |						ВТСтрокиРасчета КАК СтрокиРасчета))
	   |				) КАК СведенияОДоходахСтраховыеВзносы
	   |
	   |    ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ВидыЕСВ КАК ВидыЕСВ
	   |    ПО ВидыЕСВ.Ссылка = СведенияОДоходахСтраховыеВзносы.ВидЕСВ 
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	ЕСВПоСотрудникамОборот.ФизическоеЛицо,
	   |	ЕСВПоСотрудникамОборот.ВидЕСВ КАК ВидЕСВ,
	   |	ЕСВПоСотрудникамОборот.НалоговыйПериод КАК НалоговыйПериод,
	   |	ЕСВПоСотрудникамОборот.СпособРасчета КАК СпособРасчета,
	   |	ЕСВПоСотрудникамОборот.БазаОборот КАК БазаДо,
	   |	ЕСВПоСотрудникамОборот.БазаВзносаОборот КАК БазаВзносаДо
	   |
	   |ПОМЕСТИТЬ ВТЕСВПоСотрудникамОборот
	   |ИЗ
	   |	РегистрНакопления.ИсчисленныеСтраховыеВзносы.Обороты(
	   |			,
	   |			КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),
	   |			,
	   |			Организация = &Организация
	   |				И (ФизическоеЛицо В
	   |					(ВЫБРАТЬ
	   |						СтрокиРасчета.ФизическоеЛицо
	   |					ИЗ
	   |						ВТСтрокиРасчета КАК СтрокиРасчета))) КАК ЕСВПоСотрудникамОборот
	   |";
	
	Если ОкончательныйРасчет И ИсключатьДоходыРегистратора Тогда
		ПоляСуммирования = Новый Массив;
		ПоляСуммирования.Добавить("База");
		ПоляСуммирования.Добавить("БазаОтпускные");
		ПоляСуммирования.Добавить("БазаДо");
		ПоляСуммирования.Добавить("БазаВзносаДо");
		Запрос.Текст = ЗарплатаКадры.ДобавитьОтборПоРегистраторуРегистрНакопленияОбороты(Запрос.Текст, "ИсключаемыйРегистратор", ПоляСуммирования, "<>");
	ИначеЕсли НЕ ОкончательныйРасчет Тогда
		ПоляСуммирования = Новый Массив;
		ПоляСуммирования.Добавить("База");
		ПоляСуммирования.Добавить("БазаОтпускные");
		ПоляСуммирования.Добавить("БазаДо");
		ПоляСуммирования.Добавить("БазаВзносаДо");
		Запрос.Текст = ЗарплатаКадры.ДобавитьОтборПоРегистраторуРегистрНакопленияОбороты(Запрос.Текст, ".Проведен", ПоляСуммирования, "ЕСТЬ NULL");
	КонецЕсли;
	
	Запрос.Выполнить();   
	
	//Базы
	Запрос.Текст = 
	   "////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ РАЗЛИЧНЫЕ
	   |	СтрокиРасчета.ФизическоеЛицо,
	   |	СтрокиРасчета.ВидЕСВ,
	   |	СтрокиРасчета.НалоговыйПериод,
	   |	ЕСТЬNULL(НачисленияОбороты.База,0) КАК База,
	   |	ЕСТЬNULL(НачисленияОбороты.БазаОтпускные, 0) КАК БазаОтпускные
	   |ПОМЕСТИТЬ ВТБазаСФильтром
	   |ИЗ
	   |	ВТНачисленияОбороты КАК НачисленияОбороты
	   |    ПРАВОЕ СОЕДИНЕНИЕ
	   |    ВТСтрокиРасчета КАК СтрокиРасчета
	   |    ПО СтрокиРасчета.ФизическоеЛицо = НачисленияОбороты.ФизическоеЛицо
	   |     И СтрокиРасчета.ВидЕСВ = НачисленияОбороты.ВидЕСВ
	   |     И СтрокиРасчета.НалоговыйПериод = НачисленияОбороты.НалоговыйПериод
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	БазаСФильтром.ФизическоеЛицо,
	   |	БазаСФильтром.ВидЕСВ,
	   |	БазаСФильтром.НалоговыйПериод,
	   |	СУММА(БазаСФильтром.База) КАК База,
	   |	СУММА(БазаСФильтром.БазаОтпускные) КАК БазаОтпускные
	   |ПОМЕСТИТЬ ВТБаза
	   |ИЗ
	   |	ВТБазаСФильтром КАК БазаСФильтром
	   |СГРУППИРОВАТЬ ПО
	   |	БазаСФильтром.ФизическоеЛицо,
	   |	БазаСФильтром.ВидЕСВ,
	   |	БазаСФильтром.НалоговыйПериод
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ТаблицаБаза.ФизическоеЛицо,
	   |	ТаблицаБаза.ВидЕСВ,
	   |	ТаблицаБаза.НалоговыйПериод,
	   |	СУММА(ТаблицаБазаВычет.База) КАК БазаВычет
	   |ПОМЕСТИТЬ ВТБазаВычет
	   |ИЗ
	   |	ВТБаза КАК ТаблицаБаза
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    ВТНачисленияОбороты КАК ТаблицаБазаВычет
	   |    ПО ТаблицаБаза.ФизическоеЛицо = ТаблицаБазаВычет.ФизическоеЛицо
	   |     И ТаблицаБаза.НалоговыйПериод = ТаблицаБазаВычет.НалоговыйПериод
	   |     И ТаблицаБаза.ВидЕСВ.Порядок > ТаблицаБазаВычет.ВидЕСВ.Порядок
	   |СГРУППИРОВАТЬ ПО
	   |	ТаблицаБаза.ФизическоеЛицо,
	   |	ТаблицаБаза.ВидЕСВ,
	   |	ТаблицаБаза.НалоговыйПериод
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ТаблицаБаза.ФизическоеЛицо,
	   |	ТаблицаБаза.НалоговыйПериод,
	   |	СУММА(ТаблицаБаза.База) КАК БазаПолная
	   |ПОМЕСТИТЬ ВТБазаПолная
	   |ИЗ
	   |	ВТБаза КАК ТаблицаБаза
	   |ГДЕ
	   |	(&Применяется1863
	   |	ИЛИ ТаблицаБаза.ВидЕСВ <> ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ПоДоговорамГПХ))
	   |СГРУППИРОВАТЬ ПО
	   |	ТаблицаБаза.ФизическоеЛицо,
	   |	ТаблицаБаза.НалоговыйПериод
	   |;
	   |";
	Запрос.Выполнить();
	
	//Пределы страховых взносов
	ОтборыОТ = Новый Структура();
	ВыбираемыеПоляОТ = Новый Структура();
	ОтборыРС = Новый Структура();
	ВыбираемыеПоляРС = Новый Структура();
	ВыбираемыеПоляРС.Вставить("Предел","Предел");
	ВыбираемыеПоляРС.Вставить("ПределДия","ПределДия");
	ВыбираемыеПоляРС.Вставить("МинимальнаяБаза","МинимальнаяБаза");
	ПоляСвязей = Новый Структура();
	ПоляСвязей.Вставить("ВидЕСВ","ВидЕСВ");
	
	Запрос.Текст = ЗарплатаКадры.ЗапросВТСрезПоследнихНаВсеДаты("ВТПределыСтраховыхВзносовСрез", "ВТСтрокиРасчетаВзносыФОТ", ОтборыОТ, ВыбираемыеПоляОТ, "НалоговыйПериод", "РегистрСведений.ПределыСтраховыхВзносов", ОтборыРС, ВыбираемыеПоляРС,"Период", ПоляСвязей, ЛОЖЬ, ЛОЖЬ, ЛОЖЬ);
	Запрос.Выполнить();
	
	//Принятые и уволенные
	Запрос.Текст = 
	   "////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	   |	СтрокиРасчета.ФизическоеЛицо,
	   |	СтрокиРасчета.НалоговыйПериод
	   |ПОМЕСТИТЬ ВТТекущиеКадровыеДанныеСотрудников
	   |ИЗ
	   |	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	   |    ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	   |    ВТСтрокиРасчетаВзносыФОТ КАК СтрокиРасчета
	   |    ПО СтрокиРасчета.ФизическоеЛицо = ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо
	   |     И ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация = &Организация
	   |ГДЕ
	   |   ТекущиеКадровыеДанныеСотрудников.ТекущийВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровССотрудниками.ГигКонтракт)
	   |   ИЛИ
	   |   (НЕ ТекущиеКадровыеДанныеСотрудников.ДатаПриема > СтрокиРасчета.НалоговыйПериод
	   |    И НЕ ТекущиеКадровыеДанныеСотрудников.ДатаПриема = ДАТАВРЕМЯ(1,1,1)
	   |    И НЕ (КОНЕЦПЕРИОДА(ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения, ДЕНЬ) < КОНЕЦПЕРИОДА(СтрокиРасчета.НалоговыйПериод, МЕСЯЦ)
	   |       И ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения <> ДАТАВРЕМЯ(1,1,1))
	   |  )  
	   |";
	Запрос.Выполнить();   
	
	//Неоплаченные больничные
	Запрос.Текст = 
	   "////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	   |	СтрокиРасчета.ФизическоеЛицо,
	   |	СтрокиРасчета.НалоговыйПериод
	   |ПОМЕСТИТЬ ВТОжидаемыеБольничные
	   |ИЗ
	   |	Документ.БольничныйЛист КАК БольничныйЛист
	   |    ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	   |    ВТСтрокиРасчетаВзносыФОТ КАК СтрокиРасчета
	   |    ПО СтрокиРасчета.ФизическоеЛицо = БольничныйЛист.ФизическоеЛицо
	   |     И БольничныйЛист.Организация = &Организация
	   |     И БольничныйЛист.ПериодРегистрации = СтрокиРасчета.НалоговыйПериод
	   |ГДЕ
	   |	БольничныйЛист.Проведен
	   |	И БольничныйЛист.ЗарегистрироватьДляЕСВ
	   |	И НЕ БольничныйЛист.НазначитьПособие
	   |	И БольничныйЛист.ПериодРегистрации = &ПериодРегистрации
	   |";
	Запрос.Выполнить();   

	
	Запрос.Текст =
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	СтрокиРасчета.ФизическоеЛицо,
	   |	СтрокиРасчета.ВидЕСВ,
	   |	СтрокиРасчета.НалоговыйПериод,
	   |	СтрокиРасчета.ДатаНачала,
	   |	СтрокиРасчета.ДатаОкончания,
	   |	СтрокиРасчета.КатегорияЕСВ,
	   |	ЕСТЬNULL(ТаблицаБаза.База, 0) КАК База,
	   |	0 КАК БазаВзноса,
	   |	ЕСТЬNULL(ТаблицаБаза.БазаОтпускные, 0) КАК БазаОтпускные,
	   |	ЕСТЬNULL(ТаблицаЕСВПоСотрудникамДо.БазаДо, 0) КАК БазаДо,
	   |	ЕСТЬNULL(ТаблицаЕСВПоСотрудникамДо.БазаВзносаДо, 0) КАК БазаВзносаДо,
	   |	0 КАК Результат,
	   |	0 КАК РезультатПолная,
	   |	ЕСТЬNULL(ТаблицаБазаВычет.БазаВычет, 0) КАК БазаВычет,
	   |	ПараметрыКатегорийЕСВ.ЕСВ КАК Налог,
	   |	ЕСТЬNULL(ШкалаСтавокНалоговПоОрганизации.СтатьяНалоговойДекларации,ШкалаСтавокНалогов.СтатьяНалоговойДекларации) КАК СтатьяНалоговойДекларации,
	   |	ЕСТЬNULL(ШкалаСтавокНалоговПоОрганизации.Ставка, ЕСТЬNULL(ШкалаСтавокНалогов.Ставка, 0)) КАК Ставка,
	   |	ЕСТЬNULL(ШкалаСтавокНалоговПоОрганизации.СтавкаПолная, ЕСТЬNULL(ШкалаСтавокНалогов.СтавкаПолная, 0)) КАК СтавкаПолная,
	   |	ЕСТЬNULL(ПределыСтраховыхВзносов.Предел,0) КАК Предел
	   |ИЗ
	   |	ВТСтрокиРасчетаВзносы КАК СтрокиРасчета
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТБаза КАК ТаблицаБаза
	   |    ПО ТаблицаБаза.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И ТаблицаБаза.ВидЕСВ = СтрокиРасчета.ВидЕСВ
	   |     И ТаблицаБаза.НалоговыйПериод = СтрокиРасчета.НалоговыйПериод
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТЕСВПоСотрудникамОборот КАК ТаблицаЕСВПоСотрудникамДо
	   |    ПО ТаблицаЕСВПоСотрудникамДо.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И ТаблицаЕСВПоСотрудникамДо.ВидЕСВ = СтрокиРасчета.ВидЕСВ
	   |     И ТаблицаЕСВПоСотрудникамДо.НалоговыйПериод = СтрокиРасчета.НалоговыйПериод
	   |     И ТаблицаЕСВПоСотрудникамДо.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаВзносов.Взносы)
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.ПараметрыКатегорийЕСВ.СрезПоследних(&ПериодРегистрации) КАК ПараметрыКатегорийЕСВ
	   |    ПО СтрокиРасчета.ВидЕСВ = ПараметрыКатегорийЕСВ.Вид
	   |     И СтрокиРасчета.КатегорияЕСВ = ПараметрыКатегорийЕСВ.Категория
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    ВТБазаВычет КАК ТаблицаБазаВычет
	   |    ПО ТаблицаБаза.ФизическоеЛицо = ТаблицаБазаВычет.ФизическоеЛицо
	   |     И ТаблицаБаза.НалоговыйПериод = ТаблицаБазаВычет.НалоговыйПериод
	   |     И ТаблицаБаза.ВидЕСВ = ТаблицаБазаВычет.ВидЕСВ
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.ШкалаСтавокНалогов.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),Организация = &Организация И НомерПорога = ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.Порог1)) КАК ШкалаСтавокНалоговПоОрганизации
	   |    ПО ШкалаСтавокНалоговПоОрганизации.Налог = ПараметрыКатегорийЕСВ.ЕСВ
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.ШкалаСтавокНалогов.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И НомерПорога = ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.Порог1)) КАК ШкалаСтавокНалогов
	   |    ПО ШкалаСтавокНалогов.Налог = ПараметрыКатегорийЕСВ.ЕСВ
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    ВТПределыСтраховыхВзносовСрез КАК ПределыСтраховыхВзносов
	   |    ПО СтрокиРасчета.ВидЕСВ = ПределыСтраховыхВзносов.ВидЕСВ 
	   |     И СтрокиРасчета.НалоговыйПериод = ПределыСтраховыхВзносов.НалоговыйПериод
	   |ГДЕ НЕ (ПараметрыКатегорийЕСВ.ЕСВ ЕСТЬ NULL)
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	СтрокиРасчета.ФизическоеЛицо,
	   |	СтрокиРасчета.ВидЕСВ,
	   |	СтрокиРасчета.НалоговыйПериод,
	   |	СтрокиРасчета.ДатаНачала,
	   |	СтрокиРасчета.ДатаОкончания,
	   |	СтрокиРасчета.КатегорияЕСВ,
	   |	ЕСТЬNULL(ТаблицаБаза.База, 0) КАК База,
	   |	0 КАК БазаВзноса,
	   |	ЕСТЬNULL(ТаблицаБаза.БазаОтпускные, 0) КАК БазаОтпускные,
	   |	0 КАК БазаДоначисление,
	   |	ЕСТЬNULL(ТаблицаЕСВПоСотрудникамДо.БазаДо, 0) КАК БазаДо,
	   |	ЕСТЬNULL(ТаблицаЕСВПоСотрудникамДо.БазаВзносаДо, 0) КАК БазаВзносаДо,
	   |	0 КАК Результат,
	   |	0 КАК РезультатДоначисление,
	   |	0 КАК РезультатПолная,
	   |	ЕСТЬNULL(ТаблицаБазаВычет.БазаВычет, 0) КАК БазаВычет,
	   |	ЕСТЬNULL(ТаблицаБазаПолная.БазаПолная, 0) КАК БазаПолная,
	   |	ЕСТЬNULL(ТаблицаБазаДекретные.База, 0) КАК БазаДекретные,
	   |	ЕСТЬNULL(ТаблицаБазаБольничные.База, 0) КАК БазаБольничные,
	   |	ПараметрыКатегорийЕСВ.ЕСВФОТ КАК Налог,
	   |	ЕСТЬNULL(ШкалаСтавокНалоговПоОрганизации.СтатьяНалоговойДекларации,ШкалаСтавокНалогов.СтатьяНалоговойДекларации) КАК СтатьяНалоговойДекларации,
	   |	ЕСТЬNULL(ШкалаСтавокНалоговПоОрганизации.Ставка, ЕСТЬNULL(ШкалаСтавокНалогов.Ставка, 0)) КАК Ставка,
	   |	ЕСТЬNULL(ШкалаСтавокНалоговПоОрганизации.СтавкаПолная, ЕСТЬNULL(ШкалаСтавокНалогов.СтавкаПолная, 0)) КАК СтавкаПолная,
	   |    ВЫБОР
	   |		КОГДА ЕСТЬNULL(СпециальныеРежимыЗарплатаКадры.РезидентДияСити, ЛОЖЬ) И ЕСТЬNULL(ПределыСтраховыхВзносов.ПределДия,0)>0 
	   |			ТОГДА ЕСТЬNULL(ПределыСтраховыхВзносов.ПределДия,0)
	   |			ИНАЧЕ ЕСТЬNULL(ПределыСтраховыхВзносов.Предел,0)
	   |	КОНЕЦ КАК Предел,
	   |	ВЫБОР
	   |		КОГДА &НеПрименяетсяМинимальнаяБаза
	   |		 ТОГДА 0
	   |		КОГДА НЕ &ОкончательныйРасчет
	   |		 ТОГДА 0
	   |		КОГДА ПараметрыКатегорийЕСВ.ЕСВФОТ  В (&МассивНалогиБезМинимальнойБазы)
	   |		 ТОГДА 0
       |	 	КОГДА НАЧАЛОПЕРИОДА(СтрокиРасчета.НалоговыйПериод, МЕСЯЦ) > &ПериодРегистрации
	   |	  	 ТОГДА 0
	   |		КОГДА НЕ (ОжидаемыеБольничные.ФизическоеЛицо ЕСТЬ NULL)
	   |		 ТОГДА 0
	   |		КОГДА ЕСТЬNULL(СпециальныеРежимыЗарплатаКадры.РезидентДияСити, ЛОЖЬ) И ЕСТЬNULL(ПределыСтраховыхВзносов.ПределДия,0)>0 
	   |			ТОГДА ЕСТЬNULL(ПределыСтраховыхВзносов.ПределДия,0)
	   |		КОГДА (НЕ ТаблицаОсновныеМестаРаботы.ОсновноеМестоРаботы И НЕ ТаблицаОсновныеМестаРаботы.ГигКонтракт) ИЛИ ТаблицаОсновныеМестаРаботы.РаботаСНефиксированнымРабочимВременем
	   |		 ТОГДА 0
	   |		КОГДА ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо ЕСТЬ NULL
	   |		 ТОГДА 0
	   |		ИНАЧЕ ЕСТЬNULL(ПределыСтраховыхВзносов.МинимальнаяБаза,0) 
	   |	КОНЕЦ КАК МинимальнаяБаза,
	   |	ВЫБОР
	   |		КОГДА &НеПрименяетсяКоэффициентСтавки
	   |		 ТОГДА 0
	   |		КОГДА НЕ &ОкончательныйРасчет
	   |		 ТОГДА 0
	   |		КОГДА ПараметрыКатегорийЕСВ.ЕСВФОТ  В (&МассивНалогиБезКоэффициента)
	   |		 ТОГДА 0
	   |		КОГДА &Применяется1863
	   |		 ТОГДА ЕСТЬNULL(КоэффициентыСтавкиВзносовФОТ.КоэффициентСтавки,1)
	   |		КОГДА НЕ ТаблицаОсновныеМестаРаботы.ОсновноеМестоРаботы
	   |		 ТОГДА 0
	   |		КОГДА СтрокиРасчета.ВидЕСВ <> ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)И СтрокиРасчета.ВидЕСВ <> ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ПоДоговорамГПХ)
	   |		 ТОГДА 0
	   |		ИНАЧЕ ЕСТЬNULL(КоэффициентыСтавкиВзносовФОТ.КоэффициентСтавки,1) 
	   |	КОНЕЦ КАК КоэффициентСтавки,
	   |	0 КАК ТипНачисления
	   |ИЗ
	   |	ВТСтрокиРасчетаВзносыФОТ КАК СтрокиРасчета
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.СпециальныеРежимыЗарплатаКадры.СрезПоследних(&КонецМесяца) КАК СпециальныеРежимыЗарплатаКадры
	   |    ПО СпециальныеРежимыЗарплатаКадры.Организация = &Организация
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТОсновныеМестаРаботы КАК ТаблицаОсновныеМестаРаботы
	   |    ПО ТаблицаОсновныеМестаРаботы.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И ТаблицаОсновныеМестаРаботы.ПериодУчета = СтрокиРасчета.ПериодУчета
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	   |    ПО ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И ТекущиеКадровыеДанныеСотрудников.НалоговыйПериод = СтрокиРасчета.НалоговыйПериод
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТБаза КАК ТаблицаБаза
	   |    ПО ТаблицаБаза.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И ТаблицаБаза.ВидЕСВ = СтрокиРасчета.ВидЕСВ
	   |     И ТаблицаБаза.НалоговыйПериод = СтрокиРасчета.НалоговыйПериод
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТБаза КАК ТаблицаБазаДекретные
	   |    ПО ТаблицаБазаДекретные.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)
	   |     И ТаблицаБазаДекретные.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.Декретные)
	   |     И ТаблицаБазаДекретные.НалоговыйПериод = СтрокиРасчета.НалоговыйПериод
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТБаза КАК ТаблицаБазаБольничные
	   |    ПО ТаблицаБазаБольничные.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)
	   |     И ТаблицаБазаБольничные.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.Больничные)
	   |     И ТаблицаБазаБольничные.НалоговыйПериод = СтрокиРасчета.НалоговыйПериод
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТЕСВПоСотрудникамОборот КАК ТаблицаЕСВПоСотрудникамДо
	   |    ПО ТаблицаЕСВПоСотрудникамДо.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И ТаблицаЕСВПоСотрудникамДо.ВидЕСВ = СтрокиРасчета.ВидЕСВ
	   |     И ТаблицаЕСВПоСотрудникамДо.НалоговыйПериод = СтрокиРасчета.НалоговыйПериод
	   |     И ТаблицаЕСВПоСотрудникамДо.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаВзносов.ВзносыФОТ)
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.ПараметрыКатегорийЕСВ.СрезПоследних(&ПериодРегистрации) КАК ПараметрыКатегорийЕСВ
	   |    ПО СтрокиРасчета.ВидЕСВ = ПараметрыКатегорийЕСВ.Вид
	   |     И СтрокиРасчета.КатегорияЕСВ = ПараметрыКатегорийЕСВ.Категория
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    ВТБазаВычет КАК ТаблицаБазаВычет
	   |    ПО ТаблицаБаза.ФизическоеЛицо = ТаблицаБазаВычет.ФизическоеЛицо
	   |     И ТаблицаБаза.НалоговыйПериод = ТаблицаБазаВычет.НалоговыйПериод
	   |     И ТаблицаБаза.ВидЕСВ = ТаблицаБазаВычет.ВидЕСВ
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    ВТБазаПолная КАК ТаблицаБазаПолная
	   |    ПО ТаблицаБаза.ФизическоеЛицо = ТаблицаБазаПолная.ФизическоеЛицо
	   |     И ТаблицаБаза.НалоговыйПериод = ТаблицаБазаПолная.НалоговыйПериод
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.ШкалаСтавокНалогов.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),Организация = &Организация И НомерПорога = ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.Порог1)) КАК ШкалаСтавокНалоговПоОрганизации
	   |    ПО ШкалаСтавокНалоговПоОрганизации.Налог = ПараметрыКатегорийЕСВ.ЕСВФОТ
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.ШкалаСтавокНалогов.СрезПоследних(КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ),Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) И НомерПорога = ЗНАЧЕНИЕ(Перечисление.ПорогиШкалыСтавокНалогов.Порог1)) КАК ШкалаСтавокНалогов
	   |    ПО ШкалаСтавокНалогов.Налог = ПараметрыКатегорийЕСВ.ЕСВФОТ
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    ВТПределыСтраховыхВзносовСрез КАК ПределыСтраховыхВзносов
	   |    ПО СтрокиРасчета.ВидЕСВ = ПределыСтраховыхВзносов.ВидЕСВ 
	   |     И СтрокиРасчета.НалоговыйПериод = ПределыСтраховыхВзносов.НалоговыйПериод
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |    РегистрСведений.КоэффициентыСтавкиВзносовФОТ КАК КоэффициентыСтавкиВзносовФОТ
	   |    ПО КоэффициентыСтавкиВзносовФОТ.Организация = &Организация
	   |     И КоэффициентыСтавкиВзносовФОТ.МесяцНачисления = &ПериодРегистрации
	   |     И (СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ОсновнаяЗарплата)
	   |        ИЛИ СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.ПоДоговорамГПХ)
	   |        ИЛИ СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.Больничные)
	   |        ИЛИ СтрокиРасчета.ВидЕСВ = ЗНАЧЕНИЕ(Перечисление.ВидыЕСВ.Декретные))
	   |    ЛЕВОЕ СОЕДИНЕНИЕ
	   |	ВТОжидаемыеБольничные КАК ОжидаемыеБольничные
	   |    ПО ОжидаемыеБольничные.ФизическоеЛицо = СтрокиРасчета.ФизическоеЛицо
	   |     И ОжидаемыеБольничные.НалоговыйПериод = СтрокиРасчета.НалоговыйПериод
	   |ГДЕ НЕ (ПараметрыКатегорийЕСВ.ЕСВФОТ ЕСТЬ NULL)
	   |
	   |УПОРЯДОЧИТЬ ПО
	   |	СтрокиРасчета.ФизическоеЛицо,
	   |	СтрокиРасчета.ВидЕСВ,
	   |	СтрокиРасчета.ДатаНачала
	   |
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТНачисленияОбороты
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТСтрокиРасчета
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТСтрокиРасчетаВзносы
	   |;
	   |
	   //|////////////////////////////////////////////////////////////////////////////////
	   //|УНИЧТОЖИТЬ ВТСтрокиРасчетаВзносыФОТ
	   //|;
	   //|
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТЕСВПоСотрудникамОборот
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТБазаСФильтром
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТБаза
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТБазаВычет
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТБазаПолная
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |УНИЧТОЖИТЬ ВТТекущиеКадровыеДанныеСотрудников
       |";
	   
	РезультатПакета = Запрос.ВыполнитьПакет();   
	   
	СтрокиКРасчету.Взносы = РезультатПакета[0].Выгрузить();
	СтрокиКРасчету.ВзносыФОТ = РезультатПакета[1].Выгрузить();
	
	Для Каждого СтрокаВзносов из СтрокиКРасчету.Взносы Цикл
		
		Коэф = 1; 
		
		Предел = СтрокаВзносов.Предел;
		Ставка = СтрокаВзносов.Ставка;

		БазаДо = СтрокаВзносов.БазаДо;
		БазаВзносаДо = СтрокаВзносов.БазаВзносаДо;

		База = СтрокаВзносов.База;
		БазаВычет = СтрокаВзносов.БазаВычет;
		
		БазаВзноса = Мин(Макс(Предел-БазаВычет,0), База);
		
		База = (База - БазаДо) * Коэф;
		БазаВзноса = (БазаВзноса - БазаВзносаДо) * Коэф;
	
		Результат  = БазаВзноса * Ставка;
		Результат = Окр(Результат,2);
		
		СтрокаВзносов.База = База;
		СтрокаВзносов.БазаВзноса = БазаВзноса;
		СтрокаВзносов.Результат = Результат;
		
	КонецЦикла;
	

	//Проверить и разбить базу для дублей взносов, например при смене инвалидности в середине месяца
	Если ФизЛицаСДублями.Количество() > 0 Тогда
	
		Запрос.УстановитьПараметр("ФизЛицаСДублями", ФизЛицаСДублями);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Сотрудник,
		|   НАЧАЛОПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) КАК ДатаНачала,
		|   КОНЕЦПЕРИОДА(&ПериодРегистрации, МЕСЯЦ) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТСотрудникиДляВремени
		|ИЗ
		|   ВТОсновныеМестаРаботы КАК Сотрудники
		|ГДЕ
		|   Сотрудники.ФизическоеЛицо В (&ФизЛицаСДублями)
		|   И Сотрудники.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
		|";
		Запрос.Выполнить();	
		
		ПараметрыЗаполнения = УчетРабочегоВремени.ПараметрыДляЗапросВТДанныеУчетаВремениИСостоянийСотрудников();
		
		ПараметрыЗаполнения.ИмяВТСотрудники = "ВТСотрудникиДляВремени";
		ПараметрыЗаполнения.ИмяВТРезультат = "ВТДанныеУчетаВремениИСостоянийСотрудников";
		ПараметрыЗаполнения.РассчитыватьПлановоеВремя = Ложь;
		ПараметрыЗаполнения.Организация  = Организация;
		ПараметрыЗаполнения.ДатаАктуальности  = КонецМесяца(ПериодРегистрации);
		ПараметрыЗаполнения.ДатаНачала = НачалоМесяца(ПериодРегистрации);
		ПараметрыЗаполнения.ДатаОкончания = КонецМесяца(ПериодРегистрации);
			
		ПараметрыЗаполнения.МесяцДатаНачала = НачалоМесяца(ПериодРегистрации);
		ПараметрыЗаполнения.МесяцДатаОкончания = КонецМесяца(ПериодРегистрации);
			
		ПараметрыЗаполнения.ПолучатьУжеРассчитанныеДанные = Ложь;
		ПараметрыЗаполнения.ПолучатьУсловияТрудаИТерритории = Ложь;
			
		УчетРабочегоВремени.СоздатьВТДанныеУчетаВремениИСостоянийСотрудников(Запрос.МенеджерВременныхТаблиц, Истина, ПараметрыЗаполнения);
		
		ВидыВремениРабота = Новый Массив();
		ВидыВремениРабота.Добавить(Справочники.ВидыИспользованияРабочегоВремени.Явка);
		Запрос.УстановитьПараметр("ВидыВремениРабота", ВидыВремениРабота);

		ВидыВремениБолезнь = Новый Массив();
		ВидыВремениБолезнь.Добавить(Справочники.ВидыИспользованияРабочегоВремени.Болезнь);
        Запрос.УстановитьПараметр("ВидыВремениБолезнь", ВидыВремениБолезнь);
		
		ВидыВремениОтпуск = Новый Массив();
		ВидыВремениОтпуск.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ДополнительныйОтпуск);
		ВидыВремениОтпуск.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ОсновнойОтпуск);
		ВидыВремениОтпуск.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ОтпускНаДетей);
		ВидыВремениОтпуск.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ОтпускНаОбучение);
		ВидыВремениОтпуск.Добавить(Справочники.ВидыИспользованияРабочегоВремени.ЧернобыльскийОтпуск);
        Запрос.УстановитьПараметр("ВидыВремениОтпуск", ВидыВремениОтпуск);
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеУчетаВремениПоСостояниям.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
		|   ДанныеУчетаВремениПоСостояниям.Дата КАК Дата,
		|	ДанныеУчетаВремениПоСостояниям.Дни КАК Дни,
		|	ДанныеУчетаВремениПоСостояниям.ВидУчетаВремени КАК ВидУчетаВремени
		|ПОМЕСТИТЬ ВТДанныеУчетаВремениПоСостояниямСводно
		|ИЗ
		|  	ВТДанныеУчетаВремениПоСостояниям КАК ДанныеУчетаВремениПоСостояниям
		|ГДЕ
		|   ДанныеУчетаВремениПоСостояниям.Дни > 0
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.ДатаНачала,
		|	СтрокиРасчета.ДатаОкончания
		|ПОМЕСТИТЬ ВТСтрокиРасчетаДляВремени
		|ИЗ
		|   ВТСтрокиРасчетаВзносыФОТ КАК СтрокиРасчета
        |ГДЕ
		|   СтрокиРасчета.ФизическоеЛицо В (&ФизЛицаСДублями)
		|;
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.ДатаНачала,
		|	СтрокиРасчета.ДатаОкончания,
		|   СУММА(ВЫБОР КОГДА ДанныеУчетаВремени.ВидУчетаВремени В (&ВидыВремениРабота) ИЛИ ДанныеУчетаВремени.ВидУчетаВремени В (&ВидыВремениОтпуск) ТОГДА ДанныеУчетаВремени.Дни ИНАЧЕ 0 КОНЕЦ) КАК ДниРабота,
		|   СУММА(ВЫБОР КОГДА ДанныеУчетаВремени.ВидУчетаВремени В (&ВидыВремениБолезнь) ТОГДА ДанныеУчетаВремени.Дни ИНАЧЕ 0 КОНЕЦ) КАК ДниБолезнь,
		|   СУММА(ВЫБОР КОГДА ДанныеУчетаВремени.ВидУчетаВремени В (&ВидыВремениОтпуск) ТОГДА ДанныеУчетаВремени.Дни ИНАЧЕ 0 КОНЕЦ) КАК ДниОтпуск
		|ИЗ
		|   ВТСтрокиРасчетаДляВремени КАК СтрокиРасчета
		|   ВНУТРЕННЕЕ СОЕДИНЕНИЕ
		|   ВТДанныеУчетаВремениПоСостояниямСводно КАК ДанныеУчетаВремени
		|   ПО СтрокиРасчета.ФизическоеЛицо = ДанныеУчетаВремени.ФизическоеЛицо
		|    И СтрокиРасчета.ДатаНачала <= ДанныеУчетаВремени.Дата
		|    И СтрокиРасчета.ДатаОкончания >= ДанныеУчетаВремени.Дата
		|СГРУППИРОВАТЬ ПО
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.ДатаНачала,
		|	СтрокиРасчета.ДатаОкончания
		|УПОРЯДОЧИТЬ ПО
		|	СтрокиРасчета.ФизическоеЛицо,
		|	СтрокиРасчета.ДатаНачала
		|
		|";
		ТаблицаВремени = Запрос.Выполнить().Выгрузить();
		
		
	КонецЕсли;

	Для Каждого ФизическоеЛицо из ФизЛицаСДублями Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("ФизическоеЛицо",ФизическоеЛицо);
		Отбор.Вставить("НалоговыйПериод",ПериодРегистрации);
		Отбор.Вставить("ВидЕСВ",Перечисления.ВидыЕСВ.ОсновнаяЗарплата);
		
		СтрокиВзносов = СтрокиКРасчету.ВзносыФОТ.НайтиСтроки(Отбор);
		Если СтрокиВзносов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("ФизическоеЛицо",ФизическоеЛицо);
		СтрокиВремени = ТаблицаВремени.НайтиСтроки(Отбор);
		Если СтрокиВремени.Количество() <> СтрокиВзносов.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		//Основная зарплата
		БазаКРаспределению = СтрокиВзносов[0].База;
		Коэффициенты = Новый Массив();
		Для Каждого СтрокаВремени Из СтрокиВремени Цикл
			Коэффициенты.Добавить(СтрокаВремени.ДниРабота); 
		КонецЦикла;	
		
		Результат = ЗарплатаКадры.РаспределитьСуммуПропорциональноКоэффициентам(БазаКРаспределению, Коэффициенты);
		
		Если Результат <> Неопределено Тогда
			Индекс = 0;
			Сумма = 0;
			Пока Индекс < СтрокиВзносов.Количество() Цикл
				СтрокиВзносов[Индекс].База = Результат[Индекс];
				СтрокиВзносов[Индекс].МинимальнаяБаза = 0;
				СтрокиВзносов[Индекс].БазаВычет = СтрокиВзносов[Индекс].БазаВычет + Сумма;
				
				Сумма = Сумма + СтрокиВзносов[Индекс].База; 
				Индекс = Индекс + 1;
				
			КонецЦикла;
		КонецЕсли;	
		
		//в т.ч. отпускные
		БазаКРаспределению = СтрокиВзносов[0].БазаОтпускные;
		Если БазаКРаспределению > 0 Тогда
			Коэффициенты = Новый Массив();
			Для Каждого СтрокаВремени Из СтрокиВремени Цикл
				Коэффициенты.Добавить(СтрокаВремени.ДниОтпуск); 
			КонецЦикла;	
			
			Результат = ЗарплатаКадры.РаспределитьСуммуПропорциональноКоэффициентам(БазаКРаспределению, Коэффициенты);
			
			Индекс = 0;
			Сумма = 0;
			Пока Индекс < СтрокиВзносов.Количество() Цикл
				СтрокиВзносов[Индекс].БазаОтпускные = Результат[Индекс];
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЕсли;	
		
		Отбор = Новый Структура();
		Отбор.Вставить("ФизическоеЛицо",ФизическоеЛицо);
		Отбор.Вставить("НалоговыйПериод",ПериодРегистрации);
		Отбор.Вставить("ВидЕСВ",Перечисления.ВидыЕСВ.Больничные);
		
		СтрокиВзносов = СтрокиКРасчету.ВзносыФОТ.НайтиСтроки(Отбор);
		Если СтрокиВзносов.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		//Больничные
		БазаКРаспределению = СтрокиВзносов[0].База;
		Коэффициенты = Новый Массив();
		Для Каждого СтрокаВремени Из СтрокиВремени Цикл
			Коэффициенты.Добавить(СтрокаВремени.ДниБолезнь); 
		КонецЦикла;	
		
		Результат = ЗарплатаКадры.РаспределитьСуммуПропорциональноКоэффициентам(БазаКРаспределению, Коэффициенты);
		
		Если Результат <> Неопределено Тогда
			Индекс = 0;
			Сумма = 0;
			Пока Индекс < СтрокиВзносов.Количество() Цикл
				СтрокиВзносов[Индекс].База = Результат[Индекс];
				СтрокиВзносов[Индекс].МинимальнаяБаза = 0;
				СтрокиВзносов[Индекс].БазаВычет = СтрокиВзносов[Индекс].БазаВычет + Сумма;
				
				Сумма = Сумма + СтрокиВзносов[Индекс].База; 
				Индекс = Индекс + 1;
				
			КонецЦикла;
		КонецЕсли;	
		
	КонецЦикла;	
	
	
	Для Каждого СтрокаВзносовФОТ из СтрокиКРасчету.ВзносыФОТ Цикл
		
		Коэф = 1; 
		
		Предел = СтрокаВзносовФОТ.Предел;
		Ставка = СтрокаВзносовФОТ.Ставка;
	    СтавкаПолная = СтрокаВзносовФОТ.СтавкаПолная;
		МинимальнаяБаза = СтрокаВзносовФОТ.МинимальнаяБаза;
		КоэффициентСтавки = СтрокаВзносовФОТ.КоэффициентСтавки;
		
		БазаДо = СтрокаВзносовФОТ.БазаДо;
		БазаВзносаДо = СтрокаВзносовФОТ.БазаВзносаДо;
		
		База = СтрокаВзносовФОТ.База;
		БазаВычет = СтрокаВзносовФОТ.БазаВычет;
		БазаПолная = СтрокаВзносовФОТ.БазаПолная;
		
		БазаВзноса = Мин(Макс(Предел-БазаВычет,0), База);
		
		БазаДоначисление = 0;
		РезультатДоначисление = 0;
		РезультатПолная = 0;

		Если База <= БазаДо И СтрокаВзносовФОТ.БазаОтпускные <> 0 Тогда
			СтрокаВзносовФОТ.БазаОтпускные = 0;
		КонецЕсли;	
		
		Если МинимальнаяБаза <> 0 И База <> 0 И БазаВычет = 0 Тогда
			Если СтрокаВзносовФОТ.ВидЕСВ = Перечисления.ВидыЕСВ.Декретные ИЛИ СтрокаВзносовФОТ.ВидЕСВ = Перечисления.ВидыЕСВ.Больничные Тогда 
				//Декретные или больничные, здесь доначисление не делаем, а оставляем для основной зарплаты
			Иначе	
				БазаДоначисление = Макс(МинимальнаяБаза - БазаПолная,0);
				БазаВзноса = БазаВзноса + БазаДоначисление;
			КонецЕсли;	
		ИначеЕсли МинимальнаяБаза <> 0 И БазаДо <> 0 И БазаВзносаДо <> 0 И БазаВычет = 0 Тогда
			ДоначисленоРанее = Макс(БазаВзносаДо - БазаДо,0);
			БазаДоначисление = Макс(МинимальнаяБаза - БазаПолная,0) - ДоначисленоРанее;
			БазаВзноса = БазаДоначисление;
		ИначеЕсли МинимальнаяБаза <> 0 И БазаПолная <> 0 И (СтрокаВзносовФОТ.БазаДекретные <> 0 ИЛИ СтрокаВзносовФОТ.БазаБольничные <> 0) Тогда
			//Это основная зарплата = 0 и при этом наличие декретных или больничных 
			БазаДоначисление = Макс(МинимальнаяБаза - БазаПолная,0);
			БазаВзноса = БазаВзноса + БазаДоначисление;
		КонецЕсли;
		
		База = (База - БазаДо) * Коэф;
		БазаВзноса = (БазаВзноса - БазаВзносаДо) * Коэф;
		
		Если База = 0 И БазаВзноса = 0 И МинимальнаяБаза <> 0 И БазаДо <> 0 И БазаВзносаДо <> 0 И БазаВычет = 0 Тогда
			Если СтрокаВзносовФОТ.ВидЕСВ = Перечисления.ВидыЕСВ.Декретные ИЛИ СтрокаВзносовФОТ.ВидЕСВ = Перечисления.ВидыЕСВ.Больничные Тогда 
				//Декретные или больничные, здесь доначисление не делаем, а оставляем для основной зарплаты
			Иначе	
				ДоначисленоРанее = Макс(БазаВзносаДо - БазаДо,0);
				БазаДоначисление = Макс(МинимальнаяБаза - БазаПолная,0) - ДоначисленоРанее;
			КонецЕсли;
		ИначеЕсли База = 0 И БазаВзноса < 0 И МинимальнаяБаза <> 0 И БазаДо <> 0 И БазаВзносаДо <> 0 И БазаВычет = 0 И СтрокаВзносовФОТ.НалоговыйПериод < ПериодРегистрации Тогда
			//Сторнирование доначисление прошлого периода, например при больничных задним числом
			ДоначисленоРанее = Макс(БазаВзносаДо - БазаДо,0);
			БазаДоначисление = Макс(МинимальнаяБаза - БазаПолная,0) - ДоначисленоРанее;
		КонецЕсли;	
	
		Результат  = БазаВзноса * Ставка*?(КоэффициентСтавки = 0, 1, КоэффициентСтавки);
		РезультатДоначисление  = Окр(БазаДоначисление * Ставка * ?(КоэффициентСтавки = 0, 1, КоэффициентСтавки),2);
		
		Результат = Окр((БазаВзноса - БазаДоначисление) * Окр(Ставка * ?(КоэффициентСтавки = 0, 1, КоэффициентСтавки),5),2);
		РезультатДоначисление  = Окр(БазаДоначисление * Ставка,2);
		Результат = Результат + РезультатДоначисление;
		Если (СтавкаПолная > 0) И (СтавкаПолная <> Ставка) Тогда
			РезультатПолная = Окр(БазаВзноса * СтавкаПолная, 2);
		КонецЕсли;	
		СтрокаВзносовФОТ.База = База;
		СтрокаВзносовФОТ.БазаВзноса = БазаВзноса;
		СтрокаВзносовФОТ.Результат = Результат;
		
		СтрокаВзносовФОТ.БазаДоначисление = БазаДоначисление;
		СтрокаВзносовФОТ.РезультатДоначисление = РезультатДоначисление;
		СтрокаВзносовФОТ.РезультатПолная = РезультатПолная;
		
		Если СтрокаВзносовФОТ.ВидЕСВ = Перечисления.ВидыЕСВ.ПоДоговорамГПХ 
			И СтрокаВзносовФОТ.НалоговыйПериод < ПериодРегистрации Тогда
			//Доход ГПХ за несколько месяцев
			СтрокаВзносовФОТ.ТипНачисления = 1;
		КонецЕсли;
	КонецЦикла;
	
	
	
	Возврат СтрокиКРасчету;
	
КонецФункции

Функция СформироватьДоходыСтраховыхВзносов(Организация, ПериодРегистрации, Ссылка, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Организация", Организация);

	Запрос.Текст = 
	   "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	   |	СведенияОДоходахСтраховыеВзносы.Организация,
	   |	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо,
	   |	СведенияОДоходахСтраховыеВзносы.ВидЕСВ,
	   |	СведенияОДоходахСтраховыеВзносы.НалоговыйПериод,
	   |	СведенияОДоходахСтраховыеВзносы.Сотрудник,
	   |	СведенияОДоходахСтраховыеВзносы.Начисление,
	   |	СведенияОДоходахСтраховыеВзносы.Подразделение,
	   |	СведенияОДоходахСтраховыеВзносы.ДатаНачала КАК ДатаНачалаНачисление,
	   |	СведенияОДоходахСтраховыеВзносы.Сумма КАК СуммаДоход
	   |
	   |ИЗ
	   |	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК  СведенияОДоходахСтраховыеВзносы
	   |ГДЕ
	   |	НАЧАЛОПЕРИОДА(СведенияОДоходахСтраховыеВзносы.Период, МЕСЯЦ) = &ПериодРегистрации
	   |	И СведенияОДоходахСтраховыеВзносы.Организация = &Организация
	   |	И СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо В 
	   |					(ВЫБРАТЬ
	   |						СтрокиРасчета.ФизическоеЛицо
	   |					ИЗ
	   |						ВТФизическиеЛица КАК СтрокиРасчета)
	   |";

	Возврат Запрос.Выполнить().Выгрузить();   
	
КонецФункции	

// Формирует движения по регистру СтраховыеВзносыПоФизическимЛицам.
//	Менеджер временных таблиц содержит таблицу ВТФизическиеЛица с полями
//		ФизическоеЛицо.
//
// Параметры:
//		Движения - коллекция движений регистратора.
//		Отказ - признак отказа от заполнения движений.
//		Организация
//		ПериодРегистрации
//      Ссылка
//		ВзносыИсчисленные  - ТаблицаЗначений - с колонкой ФизическоеЛицо.
//
Процедура СформироватьСтраховыеВзносыПоФизическимЛицам(Движения, Отказ, Организация, ПериодРегистрации, Ссылка, ВзносыИсчисленные) Экспорт
	
	МассивФизическихЛиц = ОбщегоНазначения.ВыгрузитьКолонку(ВзносыИсчисленные, "ФизическоеЛицо", Истина);
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическиеЛица", МассивФизическихЛиц);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФизическиеЛица.Ссылка КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТФизическиеЛица
	|ИЗ
	|	Справочник.ФизическиеЛица КАК ФизическиеЛица
	|ГДЕ
	|	ФизическиеЛица.Ссылка В(&ФизическиеЛица)";
	Запрос.Выполнить();
	
	Доходы = СформироватьДоходыСтраховыхВзносов(Организация, ПериодРегистрации, Ссылка, МенеджерВременныхТаблиц);
	
	//Распределение таблицы взносов по таблице начислений
	ПоляРазрез = Новый Массив();
	ПоляРазрез.Добавить("Организация");
	ПоляРазрез.Добавить("Сотрудник");
	ПоляРазрез.Добавить("Подразделение");
	ПоляРазрез.Добавить("Начисление");
	ПоляРазрез.Добавить("ДатаНачалаНачисление");
	ПоляСвязи = Новый Структура();
	ПоляСвязи.Вставить("ФизическоеЛицо","ФизическоеЛицо");
	ПоляСвязи.Вставить("ВидЕСВ","ВидЕСВ");
	ПоляСвязи.Вставить("НалоговыйПериод","НалоговыйПериод");
	СтраховыеВзносыПоФизическимЛицам = ЗарплатаКадры.РаспределитьТаблицуПропорциональноТаблицеКоэффициентов(ВзносыИсчисленные, "Результат", Доходы, "СуммаДоход", ПоляРазрез, ПоляСвязи);

	ЗаписатьСтраховыеВзносыПоФизическимЛицам(Движения, Отказ, Организация, ПериодРегистрации, СтраховыеВзносыПоФизическимЛицам, Истина);
	
КонецПроцедуры




// Возвращает таблицу значений с данными по страховым взносам, прочитанную из данных документа.
//      	 
// Параметры:
//      ДокументСсылка - ДокументСсылка - документ, содержащий сведения о суммах взносов.
//      ОписаниеТаблицыВзносовВДокументе - строка - необязательный.
//		ЧитатьДопВзносы - булево - необязательный, если выставлен в Ложь, взносы по доп.тарифам из документа не читаются.
//      ФизическиеЛица - массив, СправочникСсылка.ФизическиеЛица - необязательный, содержит тех физических лиц, по
//                       которым надо прочесть данные документа.
//		ЧитатьВзносыСПревышения - булево - необязательный, если выставлен в Ложь, взносы с сумм превышения из документа не
//		                                   читаются.
//      ИмяПоляДатаПолученияДохода - строка - необязательный.
//      	 
// Возвращаемое значение:
//	таблица значений с колонками:
//		ФизическоеЛицо,
//		ДатаПолученияДохода,
//      	 
Функция ДанныеОВзносахИзДокумента(ДокументСсылка, ОписаниеТаблицыВзносовВДокументе = Неопределено, ЧитатьДопВзносы = Истина, ФизическиеЛица = Неопределено, ЧитатьВзносыСПревышения = Ложь, ИмяПоляДатаПолученияДохода = "ДатаПолученияДохода") Экспорт
	

	Запрос = Новый Запрос();
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Взносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Взносы.ВидЕСВ КАК ВидЕСВ,
	|	Взносы.КатегорияЕСВ КАК КатегорияЕСВ,
	|	НАЧАЛОПЕРИОДА(Взносы.ДатаНачала, МЕСЯЦ) КАК НалоговыйПериод,
	|	Взносы.ДатаНачала КАК ДатаНачала,
	|	Взносы.ДатаОкончания КАК ДатаОкончания,
	|	Взносы.Налог КАК Налог,
	|	Взносы.СтатьяНалоговойДекларации КАК СтатьяНалоговойДекларации,
	|	Взносы.База КАК База,
	|	Взносы.БазаВзноса КАК БазаВзноса,
	|	Взносы.БазаОтпускные КАК БазаОтпускные,
	|	Взносы.БазаДоначисление КАК БазаДоначисление,
	|	Взносы.Результат КАК Результат,
	|	Взносы.РезультатДоначисление КАК РезультатДоначисление,
	|	Взносы.РезультатПолная КАК РезультатПолная,
	|	Взносы.СтавкаПолная КАК СтавкаПолная,
	|	Взносы.Предел КАК Предел,
	|	Взносы.Ставка КАК Ставка,
	|	Взносы.МинимальнаяБаза КАК МинимальнаяБаза,
	|	Взносы.КоэффициентСтавки КАК КоэффициентСтавки,
	|	Взносы.БазаВычет КАК БазаВычет,
	|	Взносы.ТипНачисления КАК ТипНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаВзносов.Взносы) КАК СпособРасчета
	|ИЗ
	|	#ТаблицаВзносы КАК Взносы
	|ГДЕ
	|	Взносы.Ссылка = &Ссылка
	|	И &УсловиеОтбора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Взносы.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Взносы.ВидЕСВ КАК ВидЕСВ,
	|	Взносы.КатегорияЕСВ КАК КатегорияЕСВ,
	|	НАЧАЛОПЕРИОДА(Взносы.ДатаНачала, МЕСЯЦ) КАК НалоговыйПериод,
	|	Взносы.ДатаНачала КАК ДатаНачала,
	|	Взносы.ДатаОкончания КАК ДатаОкончания,
	|	Взносы.Налог КАК Налог,
	|	Взносы.СтатьяНалоговойДекларации КАК СтатьяНалоговойДекларации,
	|	Взносы.База КАК База,
	|	Взносы.БазаВзноса КАК БазаВзноса,
	|	Взносы.БазаОтпускные КАК БазаОтпускные,
	|	Взносы.БазаДоначисление КАК БазаДоначисление,
	|	Взносы.Результат КАК Результат,
	|	Взносы.РезультатДоначисление КАК РезультатДоначисление,
	|	Взносы.РезультатПолная КАК РезультатПолная,
	|	Взносы.СтавкаПолная КАК СтавкаПолная,
	|	Взносы.Предел КАК Предел,
	|	Взносы.Ставка КАК Ставка,
	|	Взносы.МинимальнаяБаза КАК МинимальнаяБаза,
	|	Взносы.КоэффициентСтавки КАК КоэффициентСтавки,
	|	Взносы.БазаВычет КАК БазаВычет,
	|	Взносы.ТипНачисления КАК ТипНачисления,
	|	ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаВзносов.ВзносыФОТ) КАК СпособРасчета
	|ИЗ
	|	#ТаблицаВзносыФОТ КАК Взносы
	|ГДЕ
	|	Взносы.Ссылка = &Ссылка
	|	И &УсловиеОтбора
	|";
	
	Если ОписаниеТаблицыВзносовВДокументе = Неопределено Тогда
		ПолноеИмяДокумента = ДокументСсылка.Метаданные().ПолноеИмя();
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТаблицаВзносыФОТ", ПолноеИмяДокумента + ".ВзносыФОТ");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТаблицаВзносы", ПолноеИмяДокумента + ".Взносы");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТаблицаВзносы", ОписаниеТаблицыВзносовВДокументе);
	КонецЕсли;
	Если ФизическиеЛица = Неопределено Тогда
		Запрос.УстановитьПараметр("УсловиеОтбора", Истина);
	Иначе
		Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтбора", "Взносы.ФизическоеЛицо В (&ФизическиеЛица)");
	КонецЕсли; 
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить()
	
КонецФункции

// Возвращает строку-перечень полей ресурсов страховых взносов.
//
// Параметры:
//	БезЕНВД - булево - необязательный, если Истина, в строку будут включены парные ЕНВДные поля.
//  ИмяТаблицы - строка - необязательный, если задан, строка результат может использоваться как часть текста запроса к
//                        таблице, содержащей соответствующие поля.
//	ВключатьДопТарифы - булево - необязательный, если Истина, в строку будут включены поля взносов по дополнительным
//	                             тарифам для вредников.
//
// Возвращаемое значение:
//	Строка.
// 
Функция РассчитываемыеВзносы(БезЕНВД = Ложь, ИмяТаблицы = "", ВключатьДопТарифы = Истина) Экспорт
	
	Возврат УчетСтраховыхВзносовКлиентСервер.РассчитываемыеВзносы(БезЕНВД, ИмяТаблицы, ВключатьДопТарифы)
	
КонецФункции 

// Возвращает строку-перечень полей ресурсов страховых взносов, по которым ведутся расчеты с фондами.
//
// Параметры:
//	БезЕНВД - булево - необязательный, если Истина, в строку будут включены парные ЕНВДные поля.
//  ИмяТаблицы - строка - необязательный, если задан, строка результат может использоваться как часть текста запроса к
//                        таблице, содержащей соответствующие поля.
//	ВключатьДопТарифы - булево - необязательный, если Истина, в строку будут включены поля взносов по дополнительным
//	                             тарифам для вредников.
//
// Возвращаемое значение:
//	Строка.
// 
Функция ОтражаемыеВУчетеВзносы(БезЕНВД = Ложь, ИмяТаблицы = "", ВключатьДопТарифы = Истина) Экспорт
	
	Возврат УчетСтраховыхВзносовКлиентСервер.ОтражаемыеВУчетеВзносы(БезЕНВД, ИмяТаблицы, ВключатьДопТарифы)
	
КонецФункции 



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Описывает источник данных для запроса по уплате страховых взносов.
//
// Возвращаемое значение
//	Структура с полями:
//		ИмяТаблицы - имя объекта метаданных в которой хранятся данные об уплате взносов.
//		ИспользоватьОсновнуюТаблицуДинамическогоСписка - определяет, используется ли таблица (ИмяТаблицы),
//														 в качестве основной таблицы динамического списка.
//		ИмяПоляДатаПлатежа - имя поля в таблице (ИмяТаблицы), в котором хранится дата платежа.
//		ИмяПоляВидПлатежа - имя поля в таблице (ИмяТаблицы), в котором хранится ВидОбязательногоСтрахованияСотрудников.
//		ИмяПоляСумма - имя поля в таблице (ИмяТаблицы), в котором хранится сумма платежа.
//		ИмяПоляОрганизация - имя поля в таблице (ИмяТаблицы), в котором хранится организация.
//		ИмяПоляПлатежЗарегистрирован - имя поля в таблице (ИмяТаблицы), в признак того что уплата взносов учтена в системе
//									   если не заполнено, то в тексте запроса будет значение ИСТИНА.
//		Отбор - массив содержащий структуры вида:
//			Поле - имя поля в таблице (имя таблицы).
//			ВидСравнения - строка вида "=", ">", "<" и т.п.
//			Значение - значение которое будет установлено в качестве параметра в запрос.
//		 На основании данного поля в запросе будет построена секция ГДЕ вида
//		 ИмяТаблицы.ИмяПоля = &Значение. 
//
Функция ОписаниеИсточникаДанныхУплатаВзносов() Экспорт 
	ОписаниеИсточникаДанных = Новый Структура();
	ОписаниеИсточникаДанных.Вставить("ИмяТаблицы", "РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам");
	ОписаниеИсточникаДанных.Вставить("ИспользоватьОсновнуюТаблицуДинамическогоСписка", Истина);
	ОписаниеИсточникаДанных.Вставить("ИмяПоляДатаПлатежа", "Период");
	ОписаниеИсточникаДанных.Вставить("ИмяПоляВидПлатежа", "ВидОбязательногоСтрахованияСотрудников");
	ОписаниеИсточникаДанных.Вставить("ИмяПоляСумма", "Сумма");
	ОписаниеИсточникаДанных.Вставить("ИмяПоляОрганизация", "Организация");
	ОписаниеИсточникаДанных.Вставить("ИмяПоляПлатежЗарегистрирован");

    Отбор = Новый Массив;
	ЭлементОтбора = Новый Структура("Поле, ВидСравнения, Значение", "ВидДвижения", "=", ВидДвиженияНакопления.Расход);
	Отбор.Добавить(ЭлементОтбора);
	
	Отбор = Новый Массив;
	ЭлементОтбора = Новый Структура("Поле, ВидСравнения, Значение", "ЭтоСтраховыеВзносы", "=", Истина);
	Отбор.Добавить(ЭлементОтбора);
	
	ОписаниеИсточникаДанных.Вставить("Отбор", Отбор);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.УчетСтраховыхВзносовВХО") Тогда
		ОписаниеИсточникаДанных.ИмяТаблицы = "Документ.УплатаСтраховыхВзносовВФонды";
		ОписаниеИсточникаДанных.ИспользоватьОсновнуюТаблицуДинамическогоСписка = Истина;
		ОписаниеИсточникаДанных.ИмяПоляДатаПлатежа = "Дата";
		ОписаниеИсточникаДанных.ИмяПоляВидПлатежа = "ВидПлатежа";
		ОписаниеИсточникаДанных.ИмяПоляСумма = "СуммаПлатежа";
		ОписаниеИсточникаДанных.ИмяПоляОрганизация = "Организация";
		ОписаниеИсточникаДанных.ИмяПоляПлатежЗарегистрирован = "Проведен";	
		ОписаниеИсточникаДанных.Отбор = Новый Массив;
	КонецЕсли;
	
	УчетСтраховыхВзносовПереопределяемый.ИзменитьОписаниеИсточникаДанныхУплатаВзносов(ОписаниеИсточникаДанных);
	
	Возврат ОписаниеИсточникаДанных;
КонецФункции	

// Вспомогательные функции процедур формирования движений.

// Параметры:
//		Движения - коллекция движений регистратора.
//		Организация - СправочникСсылка.Организации -
//		ПериодРегистрации - дата -
//		ВидСтрахования - ПеречислениеСсылка.ВидыОбязательногоСтрахованияСотрудников -
//		Сумма - число - 
//
//  Возвращает РегистрНакопленияЗапись.РасчетыСФондамиПоСтраховымВзносам или Неопределено.
//
Функция СтрокаНачисленияВзносов(Движения, Организация, ПериодРегистрации, СтрокаВзносов, ПоАктуПроверки = Ложь)

	Если Не ЗначениеЗаполнено(СтрокаВзносов.Сумма) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	НоваяСтрока = Движения.РасчетыСФондамиПоСтраховымВзносам.Добавить();
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
	НоваяСтрока.ПериодВзаиморасчетов = ПериодРегистрации;
	НоваяСтрока.ЭтоДоначислениеПоАктуПроверки = ПоАктуПроверки;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВзносов);
	
    Возврат НоваяСтрока
	
КонецФункции

// Параметры:
//		Движения - коллекция движений регистратора.
//		Организация - СправочникСсылка.Организации -
//		ПериодРегистрации - дата -
//		ПоАктуПроверки - булево -
//		ДанныеДокумента - Структура, строка выборки (и пр.) с полями, соответствующими полям рег-ра
//		                  СведенияОДоходахСтраховыеВзносы
//			ФизическоеЛицо
//          ВидДохода.
//          Сумма
//          Скидка - может отсутствовать.
//          Сотрудник - может отсутствовать.
//          Начисление - может отсутствовать
//          ...
//
//  Возвращает РегистрНакопленияЗапись.СведенияОДоходахСтраховыеВзносы
//
Функция СтрокаНачисленияДоходов(Движения, Организация, ПериодРегистрации, ПоАктуПроверки, ДанныеДокумента)
	
	НоваяСтрока = Движения.СведенияОДоходахСтраховыеВзносы.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеДокумента);
	НоваяСтрока.Организация = Организация;
	НоваяСтрока.ГоловнаяОрганизация = ЗарплатаКадрыПовтИсп.ГоловнаяОрганизация(Организация);
	Если Не ЗначениеЗаполнено(НоваяСтрока.Период) Тогда
		НоваяСтрока.Период = ПериодРегистрации;
	КонецЕсли;
	НоваяСтрока.ПоАктуПроверки = ПоАктуПроверки;
	НоваяСтрока.ДатаПолученияДохода = УчетСтраховыхВзносовКлиентСервер.ДатаПолученияДохода(?(ЗначениеЗаполнено(НоваяСтрока.ДатаПолученияДохода), НоваяСтрока.ДатаПолученияДохода, ПериодРегистрации));
	
    Возврат НоваяСтрока
	
КонецФункции

Функция СтрокаПеречисленияВзносов(Движения, Организация, ПериодРегистрации, СтрокаВзносов, ПоАктуПроверки = Ложь)

	Если Не ЗначениеЗаполнено(СтрокаВзносов.Сумма) Тогда
		Возврат Неопределено
	КонецЕсли;
	
	НоваяСтрока = Движения.РасчетыСФондамиПоСтраховымВзносам.Добавить();
	НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
	НоваяСтрока.ПериодВзаиморасчетов = ПериодРегистрации;
	НоваяСтрока.ЭтоДоначислениеПоАктуПроверки = ПоАктуПроверки;
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВзносов);
	
    Возврат НоваяСтрока
	
КонецФункции

// Формирование печатных форм.
// Специфические алгоритмы чтения данных.


// Помещает в переданный МенеджерВременныхТаблиц таблицу 
//	ВТКадровыхДанных, которая содержит следующие поля
//		Сотрудник - СправочникСсылка.Сотрудники
//		ДатаНачала - дата
//		Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//		Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//		Должность - СправочникСсылка.Должности
//		ЯвляетсяФармацевтом - булево.
//		ЯвляетсяРаботникомСДосрочнойПенсией - ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//		ЯвляетсяПрокурором - булево.
//		ЯвляетсяВоеннослужащим - булево.
//		РаботаетВСтуденческомОтряде - булево.
//		ЯвляетсяЧленомЛетногоЭкипажа - булево.
//		ЯвляетсяШахтером - булево
//		КоэффициентУчетаСтроки - число от 0 до 1.
//      	 
// Параметры:
//		Организация -
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит вр. таблицу ВТНачисления с полями
//				Сотрудник - СправочникСсылка.Сотрудники
//				ДатаНачала - дата -
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления -
//				Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//		УточнятьПериодКадровыхДанных - булево - если выставлен в Истина, период будет скорректирован с учетом дат приема и
//		                                        увольнения, для работающих постоянно - выставлен на конец месяца.
//
Процедура СформироватьВТКадровыхДанных(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, УточнятьПериодКадровыхДанных = Истина) Экспорт

	УчетСтраховыхВзносовВнутренний.СформироватьВТКадровыхДанных(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, УточнятьПериодКадровыхДанных)	
	
КонецПроцедуры

// Помещает в переданный МенеджерВременныхТаблиц таблицу 
//	ВТНачисленияСДаннымиУчета, которая содержит следующие поля:
//		Сотрудник - СправочникСсылка.Сотрудники
//		ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//		ДатаНачала - дата
//		ДатаПолученияДохода - дата.
//		Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//		ВидДохода - СправочникСсылка.ВидыДоходовПоСтраховымВзносам -
//		Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//		ЯвляетсяФармацевтом - булево.
//		ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией - ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//		КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//		ОблагаетсяВзносамиНаДоплатуЛетчикам - булево.
//		ОблагаетсяВзносамиНаДоплатуШахтерам - булево.
//		Сумма - число 
//		Скидка - число 
//      	 
// Параметры:
//		Организация -
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит 
//			вр. таблицу ВТНачисления с полями:
//				Сотрудник -
//				ДатаНачала - дата -
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления -
//				Подразделение - 
//				СуммаДохода - 
//				СуммаВычетаВзносы -
//      	        и, возможно, другими
//			вр. таблицу ВТСДаннымиУчета, с полями:
//				Сотрудник - СправочникСсылка.Сотрудники
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				ДатаНачала - дата
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//				ВидДохода - СправочникСсылка.ВидыДоходовПоСтраховымВзносам -
//				Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//				ЯвляетсяФармацевтом - булево.
//				ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией - ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//				КлассУсловийТруда - ПеречислениеСсылка.КлассыУсловийТрудаПоРезультатамСпециальнойОценки
//				ОблагаетсяВзносамиНаДоплатуЛетчикам - булево.
//				ОблагаетсяВзносамиНаДоплатуШахтерам - булево.
//				КоэффициентУчетаСтроки - число от 0 до 1.
//		ИсключаемыйРегистратор - ДокументСсылка -
//
Процедура СформироватьВТНачисленияСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ИсключаемыйРегистратор) Экспорт

	УчетСтраховыхВзносовВнутренний.СформироватьВТНачисленияСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ИсключаемыйРегистратор)	
	
КонецПроцедуры

// Помещает в переданный МенеджерВременныхТаблиц таблицу 
//	ВТСДаннымиУчета, которая содержит следующие поля
//		Сотрудник - СправочникСсылка.Сотрудники
//		ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//		ДатаНачала - дата
//		Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//		ВидЕСВ - ПеречислениеСсылка.ВидыЕСВ
//		Подразделение - СправочникСсылка.ПодразделенияОрганизаций
//		УсловияТруда - СправочникСсылка.УсловияТруда
//      	 
// Параметры:
//		Организация -
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит
//			вр. таблицу ВТНачисления с полями:
//				Сотрудник - СправочникСсылка.Сотрудники
//				ФизическоеЛицо - СправочникСсылка.ФизическиеЛица
//				ДатаНачала - дата
//				Начисление - ПеречислениеСсылка.ВидыОсобыхНачисленийИУдержаний, ПланВидовРасчетаСсылка.Начисления
//				ПодразделениеОрганизации - СправочникСсылка.ПодразделенияОрганизаций
//				УсловияТруда - СправочникСсылка.УсловияТруда
//
Процедура СформироватьВТСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц) Экспорт 

	УчетСтраховыхВзносовВнутренний.СформироватьВТСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц)	
	
КонецПроцедуры


// Формирует таблицу значений с данными для проведения по регистру СведенияОДоходахСтраховыеВзносы.
//      	 
// Параметры:
//		Организация -
//		ПериодРегистрации - дата -
//		МенеджерВременныхТаблиц - МенеджерВременныхТаблиц - содержит 
//			вр. таблицу ВТНачисления с полями
//				Сотрудник -
//				ДатаНачала - дата -
//				Начисление - ПланВидовРасчетаСсылка.Начисления -
//				Подразделение  
//				СуммаДохода 
//				СуммаВычетаВзносы
//      	        и, возможно, другими
//			вр. таблицу ВТНачисленияСДаннымиЕНВД с полями
//				Сотрудник -
//				ДатаНачала - дата -
//				Начисление - ПланВидовРасчетаСсылка.Начисления -
//				Подразделение  
//				ДоляЕНВД  
//		ИсключаемыйРегистратор - ДокументСсылка -
//
//  Возвращает значение типа ТаблицаЗначений.
//
Функция СведенияОДоходахСтраховыеВзносы(Организация, ПериодРегистрации, МенеджерВременныхТаблиц, ИсключаемыйРегистратор)
	

	СформироватьВТСДаннымиУчета(Организация, ПериодРегистрации, МенеджерВременныхТаблиц);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	| *
	|ИЗ ВТСДаннымиУчета";
	
	ДанныеУчета = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеУчета;

КонецФункции

Процедура ДобавитьОтборПриЧтенииПериодическихДанных(ПараметрыПостроения, ДатаАктуальности, ДляПервичнойОтчетностиПФР) Экспорт 
    
    Если ДляПервичнойОтчетностиПФР Тогда
        ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "НАЧАЛОПЕРИОДА(РегистрСведений.Период, КВАРТАЛ)", ">=", "НАЧАЛОПЕРИОДА(РегистрСведений.ДатаРегистрацииИзменений, КВАРТАЛ) ИЛИ РегистрСведений.ДатаРегистрацииИзменений <= КОНЕЦПЕРИОДА(ИзмеренияДаты.Период, КВАРТАЛ)", Ложь);
    Иначе
        ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПостроения.Отборы, "РегистрСведений.ДатаРегистрацииИзменений", "<=", "ДАТАВРЕМЯ(" + Формат(ДатаАктуальности,"ДФ=гггг") + ", " + Месяц(ДатаАктуальности) + ", " + День(ДатаАктуальности) + ", 23, 59, 59)", Ложь);
    КонецЕсли;

КонецПроцедуры	

#КонецОбласти

#Область БлокФункцийПервоначальногоЗаполненияИОбновленияИБ

// Перезаполняет наборы записей регистраторов исправленными данными и записывает их.
//
// Параметры: 
//  ИмяРегистра - строка - 
//  ТекстЗапроса - строка - текст исполняемого запроса, в котором обязательно присутствует 
//			поле Регистратор, остальные поля должны соответствовать 
//          полям записи заполняемого регистра, в результате должны 
//          присутствовать все заполняемые поля;
//			кроме того, результат запроса должен быть упорядочен, 
//			первое поле упорядочивания - Регистратор
//  ПараметрыЗапроса - Структура - необязательный, содержит имена и значения параметров,
//          которые требуются запросу
//
// Возвращаемое значение:
//  Нет
//
Процедура ОбработатьНаборыЗаписейРегистраНакопления(ИмяРегистра, ТекстЗапроса, ПараметрыЗапроса = Неопределено, МенеджерВременныхТаблиц = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Если МенеджерВременныхТаблиц <> Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц
	КонецЕсли;
	Запрос.Текст = ТекстЗапроса;
	Если ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Для каждого КлючИЗначение Из ПараметрыЗапроса Цикл
			Запрос.УстановитьПараметр(КлючИЗначение.Ключ, КлючИЗначение.Значение)
		КонецЦикла;
	КонецЕсли;
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
			НаборЗаписей = РегистрыНакопления[ИмяРегистра].СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.29";
	Обработчик.Процедура = "УчетСтраховыхВзносов.ИзменитьЗаписиМобРСПределыСтраховыхВзносов";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.31";
	Обработчик.Процедура = "УчетСтраховыхВзносов.ОбновитьСтраховыеВзносыДляДияСити";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.33";
	Обработчик.Процедура = "УчетСтраховыхВзносов.ОбновитьКатегорииЕСВ";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.0.38";
	Обработчик.Процедура = "УчетСтраховыхВзносов.ИсправитьАктыПроверкиСтраховыхВзносов";

	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.6.3";
	Обработчик.Процедура = "УчетСтраховыхВзносов.ОбновитьКатегорииЕСВ";
	
КонецПроцедуры

Процедура ОбновитьШкалуСтавок() Экспорт
	
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("РегистрСведений", "ШкалаСтавокНалогов");	
	
КонецПроцедуры

Процедура ИзменитьЗаписиМобРСПределыСтраховыхВзносов() Экспорт
	
	Набор = РегистрыСведений.ПределыСтраховыхВзносов.СоздатьМенеджерЗаписи();
	Набор.Период = Дата('20211201');
	Набор.ВидЕСВ = Перечисления.ВидыЕСВ.НачисленияМобилизованным;
	Набор.Прочитать();
	
	Если Набор.Выбран() Тогда
		Набор.МинимальнаяБаза = 6500;
		Набор.Записать();
	КонецЕсли;	
	
	Набор.Период = Дата('20221001');
	Набор.ВидЕСВ = Перечисления.ВидыЕСВ.НачисленияМобилизованным;
	Набор.Прочитать();
	
	Если Набор.Выбран() Тогда
		Набор.МинимальнаяБаза = 6700;
		Набор.Записать();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбновитьСтраховыеВзносыДляДияСити() Экспорт
	
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("Справочник", "КатегорииЗастрахованныхЛицЕСВ");
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("РегистрСведений", "ПределыСтраховыхВзносов");
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("РегистрСведений", "ПараметрыКатегорийЕСВ");
	
КонецПроцедуры

Процедура ОбновитьКатегорииЕСВ() Экспорт
	
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("Справочник", "КатегорииЗастрахованныхЛицЕСВ");
	Обработки.НачальноеЗаполнениеИОбновлениеОбъектов.ЗаполнитьОбъект("РегистрСведений", "ПараметрыКатегорийЕСВ");
	
КонецПроцедуры

Процедура ИсправитьАктыПроверкиСтраховыхВзносов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АктПроверкиСтраховыхВзносовУдалитьВзносы.Ссылка КАК Ссылка,
	|	1 КАК ТЧ
	|ИЗ
	|	Документ.АктПроверкиСтраховыхВзносов.УдалитьВзносы КАК АктПроверкиСтраховыхВзносовУдалитьВзносы
	|ГДЕ
	|	АктПроверкиСтраховыхВзносовУдалитьВзносы.НомерСтроки = 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктПроверкиСтраховыхВзносовУдалитьВзносыФОТ.Ссылка,
	|	2
	|ИЗ
	|	Документ.АктПроверкиСтраховыхВзносов.УдалитьВзносыФОТ КАК АктПроверкиСтраховыхВзносовУдалитьВзносыФОТ
	|ГДЕ
	|	АктПроверкиСтраховыхВзносовУдалитьВзносыФОТ.НомерСтроки = 1
	|ИТОГИ ПО
	|	Ссылка";
	
	ВыборкаСсылка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСсылка.Следующий() Цикл
		
		ДокументОбъект = ВыборкаСсылка.Ссылка.ПолучитьОбъект();
		
		ВыборкаТЧ = ВыборкаСсылка.Выбрать();
		Пока ВыборкаТЧ.Следующий() Цикл 
			
			ИмяТЧ = ?(ВыборкаТЧ.ТЧ = 1, "Взносы", "ВзносыФОТ");
			
			ДокументОбъект[ИмяТЧ].Загрузить(ДокументОбъект["Удалить" + ИмяТЧ].Выгрузить());
			ДокументОбъект["Удалить" + ИмяТЧ].Очистить();
			
		КонецЦикла;
		
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры



Процедура ЗаполнитьПолеДатаПолученияДоходаПоОписаниюДокумента(ОписаниеДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаВзносов.Ссылка
	|ИЗ
	|	#ТаблицаВзносов КАК ТаблицаВзносов
	|ГДЕ
	|	ТаблицаВзносов.ДатаПолученияДохода = ДАТАВРЕМЯ(1, 1, 1)";
	
	ПутьКТаблицеВзносов = "Документ." + ОписаниеДокумента.ИмяДокумента + "." + ОписаниеДокумента.ИмяТаблицыВзносов;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТаблицаВзносов", ПутьКТаблицеВзносов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ТаблицаВзносы = ДокументОбъект[ОписаниеДокумента.ИмяТаблицыВзносов];
		ПериодРегистрации = ДокументОбъект[ОписаниеДокумента.ИмяПоляПериодРегистрации];
		
		ДатаПолученияДохода = УчетСтраховыхВзносовКлиентСервер.ДатаПолученияДохода(ПериодРегистрации);
		
		Для Каждого СтрокаВзносов Из ТаблицаВзносы Цикл 
			Если Не ЗначениеЗаполнено(СтрокаВзносов.ДатаПолученияДохода) Тогда
				СтрокаВзносов.ДатаПолученияДохода = ДатаПолученияДохода;
			КонецЕсли;	
		КонецЦикла;	
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать();
	КонецЦикла;	
	
КонецПроцедуры	

/////////////////////////////////////////////////////////////////////////////////////////

// Устанавливает видимость колонок таблицы страховых взносов в форме документа
// в зависимости от месяца расчета.
//
// Параметры:
//	- Форма - управляемая форма документа,
//	- Месяц - дата начисления взносов.
//	- ИмяТаблицыСтраховыхВзносов - имя таблицы формы, колонками которой нужно управлять, 
//		необязательный, по умолчанию "Взносы".
//
Процедура УстановитьВидимостьКолонокТаблицыСтраховыхВзносов(Форма, Месяц, ИмяТаблицыСтраховыхВзносов = "Взносы") Экспорт
	
	
КонецПроцедуры


#КонецОбласти

#Область Свойства

// См. УправлениеСвойствамиПереопределяемый.ПриПолученииПредопределенныхНаборовСвойств.
Процедура ПриПолученииПредопределенныхНаборовСвойств(Наборы) Экспорт
	
	УправлениеСвойствамиБЗК.ЗарегистрироватьНаборСвойств(Наборы, "c091b4cb-9802-11e9-80cd-4cedfb43b11a", Метаданные.Документы.ОперацияУчетаПоСтраховымВзносам);
	
КонецПроцедуры

#КонецОбласти
