#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура НачальноеЗаполнение() Экспорт
	
	ЗаполнитьВидыОбщественноПолезнойДеятельностиСЗВК();
	ДополнитьВидыОбщественноПолезнойДеятельностиСЗВК();
	ОбновитьНаименованияВидыОбщественноПолезнойДеятельностиСЗВК();
	
КонецПроцедуры

Процедура ЗаполнитьВидыОбщественноПолезнойДеятельностиСЗВК()
	
	Наименование = "Работа, включаемая в трудовой стаж";
	Код = НСтр("ru = 'РАБОТА';
				|en = 'WORK'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код, "РАБОТА");
	
	Наименование = НСтр("ru = 'Периоды получения пособия по безработице, участия в оплачиваемых общественных работах';
						|en = 'Periods of receiving unemployment benefit and participation in paid social work'");
	Код = НСтр("ru = 'БЕЗР';
				|en = 'DIMEN'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);
	
	Наименование = НСтр("ru = 'Период пребывания в местах заключения сверх срока, назначенного при пересмотре дела';
						|en = 'Period of time spent in places of detention over the period set in the retrial'");
	Код = НСтр("ru = 'ПЕРЕСМОТР';
				|en = 'REVIEW'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Период временной нетрудоспособности, начавшийся в период работы, и период пребывания на инвалидности';
						|en = 'Period of temporary incapacity for work started in the work period and the period of disability'");
	Код = НСтр("ru = 'ПРОФЗАБ';
				|en = 'PROFZAB'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Период содержания под стражей лиц, необоснованно привлеченных к уголовной ответственности';
						|en = 'Detention period of wrongly convicted persons'");
	Код = НСтр("ru = 'РЕАБИЛИТ';
				|en = 'REHABILIT'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Военная служба и другая, приравненная к ней, служба, включаемая в общий трудовой стаж';
						|en = 'Military service and other service which is equivalent to it included in total length of service'");
	Код = НСтр("ru = 'СЛУЖБА';
				|en = 'SERVICE'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Период получения пособия по гос. социальному страхованию в период временной нетрудоспособности';
						|en = 'Period of receiving state social insurance allowance in the period of temporary incapacity for work'");
	Код = НСтр("ru = 'СОЦСТРАХ';
				|en = 'SOCIAL INSURANCE'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Период ухода за ребенком до достижения им возраста полутора лет';
						|en = 'Child care period for children under 1.5 years old'");
	Код = НСтр("ru = 'УХОД-ДЕТИ';
				|en = 'CARE-CHILDREN'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Период ухода, осуществляемого трудоспособным лицом за инвалидом I группы, ребенком-инвалидом';
						|en = 'Period of care performed by employee of disabled person of group I, disabled child'");
	Код = НСтр("ru = 'УХОД-ИНВД';
				|en = 'CARE-DISAB'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);
	
КонецПроцедуры	

Процедура ДополнитьВидыОбщественноПолезнойДеятельностиСЗВК() Экспорт 

	Наименование = НСтр("ru = 'Работа, подтвержденная свидетельскими показаниями';
						|en = 'Work confirmed by evidence'");
	Код = НСтр("ru = 'РАБСВПК';
				|en = 'RABSVPK'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

   	Наименование = НСтр("ru = 'Работа за границей';
							|en = 'Work abroad'");
	Код = НСтр("ru = 'РАБЗАГР';
				|en = 'RABZAGR'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);
	
	Наименование = НСтр("ru = 'Военная служба по призыву';
						|en = 'Conscription'");
	Код = НСтр("ru = 'СЛПРИЗ';
				|en = 'SLPRIZ'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Работа во время Великой Отечественной войны';
						|en = 'Work during the Great Patriotic War'");
	Код = НСтр("ru = 'РАБВОВ';
				|en = 'RABVOV'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);
   
   	Наименование = НСтр("ru = 'Служба в воинских частях, штабах и учреждениях, входящих в состав действующей армии, в партизанских отрядах и соединениях в период боевых действий';
							|en = 'Service in military units, headquarters and institutions included in the Army in the Field, partisan units and formations during the war'");
	Код = НСтр("ru = 'СЛДАПБЛ';
				|en = 'SLDAPBL'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);
   
	Наименование = НСтр("ru = 'Время нахождения на излечении в лечебных учреждениях вследствие военной травмы';
						|en = 'Time of treatment in medical facilities due to military injury'");
	Код = НСтр("ru = 'ИЗЛВТР';
				|en = 'IZLVTR'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Работа в г. Ленинграде в период блокады (с 8 сентября 1941 г. по 27 января 1944 г.)';
						|en = 'Work in Leningrad during the Siege (from 09/08/1941 to 01/27/1944)'");
	Код = НСтр("ru = 'РАБЛОК';
				|en = 'UNLOCK'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Проживание жен (мужей) военнослужащих, проходящих военную службу по контракту';
						|en = 'Residence of wives (husbands) of the military personnel doing the contract military service'");
	Код = НСтр("ru = 'СЛПРОЖ';
				|en = 'SLPROG'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Уход неработающей матери за ребенком';
						|en = 'Non-working mother caring for a child'");
	Код = НСтр("ru = 'НЕРАБМАТЬ';
				|en = 'NONWORKMOTHER'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Уход трудоспособным лицом за инвалидом I группы, ребенком-инвалидом или за лицом, достигшим возраста 80 лет';
						|en = 'Employee caring for disabled person of group I, disabled child or a person aged 80 and above'");
	Код = НСтр("ru = 'ТРУДЛИЦО';
				|en = 'WORKPERSON'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Уход родителей и иных законных представителей за ВИЧ-инфицированными несовершеннолетними детьми';
						|en = 'Parents or other lawful guardians caring for HIV positive minors'");
	Код = НСтр("ru = 'УХОД-ВИЧ';
				|en = 'CARE-HIV '");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Подготовка к профессиональной деятельности - обучение';
						|en = 'Preparation for professional activity - training'");
	Код = НСтр("ru = 'ДВСТО';
				|en = 'Higher Education Diploma/Diploma of Non-University Level Higher Education'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Проживание за границей жен (мужей) работников советских учреждений и международных организаций';
						|en = 'Residence abroad of wives (husb.) of the employees working in the Soviet institutions and intern. organizations'");
	Код = НСтр("ru = 'ПРЗАГР';
				|en = 'PRZAGR'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Проживание в районах, временно оккупированных неприятелем в период Великой Отечественной войны';
						|en = 'Residence in areas temporarily occupied during the Great Patriotic War'");
	Код = НСтр("ru = 'ПРОВОВ';
				|en = 'PROVOV'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Проживание в г. Ленинграде в период его блокады';
						|en = 'Residence in Leningrad during the Siege '");
	Код = НСтр("ru = 'ПРБЛОК';
				|en = 'PRBLOK'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Нахождение в концлагерях';
						|en = 'Staying in concentration camps'");
	Код = НСтр("ru = 'ПРКОНЦ';
				|en = 'PRKONC'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);

	Наименование = НСтр("ru = 'Период проживания супругов военнослужащих, проходящих военную службу по контракту, вместе с супругами в местностях, где они не могли трудиться в связи с отсутствием возможности трудоустройства';
						|en = 'Residence period of spouses of military personnel doing military service together with a spouse in areas where they couldn''t work due to lack of employment opportunities'");
	Код = НСтр("ru = 'ПРОЖСУПР';
				|en = 'PROGSUPR'");
	ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код);
	
КонецПроцедуры	

Процедура ОбновитьНаименованияВидыОбщественноПолезнойДеятельностиСЗВК() Экспорт
	Ссылка = Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК.НайтиПоКоду("СЛДАПБЛ");
	
	Если Не Ссылка.Пустая() Тогда
		Элемент = Ссылка.ПолучитьОбъект();
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Наименование = НСтр("ru = 'Служба в воинских частях, штабах и учреждениях, в действующей армии (и пр.) в период боевых действий';
									|en = 'Service in military units, headquarters and institutions, the Army in the Field (and other) during the war '");
		
		Элемент.Записать();
	КонецЕсли;	
	
	Ссылка = Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК.НайтиПоКоду("ТРУДЛИЦО");
	
	Если Не Ссылка.Пустая() Тогда
		Элемент = Ссылка.ПолучитьОбъект();
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Наименование = НСтр("ru = 'Уход трудоспособным лицом за инв. I группы, ребенком-инв. или за лицом, достигшим возраста 80 лет';
									|en = 'Employee caring for disabled person of group I, disabled child or a person aged 80 and above'");
		
		Элемент.Записать();
	КонецЕсли;	
	
	Ссылка = Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК.НайтиПоКоду("ПРОЖСУПР");
	
	Если Не Ссылка.Пустая() Тогда
		Элемент = Ссылка.ПолучитьОбъект();
		Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		Элемент.Наименование = НСтр("ru = 'Период проживания супругов военнослужащих, проходящих военную службу по контракту, вместе с супругом';
									|en = 'Residence period of spouses of military personnel doing military service together with a spouse'");
		
		Элемент.Записать();
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ДобавитьВидОбщественноПолезнойДеятельностиСЗВК(Наименование, Код, ИмяПредопределенныхДанных = "")
	
	Если ПустаяСтрока(ИмяПредопределенныхДанных) Тогда
		
		СсылкаНаОбъект = Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			Элемент = СсылкаНаОбъект.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК.СоздатьЭлемент();
		КонецЕсли;
		
	Иначе
		
		СсылкаПредопределенного = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОбщественноПолезнойДеятельностиСЗВК." + ИмяПредопределенныхДанных);
		Если ЗначениеЗаполнено(СсылкаПредопределенного) Тогда
			Элемент = СсылкаПредопределенного.ПолучитьОбъект();
		Иначе
			Элемент = Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК.СоздатьЭлемент();
			Элемент.ИмяПредопределенныхДанных = ИмяПредопределенныхДанных;
		КонецЕсли;
		
	КонецЕсли;
	
	Элемент.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
	Элемент.Код = Код;
	Элемент.Наименование = Наименование;
	
	Элемент.Записать();
	
КонецПроцедуры	

#КонецЕсли

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
// Используется для сопоставления элементов механизмом «Выгрузка/загрузка областей данных».
//
// Возвращаемое значение: Массив(Строка) - массив имен реквизитов, образующих
//  естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
