////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Формирует печатные формы акта выполненных работ.
//
// Параметры:
//     МассивОбъектов  			- Массив    - ссылки на объекты, которые нужно распечатать.
//     ПараметрыПечати 			- Структура - дополнительные настройки печати.
//     КоллекцияПечатныхФорм 	- ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//     ОбъектыПечати         	- СписокЗначений  - значение - ссылка на объект, представление - имя области
//                                                  в которой был выведен объект (выходной параметр).
//     ПараметрыВывода       	- Структура       - дополнительные параметры сформированных табличных документов
//                                                 (выходной параметр).
//
Процедура ПечатьАкта(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_12_МОЭ",
	НСтр("ru = 'Акт выполненных работ (12 граф) Мособлэкспертиза'"),
	МассивОбъектов,              
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_12_МОЭ");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_12",
	НСтр("ru = 'Акт выполненных работ (12 граф)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_12");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_14",
	НСтр("ru = 'Акт выполненных работ (14 граф)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_14");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_НРиСП",
	НСтр("ru = 'Акт выполненных работ с НР и СП'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_НРиСП");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_КС2",
	НСтр("ru = 'КС-2'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_КС2");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_КС2_8_Рес",
	НСтр("ru = 'КС-2 (8 граф) ресурсный'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_КС2_8_Рес");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_РМ12_Рес",
	НСтр("ru = 'КС-2 (8 граф) ресурсный'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_РМ12_Рес");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_ТСН11а",
	НСтр("ru = 'Акт выполненных работ (методика ТСН форма 1а)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_ТСН11а");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_ТСН11б",
	НСтр("ru = 'Акт выполненных работ (методика ТСН форма 1б)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_ТСН11б");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_Акт_ТСН9в",
	НСтр("ru = 'Акт выполненных работ (методика ТСН форма 1в)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_ТСН9в");  
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_АКТ_2В",
	НСтр("ru = 'Акт выполненных работ форма 2В'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_АКТ_2В");  
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_АКТ_ВСМ",
	НСтр("ru = 'Ведомость на списание материалов к акту.'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_АКТ_ВСМ");  
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ПФ_MXL_АКТ_ОРМ",
	НСтр("ru = 'Отчет о расходе материалов к акту.'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_АКТ_ОРМ");  

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ОтчетМ29",
	НСтр("ru = 'Отчет о расходе ресурсов (М-29)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"ОтчетМ29");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ОтчетМ29Материалы",
	НСтр("ru = 'Отчет о расходе ресурсов (М-29) (материалы)'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"ОтчетМ29");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
	"ОтчетВыполненныеРаботы",
	НСтр("ru = 'Справка об объемах выполненных работ'"),
	МассивОбъектов,
	КоллекцияПечатныхФорм,
	ОбъектыПечати,
	ПараметрыВывода,
	"ОтчетВыполненныеРаботы");
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ОтчетКС3",
		НСтр("ru = ''Справка о стоимости выполненных работ и затрат'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОтчетКС3");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_Акт_РасчетЗатратНаУплатуНДСприУСН",
		НСтр("ru = 'Расчет затрат на уплату НДС при УСН'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_Акт_РасчетЗатратНаУплатуНДСприУСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"Приложение",
		НСтр("ru = 'Приложение'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_АктВыполненныхРабот.ПФ_MXL_СМ_ПриложениеКСметеАкту");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ОтчетМ19",
		НСтр("ru = 'Отчет (М-19)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОтчетМ19");

КонецПроцедуры

// Формирует печатные формы локальной сметы.
//
// Параметры:
//     МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//     ПараметрыПечати - Структура - дополнительные настройки печати.
//     КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//     ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект, представление - имя области
//                                               в которой был выведен объект (выходной параметр).
//     ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов
//                                              (выходной параметр).
//
Процедура ПечатьЛокальнойСметы(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_13",
		НСтр("ru = 'Локальная смета (13 граф)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_13");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_11",
		НСтр("ru = 'Локальная смета (11 граф)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_11");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_13_НРиСП",
		НСтр("ru = 'Локальная смета (13 граф) с НР и СП'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_13_НРиСП");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_11_НРиСП",
		НСтр("ru = 'Локальная смета (11 граф) с НР и СП'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_11_НРиСП");	
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_12",
		НСтр("ru = 'Локальная смета (12 граф) Мособлэкспертиза'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_12");	
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_9_Рес",
		НСтр("ru = 'Локальная смета (9 граф) Ресурсная'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_9_Рес");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_12_Рес",
		НСтр("ru = 'Локальная смета (12 граф) Ресурсная'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_12_Рес");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_7_Рес",
		НСтр("ru = 'Локальная смета (7 граф) Ресурсная'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_7_Рес");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ОтчетКС3",
		НСтр("ru = ''Справка о стоимости выполненных работ и затрат'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОтчетКС3");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_РасчетЗатратНаУплатуНДСприУСН",
		НСтр("ru = 'Расчет затрат на уплату НДС при УСН'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_РасчетЗатратНаУплатуНДСприУСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_11ТСН",
		НСтр("ru = 'Локальная смета(методика ТСН форма 1а'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_11ТСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_12ТСН",
		НСтр("ru = 'Локальная смета(методика ТСН форма 1б'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_12ТСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_ЛС_13ТСН",
		НСтр("ru = 'Локальная смета(методика ТСН форма 1в'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_ЛС_13ТСН");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"Приложение",
		НСтр("ru = 'Приложение'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОбщийМакет.ПФ_MXL_СМ_ПриложениеКСметеАкту");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_ЛС_1_Рес",
		НСтр("ru = 'Приложение 2 к ГНОССС в РК (подробная)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_СМ_КЗ_ЛС_1_Рес");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_ЛС_2_Рес",
		НСтр("ru = 'Приложение 2 к ГНОССС в РК'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ЛокальнаяСмета.ПФ_MXL_СМ_КЗ_ЛС_2_Рес");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_Макет_Форма4",
		НСтр("ru = 'Форма №4'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОбщийМакет.ПФ_MXL_Макет_Форма4");

КонецПроцедуры

// Формирует печатные формы объектной сметы/
//
// Параметры:
//     МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//     ПараметрыПечати - Структура - дополнительные настройки печати.
//     КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//     ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект, представление - имя области
//                                               в которой был выведен объект (выходной параметр).
//     ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов
//                                              (выходной параметр).
//
Процедура ПечатьОбъектнойСметы(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_МакетОС",
		НСтр("ru = 'Объектная смета'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ОбъектнаяСмета.ПФ_MXL_МакетОС");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_МакетОС",
		НСтр("ru = 'Объектная смета (Кзахстан)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_ОбъектнаяСмета.ПФ_MXL_СМ_КЗ_МакетОС");

	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_Макет_Форма4",
		НСтр("ru = 'Форма №4'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"ОбщийМакет.ПФ_MXL_Макет_Форма4");

КонецПроцедуры
	
// Формирует печатные формы сводной сметы.
//
// Параметры:
//     МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать.
//     ПараметрыПечати - Структура - дополнительные настройки печати.
//     КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//     ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект, представление - имя области
//                                               в которой был выведен объект (выходной параметр).
//     ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов
//                                              (выходной параметр).
//
Процедура ПечатьСводнойСметы(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_МакетСС",
		НСтр("ru = 'Сводный сметный расчет'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_СводнаяСмета.ПФ_MXL_МакетСС");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_МакетСС",
		НСтр("ru = 'Сметный расчет стоимости строительства (Казахстан)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_СводнаяСмета.ПФ_MXL_СМ_КЗ_МакетСС");
		
	СМ_СметаПечатьСервер.ПодготовитьПечатнуюФорму(
		"ПФ_MXL_СМ_КЗ_МакетСС_Сводный",
		НСтр("ru = 'Сводный сметный расчет (Казахстан)'"),
		МассивОбъектов,
		КоллекцияПечатныхФорм,
		ОбъектыПечати,
		ПараметрыВывода,
		"Документ.СМ_СводнаяСмета.ПФ_MXL_СМ_КЗ_МакетСС_Сводный");

КонецПроцедуры

#КонецОбласти


