
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//Если НЕ РольДоступна("ПолныеПрава") Тогда
	//	//Доступен текущий месяц + 5 дней
	//	Если НачалоМесяца(Дата)>=НачалоМесяца(ТекущаяДата()) Тогда
	//	      //ОК
	//	ИначеЕсли НачалоМесяца(Дата)=НачалоМесяца(ТекущаяДата()-5*60*60*24) Тогда	
	//		// с 01 по 05 можно редактировать весь прошлый месяц
	//		
	//	ИНаче
	//		//ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю("Запрещено редактировать документ за указанный период",Отказ);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю( "Запрещено редактировать документ за указанный период",,,,Отказ);
	//	КонецЕсли;
	//КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр БДДС 
	//СуммаДокумента=Состав.Итог("Сумма");
	//
	//Если СуммаДокумента =0 Тогда
	//	СуммаДокумента =   РегистрыСведений.СтоимостьПродукции.ПолучитьЦену(Дата)*Состав.Итог("Количество");
	//КонецЕсли;
	
	
	Движения.БДДС.Записывать = Истина;
	
	Если Дата>=Дата(2022,11,01) Тогда
		Возврат;
	КонецЕсли; 
	
	Для каждого СтрСостав Из Состав Цикл
		Если НЕ СтрСостав.СтороннийЗаказчик Тогда
			Движение = Движения.БДДС.Добавить();
			Движение.Период = Дата;
			Движение.Подразделение = СтрСостав.Подразделение;
			Движение.ВидОплаты=Перечисления.ВидыДенежныхСредств.Безналичные;
			Движение.ДокументОснование=Ссылка;
			Движение.НаправлениеДДС=Перечисления.НаправленияДвиженийДенежныхСредств.Приход;
			Движение.ПланФакт=Ложь;
			Движение.ПланФакт=Направление;
			Движение.Сумма=  СтрСостав.Сумма;
			Движение.СуммаПриход=  СтрСостав.Сумма;
			Движение.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-001146");
			
			Движение.Направление=СтрСостав.НаправлениеДохода;//Справочники.Направления.НайтиПоКоду("000000002");
			
			
			
			Движение = Движения.БДДС.Добавить();
			Движение.Период = Дата;
			Движение.Подразделение = СтрСостав.ПодразделениеЗаказчик;
			Движение.ВидОплаты=Перечисления.ВидыДенежныхСредств.Безналичные;
			Движение.ДокументОснование=Ссылка;
			Движение.НаправлениеДДС=Перечисления.НаправленияДвиженийДенежныхСредств.Расход;
			Движение.ПланФакт=Ложь;
			Движение.ПланФакт=Направление;
			Движение.Сумма=  СтрСостав.Сумма;
			Движение.СуммаРасход=  СтрСостав.Сумма;
			Движение.СтатьяДвиженияДенежныхСредств=Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("УТ-001130");
			Движение.Направление=СтрСостав.НаправлениеРасхода;
		КонецЕсли;
		
	КонецЦикла;
	
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
