
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);	
	ИнициализироватьДокумент(ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УСОERP_УтверждениеКалендарногоПланаГрафика") Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполнитьНаОснованииВнутреннегоПланаПроизводстваРабот();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НаправлениеДеятельности) Тогда
		НаправлениеДеятельности = ДокументОснование.НаправлениеДеятельности;
	КонецЕсли;
	
	ПроведениеСерверУТ.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИнициализироватьДокумент();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка ИЛИ ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверкаЗаполненияЦенМатериалов();
	ПроверкаЗаолненияЦенРесурсов();
		
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);

	Документы.УСОERP_БюджетСтроительства.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	УСОERP_УправлениеСтроительнымПроизводством.ОтразитьДвиженияБюджетаСтроительства(ДополнительныеСвойства, Движения, Отказ);
	УСОERP_УправлениеСтроительнымПроизводством.ОтразитьДвиженияСтоимостиМатериаловВБюджетеСтроительства(ДополнительныеСвойства, Движения, Отказ);
	УСОERP_УправлениеСтроительнымПроизводством.ОтразитьДвиженияСтоимостиРесурсовВБюджетеСтроительства(ДополнительныеСвойства, Движения, Отказ);
	УСОERP_УправлениеСтроительнымПроизводством.ОтразитьДвиженияСтоимостиОбъектаСтроительства(ДополнительныеСвойства, Движения, Отказ);
	УСОERP_УправлениеСтроительнымПроизводством.ОтразитьДвиженияАктирования(ДополнительныеСвойства, Движения, Отказ);
	 	
	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСерверУТ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	СформироватьСписокРегистровДляКонтроля();

	ПроведениеСерверУТ.ЗаписатьНаборыЗаписей(ЭтотОбъект);

	ПроведениеСерверУТ.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);

	ПроведениеСерверУТ.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
	
#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный = Пользователи.ТекущийПользователь();
	Организация   = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	Валюта		  = ДоходыИРасходыСервер.ПолучитьВалютуУправленческогоУчета(Валюта);
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииВнутреннегоПланаПроизводстваРабот()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_УтверждениеКалендарногоПланаГрафика.Организация КАК Организация,
	|	УСОERP_УтверждениеКалендарногоПланаГрафика.ОбъектСтроительства КАК ОбъектСтроительства,
	|	УСОERP_УтверждениеКалендарногоПланаГрафика.СценарийПланирования КАК СценарийПланирования,
	|	УСОERP_УтверждениеКалендарногоПланаГрафика.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ВложенныйЗапрос.Ссылка КАК РазделительнаяВедомость
	|ИЗ
	|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика КАК УСОERP_УтверждениеКалендарногоПланаГрафика
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(УСОERP_РазделительнаяВедомость.Ссылка) КАК Ссылка
	|		ИЗ
	|			Документ.УСОERP_РазделительнаяВедомость КАК УСОERP_РазделительнаяВедомость
	|		ГДЕ
	|			УСОERP_РазделительнаяВедомость.Проведен
	|			И УСОERP_РазделительнаяВедомость.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыПланов.Утвержден)
	|			И УСОERP_РазделительнаяВедомость.ДокументУтверждения = &Ссылка) КАК ВложенныйЗапрос
	|		ПО УСОERP_УтверждениеКалендарногоПланаГрафика.Ссылка = ВложенныйЗапрос.Ссылка.ДокументУтверждения
	|ГДЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафика.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.Работа КАК Работа
	|ИЗ
	|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Работы КАК УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы
	|ГДЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументОснование);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаШапки = Результат[0].Выбрать();
	ВыборкаШапки.Следующий();
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаШапки);
	СценарийПланирования = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(ОбъектСтроительства, Организация);
	
	ДанныеПоРаботам = Результат[1].Выгрузить();
	
	//ОбъектыРасценки.Загрузить(ДанныеПоРаботам);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Процедура СформироватьСписокРегистровДляКонтроля()

	Массив = Новый Массив;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);

КонецПроцедуры

Процедура ПроверкаЗаполненияЦенМатериалов()
	
	МассивСтрокОшибок = СтоимостьМатериалов.НайтиСтроки(Новый Структура("Цена", 0));
	Для Каждого СтрокаОшибки Из  МассивСтрокОшибок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для работы " + СокрЛП(СтрокаОшибки.Работа.КодСДР) + " " + СокрЛП(СтрокаОшибки.Работа) + " не указана цена материала " + НоменклатураКлиентСервер.ПредставлениеНоменклатуры(СтрокаОшибки.Номенклатура, СтрокаОшибки.Характеристика));
	КонецЦикла;

КонецПроцедуры

Процедура ПроверкаЗаолненияЦенРесурсов()
	
	МассивСтрокОшибок = СтоимостьРесурсов.НайтиСтроки(Новый Структура("БазоваяЦена", 0));
	Для Каждого СтрокаОшибки Из  МассивСтрокОшибок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для работы " + СокрЛП(СтрокаОшибки.Работа.КодСДР) + " " + СокрЛП(СтрокаОшибки.Работа) + " по ресурсу " + СокрЛП(СтрокаОшибки.Ресурс) + " не указана цена объекта расценки " + СокрЛП(СтрокаОшибки.ОбъектРасценки));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#КонецЕсли
