
&НаСервере
Функция СинхронизироватьНаСервере(ТипВЕТИС, ХозяйствующийСубъект, Предприятие)
	
	РазмерПорции = 500;
	
	Если ТипВЕТИС = Перечисления.ТипыВЕТИС.ВетеринарноСопроводительныеДокументы Тогда
		Изменения = ЗаявкиВЕТИСВызовСервера.ПодготовитьЗапросИзмененныхВетеринарноСопроводительныхДокументов(
			ХозяйствующийСубъект, Предприятие, РазмерПорции, УникальныйИдентификатор);
	ИначеЕсли ТипВЕТИС = Перечисления.ТипыВЕТИС.ЗаписиСкладскогоЖурнала Тогда
		Изменения = ЗаявкиВЕТИСВызовСервера.ПодготовитьЗапросИзмененныхЗаписейСкладскогоЖурнала(
			ХозяйствующийСубъект, Предприятие, РазмерПорции, УникальныйИдентификатор);
	Иначе
		ИнтеграцияВЕТИСВызовСервера.ВыполнитьСинхронизациюКлассификаторов(
			Неопределено,
			ТипВЕТИС);
	КонецЕсли;
	
	Возврат Изменения;
	
КонецФункции

&НаКлиенте
Процедура Синхронизировать(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено
		Или Не ЗначениеЗаполнено(ТекущиеДанные.ТипВЕТИС) Тогда
		ПоказатьПредупреждение(, ИнтеграцияИСКлиентСервер.ТекстКомандаНеМожетБытьВыполнена());
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();
	
	РезультатОбмена = СинхронизироватьНаСервере(
		ТекущиеДанные.ТипВЕТИС,
		ТекущиеДанные.ХозяйствующийСубъект,
		ТекущиеДанные.Предприятие);
	
	Если РезультатОбмена <> Неопределено Тогда
		ОбработатьРезультатОбменаСВЕТИС(РезультатОбмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультатОбменаСВЕТИС(РезультатОбмена)
	
	ИнтеграцияВЕТИСКлиент.ОбработатьРезультатОбмена(РезультатОбмена, ЭтотОбъект,, ОповещениеПриЗавершенииОбмена(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменОбработкаОжидания()
	
	ИнтеграцияВЕТИСКлиент.ПродолжитьВыполнениеОбмена(ЭтотОбъект,, ОповещениеПриЗавершенииОбмена(), Ложь);
	
КонецПроцедуры

&НаКлиенте
Функция ОповещениеПриЗавершенииОбмена()
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПолученияРезультатОбработкиЗаявки", ЭтотОбъект);
	
	Возврат ОписаниеОповещения;
	
КонецФункции

&НаКлиенте
Процедура ПослеПолученияРезультатОбработкиЗаявки(Изменения, ДополнительныеПараметры) Экспорт
	
	Элементы.Список.Обновить();
	
КонецПроцедуры
