////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область РасчетПозиции

// Выполняет расчет поправок позиции локальной сметы и запись в регистр сведений
// СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.
// Параметры:
//     Объект 						- ДокументОбъект.СМ_ПозицияЛокальнойСметы - объект позиции.
//     СтруктураДанныхРасчета 		- Структура - содержит таблицы данных для расчета (см. менеджер СМ_ПозицияЛокальнойСметы).
//     ЛС 							- ДокументСсылка.СМ_ЛокальнаяСмета - ссылка на локальную смету.  
//     Акт 							- ДокументСсылка.СМ_АктыВыполненныхРабот - ссылка на акт выполненных работ.
//     СтруктураПараметровОтбораРС 	- Структура - содержит дополнительный отбор результирующего регистра сведений.
//     ИспользоватьРС 				- Булево - если Ложь, то все считается без чтения и записи из РС.
//
Процедура РасчитатьПоправки(Объект, СтруктураДанныхРасчета, ЛС, Акт, СтруктураПараметровОтбораРС = Неопределено, ИспользоватьРС = Истина) Экспорт
	
	Если СтруктураПараметровОтбораРС = Неопределено Тогда
		СтруктураПараметровОтбораРС = СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(Объект, Акт, "СМ_ПозицияЛокальнойСметы");
	КонецЕсли;
	
	// Определяем вариант расчета ЭММ.
	// В дальнейшем вариант расчета ЭММ будем брать из настроек пользователя.
	ВариантРасчетаЭММ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ВариантРасчетаЭксплуатацииМашин");	
	УчитыватьДопЗМ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","УчитыватьДопЗМ",Ложь);	
	ТекущийРаздел = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
	
	Параметры = Новый Структура();
	Параметры.Вставить("Позиция",СтруктураПараметровОтбораРС.СсылкаНаПозицию);
	Параметры.Вставить("Раздел",ТекущийРаздел);
	Параметры.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	Параметры.Вставить("СтоимПрямЗатраты",0);
	Параметры.Вставить("СтоимОснЗарплата",0);
	Параметры.Вставить("СтоимЭксплМашин",0);
	Параметры.Вставить("СтоимЗарплМашин",0);
	Параметры.Вставить("СтоимСтоимМатер",0);
	Параметры.Вставить("СтоимОборуд",0);
	Параметры.Вставить("СтоимВозвратМатер",0);
	Параметры.Вставить("ДопЗМ",0);
	Параметры.Вставить("ТекСтоимПрямЗатраты",0);
	Параметры.Вставить("ТекСтоимОснЗарплата",0);
	Параметры.Вставить("ТекСтоимЭксплМашин",0);
	Параметры.Вставить("ТекСтоимЗарплМашин",0);
	Параметры.Вставить("ТекСтоимСтоимМатер",0);
	Параметры.Вставить("ТекСтоимОборуд",0);
	Параметры.Вставить("ТекСтоимВозвратМатер",0);
	Параметры.Вставить("ДопЗМТек",0);
	Параметры.Вставить("ЗатратыТрудаРабочих",0);
	Параметры.Вставить("ЗатратыТрудаМашин",0);
	
	// Базисно-индексный метод.
	Если ЛС.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
		
		Параметры.СтоимПрямЗатраты		= Объект.ПрямЗатраты;
		Параметры.СтоимОснЗарплата		= Объект.ОснЗарплата;
		Параметры.СтоимЭксплМашин		= Объект.ЭксплМашин;
		Параметры.СтоимЗарплМашин		= Объект.ЗарплМашинистов;
		Параметры.СтоимСтоимМатер		= Объект.СтоимМатериалов;
		Параметры.СтоимОборуд			= Объект.Оборудование;
		Параметры.СтоимВозвратМатер		= Объект.ВозвратМатер;
		Параметры.ЗатратыТрудаРабочих	= Объект.ЗатратыТрудаРабочих;
		Параметры.ЗатратыТрудаМашин		= Объект.ЗатратыТрудаМашинистов;
		
		Параметры.ТекСтоимПрямЗатраты  	= Объект.ПрямЗатраты;
		Параметры.ТекСтоимОснЗарплата  	= Объект.ОснЗарплата;
		Параметры.ТекСтоимЭксплМашин  	= Объект.ЭксплМашин;
		Параметры.ТекСтоимЗарплМашин  	= Объект.ЗарплМашинистов;
		Параметры.ТекСтоимСтоимМатер  	= Объект.СтоимМатериалов;
		Параметры.ТекСтоимОборуд   		= Объект.Оборудование;
		Параметры.ТекСтоимВозвратМатер  = Объект.ВозвратМатер;
		
		Если ЛС.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел
			ИЛИ ЛС.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Расценка Тогда
			
			Если Объект.НеПрименятьИндексы = Истина Тогда
				
				Если ТипЗнч(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета) <> Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
					
					СтруктураЦен = Новый Структура();
					СтруктураЦен.Вставить("ТекущаяЦена",0);
					СтруктураЦен.Вставить("ТекущаяЗарплатаМашинистов",0);		
					
					ПолучитьТекущуюЦенуПоПозицииАкта(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета,Объект,СтруктураЦен);
					
					Если Объект.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Оборудование Тогда
						Параметры.ТекСтоимОборуд   		= СтруктураЦен.ТекущаяЦена;
					ИначеЕсли Объект.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал Тогда
						Параметры.ТекСтоимСтоимМатер  = СтруктураЦен.ТекущаяЦена;
						Параметры.ТекСтоимПрямЗатраты = СтруктураЦен.ТекущаяЦена;
					Иначе	
						Параметры.ТекСтоимЭксплМашин = СтруктураЦен.ТекущаяЦена;
						Параметры.ТекСтоимЗарплМашин = СтруктураЦен.ТекущаяЗарплатаМашинистов;
						Параметры.ТекСтоимПрямЗатраты = СтруктураЦен.ТекущаяЦена;
					КонецЕсли;	
					
				Иначе	
					Если Объект.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Оборудование Тогда
						Параметры.ТекСтоимОборуд   		= Объект.ТекущаяЦена;
					ИначеЕсли Объект.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал Тогда
						Параметры.ТекСтоимСтоимМатер  = Объект.ТекущаяЦена;
						Параметры.ТекСтоимПрямЗатраты = Объект.ТекущаяЦена;
					Иначе	
						Параметры.ТекСтоимЭксплМашин = Объект.ТекущаяЦена;
						Параметры.ТекСтоимЗарплМашин = Объект.ТекущаяЗарплатаМашинистов;
						Параметры.ТекСтоимПрямЗатраты = Объект.ТекущаяЦена;
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЕсли;	
			
		КонецЕсли;	

	// Ресурсный метод.
	ИначеЕсли ЛС.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
		
		Если ИспользоватьРС Тогда
			
			НаборЗаписей = РегистрыСведений.СМ_РесурснаяСтоимостьПозиции.СоздатьНаборЗаписей();
			
			НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
			НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
			НаборЗаписей.Прочитать();
			
			СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции = НаборЗаписей.Выгрузить();
			
		КонецЕсли;
		
		Если СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции.Количество() > 0 Тогда
			
			ТекСтрока = СтруктураДанныхРасчета.СМ_РесурснаяСтоимостьПозиции[0];
			
			Параметры.СтоимПрямЗатраты		= ТекСтрока.СтоимПрямЗатраты;
			Параметры.СтоимОснЗарплата		= ТекСтрока.СтоимОснЗарплата;
			Параметры.СтоимЭксплМашин		= ТекСтрока.СтоимЭксплМашин;
			Параметры.СтоимЗарплМашин		= ТекСтрока.СтоимЗарплМашин;
			Параметры.СтоимСтоимМатер		= ТекСтрока.СтоимСтоимМатер;
			Параметры.СтоимОборуд			= ТекСтрока.СтоимОборуд;
			Параметры.СтоимВозвратМатер		= ТекСтрока.СтоимВозвратМатер;
			
			Параметры.ТекСтоимПрямЗатраты	= ТекСтрока.ТекСтоимПрямЗатраты;
			Параметры.ТекСтоимОснЗарплата	= ТекСтрока.ТекСтоимОснЗарплата;
			Параметры.ТекСтоимЭксплМашин	= ТекСтрока.ТекСтоимЭксплМашин;
			Параметры.ТекСтоимЗарплМашин	= ТекСтрока.ТекСтоимЗарплМашин;
			Параметры.ТекСтоимСтоимМатер	= ТекСтрока.ТекСтоимСтоимМатер;
			Параметры.ТекСтоимОборуд		= ТекСтрока.ТекСтоимОборуд;
			Параметры.ТекСтоимВозвратМатер	= ТекСтрока.ТекСтоимВозвратМатер;			
			
			Параметры.ЗатратыТрудаРабочих	= ТекСтрока.ЗатратыТрудаРабочих;
			Параметры.ЗатратыТрудаМашин		= ТекСтрока.ЗатратыТрудаМашин;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// ***********************************************
	// ++ AVV Ошибки учета ресурсов акта.
	// Для акта по ресурсному методу расчет поправок не делаем. 
	// Норма расхода по смете для акта и количество ресурсов по акту уже учитывает поправки.
	Если Акт <> Неопределено И ЛС.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
		Если ИспользоватьРС Тогда
			Отбор = Новый Структура();
			Отбор.Вставить("Позиция",СтруктураПараметровОтбораРС.СсылкаНаПозицию);
			Отбор.Вставить("Раздел",ТекущийРаздел);
			Отбор.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
			СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками",Отбор,Параметры);
		Иначе
			СтрокаСтоимость = СтруктураДанныхРасчета.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаСтоимость,Параметры);
		КонецЕсли;
		Возврат;
	КонецЕсли;	
	// -- AVV
	// ***********************************************

	// Получаем таблицу поправок.
	ПоДокументу 		= Истина;
	ТаблПоправок		= ПолучитьПоправки(Объект, ПоДокументу);
	ДопЗМ 				= 0;
	ДопЗМТек 			= 0;
	ЗарплМашинистов 	= Параметры.СтоимЗарплМашин;
	ТекЗарплМашинистов 	= Параметры.ТекСтоимЗарплМашин;
	СтоимЗПМБезКоэфф 	= Параметры.СтоимЗарплМашин;

	Для Каждого СтрокаТаблПоправок Из ТаблПоправок Цикл
		
		ВариантРасчетаЭММ = ?(Не ЗначениеЗаполнено(СтрокаТаблПоправок.ВариантРасчета),ВариантРасчетаЭММ,СтрокаТаблПоправок.ВариантРасчета);
		Если Не ЗначениеЗаполнено(ВариантРасчетаЭММ)  Тогда
			ВариантРасчетаЭММ = Перечисления.СМ_ВариантыРасчетаЭММ.Одинаковые;
		КонецЕсли;
			
		КоэффПЗ 	= ?(СтрокаТаблПоправок.КоэффициентКПрямымЗатратам = 0,1,СтрокаТаблПоправок.КоэффициентКПрямымЗатратам);
		КоэффОЗ 	= ?(СтрокаТаблПоправок.КоэффициентКОсновнойЗарплате = 0,1,СтрокаТаблПоправок.КоэффициентКОсновнойЗарплате);
		КоэффЭМ 	= ?(СтрокаТаблПоправок.КоэффициентКЭксплуатацииМашин = 0,1,СтрокаТаблПоправок.КоэффициентКЭксплуатацииМашин);
		КоэффЗМ 	= ?(СтрокаТаблПоправок.КоэффициентКЗарплатеМашинистов = 0,1,СтрокаТаблПоправок.КоэффициентКЗарплатеМашинистов);
		КоэффСМ 	= ?(СтрокаТаблПоправок.КоэффициентКСтоимостиМатериалов = 0,1,СтрокаТаблПоправок.КоэффициентКСтоимостиМатериалов);
		КоэффЗТР 	= ?(СтрокаТаблПоправок.КоэффициентКТрудозатратамРабочих = 0,1,СтрокаТаблПоправок.КоэффициентКТрудозатратамРабочих);
		КоэффЗТМ 	= ?(СтрокаТаблПоправок.КоэффициентКТрудозатратамМашинистов = 0,1,СтрокаТаблПоправок.КоэффициентКТрудозатратамМашинистов);
		// Добавки к составляющим.
		ДобавПЗ = СтрокаТаблПоправок.ДобавитьКПрямымЗатратам;
		ДобавОЗ = СтрокаТаблПоправок.ДобавитьКОсновнойЗарплате;
		ДобавЭМ = СтрокаТаблПоправок.ДобавитьКЭксплуатацииМашин;
		ДобавЗМ = СтрокаТаблПоправок.ДобавитьКЗарплатеМашинистов;
		ДобавСМ = СтрокаТаблПоправок.ДобавитьКСтоимостиМатериалов;
		ДобавТР = СтрокаТаблПоправок.ДобавитьКТрудозатратамРабочих;
		ДобавТМ = СтрокаТаблПоправок.ДобавитьКТрудозатратам;
		
		// Если заданы добавки, они добавляются к составляющим и прямым затратам.
		Если ДобавПЗ <> 0 Тогда
			Параметры.Вставить("СтоимПрямЗатраты",(Параметры.СтоимПрямЗатраты + ДобавПЗ));
			Параметры.Вставить("ТекСтоимПрямЗатраты",(Параметры.ТекСтоимПрямЗатраты+ДобавПЗ));
		КонецЕсли;
		Если ДобавОЗ <> 0 Тогда
			Параметры.Вставить("СтоимОснЗарплата",Параметры.СтоимОснЗарплата + ДобавОЗ);
			Параметры.Вставить("ТекСтоимОснЗарплата",Параметры.ТекСтоимОснЗарплата+ДобавОЗ);
		КонецЕсли;
		Если ДобавЭМ <> 0 Тогда
			Параметры.Вставить("СтоимЭксплМашин",Параметры.СтоимЭксплМашин + ДобавЭМ);
			Параметры.Вставить("ТекСтоимЭксплМашин",Параметры.ТекСтоимЭксплМашин+ДобавЭМ);
		КонецЕсли;
		Если ДобавЗМ <> 0 Тогда
			Параметры.Вставить("СтоимЗарплМашин",Параметры.СтоимЗарплМашин + ДобавЗМ);
			Параметры.Вставить("ТекСтоимЗарплМашин",Параметры.ТекСтоимЗарплМашин+ДобавЗМ);
		КонецЕсли;
		Если ДобавСМ <> 0 Тогда
			Параметры.Вставить("СтоимСтоимМатер",Параметры.СтоимСтоимМатер + ДобавСМ);
			Параметры.Вставить("ТекСтоимСтоимМатер",Параметры.ТекСтоимСтоимМатер+ДобавСМ);
		КонецЕсли;
		Если ДобавТР <> 0 Тогда
			Параметры.Вставить("ЗатратыТрудаРабочих",Параметры.ЗатратыТрудаРабочих + ДобавТР);
		КонецЕсли;
		Если ДобавТМ <> 0 Тогда
			Параметры.Вставить("ЗатратыТрудаМашин",Параметры.ЗатратыТрудаМашин + ДобавТМ);
		КонецЕсли;
		
		// Обработка коэффициентов.
		Если КоэффПЗ <> 1 Тогда
			//  Если Задан коэффициент к ПЗ, то он применяется к каждой из составляющих.
			КоэффОЗ 	= КоэффПЗ * КоэффОЗ;
			КоэффЭМ 	= КоэффПЗ * КоэффЭМ;
			КоэффЗМ 	= КоэффПЗ * КоэффЗМ;
			КоэффСМ 	= КоэффПЗ * КоэффСМ;
			КоэффЗТР 	= КоэффПЗ * КоэффЗТР;
			КоэффЗТМ 	= КоэффПЗ * КоэффЗТМ;
			//
		КонецЕсли;	
		
		// Умножаем на коэффициенты.
		Параметры.Вставить("СтоимОснЗарплата",Параметры.СтоимОснЗарплата*КоэффОЗ);
		Параметры.Вставить("ТекСтоимОснЗарплата",Параметры.ТекСтоимОснЗарплата*КоэффОЗ);
		// Получаем измененную ЗМ.
		ЗарплМашинистов = Параметры.СтоимЗарплМашин;
		ТекЗарплМашинистов = Параметры.ТекСтоимЗарплМашин;
		
		Если ВариантРасчетаЭММ = Перечисления.СМ_ВариантыРасчетаЭММ.Одинаковые Тогда
			
			Параметры.Вставить("СтоимЭксплМашин",Параметры.СтоимЭксплМашин*КоэффЭМ);
			Параметры.Вставить("СтоимЗарплМашин",ЗарплМашинистов*КоэффЭМ);
			Параметры.Вставить("ТекСтоимЭксплМашин",Параметры.ТекСтоимЭксплМашин*КоэффЭМ);
			Параметры.Вставить("ТекСтоимЗарплМашин",ТекЗарплМашинистов *КоэффЭМ);
			
		ИначеЕсли ВариантРасчетаЭММ = Перечисления.СМ_ВариантыРасчетаЭММ.Разные Тогда
			Параметры.Вставить("СтоимЭксплМашин",Параметры.СтоимЭксплМашин*КоэффЭМ);
			Параметры.Вставить("ТекСтоимЭксплМашин",Параметры.ТекСтоимЭксплМашин*КоэффЭМ);
			Параметры.Вставить("ТекСтоимЗарплМашин",ТекЗарплМашинистов*КоэффЗМ);
			Параметры.Вставить("СтоимЗарплМашин",ЗарплМашинистов*КоэффЗМ);
			Если УчитыватьДопЗМ Тогда
				ДопЗМ = ДопЗМ + ЗарплМашинистов *(КоэффЗМ - КоэффЭМ); 
				ДопЗМТек = ДопЗМТек + ТекЗарплМашинистов *(КоэффЗМ - КоэффЭМ); 
			КонецЕсли;
			Параметры.Вставить("СтоимЭксплМашин",Параметры.СтоимЭксплМашин + ДопЗМ);
			Параметры.Вставить("ТекСтоимЭксплМашин",Параметры.ТекСтоимЭксплМашин + ДопЗМТек);
			
		ИначеЕсли ВариантРасчетаЭММ = Перечисления.СМ_ВариантыРасчетаЭММ.РазныеКРазности Тогда
			// Получаем измененную ЗМ.
			СтоимЗПМБезКоэфф = ЗарплМашинистов;
			СтоимЗПМ = ЗарплМашинистов*КоэффЗМ;
			Параметры.Вставить("СтоимЗарплМашин",СтоимЗПМ );
			СтоимостьЭМРазница = (Параметры.СтоимЭксплМашин - СтоимЗПМБезКоэфф)*КоэффЭМ;
			Параметры.Вставить("СтоимЭксплМашин",СтоимостьЭМРазница + СтоимЗПМ);
			
			ТекСтоимЗПМБезКоэфф = ТекЗарплМашинистов;
			ТекСтоимЗПМ = ТекЗарплМашинистов*КоэффЗМ;
			СтоимостьЭМРазница = (Параметры.ТекСтоимЭксплМашин - ТекСтоимЗПМБезКоэфф)*КоэффЭМ;
			
			Параметры.Вставить("ТекСтоимЭксплМашин",СтоимостьЭМРазница + ТекСтоимЗПМ);
			Параметры.Вставить("ТекСтоимЗарплМашин",ТекСтоимЗПМ);
			Если УчитыватьДопЗМ Тогда
				Если (КоэффЗМ - КоэффЭМ) <> 0 Тогда	
					ДопЗМ = ДопЗМ + ЗарплМашинистов *(КоэффЗМ - КоэффЭМ); 
					ДопЗМТек = ДопЗМТек + ТекЗарплМашинистов  *(КоэффЗМ - КоэффЭМ);
				Иначе
					ДопЗМ = ДопЗМ * КоэффЗМ; 
					ДопЗМТек = ДопЗМТек * КоэффЗМ;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;
		  	
		Параметры.Вставить("ДопЗМ",ДопЗМ);
		Параметры.Вставить("ДопЗМТек",ДопЗМТек);

		Параметры.Вставить("СтоимСтоимМатер",Параметры.СтоимСтоимМатер*КоэффСМ);
		Параметры.Вставить("ТекСтоимСтоимМатер",Параметры.ТекСтоимСтоимМатер*КоэффСМ);
		// Коэффициент ПЗ применяется к Оборудованию.
		Параметры.Вставить("СтоимОборуд",Параметры.СтоимОборуд*КоэффПЗ);
		Параметры.Вставить("ТекСтоимОборуд",Параметры.ТекСтоимОборуд*КоэффПЗ);
		
		Параметры.Вставить("СтоимВозвратМатер",Параметры.СтоимВозвратМатер);
		Параметры.Вставить("ТекСтоимВозвратМатер",Параметры.ТекСтоимВозвратМатер);
		
		Параметры.Вставить("ЗатратыТрудаРабочих",Параметры.ЗатратыТрудаРабочих*КоэффЗТР);
		Параметры.Вставить("ЗатратыТрудаМашин",Параметры.ЗатратыТрудаМашин*КоэффЗТМ);
		// Проверяем равны ли ПЗ  сумме составляющих, или ПЗ не состоит из составляющих.
		Если (Параметры.СтоимЭксплМашин + Параметры.СтоимОснЗарплата + Параметры.СтоимСтоимМатер) <> 0 Тогда
			СтоимПЗ = Параметры.СтоимЭксплМашин + Параметры.СтоимОснЗарплата + Параметры.СтоимСтоимМатер;
		Иначе 
			СтоимПЗ = Параметры.СтоимПрямЗатраты * КоэффПЗ;
		КонецЕсли;	
		Параметры.Вставить("СтоимПрямЗатраты",СтоимПЗ);
		Если (Параметры.ТекСтоимЭксплМашин + Параметры.ТекСтоимОснЗарплата + Параметры.ТекСтоимСтоимМатер) <> 0 Тогда
			ТекСтоимПЗ = Параметры.ТекСтоимЭксплМашин + Параметры.ТекСтоимОснЗарплата + Параметры.ТекСтоимСтоимМатер;
		Иначе 
			ТекСтоимПЗ = Параметры.ТекСтоимПрямЗатраты * КоэффПЗ;
		КонецЕсли;	
		Параметры.Вставить("ТекСтоимПрямЗатраты",ТекСтоимПЗ);
		
	КонецЦикла;
	
	Если ИспользоватьРС Тогда
	
		Отбор = Новый Структура();
		Отбор.Вставить("Позиция",СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		Отбор.Вставить("Раздел",ТекущийРаздел);
		Отбор.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками",Отбор,Параметры);
		
	Иначе
		
		СтрокаСтоимость = СтруктураДанныхРасчета.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСтоимость,Параметры);
		
	КонецЕсли;

КонецПроцедуры

// Получает текущую цену позиции акта.
Процедура ПолучитьТекущуюЦенуПоПозицииАкта(АктСсылка,ПозицияСсылка,СтруктураЦен)
	Если  АктСсылка <> Неопределено Тогда
		ТекСтрока = АктСсылка.Позиции.Найти(ПозицияСсылка.Ссылка);
		Если ТекСтрока <> Неопределено Тогда
			СтруктураЦен.ТекущаяЦена = ТекСтрока.ТекущаяЦена;
			СтруктураЦен.ТекущаяЗарплатаМашинистов = ТекСтрока.ТекущаяЗарплатаМашинистов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Выполняет расчет числовых параметров позиции локальной сметы и запись в регистр сведений
// СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.
//
// Параметры:
//     Позиция 						- ДокументОбъект.СМ_ПозицияЛокальнойСметы - объект позиции.
//     СтруктураДанныхРасчета 		- Структура - содержит таблицу данных для расчета (см. менеджер СМ_ПозицияЛокальнойСметы).
//     ЛС 							- ДокументСсылка.СМ_ЛокальнаяСмета - ссылка на локальную смету.
//     ОбъемРабот 					- Число - текущий объем работ.
//     РесурсныйРасчет 				- Булево - ресурсный метод счета, то Истина, иначе - Ложь.
//     ТаблСПоправками 				- ТаблицаЗначений - таблица с поправками позиции.
//     ПромОкр 						- Булево - выполнять или нет промежуточное округление.
//     Акт 							- ДокументСсылка.СМ_АктыВыполненныхРабот - если задан акт, передается ссылка на него.
//     СтруктураПараметровОтбораРС 	- Структура - содержит дополнительный отбор результирующего регистра сведений.
//     ИспользоватьРС 				- Булево - если Ложь, то все считается без чтения и записи из РС.
//
Процедура РасчитатьЧП(Позиция, СтруктураДанныхРасчета, ЛС, ОбъемРабот, РесурсныйРасчет = Ложь, ТаблСПоправками = Неопределено, ПромОкр = Ложь, Акт = Неопределено, СтруктураПараметровОтбораРС = Неопределено, ИспользоватьРС = Истина) Экспорт 
	
	Если СтруктураПараметровОтбораРС = Неопределено Тогда
		СтруктураПараметровОтбораРС = СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(Позиция, Акт, "СМ_ПозицияЛокальнойСметы");
	КонецЕсли;
	
	Если ИспользоватьРС Тогда
		
		// 1. Выборка по ПозицииЛС из регистра "Базисная единичная стоимость позиции с поправками".
		НаборЗаписей = РегистрыСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		
	
		НаборЗаписей.Прочитать();
    	ТаблСПоправками = НаборЗаписей.Выгрузить();
		
	Иначе
		
		ТаблСПоправками = СтруктураДанныхРасчета.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Скопировать();
		
	КонецЕсли;   
	
	ТекущийРаздел = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
	
	//Если ЛС.МетодикаТСН Тогда
	Если ЛС.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_МетодикаТСНГородаМосква Тогда
		ПрименитьТрудРаб	= ЛС.ПрименитьЗУТрудРабочих;
		ПрименитьТрудМаш	= ЛС.ПрименитьЗУТрудМашинистов;
		ПризнакКапРемонт = ?(ЛС.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт,Истина,Ложь);

		Если Акт <> Неопределено Тогда
			СтрокаПозиции = СМ_СметаВызовСервера.СтрокаПозицииАкта(Акт, Позиция);
			Если Не СтрокаПозиции = Неопределено Тогда
				Если ПризнакКапРемонт Тогда
					КоэффЗУ = ?(СтрокаПозиции.ЗимнееУдорожРемонт = 0,1,СтрокаПозиции.ЗимнееУдорожРемонт);
					КоэффЗУМат = ?(СтрокаПозиции.ЗимнееУдорожМатериалРемонт = 0,1,СтрокаПозиции.ЗимнееУдорожМатериалРемонт);
				Иначе	
					КоэффЗУ = ?(СтрокаПозиции.ЗимнееУдорож = 0,1,СтрокаПозиции.ЗимнееУдорож);
					КоэффЗУМат = ?(СтрокаПозиции.ЗимнееУдорожМатериал = 0,1,СтрокаПозиции.ЗимнееУдорожМатериал);
				КонецЕсли;
				
			Иначе 
				КоэффЗУ = 1;
				КоэффЗУМат = 1;
			КонецЕсли;

		Иначе	
			Если ПризнакКапРемонт Тогда
				КоэффЗУ = ?(Позиция.ЗимнееУдорожРемонт = 0,1,Позиция.ЗимнееУдорожРемонт);
				КоэффЗУМат = ?(Позиция.ЗимнееУдорожМатериалРемонт = 0,1,Позиция.ЗимнееУдорожМатериалРемонт);
			Иначе	
				КоэффЗУ = ?(Позиция.ЗимнееУдорож = 0,1,Позиция.ЗимнееУдорож);
				КоэффЗУМат = ?(Позиция.ЗимнееУдорожМатериал = 0,1,Позиция.ЗимнееУдорожМатериал);
			КонецЕсли;
		КонецЕсли;		
		РасчетЗимнегоУдорожания(ТаблСПоправками,ПрименитьТрудРаб,ПрименитьТрудМаш,КоэффЗУ,КоэффЗУМат);
	КонецЕсли;	
	
	ТаблСПоправками.Колонки.Добавить("МассаБрутто", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5,ДопустимыйЗнак.Неотрицательный)));
	
	Для Каждого СтрЗнач Из ТаблСПоправками Цикл
		СтрЗнач.МассаБрутто = Позиция.МассаБрутто;
		СтрЗнач.Смета       = СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета;
		СтрЗнач.Раздел 		= ТекущийРаздел;
	КонецЦикла;
	
	Если ИспользоватьРС Тогда
		
		// 2. Создание пустой таблицы аналога регистра «Базисная единичная стоимость позиции с начислениями».
		НаборЗаписей = РегистрыСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		НаборЗаписей.Отбор.Раздел.Установить(ТекущийРаздел);
		НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);	
		НаборЗаписей.Прочитать();
		
		ТаблРасчета = НаборЗаписей.Выгрузить();
		
	Иначе
		
		ТаблРасчета = СтруктураДанныхРасчета.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Скопировать();
		
	КонецЕсли;
	
	ТаблРасчета.Колонки.Добавить("Итог");
	ТаблРасчета.Колонки.Добавить("МассаБрутто", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,5,ДопустимыйЗнак.Неотрицательный)));

	ТаблРасчета.Очистить();
	
	// 3. Переход к расчету числовых параметров.
	//	Задание параметров округления.
	ОкрИтог =  ЛС.ОкруглятьДоРублей;
	ОбрабПогр = ЛС.ОбрабатыватьПогрешность;
	СтруктураДанныхРасчета.СМ_ИтогиЧППоРазделу = РасчетЧП(Позиция, СтруктураДанныхРасчета, ЛС, ТаблСПоправками, ТаблРасчета, РесурсныйРасчет, ПромОкр, ОкрИтог, ОбрабПогр, Акт, СтруктураПараметровОтбораРС, ИспользоватьРС);
	
	// 3.1 Удаление повторов и нулевых значений для простоты печати.
	Врем = Новый ТаблицаЗначений;
	Врем = СтруктураДанныхРасчета.СМ_ИтогиЧППоРазделу.Скопировать();
	Врем.Колонки.Добавить("Номер", Новый ОписаниеТипов("Число", , Новый КвалификаторыЧисла(3,0)));
	Врем.Колонки.Добавить("Накоп", Новый ОписаниеТипов("Булево"));
	
	СтруктураДанныхРасчета.СМ_ИтогиЧППоРазделу.Очистить();
	
	Для каждого СтрРасчета Из Врем Цикл
		СтрРасчета.Номер = СтрРасчета.Итог.ПорядковыйНомер;
		СтрРасчета.Накоп = СтрРасчета.Итог.Накопительный;
	КонецЦикла;
	
	Врем.Сортировать("Номер,Накоп");
	ИтогПЗ = 0;
	ИтогОб =  0 ;
	ИтогПЗБазис = 0; 
	ИтогоОББазис = 0;
	Начало = Истина;
	
	Для каждого СтрРасчета Из Врем Цикл
		Если  Позиция.Определитель.ВидРабот = Перечисления.СМ_ВидыЗатратСмета.Оборудование Тогда
			Если Начало = Истина Тогда
				НоваяСтрока = СтруктураДанныхРасчета.СМ_ИтогиЧППоРазделу.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрРасчета);
				Если СтрРасчета.Накоп = Истина Тогда
					ИтогОБ =  СтрРасчета.ТекСтоимОборуд;
					ИтогОББазис = СтрРасчета.СтоимОборуд;
				КонецЕсли;
				Начало = Ложь;
				Продолжить;
			ИначеЕсли СтрРасчета.ТекСтоимОборуд = ИтогОб
				И СтрРасчета.СтоимОборуд = ИтогоОББазис
				И СтрРасчета.Накоп = Истина И Начало <> Истина Тогда
				Продолжить;
			ИначеЕсли СтрРасчета.ТекСтоимОборуд = 0
				И СтрРасчета.СтоимОборуд  = 0
				И СтрРасчета.Накоп = Ложь Тогда 	Продолжить;	
			Иначе
				НоваяСтрока = СтруктураДанныхРасчета.СМ_ИтогиЧППоРазделу.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрРасчета);
				Если СтрРасчета.Накоп = Истина Тогда
					ИтогОБ =  СтрРасчета.ТекСтоимОборуд;
					ИтогОББазис = СтрРасчета.СтоимОборуд;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если Начало = Истина Тогда
				НоваяСтрока = СтруктураДанныхРасчета.СМ_ИтогиЧППоРазделу.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрРасчета);
				Если СтрРасчета.Накоп = Истина Тогда
					ИтогПЗ = СтрРасчета.ТекСтоимПрямЗатраты;
					ИтогПЗБазис = СтрРасчета.СтоимПрямЗатраты;
				КонецЕсли;
				Начало = Ложь;
				Продолжить;
			ИначеЕсли СтрРасчета.ТекСтоимПрямЗатраты = ИтогПЗ
				И СтрРасчета.СтоимПрямЗатраты = ИтогПЗБазис
				И СтрРасчета.Накоп = Истина И Начало <> Истина Тогда
				Продолжить;
			ИначеЕсли СтрРасчета.ТекСтоимПрямЗатраты = 0
				И СтрРасчета.СтоимПрямЗатраты = 0
				И СтрРасчета.Накоп = Ложь Тогда 	Продолжить;	
			Иначе
				НоваяСтрока = СтруктураДанныхРасчета.СМ_ИтогиЧППоРазделу.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрРасчета);
				Если СтрРасчета.Накоп = Истина Тогда
					ИтогПЗ = СтрРасчета.ТекСтоимПрямЗатраты;
					ИтогПЗБазис = СтрРасчета.СтоимПрямЗатраты;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;	
	
	// 4. Записть таблицы расчета в итоги по разлелу.
	Если ИспользоватьРС Тогда
		НаборЗаписей = РегистрыСведений.СМ_ИтогиЧППоРазделу.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Позиция.Установить(СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		НаборЗаписей.Отбор.Раздел.Установить(ТекущийРаздел);
		НаборЗаписей.Отбор.Смета.Установить(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Загрузить(СтруктураДанныхРасчета.СМ_ИтогиЧППоРазделу);
		НаборЗаписей.Записать();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ПолучениеТаблицДляРасчетовИГрупповойОбработки

// Возвращает таблицу со сведениями о ресурсах Сметы (сводную или нет).
// ВАЖНО! Нельзя одновременно не учитывать цену при группировке и группировать по позициям, Если цена не учитывается -
// то группировка по позициям теряется.
//
// Параметры:
//     СписокПозиций 				- СписокЗначений - содержит элементы позициями или таблица с колонкой Позиция.
//     СвернутьТаблицу 				- Булево - сводная таблица или нет.
//     УчитыватьЦеныПриГруппировке 	- Булево - если Ложь, то ресурсы группируются без учета цен, так же добавляется
//                                             колонка с проверкой отклонения.
//     ГруппироватьПоПозициям 		- Булево - если Истина, то в итоговой колонке будет Позиция, иначе будет
//                                             сводная таблица.
//	   ТолькоФактическиеРесурсы     - Булево - если Истина то будут исключены ресурсы из позиций с объемом работ меньше 0. 
//	   БезНомераСтроки              - Булево - включать или нет номер строки в наименование ресурса.
//	   ГруппироватьПоСмете          - Булево - если Истина то будет добавлена колонка "смета" с группировкой по ней. 
//	   ГруппироватьСтатусы          - Булево - группировать или нет данные по статусам ресурсов сметы и акта. 
//
// Возвращаемое значение:
//     ТаблСтоимРес - ТаблицаЗначений - содержит ресурсы сметы, согласно переданным параметрам.
//
Функция ПолучитьТаблицуСтоимостиРесурсовСметы(СписокПозиций, СвернутьТаблицу = Ложь, УчитыватьЦеныПриГруппировке = Истина, ГруппироватьПоПозициям = Ложь, ТолькоФактическиеРесурсы = Ложь,БезНомераСтроки = Ложь,ГруппироватьПоСмете = Ложь,ГруппироватьСтатусы = Ложь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Таблица = (ТипЗнч(СписокПозиций) <> Тип("СписокЗначений"));
	
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ПараметрыЧисла = Новый КвалификаторыЧисла(15, 6);
	Число15_6 = Новый ОписаниеТипов("Число", , ПараметрыЧисла);
	ПараметрыЧисла = Новый КвалификаторыЧисла(20,6);
	Число15_2 = Новый ОписаниеТипов("Число", , ПараметрыЧисла);
	ПараметрыЧисла = Новый КвалификаторыЧисла(1,0);
	Число1_0 = Новый ОписаниеТипов("Число",,ПараметрыЧисла);
	
	ТаблСтоимРес = Новый ТаблицаЗначений();
	ТаблСтоимРес.Колонки.Добавить("КодРесурса", СтрокаТип);
	ТаблСтоимРес.Колонки.Добавить("Ресурс", Новый ОписаниеТипов("СправочникСсылка.СМ_Ресурсы"));
	ТаблСтоимРес.Колонки.Добавить("ВидРесурса", Новый ОписаниеТипов("ПеречислениеСсылка.СМ_ВидыРесурсов"));
	ТаблСтоимРес.Колонки.Добавить("НаименованиеРесурса", СтрокаТип);
	ТаблСтоимРес.Колонки.Добавить("ЕдиницаИзмеренияРесурса", Новый ОписаниеТипов("СправочникСсылка.СМ_ЕдиницыИзмеренияСмета"));
	ТаблСтоимРес.Колонки.Добавить("НормаРасхода", Число15_6);
	ТаблСтоимРес.Колонки.Добавить("Количество", Число15_6);
	ТаблСтоимРес.Колонки.Добавить("РасходПоНорме", Число15_6);
	ТаблСтоимРес.Колонки.Добавить("РасходПоФакту", Число15_6);
	ТаблСтоимРес.Колонки.Добавить("ЦенаБазисная", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("ЦенаЗМБазисная", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("СтоимостьБазисная", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("СтоимостьЗМБазисная", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("ЦенаТекущая", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("ЦенаТекущаяЗМ", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("СтоимостьТекущая", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("СтоимостьТекущаяЗМ", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("ЭтоУчтенный", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("ЭтоНеучтенный", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("ЭтоОборудование", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("Картинка", Число1_0);
	ТаблСтоимРес.Колонки.Добавить("Сортировка1", Новый ОписаниеТипов("Число"));
	ТаблСтоимРес.Колонки.Добавить("СтатусРесурса", Новый ОписаниеТипов("ПеречислениеСсылка.СМ_ОбеспечениеРесурса"));
	ТаблСтоимРес.Колонки.Добавить("НеИзменятьЦены", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("НомерСтрокиДокумента", Число15_2);
			
	Если ГруппироватьПоПозициям Тогда
		ТаблСтоимРес.Колонки.Добавить("Позиция", Новый ОписаниеТипов("ДокументСсылка.СМ_ПозицияЛокальнойСметы"));	
	КонецЕсли;
	
	Если ГруппироватьПоСмете Тогда
		ТаблСтоимРес.Колонки.Добавить("Смета", Новый ОписаниеТипов("ДокументСсылка.СМ_ЛокальнаяСмета"));	
	КонецЕсли;

	СписокПозицийОтбор = Новый СписокЗначений();
	Если Таблица Тогда
		СписокПозицийОтбор.ЗагрузитьЗначения(СписокПозиций.Выгрузить().ВыгрузитьКолонку("Позиция"));	 
	Иначе
		СписокПозицийОтбор = СписокПозиций;
	КонецЕсли;
	
	ТаблПоправок = ПолучитьПоправки(СписокПозицийОтбор,Ложь);
	
	Если ТолькоФактическиеРесурсы Тогда
		// Получим отминусованные.
		ТабМинусовых = ПолучитьМинусовые(СписокПозицийОтбор);
	КонецЕсли;
	
	Для каждого ПозицияЭл Из СписокПозицийОтбор Цикл  		
		
		Позиция = ПозицияЭл.Значение;
		
		Если (ТипЗнч(Позиция) <> Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы")) Тогда
			Продолжить;	
		КонецЕсли;
		
		Если Позиция.ОбъемРабот < 0 И ТолькоФактическиеРесурсы И Позиция.Определитель.ВидРасценки <> Перечисления.СМ_ВидыРасценки.Работа Тогда
			Продолжить;
		КонецЕсли;
		
		//Если Позиция.ИдСметы.МетодикаТСН Тогда
		Если Позиция.ИдСметы.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_МетодикаТСНГородаМосква Тогда
			// Применим ЗУ.
			ПрименитьЗУНормамМат = Позиция.ИдСметы.ПрименитьЗУНормамМат;
			ПрименитьЗУНормамМаш = Позиция.ИдСметы.ПрименитьЗУНормамМаш;
			ПрименитьЗУТрудРабочих =  Позиция.ИдСметы.ПрименитьЗУТрудРабочих;
			ПрименитьЗУТрудМашинистов = Позиция.ИдСметы.ПрименитьЗУТрудМашинистов;
			ТипСтроительстваРемонт = (Позиция.ИдСметы.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт);
		Иначе
			ПрименитьЗУНормамМат = Ложь;
			ПрименитьЗУНормамМаш = Ложь;
			ПрименитьЗУТрудРабочих =  Ложь;
			ПрименитьЗУТрудМашинистов = Ложь;
			ТипСтроительстваРемонт = Ложь;
		КонецЕсли;			
		
		Для каждого СтрокаРесурса Из Позиция.РесурсыПозицииЛокальнойСметы Цикл
			
			Если СтрокаРесурса.ТипМатериала = Перечисления.СМ_ТипыМатериалов.НеУчтенный ИЛИ СтрокаРесурса.ТипМатериала = Перечисления.СМ_ТипыМатериалов.ПоПроекту ИЛИ СтрокаРесурса.Удален Тогда
				Продолжить;	
			КонецЕсли;
			
			Количество = СтрокаРесурса.НормаРасхода * ?(ЗначениеЗаполнено(СтрокаРесурса.КоэффициентКРасходуРесурсов),СтрокаРесурса.КоэффициентКРасходуРесурсов,1);
			
			ОтборПоправок = Новый Структура();
			ОтборПоправок.Вставить("Позиция", Позиция); 
			МассивПоправок = ТаблПоправок.НайтиСтроки(ОтборПоправок);
			
			Для каждого СтрокаТаблПоправок Из МассивПоправок Цикл
				Если СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда	
					Количество = Количество * СтрокаТаблПоправок.КоэффициентКТрудозатратамРабочих;	
				ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда	
					Количество = Количество * СтрокаТаблПоправок.КоэффициентКТрудозатратамМашинистов;	
				ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда	
					Количество = Количество * СтрокаТаблПоправок.КоэффициентКСтоимостиМатериалов;	
				ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда	
					Количество = Количество * СтрокаТаблПоправок.КоэффициентКЭксплуатацииМашин;	
				КонецЕсли;
			КонецЦикла;
			
			// Умножать если не 0. 
			Если ТипСтроительстваРемонт Тогда
				ЗимнееУдорож = ?(Позиция.ЗимнееУдорожРемонт = 0,1,Позиция.ЗимнееУдорожРемонт);
				ЗимнееУдорожМатериал = ?(Позиция.ЗимнееУдорожМатериалРемонт = 0,1,Позиция.ЗимнееУдорожМатериалРемонт);
			Иначе
				ЗимнееУдорож = ?(Позиция.ЗимнееУдорож = 0,1,Позиция.ЗимнееУдорож);
				ЗимнееУдорожМатериал = ?(Позиция.ЗимнееУдорожМатериал = 0,1,Позиция.ЗимнееУдорожМатериал);
			КонецЕсли;
			
			Если ПрименитьЗУТрудРабочих И СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				Количество = Количество * ЗимнееУдорож;
			КонецЕсли;
			
			Если ПрименитьЗУТрудМашинистов И СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
				Количество = Количество * ЗимнееУдорож;
			КонецЕсли;
			
			Если ПрименитьЗУНормамМаш И СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				Количество = Количество * ЗимнееУдорож;
			КонецЕсли;
			
			Если ПрименитьЗУНормамМат И СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
				Количество = Количество * ЗимнееУдорожМатериал;
			КонецЕсли;
			
			Если ТолькоФактическиеРесурсы Тогда
				// Отсеим отминусованные.
				Пропускаем = Ложь;
				Если ТабМинусовых.Количество() > 0 Тогда
					Отбор = Новый Структура();
					Отбор.Вставить("ИДВладельца", Позиция);
					Отбор.Вставить("ШифрРасценки", СтрокаРесурса.СметныйКодРесурса);
					МассивМинусовых = ТабМинусовых.НайтиСтроки(Отбор);
					Для Каждого СтрМинус Из МассивМинусовых Цикл
						Если -1*СтрМинус.ОбъемРабот = Количество * Позиция.ОбъемРабот Тогда
							Пропускаем = Истина;
							Прервать;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
				Если Пропускаем Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаТаблСтоимРес 				= ТаблСтоимРес.Добавить();
			СтрокаТаблСтоимРес.Ресурс 		= СтрокаРесурса.Ресурс;
			СтрокаТаблСтоимРес.КодРесурса 	= ?(ЗначениеЗаполнено(СтрокаРесурса.Ресурс),СтрокаРесурса.Ресурс.Код,СтрокаРесурса.СметныйКодРесурса);
			СтрокаТаблСтоимРес.ВидРесурса 	= СтрокаРесурса.ВидРесурса;
			СтрокаТаблСтоимРес.НаименованиеРесурса = ?(БезНомераСтроки,СтрокаРесурса.НаименованиеРесурса,Строка(СтрокаРесурса.НомерСтроки)+" "+СтрокаРесурса.НаименованиеРесурса);
			СтрокаТаблСтоимРес.ЕдиницаИзмеренияРесурса = СтрокаРесурса.Ресурс.ЕдиницаИзмерения;
			СтрокаТаблСтоимРес.НомерСтрокиДокумента = ?(БезНомераСтроки,0,СтрокаРесурса.НомерСтроки);
			СтрокаТаблСтоимРес.НормаРасхода = СтрокаРесурса.НормаРасхода;
			СтрокаТаблСтоимРес.Количество = Количество;
			СтрокаТаблСтоимРес.РасходПоНорме = Количество * Позиция.ОбъемРабот;
			СтрокаТаблСтоимРес.РасходПоФакту = Количество * Позиция.ОбъемРабот;
			СтрокаТаблСтоимРес.ЦенаБазисная = СтрокаРесурса.БазиснаяЦена;
			СтрокаТаблСтоимРес.ЦенаЗМБазисная = СтрокаРесурса.БазиснаяЗарплатаМашинистов;
			СтрокаТаблСтоимРес.СтоимостьБазисная = Количество * СтрокаРесурса.БазиснаяЦена;
			СтрокаТаблСтоимРес.СтоимостьЗМБазисная = Количество * СтрокаРесурса.БазиснаяЗарплатаМашинистов;
			СтрокаТаблСтоимРес.ЦенаТекущая = СтрокаРесурса.ТекущаяЦена;
			СтрокаТаблСтоимРес.ЦенаТекущаяЗМ = СтрокаРесурса.ТекущаяЗарплатаМашинистов;
			СтрокаТаблСтоимРес.СтоимостьТекущая = Количество * СтрокаРесурса.ТекущаяЦена;
			Если Константы.СМ_РасчетСтоимостиВспомогательныхМатериаловОЗМонтажников.Получить() = Истина Тогда
				Если СтрокаРесурса.СметныйКодРесурса = Константы.СМ_ВспомогательныеМатериалы.Получить().Код Тогда
					СтрокаТаблСтоимРес.СтоимостьТекущая = СМ_СметаРасчетРесурсныйСервер.РассчитатьСтоимостьВспомогательных(Позиция.Ссылка, Позиция.РесурсыПозицииЛокальнойСметы);  
				КонецЕсли;
			КонецЕсли;
			СтрокаТаблСтоимРес.СтоимостьТекущаяЗМ = Количество * СтрокаРесурса.ТекущаяЗарплатаМашинистов;
			СтрокаТаблСтоимРес.ЭтоУчтенный = Истина;
			СтрокаТаблСтоимРес.ЭтоНеучтенный = Ложь;
			СтрокаТаблСтоимРес.ЭтоОборудование = Ложь;
			СтрокаТаблСтоимРес.Картинка = СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(СтрокаРесурса.ТипМатериала, СтрокаРесурса.ВидРесурса);
			СтрокаТаблСтоимРес.СтатусРесурса  = СтрокаРесурса.СтатусРесурса;
			СтрокаТаблСтоимРес.НеИзменятьЦены  = СтрокаРесурса.НеИзменятьЦены;
			Если ГруппироватьПоПозициям Тогда
				СтрокаТаблСтоимРес.Позиция = Позиция;
			КонецЕсли;
			
			Если ГруппироватьПоСмете Тогда
				СтрокаТаблСтоимРес.Смета = Позиция.ИдСметы;
			КонецЕсли;
			
			// Сортировка (обязательно по убыванию, таким образом все ресурсы, 
			// которые не обрабатываются будут попадать вниз, т.к. значение = "0").
			Если СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 3;	
			ИначеЕсли СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 2;	
			ИначеЕсли СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 1;	
			КонецЕсли;
			
		КонецЦикла;
		
		Если Позиция.РесурсыПозицииЛокальнойСметы.Количество() = 0
			И (Позиция.Определитель.ВидРасценки =  Перечисления.СМ_ВидыРасценки.Материал
			ИЛИ Позиция.Определитель.ВидРасценки =  Перечисления.СМ_ВидыРасценки.Оборудование) Тогда
			
			СтрокаТаблСтоимРес = ТаблСтоимРес.Добавить();
			СтрокаТаблСтоимРес.СтатусРесурса  = Позиция.СтатусРесурса;	
			СтрокаТаблСтоимРес.НеИзменятьЦены  = Позиция.НеИзменятьЦены;
			СтрокаТаблСтоимРес.КодРесурса = Позиция.ШифрРасценки;
			СтрокаТаблСтоимРес.НаименованиеРесурса = Позиция.Наименование;
			СтрокаТаблСтоимРес.ЕдиницаИзмеренияРесурса = Позиция.ЕдиницаИзмерения;
			СтрокаТаблСтоимРес.Ресурс = Справочники.СМ_Ресурсы.ПустаяСсылка();
			
			СтрокаТаблСтоимРес.НормаРасхода = 1;

			ЭтоМатериал =  (Позиция.Определитель.ВидРасценки =  Перечисления.СМ_ВидыРасценки.Материал);
			СтрокаТаблСтоимРес.ВидРесурса = ?(ЭтоМатериал, ?(Позиция.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаЭксплуатациюМашин, Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы, Перечисления.СМ_ВидыРесурсов.Материалы), Перечисления.СМ_ВидыРесурсов.Оборудование);
			
			ВремКоличество = СтрокаТаблСтоимРес.НормаРасхода;
			
			Для каждого СтрокаПоправки Из Позиция.ПоправкиПозиции Цикл
				Если СтрокаПоправки.КоэффСМ <> 0 И ЭтоМатериал Тогда
					ВремКоличество = ВремКоличество * СтрокаПоправки.КоэффСМ; 
				КонецЕсли;
				Если СтрокаПоправки.КоэффПЗ <> 0 Тогда
					ВремКоличество = ВремКоличество * СтрокаПоправки.КоэффПЗ; 
				КонецЕсли;
			КонецЦикла;	
			
			Если ПрименитьЗУТрудРабочих И СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				ВремКоличество = ВремКоличество * ?(ТипСтроительстваРемонт, Позиция.ЗимнееУдорожРемонт, Позиция.ЗимнееУдорож);
			КонецЕсли;
			
			Если ПрименитьЗУТрудМашинистов И СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
				ВремКоличество = ВремКоличество * ?(ТипСтроительстваРемонт, Позиция.ЗимнееУдорожРемонт, Позиция.ЗимнееУдорож);
			КонецЕсли;
			
			Если ПрименитьЗУНормамМаш И СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				ВремКоличество = ВремКоличество * ?(ТипСтроительстваРемонт, Позиция.ЗимнееУдорожРемонт, Позиция.ЗимнееУдорож);
			КонецЕсли;
			
			Если ПрименитьЗУНормамМат И СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
				ВремКоличество = ВремКоличество * ?(ТипСтроительстваРемонт, Позиция.ЗимнееУдорожМатериалРемонт, Позиция.ЗимнееУдорожМатериал);
			КонецЕсли;

			СтрокаТаблСтоимРес.Количество = ВремКоличество;
			
			СтрокаТаблСтоимРес.РасходПоНорме = ВремКоличество * Позиция.ОбъемРабот;
						
			СтрокаТаблСтоимРес.РасходПоФакту = ВремКоличество * Позиция.ОбъемРабот;
			
			Если ЭтоМатериал Тогда
				СтрокаТаблСтоимРес.ЦенаБазисная = Позиция.СтоимМатериалов;
				СтрокаТаблСтоимРес.ЦенаЗМБазисная = 0; 
				СтрокаТаблСтоимРес.СтоимостьБазисная = ВремКоличество * Позиция.ПрямЗатраты;
				СтрокаТаблСтоимРес.СтоимостьЗМБазисная = 0;
			Иначе
				СтрокаТаблСтоимРес.ЦенаБазисная = Позиция.Оборудование;
				СтрокаТаблСтоимРес.ЦенаЗМБазисная = 0; 
				СтрокаТаблСтоимРес.СтоимостьБазисная = ВремКоличество * Позиция.Оборудование;
				СтрокаТаблСтоимРес.СтоимостьЗМБазисная = 0;
			КонецЕсли;
			
			СтрокаТаблСтоимРес.ЦенаТекущая = Позиция.ТекущаяЦена;
			СтрокаТаблСтоимРес.ЦенаТекущаяЗМ = 0;

			СтрокаТаблСтоимРес.СтоимостьТекущая = ВремКоличество * Позиция.ТекущаяЦена;
			СтрокаТаблСтоимРес.СтоимостьТекущаяЗМ = 0;
			
			СтрокаТаблСтоимРес.ЭтоУчтенный = Ложь;
			СтрокаТаблСтоимРес.ЭтоНеучтенный = (Позиция.Определитель.ВидРасценки <> Перечисления.СМ_ВидыРасценки.Оборудование);
			СтрокаТаблСтоимРес.ЭтоОборудование = (Позиция.Определитель.ВидРасценки =  Перечисления.СМ_ВидыРасценки.Оборудование);
			// Тут только неучтенные и оборудование.
			СтрокаТаблСтоимРес.Картинка = СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(?(СтрокаТаблСтоимРес.ЭтоНеучтенный, Перечисления.СМ_ТипыМатериалов.НеУчтенный, Перечисления.СМ_ТипыМатериалов.Учтенный), СтрокаТаблСтоимРес.ВидРесурса);

			Если ГруппироватьПоПозициям Тогда
				СтрокаТаблСтоимРес.Позиция = Позиция;
			КонецЕсли;
			
			Если ГруппироватьПоСмете Тогда
				СтрокаТаблСтоимРес.Смета = Позиция.ИдСметы;
			КонецЕсли;
			
			СтрокаТаблСтоимРес.НомерСтрокиДокумента = ?(БезНомераСтроки,0,СМ_СметаВызовСервера.ПолучитьНомерДокумента(Позиция,"СМ_ПозицияЛокальнойСметы"));
						
			// Сортировка (обязательно по убыванию, таким образом все ресурсы, 
			// которые не обрабатываются будут попадать вниз, т.к. значение = "0").
			Если СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 3;	
			ИначеЕсли СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 2;	
			ИначеЕсли СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 1;	
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Если СвернутьТаблицу Тогда
		ТаблСтоимРес.Свернуть("Ресурс, КодРесурса, ВидРесурса, НаименованиеРесурса, ЕдиницаИзмеренияРесурса, ЭтоУчтенный, ЭтоНеучтенный, ЭтоОборудование, ЦенаБазисная, ЦенаЗМБазисная, ЦенаТекущая, ЦенаТекущаяЗМ, Картинка,НеИзменятьЦены " + ?(ГруппироватьПоПозициям, ", Позиция", "")+?(ГруппироватьПоСмете, ", Смета", "")+?(ГруппироватьСтатусы, ", СтатусРесурса", ""), "Количество, РасходПоНорме, РасходПоФакту, СтоимостьБазисная, СтоимостьЗМБазисная, СтоимостьТекущая, СтоимостьТекущаяЗМ");   
		Если (Не УчитыватьЦеныПриГруппировке) Тогда
			ТаблСтоимРес = ?(ГруппироватьСтатусы,ПолучитьТаблицуБезГруппировкиПоЦенамСтатусы(ТаблСтоимРес),ПолучитьТаблицуБезГруппировкиПоЦенам(ТаблСтоимРес));		
		КонецЕсли;
		ТаблСтоимРес.Сортировать("ЭтоНеучтенный, ЭтоОборудование, ВидРесурса, КодРесурса");	
	КонецЕсли; 
	
	Для каждого стр Из ТаблСтоимРес Цикл
		стр.КодРесурса 			= СокрЛП(стр.КодРесурса);
		стр.НаименованиеРесурса = СокрЛП(стр.НаименованиеРесурса);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ТаблСтоимРес;
	
КонецФункции

// Возвращает таблицу со сведениями о ресурсах Акта (сводную или нет).
// ВАЖНО! Нельзя одновременно не учитывать цену при группировке и группировать по позициям, Если цена не учитывается -
// то группировка по позициям теряется.
//
// Параметры:
//     Акт 							- ДокументСсылка.СМ_АктыВыполненныхРабот - Акт для которого формируется список ресурсов.
//     СвернутьТаблицу 				- Булево - сводная таблица или нет.
//     ОтборПозицийСписок 			- СписокЗначений - содержит элементы для отбора позиций в акте.
//     УчитыватьЦеныПриГруппировке 	- Булево - если Ложь, то ресурсы группируются без учета цен, так же добавляется
//                                             колонка с проверкой отклонения.
//     ГруппироватьПоПозициям 		- Булево - если Истина, то в итоговой колонке будет Позиция, иначе будет
//                                             сводная таблица.
//     БезНомераСтроки				- Булево - включать или нет номер строки в наименование ресурса.
//     ГруппироватьПоСмете          - Булево - если Истина то будет добавлена колонка "смета" с группировкой по ней. 
//	   ГруппироватьСтатусы          - Булево - группировать или нет данные по статусам ресурсов сметы и акта.
//	   ГруппироватьНеИзменятьЦены   - Булево - изменять или нет цены при группировке.
//	   ДетализацияОтклонения        - Булево - группировать или нет данные по варианту отклонения.
//	   ЗаменыРесурсов				- Булево - если Истина, то в итоговой таблице будут включены все замены ресурсов по позициям.
//
// Возвращаемое значение:
//     ТаблСтоимРес - ТаблицаЗначений - содержит ресурсы акта, согласно переданным параметрам.
//
Функция ПолучитьТаблицуСтоимостиРесурсовАкта(Акт, СвернутьТаблицу = Ложь, ОтборПозицийСписок = Неопределено, УчитыватьЦеныПриГруппировке = Истина, ГруппироватьПоПозициям = Ложь,БезНомераСтроки = Ложь,ГруппироватьПоСмете = Ложь,ГруппироватьСтатусы = Ложь,ГруппироватьНеИзменятьЦены = Ложь, ДетализацияОтклонения = Ложь, ЗаменыРесурсов = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	СписокПозиций = Новый СписокЗначений();
	Если ОтборПозицийСписок = Неопределено Тогда
		СписокПозиций.ЗагрузитьЗначения(Акт.Позиции.Выгрузить(,"Позиция").ВыгрузитьКолонку("Позиция"));
	Иначе
		СписокПозиций = ОтборПозицийСписок;
	КонецЕсли;
	
	ТаблицаБазисныхЦен = СМ_СметаВызовСервера.ПолучитьСписокВсехРесурсовПозиций(СписокПозиций, , ИСТИНА);	
	
	Таблица = (ТипЗнч(СписокПозиций) <> Тип("СписокЗначений"));
	
	СтрокаТип = Новый ОписаниеТипов("Строка");
	ПараметрыЧисла = Новый КвалификаторыЧисла(15, 6);
	Число15_6 = Новый ОписаниеТипов("Число", , ПараметрыЧисла);
	ПараметрыЧисла = Новый КвалификаторыЧисла(15, 2);
	Число15_2 = Новый ОписаниеТипов("Число", , ПараметрыЧисла);
	ПараметрыЧисла = Новый КвалификаторыЧисла(1,0);
	Число1_0 = Новый ОписаниеТипов("Число",,ПараметрыЧисла);
	
	ТаблСтоимРес = Новый ТаблицаЗначений();
	ТаблСтоимРес.Колонки.Добавить("КодРесурса", СтрокаТип);
	ТаблСтоимРес.Колонки.Добавить("Ресурс", Новый ОписаниеТипов("СправочникСсылка.СМ_Ресурсы"));
	ТаблСтоимРес.Колонки.Добавить("ВидРесурса", Новый ОписаниеТипов("ПеречислениеСсылка.СМ_ВидыРесурсов"));
	ТаблСтоимРес.Колонки.Добавить("НаименованиеРесурса", СтрокаТип);
	ТаблСтоимРес.Колонки.Добавить("ЕдиницаИзмеренияРесурса", Новый ОписаниеТипов("СправочникСсылка.СМ_ЕдиницыИзмеренияСмета"));
	ТаблСтоимРес.Колонки.Добавить("НормаРасхода", Число15_6);
	ТаблСтоимРес.Колонки.Добавить("Количество", Число15_6);
	ТаблСтоимРес.Колонки.Добавить("РасходПоНорме", Число15_6);
	ТаблСтоимРес.Колонки.Добавить("РасходПоФакту", Число15_6);
	ТаблСтоимРес.Колонки.Добавить("ЦенаБазисная", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("ЦенаЗМБазисная", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("СтоимостьБазисная", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("СтоимостьЗМБазисная", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("ЦенаТекущая", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("ЦенаТекущаяЗМ", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("СтоимостьТекущая", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("СтоимостьТекущаяЗМ", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("ЭтоУчтенный", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("ЭтоНеучтенный", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("ЭтоОборудование", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("Картинка", Число1_0);
	ТаблСтоимРес.Колонки.Добавить("Сортировка1", Новый ОписаниеТипов("Число"));
	Если ГруппироватьПоПозициям Тогда
		ТаблСтоимРес.Колонки.Добавить("Позиция", Новый ОписаниеТипов("ДокументСсылка.СМ_ПозицияЛокальнойСметы"));	
		ТаблСтоимРес.Колонки.Добавить("ФактОбъем", Число15_2);	
	КонецЕсли;
	Если ГруппироватьПоСмете Тогда
		ТаблСтоимРес.Колонки.Добавить("Смета", Новый ОписаниеТипов("ДокументСсылка.СМ_ЛокальнаяСмета"));	
	КонецЕсли;
	ТаблСтоимРес.Колонки.Добавить("СтатусРесурса", Новый ОписаниеТипов("ПеречислениеСсылка.СМ_ОбеспечениеРесурса"));
	ТаблСтоимРес.Колонки.Добавить("ИзмененФактРасход", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("НеИзменятьЦены", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("ВариантОтклонения", Новый ОписаниеТипов("ПеречислениеСсылка.СМ_ВариантыОтклоненияНормы"));
	ТаблСтоимРес.Колонки.Добавить("ВариантПревышения", Новый ОписаниеТипов("ПеречислениеСсылка.СМ_ВариантыСписанияПревышения"));
	ТаблСтоимРес.Колонки.Добавить("КомментарийКФайлу", СтрокаТип);	
	ТаблСтоимРес.Колонки.Добавить("НомерСтрокиДокумента", Число15_2);
	ТаблСтоимРес.Колонки.Добавить("Заменен", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("ЭтоЗамена", Новый ОписаниеТипов("Булево"));
	ТаблСтоимРес.Колонки.Добавить("СортировкаЗамен", Число1_0);
	
	Если ЗаменыРесурсов Тогда
		СписокАктов = Новый СписокЗначений();
		СписокАктов.Добавить(Акт.Ссылка);
		ТаблицаПредыдущихЗамен 		= СМ_СметаВызовСервера.ПолучитьЗамененныеРесурсыАктов(СписокАктов); 
		СписокЗамененныхРесурсов 	= Новый Соответствие;
	КонецЕсли;

	ТаблПоправок = ПолучитьПоправки(СписокПозиций,Ложь); 
	
	//Если Акт.ЛокальнаяСмета.МетодикаТСН Тогда
	Если Акт.ЛокальнаяСмета.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_МетодикаТСНГородаМосква Тогда
		// Применим ЗУ.
		ПрименитьЗУНормамМат 		= Акт.ЛокальнаяСмета.ПрименитьЗУНормамМат;
		ПрименитьЗУНормамМаш 		= Акт.ЛокальнаяСмета.ПрименитьЗУНормамМаш;
		ПрименитьЗУТрудРабочих 		= Акт.ЛокальнаяСмета.ПрименитьЗУТрудРабочих;
		ПрименитьЗУТрудМашинистов 	= Акт.ЛокальнаяСмета.ПрименитьЗУТрудМашинистов;
		ТипСтроительстваРемонт 		= (Акт.ЛокальнаяСмета.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт);
	Иначе
		ПрименитьЗУНормамМат 		= Ложь;
		ПрименитьЗУНормамМаш 		= Ложь;
		ПрименитьЗУТрудРабочих 		= Ложь;
		ПрименитьЗУТрудМашинистов 	= Ложь;
		ТипСтроительстваРемонт 		= Ложь;
	КонецЕсли;
	
	СортировкаЗамен = 1;
	
	Для Каждого СтрокаПозицииАкта Из Акт.Позиции Цикл
		
		Позиция = СтрокаПозицииАкта.Позиция;
		
		Если (СписокПозиций.НайтиПоЗначению(Позиция) = Неопределено) Тогда
			Продолжить;	
		КонецЕсли;
		
		МассивНужныхСтрок 		= СМ_СметаВызовСервера.МассивСтрокРесурсовПозицииАкта(Акт, Позиция);
		СчЗамен 				= 0;
		
		Для Каждого СтрокаРесурса Из МассивНужныхСтрок Цикл
		
			Если СтрокаРесурса.ТипМатериала = Перечисления.СМ_ТипыМатериалов.НеУчтенный ИЛИ СтрокаРесурса.ТипМатериала = Перечисления.СМ_ТипыМатериалов.ПоПроекту ИЛИ СтрокаРесурса.Удален Тогда
				Продолжить;	
			КонецЕсли;
			
			Отбор = Новый Структура();
			Отбор.Вставить("Позиция", СтрокаРесурса.Позиция);
			Отбор.Вставить("Ресурс", СтрокаРесурса.Ресурс);
			
			МассивБЦ = ТаблицаБазисныхЦен.НайтиСтроки(Отбор);
			
			БазиснаяЦена = СтрокаРесурса.БазиснаяЦена;	
			БазиснаяЗарплатаМашинистов = СтрокаРесурса.БазиснаяЗарплатаМашинистов;
			
			РасчетКоличества = Истина;
			Если МассивБЦ.Количество() Тогда
				НормаРасхода = МассивБЦ[0].НормаРасхода;
				КоэффРасхода = ?(ЗначениеЗаполнено(МассивБЦ[0].КоэффициентКРасходуРесурсов),МассивБЦ[0].КоэффициентКРасходуРесурсов,1);
			Иначе
				// Это новый ресурс, которым заменяем.
				// Есть введенная пользователем норма расхода на объем.
				НормаРасходаНаОбъем = СтрокаРесурса.НормаРасходаОбъем;
				РасчетКоличества 	= Ложь;
				
				Если СтрокаПозицииАкта.ФактОбъем <> 0 Тогда
					Количество 		= НормаРасходаНаОбъем  / СтрокаПозицииАкта.ФактОбъем;
					НормаРасхода 	= Количество  / СтрокаПозицииАкта.ФактОбъем;
				Иначе
					НормаРасхода 	= 0;
					Количество 		= 0;
				КонецЕсли;
				КоэффРасхода = 1;
			КонецЕсли;
			
			Если (СтрокаПозицииАкта<>Неопределено) Тогда 
				// ФактОбъем может быть равен 0.
				ФактОбъем = СтрокаПозицииАкта.ФактОбъем;
			Иначе
				ФактОбъем = 0;
			КонецЕсли;
			
			Если РасчетКоличества Тогда
				ОтборПоправок = Новый Структура();
				ОтборПоправок.Вставить("Позиция", СтрокаРесурса.Позиция); 
				МассивПоправок = ТаблПоправок.НайтиСтроки(ОтборПоправок);
				
				Количество = НормаРасхода * КоэффРасхода;
				
				Для каждого СтрокаТаблПоправок Из МассивПоправок Цикл
					Если СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда	
						Количество = Количество * СтрокаТаблПоправок.КоэффициентКТрудозатратамРабочих;	
					ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда	
						Количество = Количество * СтрокаТаблПоправок.КоэффициентКТрудозатратамМашинистов;	
					ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда	
						Количество = Количество * СтрокаТаблПоправок.КоэффициентКСтоимостиМатериалов;	
					ИначеЕсли СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда	
						Количество = Количество * СтрокаТаблПоправок.КоэффициентКЭксплуатацииМашин;	
					КонецЕсли;
				КонецЦикла;
			
				Если ПрименитьЗУТрудРабочих И СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
					Количество = Количество * ?(ТипСтроительстваРемонт, СтрокаПозицииАкта.ЗимнееУдорожРемонт, СтрокаПозицииАкта.ЗимнееУдорож);
				КонецЕсли;
				
				Если ПрименитьЗУТрудМашинистов И СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
					Количество = Количество * ?(ТипСтроительстваРемонт, СтрокаПозицииАкта.ЗимнееУдорожРемонт, СтрокаПозицииАкта.ЗимнееУдорож);
				КонецЕсли;
				
				Если ПрименитьЗУНормамМаш И СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
					Количество = Количество * ?(ТипСтроительстваРемонт, СтрокаПозицииАкта.ЗимнееУдорожРемонт, СтрокаПозицииАкта.ЗимнееУдорож);
				КонецЕсли;
				
				Если ПрименитьЗУНормамМат И СтрокаРесурса.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
					Количество = Количество * ?(ТипСтроительстваРемонт, СтрокаПозицииАкта.ЗимнееУдорожМатериалРемонт, СтрокаПозицииАкта.ЗимнееУдорожМатериал);
				КонецЕсли;
			КонецЕсли;
			
			СтрокаТаблСтоимРес 			= ТаблСтоимРес.Добавить();
			СтрокаТаблСтоимРес.Ресурс 	= СтрокаРесурса.Ресурс;
			
			Попытка
				СтрокаТаблСтоимРес.КодРесурса 				= ?(ЗначениеЗаполнено(СтрокаРесурса.Ресурс),СтрокаРесурса.Ресурс.Код,СтрокаРесурса.СметныйКодРесурса);
				СтрокаТаблСтоимРес.ЕдиницаИзмеренияРесурса 	= СтрокаРесурса.Ресурс.ЕдиницаИзмерения;
			Исключение
				СтрокаТаблСтоимРес.КодРесурса = СтрокаРесурса.СметныйКодРесурса;
			КонецПопытки;
						
			СтрокаТаблСтоимРес.ВидРесурса 			= СтрокаРесурса.ВидРесурса;
			СтрокаТаблСтоимРес.НаименованиеРесурса 	= ?(БезНомераСтроки,СтрокаРесурса.НаименованиеРесурса,Строка(СтрокаРесурса.НомерСтроки)+" "+СтрокаРесурса.НаименованиеРесурса);
			СтрокаТаблСтоимРес.НомерСтрокиДокумента = ?(БезНомераСтроки,0,СтрокаРесурса.НомерСтрокиДокумента);
			СтрокаТаблСтоимРес.НормаРасхода 		= НормаРасхода;
			СтрокаТаблСтоимРес.Количество 			= Количество;
			СтрокаТаблСтоимРес.РасходПоФакту 		= СтрокаРесурса.ФактРасходаОбъем;
			СтрокаТаблСтоимРес.РасходПоНорме		= СтрокаРесурса.НормаРасходаОбъем;
			СтрокаТаблСтоимРес.ЦенаБазисная 		= БазиснаяЦена;
			СтрокаТаблСтоимРес.ЦенаЗМБазисная 		= БазиснаяЗарплатаМашинистов;
			СтрокаТаблСтоимРес.СтоимостьБазисная 	= СтрокаРесурса.ФактРасходаОбъем * БазиснаяЦена;
			СтрокаТаблСтоимРес.СтоимостьЗМБазисная 	= СтрокаРесурса.ФактРасходаОбъем * БазиснаяЗарплатаМашинистов;
			СтрокаТаблСтоимРес.ЦенаТекущая 			= СтрокаРесурса.ТекущаяЦена;
			СтрокаТаблСтоимРес.ЦенаТекущаяЗМ 		= СтрокаРесурса.ТекущаяЗарплатаМашинистов;
			СтрокаТаблСтоимРес.СтоимостьТекущая 	= СтрокаРесурса.ФактРасходаОбъем * СтрокаРесурса.ТекущаяЦена;
			СтрокаТаблСтоимРес.СтоимостьТекущаяЗМ 	= СтрокаРесурса.ФактРасходаОбъем * СтрокаРесурса.ТекущаяЗарплатаМашинистов;
			СтрокаТаблСтоимРес.ЭтоУчтенный 			= Истина;
			СтрокаТаблСтоимРес.ЭтоНеучтенный 		= Ложь;
			СтрокаТаблСтоимРес.ЭтоОборудование 		= Ложь;
			СтрокаТаблСтоимРес.Картинка 			= СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(СтрокаРесурса.ТипМатериала, СтрокаРесурса.ВидРесурса);
			СтрокаТаблСтоимРес.СтатусРесурса  		= СтрокаРесурса.СтатусРесурса;
			СтрокаТаблСтоимРес.НеИзменятьЦены  		= СтрокаРесурса.НеИзменятьЦены;
			СтрокаТаблСтоимРес.ВариантОтклонения  	= СтрокаРесурса.ВариантОтклонения;
			СтрокаТаблСтоимРес.ВариантПревышения  	= СтрокаРесурса.ВариантСписанияПревышения;
			СтрокаТаблСтоимРес.КомментарийКФайлу  	= СтрокаРесурса.КомментарийКФайлу;
						
			Если ГруппироватьПоПозициям Тогда
				СтрокаТаблСтоимРес.Позиция = СтрокаРесурса.Позиция;
				СтрокаТаблСтоимРес.ФактОбъем = ФактОбъем;
			КонецЕсли;
			
			Если ГруппироватьПоСмете Тогда
				СтрокаТаблСтоимРес.Смета = СтрокаРесурса.Позиция.ИдСметы;	
			КонецЕсли;
			
			// Сортировка (обязательно по убыванию, таким образом все ресурсы, 
			// которые не обрабатываются будут попадать вниз, т.к. значение = "0").
			Если СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 3;	
			ИначеЕсли СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 2;	
			ИначеЕсли СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 1;	
			КонецЕсли;
			
			// ***********************************************************
			// ++ AVV Запрет изменения факт расхода.
			СтрокаТаблСтоимРес.ИзмененФактРасход = СтрокаРесурса.ИзмененФактРасход;
			// -- AVV 
			// ***********************************************************

			// ***********************************************************
			// ++ AVV Добавление в таблицу замененных ресурсов.
			Если ЗаменыРесурсов Тогда

				СтрокаТаблСтоимРес.ЭтоЗамена		= Ложь;
				СтрокаТаблСтоимРес.Заменен 			= Ложь;
				СтрокаТаблСтоимРес.СортировкаЗамен	= 0;
				
				// Предполагается что в таблице только незамененные ресурсы.
				// Замены ищем и добавляем в таблицу.
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Смета",Акт.Ссылка);
				СтруктураОтбора.Вставить("Позиция",Позиция);
				СтруктураОтбора.Вставить("НовыйРесурс",СтрокаРесурса.Ресурс);
				
				// Нашли строку замены, нужно добавить в таблицу ресурсов и все посчитать
				МассивСтрок = ТаблицаПредыдущихЗамен.НайтиСтроки(СтруктураОтбора);
				Если МассивСтрок.Количество() > 0 Тогда
					
					СтрокаСтарогоРесурса = МассивСтрок[0];
					
					НайденнаяСортировка = СписокЗамененныхРесурсов.Получить(СтрокаСтарогоРесурса.ЗамененныйРесурс); 
					Если НайденнаяСортировка = Неопределено Тогда
						СортировкаЗамен			= СортировкаЗамен + 2;
						СортировкаПодчиненных 	= СортировкаЗамен + 1;
						СписокЗамененныхРесурсов.Вставить(СтрокаСтарогоРесурса.ЗамененныйРесурс,СортировкаЗамен);
					Иначе
						СортировкаЗамен 		= НайденнаяСортировка;
						СортировкаПодчиненных 	= СортировкаЗамен + 1;
					КонецЕсли;
					
					СтрокаТаблСтоимРес2 						= ТаблСтоимРес.Добавить();
					СтрокаТаблСтоимРес2.Ресурс 					= СтрокаСтарогоРесурса.ЗамененныйРесурс;
					СтрокаТаблСтоимРес2.КодРесурса				= СтрокаСтарогоРесурса.ЗамененныйРесурс.Код;
					СтрокаТаблСтоимРес2.ВидРесурса				= СтрокаРесурса.ВидРесурса;
					СтрокаТаблСтоимРес2.НаименованиеРесурса 	= СтрокаСтарогоРесурса.ЗамененныйРесурс.Наименование;
					СтрокаТаблСтоимРес2.ЕдиницаИзмеренияРесурса	= СтрокаСтарогоРесурса.ЗамененныйРесурс.ЕдиницаИзмерения;
					СтрокаТаблСтоимРес2.НормаРасхода			= СтрокаСтарогоРесурса.НормаРасходаСтарогоМатериала;
					СтрокаТаблСтоимРес2.Количество				= Количество;
					СтрокаТаблСтоимРес2.РасходПоНорме			= Количество * ФактОбъем;
					СтрокаТаблСтоимРес2.ЦенаБазисная			= СтрокаСтарогоРесурса.БазиснаяЦенаСтарогоМатериала;
					СтрокаТаблСтоимРес2.ЦенаЗМБазисная			= СтрокаСтарогоРесурса.БазисЗарплМашСтарРесурс;
					СтрокаТаблСтоимРес2.ЦенаТекущая				= СтрокаСтарогоРесурса.ТекущаяЦенаСтарогоМатериала;
					СтрокаТаблСтоимРес2.ЦенаТекущаяЗМ			= СтрокаСтарогоРесурса.ТекЗарплМашСтарРесурс;
					СтрокаТаблСтоимРес2.ЭтоУчтенный				= Истина;
					СтрокаТаблСтоимРес2.ЭтоНеучтенный			= Ложь;
					СтрокаТаблСтоимРес2.ЭтоОборудование			= Ложь;
					СтрокаТаблСтоимРес2.Картинка 				= СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(СтрокаРесурса.ТипМатериала, СтрокаРесурса.ВидРесурса);
					СтрокаТаблСтоимРес2.СтатусРесурса  			= СтрокаРесурса.СтатусРесурса;
					СтрокаТаблСтоимРес2.НеИзменятьЦены  		= СтрокаРесурса.НеИзменятьЦены;
					СтрокаТаблСтоимРес2.ВариантОтклонения  		= СтрокаРесурса.ВариантОтклонения;
					СтрокаТаблСтоимРес2.ВариантПревышения  		= СтрокаРесурса.ВариантСписанияПревышения;
					СтрокаТаблСтоимРес2.КомментарийКФайлу  	    = СтрокаРесурса.КомментарийКФайлу;
					СтрокаТаблСтоимРес2.Заменен 				= Истина;
					СтрокаТаблСтоимРес2.ЭтоЗамена 				= Ложь;
					СтрокаТаблСтоимРес2.СортировкаЗамен 		= СортировкаЗамен;
				
					Если ГруппироватьПоПозициям Тогда
						СтрокаТаблСтоимРес2.Позиция = Позиция;
						СтрокаТаблСтоимРес2.ФактОбъем = ФактОбъем;
					КонецЕсли;
					
					Если ГруппироватьПоСмете Тогда
						СтрокаТаблСтоимРес2.Смета = Позиция.ИдСметы;	
					КонецЕсли;

					// Сортировка (обязательно по убыванию, таким образом все ресурсы, 
					// которые не обрабатываются будут попадать вниз, т.к. значение = "0").
					Если СтрокаТаблСтоимРес2.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
						СтрокаТаблСтоимРес2.Сортировка1	= 3;	
					ИначеЕсли СтрокаТаблСтоимРес2.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
						СтрокаТаблСтоимРес2.Сортировка1	= 2;	
					ИначеЕсли СтрокаТаблСтоимРес2.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
						СтрокаТаблСтоимРес2.Сортировка1	= 1;	
					КонецЕсли;
					
					// Заполнение значений в исходной строке замененные ресурса
					СтрокаТаблСтоимРес.СортировкаЗамен 	= СортировкаПодчиненных;
					СтрокаТаблСтоимРес.ЭтоЗамена 		= Истина;
					
				КонецЕсли;
			КонецЕсли;
			// -- AVV
			// **********************************************************************

		КонецЦикла;
		
		// Позиции - ресурсы
		Если Позиция.Расчет И Позиция.РесурсыПозицииЛокальнойСметы.Количество() = 0 И
			(Позиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал ИЛИ
			 Позиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Оборудование) Тогда
			
			СтрокаТаблСтоимРес 							= ТаблСтоимРес.Добавить();
			СтрокаТаблСтоимРес.КодРесурса 				= Позиция.ШифрРасценки;
			СтрокаТаблСтоимРес.НаименованиеРесурса 		= Позиция.Наименование;
			СтрокаТаблСтоимРес.ЕдиницаИзмеренияРесурса 	= Позиция.ЕдиницаИзмерения;
			СтрокаТаблСтоимРес.Ресурс 					= Справочники.СМ_Ресурсы.ПустаяСсылка();
			
			// ***********************************************************
			// ++ AVV Статусы ресурсов акта
			//СтрокаТаблСтоимРес.СтатусРесурса  		= ?(Позиция.СтатусРесурса.Пустая(),Перечисления.СМ_ОбеспечениеРесурса.Собственный,Позиция.СтатусРесурса);
			СтрокаТаблСтоимРес.СтатусРесурса			= ?(СтрокаПозицииАкта.СтатусРесурса.Пустая(), Перечисления.СМ_ОбеспечениеРесурса.Собственный,СтрокаПозицииАкта.СтатусРесурса); 
			// СтрокаТаблСтоимРес.СтатусРесурсаАкт 		= ?(Позиция.СтатусРесурсаАкт.Пустая(),Перечисления.СМ_ОбеспечениеРесурса.Собственный,Позиция.СтатусРесурсаАкт);
			// -- AVV 
			// ***********************************************************

			СтрокаТаблСтоимРес.НеИзменятьЦены  			= Позиция.НеИзменятьЦены;
			СтрокаТаблСтоимРес.НормаРасхода 			= 1;

			ЭтоМатериал = (Позиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Материал);
			СтрокаТаблСтоимРес.ВидРесурса = ?(ЭтоМатериал, ?(Позиция.ТипНормативныхСборников = Перечисления.СМ_ТипыНормативныхСборников.СметныеЦеныНаЭксплуатациюМашин, Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы, Перечисления.СМ_ВидыРесурсов.Материалы), Перечисления.СМ_ВидыРесурсов.Оборудование);
			
			ВремКоличество = СтрокаТаблСтоимРес.НормаРасхода;
			
			Для каждого СтрокаПоправки Из Позиция.ПоправкиПозиции Цикл
				Если СтрокаПоправки.КоэффСМ <> 0 И ЭтоМатериал Тогда
					ВремКоличество = ВремКоличество * СтрокаПоправки.КоэффСМ; 
				КонецЕсли;
				Если СтрокаПоправки.КоэффПЗ <> 0 Тогда
					ВремКоличество = ВремКоличество * СтрокаПоправки.КоэффПЗ; 
				КонецЕсли;
			КонецЦикла;	
			
			Если ПрименитьЗУТрудРабочих И СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				ВремКоличество = ВремКоличество * ?(ТипСтроительстваРемонт, Позиция.ЗимнееУдорожРемонт, Позиция.ЗимнееУдорож);
			КонецЕсли;
			
			Если ПрименитьЗУТрудМашинистов И СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
				ВремКоличество = ВремКоличество * ?(ТипСтроительстваРемонт, Позиция.ЗимнееУдорожРемонт, Позиция.ЗимнееУдорож);
			КонецЕсли;
			
			Если ПрименитьЗУНормамМаш И СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				ВремКоличество = ВремКоличество * ?(ТипСтроительстваРемонт, Позиция.ЗимнееУдорожРемонт, Позиция.ЗимнееУдорож);
			КонецЕсли;
			
			Если ПрименитьЗУНормамМат И СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
				ВремКоличество = ВремКоличество * ?(ТипСтроительстваРемонт, Позиция.ЗимнееУдорожМатериалРемонт, Позиция.ЗимнееУдорожМатериал);
			КонецЕсли;

			СтрокаТаблСтоимРес.Количество 		= ВремКоличество;
			СтрокаТаблСтоимРес.РасходПоНорме 	= СтрокаПозицииАкта.НормРасход; //ВремКоличество * СтрокаПозицииАкта.ФактОбъем;
			СтрокаТаблСтоимРес.РасходПоФакту 	= ВремКоличество * СтрокаПозицииАкта.ФактОбъем;
	
			Если ЭтоМатериал Тогда
				СтрокаТаблСтоимРес.ЦенаБазисная 		= Позиция.СтоимМатериалов;
				СтрокаТаблСтоимРес.ЦенаЗМБазисная 		= 0; 
				СтрокаТаблСтоимРес.СтоимостьБазисная 	= СтрокаПозицииАкта.ФактОбъем * Позиция.ПрямЗатраты;
				СтрокаТаблСтоимРес.СтоимостьЗМБазисная 	= 0;
			Иначе
				СтрокаТаблСтоимРес.ЦенаБазисная 		= Позиция.Оборудование;
				СтрокаТаблСтоимРес.ЦенаЗМБазисная 		= 0; 
				СтрокаТаблСтоимРес.СтоимостьБазисная 	= СтрокаПозицииАкта.ФактОбъем * Позиция.Оборудование;
				СтрокаТаблСтоимРес.СтоимостьЗМБазисная 	= 0;
			КонецЕсли;
			
			СтрокаТаблСтоимРес.ЦенаТекущая 			= СтрокаПозицииАкта.ТекущаяЦена;
			СтрокаТаблСтоимРес.ЦенаТекущаяЗМ 		= СтрокаПозицииАкта.ТекущаяЗарплатаМашинистов;

			СтрокаТаблСтоимРес.СтоимостьТекущая 	= СтрокаПозицииАкта.ФактОбъем * СтрокаПозицииАкта.ТекущаяЦена;
			СтрокаТаблСтоимРес.СтоимостьТекущаяЗМ 	= СтрокаПозицииАкта.ФактОбъем * СтрокаПозицииАкта.ТекущаяЗарплатаМашинистов;

			СтрокаТаблСтоимРес.ЭтоУчтенный 		= Ложь;
			СтрокаТаблСтоимРес.ЭтоНеучтенный 	= (Позиция.Определитель.ВидРасценки <> Перечисления.СМ_ВидыРасценки.Оборудование);
			СтрокаТаблСтоимРес.ЭтоОборудование 	= (Позиция.Определитель.ВидРасценки =  Перечисления.СМ_ВидыРасценки.Оборудование);
			
			// Тут только неучтенные и оборудование.
			СтрокаТаблСтоимРес.Картинка = СМ_СметаКлиентСервер.ПолучитьКартинкуРесурса(?(СтрокаТаблСтоимРес.ЭтоНеучтенный, Перечисления.СМ_ТипыМатериалов.НеУчтенный, Перечисления.СМ_ТипыМатериалов.Учтенный), СтрокаТаблСтоимРес.ВидРесурса);
			
			Если ГруппироватьПоПозициям Тогда
				СтрокаТаблСтоимРес.Позиция 		= Позиция;
				СтрокаТаблСтоимРес.ФактОбъем 	= СтрокаПозицииАкта.ФактОбъем;
			КонецЕсли;
			
			Если ГруппироватьПоСмете Тогда
				СтрокаТаблСтоимРес.Смета = Позиция.ИдСметы;	
			КонецЕсли;
			
			// Сортировка (обязательно по убыванию, таким образом все ресурсы, 
			// которые не обрабатываются будут попадать вниз, т.к. значение = "0").
			Если СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 3;	
			ИначеЕсли СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 2;	
			ИначеЕсли СтрокаТаблСтоимРес.ВидРесурса = Перечисления.СМ_ВидыРесурсов.Материалы Тогда
				СтрокаТаблСтоимРес.Сортировка1	= 1;	
			КонецЕсли;
			
			СтрокаТаблСтоимРес.НомерСтрокиДокумента = ?(БезНомераСтроки,0,СтрокаПозицииАкта.НомерСтроки);
			
			// ***********************************************************
			// ++ AVV
			
			// 2. В сводной таблице ресурсов акта колонка "Расход по норме (НормаРасхода)":
			// Позиция.НормаРасходаРесурса * Позиция.КоличествоРесурса * ФактРасход (т.ч. позиции) / Позиция.ОбъемРабот
	        // СтрокаТаблСтоимРес.РасходПоНорме = Позиция.НормаРасходаРесурса * Позиция.КоличествоРесурса * СтрокаТаблСтоимРес.РасходПоФакту / Позиция.ОбъемРабот; 
			// СтрокаТаблСтоимРес.РасходПоНорме = Позиция.НормаРасходаРесурса * Позиция.КоличествоРесурса * СтрокаПозицииАкта.ФактРасход / Позиция.ОбъемРабот; 
			
			// Если Позиция.ОбъемРабот = 0 Тогда
			//	 СтрокаТаблСтоимРес.РасходПоНорме = 0; 
			// Иначе
			//	 СтрокаТаблСтоимРес.РасходПоНорме = Позиция.НормаРасходаРесурса * Позиция.КоличествоРесурса * СтрокаПозицииАкта.ФактОбъем / Позиция.ОбъемРабот; 
			// КонецЕсли;
			
			//-- AVV
			// ***********************************************************
			
		КонецЕсли;	
	КонецЦикла;
	
	Если СвернутьТаблицу Тогда
		
		// ТаблСтоимРес.Свернуть("Ресурс, КодРесурса, ВидРесурса, НаименованиеРесурса, ЕдиницаИзмеренияРесурса, ЭтоУчтенный, ЭтоНеучтенный, ЭтоОборудование, ЦенаБазисная, ЦенаЗМБазисная, ЦенаТекущая, ЦенаТекущаяЗМ, Картинка,НеИзменятьЦены"+?(ГруппироватьПоПозициям, ", Позиция, ФактОбъем", "")+?(ГруппироватьПоСмете, ", Смета", "")+?(ГруппироватьСтатусы, ", СтатусРесурса,СтатусРесурсаАкт ", "")+?(ДетализацияОтклонения, ", ВариантОтклонения, ВариантПревышения, КомментарийКФайлу", "")+",Заменен,ЭтоЗамена,СортировкаЗамен", "Количество, РасходПоНорме, РасходПоФакту, СтоимостьБазисная, СтоимостьЗМБазисная, СтоимостьТекущая, СтоимостьТекущаяЗМ");   
		// ТаблСтоимРес.Свернуть("Ресурс, КодРесурса, ВидРесурса, НаименованиеРесурса, ЕдиницаИзмеренияРесурса, ЭтоУчтенный, ЭтоНеучтенный, ЭтоОборудование, ЦенаБазисная, ЦенаЗМБазисная, ЦенаТекущая, ЦенаТекущаяЗМ, Картинка,НеИзменятьЦены"+?(ГруппироватьПоПозициям, ", Позиция, ФактОбъем", "")+?(ГруппироватьПоСмете, ", Смета", "")+?(ГруппироватьСтатусы, ",СтатусРесурса","")+?(ДетализацияОтклонения, ", ВариантОтклонения, ВариантПревышения, КомментарийКФайлу", "")+",Заменен,ЭтоЗамена,СортировкаЗамен", "Количество, РасходПоНорме, РасходПоФакту, СтоимостьБазисная, СтоимостьЗМБазисная, СтоимостьТекущая, СтоимостьТекущаяЗМ");  
		
		// ***********************************************************
		// ++ AVV Запрет изменения факт расхода
		ТаблСтоимРес.Свернуть("Ресурс, КодРесурса, ВидРесурса, НаименованиеРесурса, ЕдиницаИзмеренияРесурса, ЭтоУчтенный, ЭтоНеучтенный, ЭтоОборудование, ЦенаБазисная, ЦенаЗМБазисная, ЦенаТекущая, ЦенаТекущаяЗМ, Картинка,НеИзменятьЦены"+?(ГруппироватьПоПозициям, ", Позиция, ФактОбъем", "")+?(ГруппироватьПоСмете, ", Смета", "")+?(ГруппироватьСтатусы, ",СтатусРесурса","")+?(ДетализацияОтклонения, ", ВариантОтклонения, ВариантПревышения, КомментарийКФайлу", "")+",Заменен,ЭтоЗамена,СортировкаЗамен,ИзмененФактРасход", "Количество, РасходПоНорме, РасходПоФакту, СтоимостьБазисная, СтоимостьЗМБазисная, СтоимостьТекущая, СтоимостьТекущаяЗМ"); 
		// -- AVV 
		// ***********************************************************
		
		Если Не УчитыватьЦеныПриГруппировке Тогда
			ТаблСтоимРес = ТаблицаБезГруппировкиПоЦенам(ТаблСтоимРес,ГруппироватьСтатусы,ДетализацияОтклонения);
		КонецЕсли;
		
		// ***********************************************************
		// ++ AVV
		// ТаблСтоимРес.Сортировать("ЭтоНеучтенный, ЭтоОборудование, ВидРесурса, КодРесурса");
		ТаблСтоимРес.Сортировать("ЭтоНеучтенный, ЭтоОборудование, ВидРесурса, СортировкаЗамен, КодРесурса, ЭтоЗамена");
		// -- AVV
		// ***********************************************************
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ТаблСтоимРес;
	
КонецФункции

// Возвращает таблицу со сведениями о начислениях Сметы (сводную или нет).
//
// Параметры:
//     СписокПозиций 	- СписокЗначений - содержит позиции или таблицу с колонкой Позиция.
//     СвернутьТаблицу 	- Булево - сводная таблица или нет.
//
// Возвращаемое значение:
//     ТабРезультат - ТаблицаЗначений - содержит числовые параметры сметы, согласно переданным параметрам.
//
Функция ПолучитьТаблицуНачисленийСметы(СписокПозиций, СвернутьТаблицу = Ложь) Экспорт
	
	Таблица = (ТипЗнч(СписокПозиций) <> Тип("СписокЗначений"));
	
	Запрос = Новый Запрос;
	Если Не СвернутьТаблицу Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Значение,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Формула,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.СтандартноеЗначение,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.ТипЗначения,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.ПорядокРасчета,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Значение КАК ЗначениеПроверка,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка КАК Позиция
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.НачисленияПозиции КАК СМ_ПозицияЛокальнойСметыНачисленияПозиции
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка В(&Ссылка)";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Формула КАК Формула,
		               |	СРЕДНЕЕ(1) КАК Количество
		               |ПОМЕСТИТЬ Формулы
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.НачисленияПозиции КАК СМ_ПозицияЛокальнойСметыНачисленияПозиции
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка В(&Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Формула
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СМ_Формулы.ЧисловойПараметр,
		               |	СУММА(СМ_Формулы.Количество) КАК ЕстьОтклонение
		               |ПОМЕСТИТЬ ФормулыЕстьОтклонения
		               |ИЗ
		               |	Формулы КАК СМ_Формулы
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СМ_Формулы.ЧисловойПараметр
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыНачисленияПозиции.Значение) КАК Значение
		               |ПОМЕСТИТЬ СредниеПоСмете
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.НачисленияПозиции КАК СМ_ПозицияЛокальнойСметыНачисленияПозиции
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка В(&Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыНачисленияПозиции.Значение) КАК Значение,
		               |	ВЫБОР
		               |		КОГДА ФормулыЕстьОтклонения.ЕстьОтклонение > 1
		               |			ТОГДА """"
		               |		ИНАЧЕ СМ_ПозицияЛокальнойСметыНачисленияПозиции.Формула
		               |	КОНЕЦ КАК Формула,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.ТипЗначения,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.СтандартноеЗначение,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.ПорядокРасчета,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыНачисленияПозиции.Значение <> СредниеПоСмете.Значение
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ЕстьОтклонение,
		               |	СУММА(ФормулыЕстьОтклонения.ЕстьОтклонение - 1) КАК ФормулаЕстьОтклонение
		               |ПОМЕСТИТЬ ЧисловыеПараметрыСметы
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.НачисленияПозиции КАК СМ_ПозицияЛокальнойСметыНачисленияПозиции
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СредниеПоСмете КАК СредниеПоСмете
		               |		ПО СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр = СредниеПоСмете.ЧисловойПараметр
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ФормулыЕстьОтклонения КАК ФормулыЕстьОтклонения
		               |		ПО СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр = ФормулыЕстьОтклонения.ЧисловойПараметр
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.Ссылка В(&Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.ТипЗначения,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.СтандартноеЗначение,
		               |	СМ_ПозицияЛокальнойСметыНачисленияПозиции.ЧисловойПараметр.ПорядокРасчета,
		               |	ВЫБОР
		               |		КОГДА ФормулыЕстьОтклонения.ЕстьОтклонение > 1
		               |			ТОГДА """"
		               |		ИНАЧЕ СМ_ПозицияЛокальнойСметыНачисленияПозиции.Формула
		               |	КОНЕЦ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЧисловыеПараметрыСметы.ЧисловойПараметр,
		               |	ВЫБОР
		               |		КОГДА ЧисловыеПараметрыСметы.ЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ЧисловыеПараметрыСметы.Значение
		               |	КОНЕЦ КАК Значение,
		               |	ЧисловыеПараметрыСметы.ЧисловойПараметрТипЗначения,
		               |	ЧисловыеПараметрыСметы.ЧисловойПараметрСтандартноеЗначение,
		               |	ЧисловыеПараметрыСметы.ЧисловойПараметрПорядокРасчета КАК ЧисловойПараметрПорядокРасчета,
		               |	ЧисловыеПараметрыСметы.ЕстьОтклонение КАК ЗначениеЕстьОтклонение,
		               |	ЧисловыеПараметрыСметы.ФормулаЕстьОтклонение,
		               |	ЧисловыеПараметрыСметы.Формула
		               |ИЗ
		               |	ЧисловыеПараметрыСметы КАК ЧисловыеПараметрыСметы
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЧисловойПараметрПорядокРасчета";	
	КонецЕсли;					   
	
	СписокПозицийОтбор = Новый СписокЗначений();
	Если Таблица Тогда
		СписокПозицийОтбор.ЗагрузитьЗначения(Таблица.Выгрузить().ВыгрузитьКолонку("Позиция"));	
	Иначе
		СписокПозицийОтбор = СписокПозиций;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", СписокПозицийОтбор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает таблицу со сведениями о поправках Сметы (сводную или нет).
//
// Параметры:
//     СписокПозиций 	- СписокЗначений - содержит позиции или таблицу с колонкой Позиция.
//     СвернутьТаблицу 	- Булево - сводная таблица или нет.
//
// Возвращаемое значение:
//     ТабРезультат - ТаблицаЗначений - содержит поправки сметы, согласно переданным параметрам.
//
Функция ПолучитьТаблицуПоправокСметы(СписокПозиций, СвернутьТаблицу = Ложь) Экспорт
	
	Таблица = (ТипЗнч(СписокПозиций) <> Тип("СписокЗначений"));
	
	Запрос = Новый Запрос;
	
	Если Не СвернутьТаблицу Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Применить,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.УсловияПрименения,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Обоснование,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффПЗ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффОЗ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффЭМ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффЗМ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ВариантРасчета,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффСМ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффТР,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффТМ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавПЗ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавОЗ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавЭМ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавЗМ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавСМ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавТР,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Справка,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавТ,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка КАК Позиция
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК СМ_ПозицияЛокальнойСметыПоправкиПозиции
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка В(&Ссылка)";
	Иначе                  
					   
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.УсловияПрименения КАК СТРОКА(200)) КАК УсловияПрименения,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Обоснование,
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.Справка КАК СТРОКА(200)) КАК Справка,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ВариантРасчета,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффПЗ) КАК КоэффПЗ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффОЗ) КАК КоэффОЗ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффЭМ) КАК КоэффЭМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффЗМ) КАК КоэффЗМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффСМ) КАК КоэффСМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффТР) КАК КоэффТР,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффТМ) КАК КоэффТМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавПЗ) КАК ДобавПЗ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавОЗ) КАК ДобавОЗ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавЭМ) КАК ДобавЭМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавЗМ) КАК ДобавЗМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавСМ) КАК ДобавСМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавТР) КАК ДобавТР,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавТ) КАК ДобавТ,
		               |	СРЕДНЕЕ(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.Применить
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Применить
		               |ПОМЕСТИТЬ СредниеПоСмете
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК СМ_ПозицияЛокальнойСметыПоправкиПозиции
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка В(&Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.УсловияПрименения КАК СТРОКА(200)),
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Обоснование,
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.Справка КАК СТРОКА(200)),
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ВариантРасчета
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.УсловияПрименения КАК СТРОКА(200)) КАК УсловияПрименения,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Обоснование,
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.Справка КАК СТРОКА(200)) КАК Справка,
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ВариантРасчета,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффПЗ) КАК КоэффПЗ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффОЗ) КАК КоэффОЗ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффЭМ) КАК КоэффЭМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффЗМ) КАК КоэффЗМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффСМ) КАК КоэффСМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффТР) КАК КоэффТР,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффТМ) КАК КоэффТМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавПЗ) КАК ДобавПЗ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавОЗ) КАК ДобавОЗ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавЭМ) КАК ДобавЭМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавЗМ) КАК ДобавЗМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавСМ) КАК ДобавСМ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавТР) КАК ДобавТР,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавТ) КАК ДобавТ,
		               |	СРЕДНЕЕ(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.Применить
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Применить,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффПЗ <> СредниеПоСмете.КоэффПЗ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффПЗЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффОЗ <> СредниеПоСмете.КоэффОЗ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффОЗЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффЭМ <> СредниеПоСмете.КоэффЭМ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффЭМЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффЗМ <> СредниеПоСмете.КоэффЗМ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффЗМЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффСМ <> СредниеПоСмете.КоэффСМ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффСМЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффТР <> СредниеПоСмете.КоэффТР
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффТРЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.КоэффТМ <> СредниеПоСмете.КоэффТМ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффТМЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавПЗ <> СредниеПоСмете.ДобавПЗ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ДобавПЗЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавОЗ <> СредниеПоСмете.ДобавОЗ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ДобавОЗЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавЭМ <> СредниеПоСмете.ДобавЭМ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ДобавЭМЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавЗМ <> СредниеПоСмете.ДобавЗМ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ДобавЗМЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавСМ <> СредниеПоСмете.ДобавСМ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ДобавСМЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавТР <> СредниеПоСмете.ДобавТР
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ДобавТРЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.ДобавТ <> СредниеПоСмете.ДобавТ
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК ДобавТЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыПоправкиПозиции.Применить
		               |				ТОГДА 1 - СредниеПоСмете.Применить
		               |			ИНАЧЕ СредниеПоСмете.Применить
		               |		КОНЕЦ) КАК ПрименитьЕстьОтклонение
		               |ПОМЕСТИТЬ ПоправкиСметы
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК СМ_ПозицияЛокальнойСметыПоправкиПозиции
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СредниеПоСмете КАК СредниеПоСмете
		               |		ПО ((ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.УсловияПрименения КАК СТРОКА(200))) = СредниеПоСмете.УсловияПрименения)
		               |			И ((ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.Справка КАК СТРОКА(200))) = СредниеПоСмете.Справка)
		               |			И СМ_ПозицияЛокальнойСметыПоправкиПозиции.Обоснование = СредниеПоСмете.Обоснование
		               |			И СМ_ПозицияЛокальнойСметыПоправкиПозиции.ВариантРасчета = СредниеПоСмете.ВариантРасчета
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Ссылка В(&Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.УсловияПрименения КАК СТРОКА(200)),
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.Обоснование,
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыПоправкиПозиции.Справка КАК СТРОКА(200)),
		               |	СМ_ПозицияЛокальнойСметыПоправкиПозиции.ВариантРасчета
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПоправкиСметы.УсловияПрименения,
		               |	ПоправкиСметы.Обоснование,
		               |	ПоправкиСметы.Справка,
		               |	ПоправкиСметы.ВариантРасчета,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.ПрименитьЕстьОтклонение > 0
		               |			ТОГДА ЛОЖЬ
		               |		ИНАЧЕ ВЫБОР
		               |				КОГДА ПоправкиСметы.Применить = 1
		               |					ТОГДА ИСТИНА
		               |				ИНАЧЕ ЛОЖЬ
		               |			КОНЕЦ
		               |	КОНЕЦ КАК Применить,
		               |	ПоправкиСметы.ПрименитьЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.КоэффПЗЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.КоэффПЗ
		               |	КОНЕЦ КАК КоэффПЗ,
		               |	ПоправкиСметы.КоэффПЗЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.КоэффОЗЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.КоэффОЗ
		               |	КОНЕЦ КАК КоэффОЗ,
		               |	ПоправкиСметы.КоэффОЗЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.КоэффЭМЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.КоэффЭМ
		               |	КОНЕЦ КАК КоэффЭМ,
		               |	ПоправкиСметы.КоэффЭМЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.КоэффЗМЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.КоэффЗМ
		               |	КОНЕЦ КАК КоэффЗМ,
		               |	ПоправкиСметы.КоэффЗМЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.КоэффСМЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.КоэффСМ
		               |	КОНЕЦ КАК КоэффСМ,
		               |	ПоправкиСметы.КоэффСМЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.КоэффТРЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.КоэффТР
		               |	КОНЕЦ КАК КоэффТР,
		               |	ПоправкиСметы.КоэффТРЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.КоэффТМЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.КоэффТМ
		               |	КОНЕЦ КАК КоэффТМ,
		               |	ПоправкиСметы.КоэффТМЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.ДобавПЗЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.ДобавПЗ
		               |	КОНЕЦ КАК ДобавПЗ,
		               |	ПоправкиСметы.ДобавПЗЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.ДобавОЗЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.ДобавОЗ
		               |	КОНЕЦ КАК ДобавОЗ,
		               |	ПоправкиСметы.ДобавОЗЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.ДобавЭМЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.ДобавЭМ
		               |	КОНЕЦ КАК ДобавЭМ,
		               |	ПоправкиСметы.ДобавЭМЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.ДобавЗМЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.ДобавЗМ
		               |	КОНЕЦ КАК ДобавЗМ,
		               |	ПоправкиСметы.ДобавЗМЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.ДобавСМЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.ДобавСМ
		               |	КОНЕЦ КАК ДобавСМ,
		               |	ПоправкиСметы.ДобавСМЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.ДобавТРЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.ДобавТР
		               |	КОНЕЦ КАК ДобавТР,
		               |	ПоправкиСметы.ДобавТРЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ПоправкиСметы.ДобавТЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ПоправкиСметы.ДобавТ
		               |	КОНЕЦ КАК ДобавТМ,
		               |	ПоправкиСметы.ДобавТЕстьОтклонение КАК ДобавТМЕстьОтклонение
		               |ИЗ
		               |	ПоправкиСметы КАК ПоправкиСметы";	
    КонецЕсли;
   
    СписокПозицийОтбор = Новый СписокЗначений();
	Если Таблица Тогда
		СписокПозицийОтбор.ЗагрузитьЗначения(Таблица.Выгрузить().ВыгрузитьКолонку("Позиция"));	
	Иначе
		СписокПозицийОтбор = СписокПозиций;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", СписокПозицийОтбор);
	
	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабРезультат;
		
КонецФункции

// Возвращает таблицу со сведениями об индексах Сметы (сводную или нет).
//
// Параметры:
//     СписокПозиций 	- СписокЗначений - содержит позиции или таблицу с колонкой Позиция.
//     СвернутьТаблицу 	- Булево - сводная таблица или нет.
//
// Возвращаемое значение:
//     ТабРезультат - ТаблицаЗначений - содержит индексы сметы, согласно переданным параметрам.
//
Функция ПолучитьТаблицуИндексовСметы(СписокПозиций, СвернутьТаблицу = Ложь) Экспорт
	
	Таблица = (ТипЗнч(СписокПозиций) <> Тип("СписокЗначений"));
	
	Запрос = Новый Запрос;
	Если Не СвернутьТаблицу Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОснЗарплаты,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЭксплМашин,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЗарплатеМашин,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимМатериалов,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОборуд,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффПолнСтоимРабот,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка КАК Позиция
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.КоэффициентыПересчета КАК СМ_ПозицияЛокальнойСметыКоэффициентыПересчета
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка В(&Ссылка)";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200)) КАК ВидРабот,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ КАК ВариантПересчетаЭММ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОснЗарплаты) КАК КоэффОснЗарплаты,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЭксплМашин) КАК КоэффСтоимЭксплМашин,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЗарплатеМашин) КАК КоэффСтоимЗарплатеМашин,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимМатериалов) КАК КоэффСтоимМатериалов,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОборуд) КАК КоэффОборуд,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффПолнСтоимРабот) КАК КоэффПолнСтоимРабот
		               |ПОМЕСТИТЬ СредниеПоСмете
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.КоэффициентыПересчета КАК СМ_ПозицияЛокальнойСметыКоэффициентыПересчета
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка В(&Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200)),
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200)) КАК ВидРабот,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ КАК ВариантПересчетаЭММ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОснЗарплаты) КАК КоэффОснЗарплаты,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЭксплМашин) КАК КоэффСтоимЭксплМашин,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЗарплатеМашин) КАК КоэффСтоимЗарплатеМашин,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимМатериалов) КАК КоэффСтоимМатериалов,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОборуд) КАК КоэффОборуд,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффПолнСтоимРабот) КАК КоэффПолнСтоимРабот,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОснЗарплаты <> СредниеПоСмете.КоэффОснЗарплаты
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффОснЗарплатыЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЭксплМашин <> СредниеПоСмете.КоэффСтоимЭксплМашин
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффСтоимЭксплМашинЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЗарплатеМашин <> СредниеПоСмете.КоэффСтоимЗарплатеМашин
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффСтоимЗарплатеМашинЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимМатериалов <> СредниеПоСмете.КоэффСтоимМатериалов
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффСтоимМатериаловЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОборуд <> СредниеПоСмете.КоэффОборуд
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффОборудЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффПолнСтоимРабот <> СредниеПоСмете.КоэффПолнСтоимРабот
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффПолнСтоимРаботЕстьОтклонение
		               |ПОМЕСТИТЬ ИндексыСметы
		               |ИЗ
		               |	Документ.СМ_ПозицияЛокальнойСметы.КоэффициентыПересчета КАК СМ_ПозицияЛокальнойСметыКоэффициентыПересчета
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СредниеПоСмете КАК СредниеПоСмете
		               |		ПО ((ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200))) = СредниеПоСмете.ВидРабот)
		               |			И СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ = СредниеПоСмете.ВариантПересчетаЭММ
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Ссылка В(&Ссылка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200)),
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИндексыСметы.ВидРабот,
		               |	ИндексыСметы.ВариантПересчетаЭММ,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффОснЗарплатыЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффОснЗарплаты
		               |	КОНЕЦ КАК КоэффОснЗарплаты,
		               |	ИндексыСметы.КоэффОснЗарплатыЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффСтоимЭксплМашинЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффСтоимЭксплМашин
		               |	КОНЕЦ КАК КоэффСтоимЭксплМашин,
		               |	ИндексыСметы.КоэффСтоимЭксплМашинЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффСтоимЗарплатеМашинЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффСтоимЗарплатеМашин
		               |	КОНЕЦ КАК КоэффСтоимЗарплатеМашин,
		               |	ИндексыСметы.КоэффСтоимЗарплатеМашинЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффСтоимМатериаловЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффСтоимМатериалов
		               |	КОНЕЦ КАК КоэффСтоимМатериалов,
		               |	ИндексыСметы.КоэффСтоимМатериаловЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффОборудЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффОборуд
		               |	КОНЕЦ КАК КоэффОборуд,
		               |	ИндексыСметы.КоэффОборудЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффПолнСтоимРаботЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффПолнСтоимРабот
		               |	КОНЕЦ КАК КоэффПолнСтоимРабот,
		               |	ИндексыСметы.КоэффПолнСтоимРаботЕстьОтклонение
		               |ИЗ
		               |	ИндексыСметы КАК ИндексыСметы";	
	КонецЕсли;		
		
	СписокПозицийОтбор = Новый СписокЗначений();
	Если Таблица Тогда
		СписокПозицийОтбор.ЗагрузитьЗначения(Таблица.Выгрузить().ВыгрузитьКолонку("Позиция"));	
	Иначе
		СписокПозицийОтбор = СписокПозиций;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", СписокПозицийОтбор);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает таблицу со сведениями об индексах Акта (сводную или нет).
//
// Параметры:
//     Акт 					- ДокументСсылка.СМ_АктВыполненныхРабот - акт для которого формируется список ресурсов.
//     СвернутьТаблицу 		- Булево - сводная таблицв или нет.
//     ОтборПозицийСписок 	- СписокЗначений - список позиций для дополнительного отбора по позициям.
//
// Возвращаемое значение:
//     ТабРезультат - ТаблицаЗначений - содержит индексы акта, согласно переданным параметрам.
//
Функция ПолучитьТаблицуИндексовАкта(Акт, СвернутьТаблицу = Ложь, ОтборПозицийСписок = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если Не СвернутьТаблицу Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(СМ_АктВыполненныхРаботПозиции.ВидРабот КАК СТРОКА(200)) КАК ВидРабот,
		               |	СМ_АктВыполненныхРаботПозиции.ВариантПересчетаЭММ,
		               |	СРЕДНЕЕ(СМ_АктВыполненныхРаботПозиции.КоэффОснЗарплаты) КАК КоэффОснЗарплаты,
		               |	СРЕДНЕЕ(СМ_АктВыполненныхРаботПозиции.КоэффСтоимЭксплМашин) КАК КоэффСтоимЭксплМашин,
		               |	СРЕДНЕЕ(СМ_АктВыполненныхРаботПозиции.КоэффСтоимЗарплатеМашин) КАК КоэффСтоимЗарплатеМашин,
		               |	СРЕДНЕЕ(СМ_АктВыполненныхРаботПозиции.КоэффСтоимМатериалов) КАК КоэффСтоимМатериалов,
		               |	СРЕДНЕЕ(СМ_АктВыполненныхРаботПозиции.КоэффОборуд) КАК КоэффОборуд,
		               |	СРЕДНЕЕ(СМ_АктВыполненныхРаботПозиции.КоэффПолнСтоимРабот) КАК КоэффПолнСтоимРабот,
		               |	СМ_АктВыполненныхРаботПозиции.Позиция
		               |ИЗ
		               |	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_АктВыполненныхРаботПозиции
		               |ГДЕ
		               |	СМ_АктВыполненныхРаботПозиции.Позиция В(&СписокПозиций)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫРАЗИТЬ(СМ_АктВыполненныхРаботПозиции.ВидРабот КАК СТРОКА(200)),
		               |	СМ_АктВыполненныхРаботПозиции.ВариантПересчетаЭММ,
		               |	СМ_АктВыполненныхРаботПозиции.Позиция";
				   
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200)) КАК ВидРабот,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ КАК ВариантПересчетаЭММ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОснЗарплаты) КАК КоэффОснЗарплаты,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЭксплМашин) КАК КоэффСтоимЭксплМашин,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЗарплатеМашин) КАК КоэффСтоимЗарплатеМашин,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимМатериалов) КАК КоэффСтоимМатериалов,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОборуд) КАК КоэффОборуд,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффПолнСтоимРабот) КАК КоэффПолнСтоимРабот
		               |ПОМЕСТИТЬ СредниеПоСмете
		               |ИЗ
		               |	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_ПозицияЛокальнойСметыКоэффициентыПересчета
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Позиция В(&СписокПозиций)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200)),
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200)) КАК ВидРабот,
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ КАК ВариантПересчетаЭММ,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОснЗарплаты) КАК КоэффОснЗарплаты,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЭксплМашин) КАК КоэффСтоимЭксплМашин,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЗарплатеМашин) КАК КоэффСтоимЗарплатеМашин,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимМатериалов) КАК КоэффСтоимМатериалов,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОборуд) КАК КоэффОборуд,
		               |	СРЕДНЕЕ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффПолнСтоимРабот) КАК КоэффПолнСтоимРабот,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОснЗарплаты <> СредниеПоСмете.КоэффОснЗарплаты
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффОснЗарплатыЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЭксплМашин <> СредниеПоСмете.КоэффСтоимЭксплМашин
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффСтоимЭксплМашинЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимЗарплатеМашин <> СредниеПоСмете.КоэффСтоимЗарплатеМашин
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффСтоимЗарплатеМашинЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффСтоимМатериалов <> СредниеПоСмете.КоэффСтоимМатериалов
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффСтоимМатериаловЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффОборуд <> СредниеПоСмете.КоэффОборуд
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффОборудЕстьОтклонение,
		               |	СУММА(ВЫБОР
		               |			КОГДА СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.КоэффПолнСтоимРабот <> СредниеПоСмете.КоэффПолнСтоимРабот
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК КоэффПолнСтоимРаботЕстьОтклонение
		               |ПОМЕСТИТЬ ИндексыСметы
		               |ИЗ
		               |	Документ.СМ_АктВыполненныхРабот.Позиции КАК СМ_ПозицияЛокальнойСметыКоэффициентыПересчета
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СредниеПоСмете КАК СредниеПоСмете
		               |		ПО ((ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200))) = СредниеПоСмете.ВидРабот)
		               |			И СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ = СредниеПоСмете.ВариантПересчетаЭММ
		               |ГДЕ
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.Позиция В(&СписокПозиций)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫРАЗИТЬ(СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВидРабот КАК СТРОКА(200)),
		               |	СМ_ПозицияЛокальнойСметыКоэффициентыПересчета.ВариантПересчетаЭММ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИндексыСметы.ВидРабот,
		               |	ИндексыСметы.ВариантПересчетаЭММ,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффОснЗарплатыЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффОснЗарплаты
		               |	КОНЕЦ КАК КоэффОснЗарплаты,
		               |	ИндексыСметы.КоэффОснЗарплатыЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффСтоимЭксплМашинЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффСтоимЭксплМашин
		               |	КОНЕЦ КАК КоэффСтоимЭксплМашин,
		               |	ИндексыСметы.КоэффСтоимЭксплМашинЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффСтоимЗарплатеМашинЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффСтоимЗарплатеМашин
		               |	КОНЕЦ КАК КоэффСтоимЗарплатеМашин,
		               |	ИндексыСметы.КоэффСтоимЗарплатеМашинЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффСтоимМатериаловЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффСтоимМатериалов
		               |	КОНЕЦ КАК КоэффСтоимМатериалов,
		               |	ИндексыСметы.КоэффСтоимМатериаловЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффОборудЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффОборуд
		               |	КОНЕЦ КАК КоэффОборуд,
		               |	ИндексыСметы.КоэффОборудЕстьОтклонение,
		               |	ВЫБОР
		               |		КОГДА ИндексыСметы.КоэффПолнСтоимРаботЕстьОтклонение > 0
		               |			ТОГДА 0
		               |		ИНАЧЕ ИндексыСметы.КоэффПолнСтоимРабот
		               |	КОНЕЦ КАК КоэффПолнСтоимРабот,
		               |	ИндексыСметы.КоэффПолнСтоимРаботЕстьОтклонение
		               |ИЗ
		               |	ИндексыСметы КАК ИндексыСметы";
	КонецЕсли;   			   
				  
	СписокПозиций = Новый СписокЗначений();
	Если ОтборПозицийСписок = Неопределено Тогда
		СписокПозиций.ЗагрузитьЗначения(Акт.Позиции.Выгрузить(,"Позиция").ВыгрузитьКолонку("Позиция"));
	Иначе
		СписокПозиций = ОтборПозицийСписок;
	КонецЕсли;
	Запрос.УстановитьПараметр("СписокПозиций",СписокПозиций);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Возвращает поправки из позиции локальной сметы в виде таблицы.
//
// Параметры:
//     Объект 		- Массив - список позиций для дополнительного отбора по позициям.
//     ПоДокументу 	- Булево - отбор по документу или в целом.
//
// Возвращаемое значение:
//     ТаблПоправок - ТаблицаЗначений - содержащая поправки, согласно переданным параметрам.
//
Функция ПолучитьПоправки(Объект,ПоДокументу = ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ПоДокументу Тогда
		Запрос.Текст = 	"ВЫБРАТЬ
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффОЗ КАК КоэффициентКОсновнойЗарплате,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффЭМ КАК КоэффициентКЭксплуатацииМашин,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффЗМ КАК КоэффициентКЗарплатеМашинистов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффСМ КАК КоэффициентКСтоимостиМатериалов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффТР КАК КоэффициентКТрудозатратамРабочих,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффТМ КАК КоэффициентКТрудозатратамМашинистов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавПЗ КАК ДобавитьКПрямымЗатратам,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавОЗ КАК ДобавитьКОсновнойЗарплате,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавЭМ КАК ДобавитьКЭксплуатацииМашин,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавЗМ КАК ДобавитьКЗарплатеМашинистов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавСМ КАК ДобавитьКСтоимостиМатериалов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавТР КАК ДобавитьКТрудозатратамРабочих,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавТ КАК ДобавитьКТрудозатратам,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффПЗ КАК КоэффициентКПрямымЗатратам,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ВариантРасчета
		               	|ИЗ
		               	|	Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК ПозицияЛокальнойСметыПоправкиПозиции
		               	|ГДЕ
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.Ссылка = &Ссылка
		               	|	И ПозицияЛокальнойСметыПоправкиПозиции.Применить = ИСТИНА";
		Запрос.УстановитьПараметр("Ссылка",СМ_СметаВызовСервера.ПолучитьСсылкуНаДокумент(Объект,"СМ_ПозицияЛокальнойСметы"));
		
	Иначе
		
		Запрос.Текст = 	"ВЫБРАТЬ
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффОЗ КАК КоэффициентКОсновнойЗарплате,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффЭМ КАК КоэффициентКЭксплуатацииМашин,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффЗМ КАК КоэффициентКЗарплатеМашинистов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффСМ КАК КоэффициентКСтоимостиМатериалов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффТР КАК КоэффициентКТрудозатратамРабочих,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффТМ КАК КоэффициентКТрудозатратамМашинистов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавПЗ КАК ДобавитьКПрямымЗатратам,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавОЗ КАК ДобавитьКОсновнойЗарплате,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавЭМ КАК ДобавитьКЭксплуатацииМашин,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавЗМ КАК ДобавитьКЗарплатеМашинистов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавСМ КАК ДобавитьКСтоимостиМатериалов,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавТР КАК ДобавитьКТрудозатратамРабочих,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ДобавТ КАК ДобавитьКТрудозатратам,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.КоэффПЗ КАК КоэффициентКПрямымЗатратам,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.ВариантРасчета,
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.Ссылка КАК Позиция
		               	|ИЗ
		               	|	Документ.СМ_ПозицияЛокальнойСметы.ПоправкиПозиции КАК ПозицияЛокальнойСметыПоправкиПозиции
		               	|ГДЕ
		               	|	ПозицияЛокальнойСметыПоправкиПозиции.Ссылка В (&СписокДокументов)
		               	|	И ПозицияЛокальнойСметыПоправкиПозиции.Применить = ИСТИНА";
						
		Для Каждого Позиция Из Объект Цикл
			Если ТипЗнч(Позиция.Значение) <> Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
				Позиция.Значение = СМ_СметаВызовСервера.ПолучитьСсылкуНаДокумент(Позиция.Значение,"СМ_ПозицияЛокальнойСметы");	
			КонецЕсли;
		КонецЦикла;				
		Запрос.УстановитьПараметр("СписокДокументов",Объект);
 
	КонецЕсли;
	
	ТаблПоправок = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблПоправок Из ТаблПоправок Цикл
		Для Каждого колонка Из ТаблПоправок.Колонки Цикл
			Если ТипЗнч(СтрокаТаблПоправок[Колонка.Имя]) = Тип("Число") И СтрокаТаблПоправок[Колонка.Имя] = 0 И НЕ Лев(Колонка.Имя,8) = "Добавить" Тогда
				СтрокаТаблПоправок[Колонка.Имя] = 1;	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат ТаблПоправок;
	
КонецФункции

// Возвращает отминусованные ресурсы из позиции локальной сметы в виде таблицы.
//
// Параметры:
//     СписокПозиций - Массив - список позиций для отбора по позициям.
//
// Возвращаемое значение:
//     ТабРезультат - ТаблицаЗначений - содержит позиции с минусом, согласно переданным параметрам.
//
Функция ПолучитьМинусовые(СписокПозиций) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	СМ_ПозицияЛокальнойСметы.Ссылка КАК Позиция,
	               	|	СМ_ПозицияЛокальнойСметы.ОбъемРабот,
	               	|	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца КАК ИДВладельца,
	               	|	СМ_ПозицияЛокальнойСметы.ШифрРасценки
	               	|ИЗ
	               	|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	               	|ГДЕ
	               	|	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца В(&СписокДокументов)
	               	|	И СМ_ПозицияЛокальнойСметы.ОбъемРабот < 0";
	Запрос.УстановитьПараметр("СписокДокументов",СписокПозиций);
	Возврат Запрос.Выполнить().Выгрузить();;
КонецФункции   

// Пересчет привязанных позиций при изменении объема основной позиции. 
//
// Параметры:
//     ПозицияВладелец - ДокументСсылка - ссылка на документ СМ_ПозицияЛокальнойСметы.
//     НовыйОбъем      - Число - новый объем работ по позиции.
//     СтарыйОбъем     - Число - объем работ по позиции до изменения.
//
Процедура ВыполнитьПересчетПривязанныхПозиций(ПозицияВладелец,НовыйОбъем,СтарыйОбъем) Экспорт
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СМ_ПозицияЛокальнойСметы.Ссылка
	|ИЗ
	|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	|ГДЕ
	|	СМ_ПозицияЛокальнойСметы.ИДПозицииВладельца = &ИДПозицииВладельца
	|	И СМ_ПозицияЛокальнойСметы.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	СМ_ПозицияЛокальнойСметы.Дата";
	Запрос.УстановитьПараметр("ИДПозицииВладельца",ПозицияВладелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Позиция = Выборка.Ссылка.ПолучитьОбъект();
		
		// ******************************************************
		// ++ AVV
		Позиция.КоличествоРесурса 	= НовыйОбъем; 
		Позиция.ФормулаОбъема		= "" + Позиция.НормаРасходаРесурса + " * " + Позиция.КоличествоРесурса;
		Позиция.ОбъемРабот			= Позиция.НормаРасходаРесурса * Позиция.КоличествоРесурса;

		//Если ЗначениеЗаполнено(Позиция.ФормулаОбъема) Тогда
		//	ВычОбъем 		= 0;
		//	Формула 		= "ВычОбъем = Значение";
		//	ФормулаОбъема 	= СтрЗаменить(Позиция.ФормулаОбъема,",",".");
		//	Формула 		= СтрЗаменить(Формула,"Значение",ФормулаОбъема);
		//	Попытка
		//		Выполнить(Формула);
		//		ТекОбъем 	= (ВычОбъем/СтарыйОбъем)*НовыйОбъем;
		//		Норма 		= ВычОбъем/СтарыйОбъем;
		//	Исключение
		//		Если СтарыйОбъем = 0 Тогда
		//			ТекОбъем 	= НовыйОбъем;
		//		Иначе
		//			ТекОбъем 	= (Позиция.ОбъемРабот/СтарыйОбъем)*НовыйОбъем;
		//			Норма 		= Позиция.ОбъемРабот/СтарыйОбъем;
		//		КонецЕсли;
		//	КонецПопытки;
		//Иначе
		//	ТекОбъем 	= (Позиция.ОбъемРабот/СтарыйОбъем)*НовыйОбъем;
		//	Норма 		= Позиция.ОбъемРабот/СтарыйОбъем;
		//КонецЕсли;
		//
		//Если СтарыйОбъем = 0 Тогда
		//	Позиция.ФормулаОбъема = "1" + "*" + СокрЛП(Строка(Формат(ТекОбъем,"ЧГ=0")));
		//Иначе
		//	Позиция.ФормулаОбъема = СокрЛП(Строка(Формат(НовыйОбъем,"ЧГ=0"))) + "*" + СокрЛП(Строка(Формат(Норма,"ЧГ=0")));
		//КонецЕсли;
		//Позиция.ОбъемРабот = ТекОбъем;
		
		// -- AVV
		// ******************************************************

		Позиция.Записать();
		Документы.СМ_ПозицияЛокальнойСметы.Перерасчет(Позиция);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область РасчетИтогов

// Формирвание итогов по Смете, рассчитывает итоги для всех 
//	методов счета базисно-индексный(уровень задания индексов расценка, раздел, смета.
//	Способ задания индексов по эелементам затрат, к полной стоимости.
//
// Параметры:
//     Ссылка - ДокументСсылка - ссылка на документ СМ_ЛокальнаяСмета, Акт.
//
Процедура СформироватьИтогиПоСмете(Ссылка) Экспорт
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6));

	ТаблРасчета = Новый ТаблицаЗначений();
	ТаблРасчета.Колонки.Добавить("Смета");
	ТаблРасчета.Колонки.Добавить("Итог");
	ТаблРасчета.Колонки.Добавить("ВозвратМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗарплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗатратыТрудаМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗатратыТрудаРабочих",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("Оборуд",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ОснЗарплата",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ПрямЗатраты",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("СтоимМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекВозвратМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекЗарплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекОборуд",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекОснЗарплата",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекПрямЗатраты",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекСтоимМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекЭксплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЭксплМашин",ОписаниеТипаЧисло);   
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Смета", Ссылка);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		НаборКоэф = Ссылка;
		Акт = Истина;
		ЛокСмета = Ссылка.ЛокальнаяСмета;
		Запрос.УстановитьПараметр("Раздел",Ссылка.ЛокальнаяСмета);
		МетодикаРСНБ = (Ссылка.ЛокальнаяСмета.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_КЗ_РСНБ);
	Иначе
		Акт = Ложь;
		ЛокСмета = Ссылка;
		НаборКоэф = ЛокСмета;
		Запрос.УстановитьПараметр("Раздел",Ссылка);
		МетодикаРСНБ = (Ссылка.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_КЗ_РСНБ);
	КонецЕсли;
	Уровень = ЛокСмета.Уровень;
	МетодРасчета = ЛокСмета.МетодРасчета; 
	СпособРасчетаИндексов = ЛокСмета.СпособРасчетаИндексов;
	ОкрИтог = Ссылка.ОкруглятьДоРублей;
	ОкрПромежуточно = Ссылка.ПромежуточноеОкругление;
	Если ОкрИтог Тогда
		КолЗнаков = 0;
	ИначеЕсли ОкрПромежуточно Тогда
		КолЗнаков = 2;
	Иначе
		КолЗнаков = 6;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИтогиПоРазделу.Итог,
	|	СУММА(ИтогиПоРазделу.ПрямЗатраты) КАК ПрямЗатраты,
	|	СУММА(ИтогиПоРазделу.ОснЗарплата) КАК ОснЗарплата,
	|	СУММА(ИтогиПоРазделу.ЭксплМашин) КАК ЭксплМашин,
	|	СУММА(ИтогиПоРазделу.ЗарплМашин) КАК ЗарплМашин,
	|	СУММА(ИтогиПоРазделу.СтоимМатер) КАК СтоимМатер,
	|	СУММА(ИтогиПоРазделу.Оборуд) КАК Оборуд,
	|	СУММА(ИтогиПоРазделу.ВозвратМатер) КАК ВозвратМатер,
	|	СУММА(ИтогиПоРазделу.ЗатратыТрудаРабочих) КАК ЗатратыТрудаРабочих,
	|	СУММА(ИтогиПоРазделу.ЗатратыТрудаМашин) КАК ЗатратыТрудаМашин,
	|	СУММА(ИтогиПоРазделу.ТекПрямЗатраты) КАК ТекПрямЗатраты,
	|	СУММА(ИтогиПоРазделу.ТекОснЗарплата) КАК ТекОснЗарплата,
	|	СУММА(ИтогиПоРазделу.ТекЭксплМашин) КАК ТекЭксплМашин,
	|	СУММА(ИтогиПоРазделу.ТекЗарплМашин) КАК ТекЗарплМашин,
	|	СУММА(ИтогиПоРазделу.ТекСтоимМатер) КАК ТекСтоимМатер,
	|	СУММА(ИтогиПоРазделу.ТекОборуд) КАК ТекОборуд,
	|	СУММА(ИтогиПоРазделу.ТекВозвратМатер) КАК ТекВозвратМатер
	|ИЗ
	|	РегистрСведений.СМ_ИтогиПоРазделу КАК ИтогиПоРазделу
	|ГДЕ
	|	ИтогиПоРазделу.Смета = &Смета
	|	И ИтогиПоРазделу.Раздел.ИДРодителя = &Раздел
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтогиПоРазделу.Итог";
	
	
	ТаблицаИтогов = Запрос.Выполнить().Выгрузить();
	Если ТаблицаИтогов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИтогиПоВидамРабот.Итог,
	|	СУММА(ИтогиПоВидамРабот.ПрямЗатраты) КАК ПрямЗатраты,
	|	СУММА(ИтогиПоВидамРабот.ОснЗарплата) КАК ОснЗарплата,
	|	СУММА(ИтогиПоВидамРабот.ЭксплМашин) КАК ЭксплМашин,
	|	СУММА(ИтогиПоВидамРабот.ЗарплМашин) КАК ЗарплМашин,
	|	СУММА(ИтогиПоВидамРабот.СтоимМатер) КАК СтоимМатер,
	|	СУММА(ИтогиПоВидамРабот.Оборуд) КАК Оборуд,
	|	СУММА(ИтогиПоВидамРабот.ВозвратМатер) КАК ВозвратМатер,
	|	СУММА(ИтогиПоВидамРабот.ЗатратыТрудаРабочих) КАК ЗатратыТрудаРабочих,
	|	СУММА(ИтогиПоВидамРабот.ЗатратыТрудаМашин) КАК ЗатратыТрудаМашин,
	|	СУММА(ИтогиПоВидамРабот.ТекПрямЗатраты) КАК ТекПрямЗатраты,
	|	СУММА(ИтогиПоВидамРабот.ТекОснЗарплата) КАК ТекОснЗарплата,
	|	СУММА(ИтогиПоВидамРабот.ТекЭксплМашин) КАК ТекЭксплМашин,
	|	СУММА(ИтогиПоВидамРабот.ТекЗарплМашин) КАК ТекЗарплМашин,
	|	СУММА(ИтогиПоВидамРабот.ТекСтоимМатер) КАК ТекСтоимМатер,
	|	СУММА(ИтогиПоВидамРабот.ТекОборуд) КАК ТекОборуд,
	|	СУММА(ИтогиПоВидамРабот.ТекВозвратМатер) КАК ТекВозвратМатер

	|ИЗ
	|	РегистрСведений.СМ_ИтогиПоВидамРабот КАК ИтогиПоВидамРабот
	|ГДЕ
	|	ИтогиПоВидамРабот.Смета = &Смета
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтогиПоВидамРабот.Итог";
	
	ТаблицаИтоговПоВидамРабот = Запрос.Выполнить().Выгрузить();
	
	НормТрудоемкость = ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.НормативТрудоемк).ПрямЗатраты; 
	ИтогоПоСмете 		= ТаблРасчета.Добавить();
	ИтогоПоСмете.Итог 	= Справочники.СМ_ИтогиПоСмете.ИтогоПоСмете;
	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
		ТекОборуд = Окр(ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоСИндексКОборуд).ТекПрямЗатраты,КолЗнаков);
		Оборуд = Окр(ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоОборуд).ПрямЗатраты,КолЗнаков);
		СтрокаИтога = ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоСИндексКЭлемЗатрат);
	Иначе
		СтрокаОборуд = ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоОборуд);
		ТекОборуд = Окр(?(СтрокаОборуд = Неопределено,0,СтрокаОборуд.ТекПрямЗатраты),КолЗнаков);
		Оборуд = Окр(?(СтрокаОборуд = Неопределено,0,СтрокаОборуд.ПрямЗатраты),КолЗнаков);
		СтрокаИтога = ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоПоРазделу);
	КонецЕсли;	
	
	Если НЕ СтрокаИтога = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ИтогоПоСмете, СтрокаИтога, , "Итог");
		ИтогоПоСмете.ТекПрямЗатраты = Окр(ИтогоПоСмете.ТекПрямЗатраты,КолЗнаков) + ТекОборуд;
		ИтогоПоСмете.ПрямЗатраты 	= Окр(ИтогоПоСмете.ПрямЗатраты,КолЗнаков) 	+  Оборуд;
	КонецЕсли;
	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета
		И СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости Тогда	
		НаклРасх = ТаблРасчета.Добавить();
		НаклРасх.Итог = Справочники.СМ_ИтогиПоСмете.НаклРасх;
		СтрокаИтога = ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.НаклРасх);
		Если НЕ СтрокаИтога = Неопределено Тогда
			НаклРасх.ПрямЗатраты 	= Окр(СтрокаИтога.ПрямЗатраты,КолЗнаков);
			НаклРасх.ТекПрямЗатраты = Окр(СтрокаИтога.ТекПрямЗатраты,КолЗнаков);
		Иначе
			НаклРасх.ПрямЗатраты 	= 0;
			НаклРасх.ТекПрямЗатраты = 0;
		КонецЕсли;
	Иначе
		НаклРасх = ТаблРасчета.Добавить();
		НаклРасх.Итог = Справочники.СМ_ИтогиПоСмете.НаклРасх;
		СтрокаИтога = ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.НаклРасх);
		Если НЕ СтрокаИтога = Неопределено Тогда
			НаклРасх.ПрямЗатраты 	= Окр(СтрокаИтога.ПрямЗатраты,КолЗнаков);
			НаклРасх.ТекПрямЗатраты = Окр(СтрокаИтога.ТекПрямЗатраты,КолЗнаков);
		Иначе
			НаклРасх.ПрямЗатраты 	= 0;
			НаклРасх.ТекПрямЗатраты = 0;
		КонецЕсли;
	КонецЕсли;          	
	
	ИтогоНормативТрудоемк = ТаблРасчета.Добавить();
	ИтогоНормативТрудоемк.Итог = Справочники.СМ_ИтогиПоСмете.НормативТрудоемк;
	ИтогоНормативТрудоемк.ПрямЗатраты = НормТрудоемкость;
	ИтогоНормативТрудоемк.ТекПрямЗатраты 	= НормТрудоемкость;
	
	ИтогоСметнЗарплата = ТаблРасчета.Добавить();
	ИтогоСметнЗарплата.Итог = Справочники.СМ_ИтогиПоСмете.СметнЗарплата;
	ИтогоСметнЗарплата.ПрямЗатраты = Окр(ИтогоПоСмете.ОснЗарплата,КолЗнаков) + Окр(ИтогоПоСмете.ЗарплМашин,КолЗнаков);
	ИтогоСметнЗарплата.ТекПрямЗатраты 	= Окр(ИтогоПоСмете.ТекОснЗарплата,КолЗнаков) + Окр(ИтогоПоСмете.ТекЗарплМашин,КолЗнаков);
	
	ИтогоСУчетомНаклРасх = ТаблРасчета.Добавить();
	ИтогоСУчетомНаклРасх.Итог = Справочники.СМ_ИтогиПоСмете.ИтогоСУчетомНаклРасх;
	ИтогоСУчетомНаклРасх.ПрямЗатраты = Окр(ИтогоПоСмете.ПрямЗатраты,КолЗнаков) + Окр(НаклРасх.ПрямЗатраты,КолЗнаков);
	ИтогоСУчетомНаклРасх.ТекПрямЗатраты = Окр(ИтогоПоСмете.ТекПрямЗатраты,КолЗнаков) + Окр(НаклРасх.ТекПрямЗатраты,КолЗнаков);

	Если (МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный) и методикаРСНБ Тогда
		НаклРасх2 = ТаблРасчета.Добавить();
		НаклРасх2.Итог = Справочники.СМ_ИтогиПоСмете.НаклРасх2;
		НаклРасх2.ПрямЗатраты = Окр(ИтогоСУчетомНаклРасх.ПрямЗатраты*ЛокСмета.НР2_ВС/100,КолЗнаков);
		НаклРасх2.ТекПрямЗатраты = Окр(ИтогоСУчетомНаклРасх.ТекПрямЗатраты*ЛокСмета.НР2_ВС/100,КолЗнаков);
		
		ИтогоСУчетомНаклРасх2 = ТаблРасчета.Добавить();
		ИтогоСУчетомНаклРасх2.Итог = Справочники.СМ_ИтогиПоСмете.ИтогоСУчетомНаклРасх2;
		ИтогоСУчетомНаклРасх2.ПрямЗатраты = Окр(ИтогоСУчетомНаклРасх.ПрямЗатраты + НаклРасх2.ПрямЗатраты,КолЗнаков);
		ИтогоСУчетомНаклРасх2.ТекПрямЗатраты = Окр(ИтогоСУчетомНаклРасх.ТекПрямЗатраты + НаклРасх2.ТекПрямЗатраты,КолЗнаков);
	КонецЕсли;                                      	

	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета
		И СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости Тогда	
		СметПрибыль = ТаблРасчета.Добавить();
		СметПрибыль.Итог = Справочники.СМ_ИтогиПоСмете.СметПрибыль;
		СтрокаИтога = ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.СметПрибыль);
		Если НЕ СтрокаИтога = Неопределено Тогда
			СметПрибыль.ПрямЗатраты 	= Окр(СтрокаИтога.ПрямЗатраты,КолЗнаков);
			СметПрибыль.ТекПрямЗатраты = Окр(СтрокаИтога.ТекПрямЗатраты ,КолЗнаков);
		Иначе
			СметПрибыль.ПрямЗатраты 	= 0;
			СметПрибыль.ТекПрямЗатраты = 0;
		КонецЕсли;
	ИначеЕсли (МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный) и методикаРСНБ Тогда
		СметПрибыль = ТаблРасчета.Добавить();
		СметПрибыль.Итог = Справочники.СМ_ИтогиПоСмете.СметПрибыль;
		СметПрибыль.ПрямЗатраты 	= Окр(ИтогоСУчетомНаклРасх2.ПрямЗатраты*ЛокСмета.СП_ВС/100,КолЗнаков);
		СметПрибыль.ТекПрямЗатраты 	= Окр(ИтогоСУчетомНаклРасх2.ТекПрямЗатраты*ЛокСмета.СП_ВС/100,КолЗнаков);
	Иначе	
		СметПрибыль = ТаблРасчета.Добавить();
		СметПрибыль.Итог = Справочники.СМ_ИтогиПоСмете.СметПрибыль;
		СтрокаИтога = ТаблицаИтогов.Найти(Справочники.СМ_ИтогиПоРазделу.СметПрибыль);
		Если НЕ СтрокаИтога = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(СметПрибыль, СтрокаИтога, , "Итог");
		Иначе
			СметПрибыль.ПрямЗатраты 	= 0;
			СметПрибыль.ТекПрямЗатраты 	= 0;
		КонецЕсли;
	КонецЕсли;
	
	//  Округление.
	СметПрибыль.ПрямЗатраты 	= Окр(СметПрибыль.ПрямЗатраты,КолЗнаков);
	СметПрибыль.ТекПрямЗатраты 	= Окр(СметПрибыль.ТекПрямЗатраты,КолЗнаков);
	            	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
		Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат Тогда	
			ДобавПЗБезСоставл = 0;
			ИндексыПоСметеКЭлементам = ТаблРасчета.Добавить();
			ИндексыПоСметеКЭлементам.Итог = Справочники.СМ_ИтогиПоСмете.ИндексыПоСметеКЭлементам;
			ИндексыПоСметеКЭлементам.ПрямЗатраты 	= Окр(ИтогоПоСмете.ПрямЗатраты,КолЗнаков);
			ИндексыПоСметеКЭлементам.ОснЗарплата 	= Окр(ИтогоПоСмете.ОснЗарплата,КолЗнаков);
			ИндексыПоСметеКЭлементам.ЭксплМашин 	= Окр(ИтогоПоСмете.ЭксплМашин,КолЗнаков);
			ИндексыПоСметеКЭлементам.ЗарплМашин 	= Окр(ИтогоПоСмете.ЗарплМашин,КолЗнаков);
			ИндексыПоСметеКЭлементам.СтоимМатер 	= Окр(ИтогоПоСмете.СтоимМатер,КолЗнаков);
			ИндексыПоСметеКЭлементам.Оборуд			= Окр(ИтогоПоСмете.Оборуд,КолЗнаков);
			ИндексыПоСметеКЭлементам.ВозвратМатер   = Окр(ИтогоПоСмете.ВозвратМатер,КолЗнаков);
			
			ИндексыПоСметеКЭлементам.ТекПрямЗатраты = Окр(ИтогоПоСмете.ТекПрямЗатраты,КолЗнаков);
			Если ИтогоПоСмете.ТекОборуд = 0 Тогда
				ДобавПЗБезСоставл = ИтогоПоСмете.ПрямЗатраты - ИтогоПоСмете.ОснЗарплата - ИтогоПоСмете.ЭксплМашин - ИтогоПоСмете.СтоимМатер;
			Иначе
				ДобавПЗБезСоставл = ИтогоПоСмете.ПрямЗатраты - ИтогоПоСмете.ОснЗарплата - ИтогоПоСмете.ЭксплМашин - ИтогоПоСмете.СтоимМатер - ИтогоПоСмете.Оборуд ;
			КонецЕсли;
			ИндексыПоСметеКЭлементам.ТекОснЗарплата = Окр(ИтогоПоСмете.ТекОснЗарплата * ?(НаборКоэф.КоэффФОТ = 0,1,НаборКоэф.КоэффФОТ),КолЗнаков);
			ИндексыПоСметеКЭлементам.ТекСтоимМатер = Окр(ИтогоПоСмете.ТекСтоимМатер * ?(НаборКоэф.КоэффСтоимМатериалов = 0,1,НаборКоэф.КоэффСтоимМатериалов),КолЗнаков);
			ИндексыПоСметеКЭлементам.ТекВозвратМатер = Окр(ИтогоПоСмете.ТекВозвратМатер * ?(НаборКоэф.КоэффСтоимМатериалов = 0,1,НаборКоэф.КоэффСтоимМатериалов),КолЗнаков);
			Если Ссылка.ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.Разные Тогда
				ИндексыПоСметеКЭлементам.ТекЭксплМашин = Окр(ИтогоПоСмете.ТекЭксплМашин * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),КолЗнаков);
				ИндексыПоСметеКЭлементам.ТекЗарплМашин = Окр(ИтогоПоСмете.ТекЗарплМашин * ?(НаборКоэф.КоэффФОТ = 0,1,НаборКоэф.КоэффФОТ),КолЗнаков);
			ИначеЕсли Ссылка.ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.Одинаковые Тогда
				ИндексыПоСметеКЭлементам.ТекЭксплМашин = Окр(ИтогоПоСмете.ТекЭксплМашин * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),КолЗнаков);
				ИндексыПоСметеКЭлементам.ТекЗарплМашин = Окр(ИтогоПоСмете.ТекЗарплМашин * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),КолЗнаков);
			ИначеЕсли Ссылка.ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.РазныеКРазности Тогда
				ИндексыПоСметеКЭлементам.ТекЗарплМашин = Окр(ИтогоПоСмете.ТекЗарплМашин * ?(НаборКоэф.КоэффФОТ = 0,1,НаборКоэф.КоэффФОТ),КолЗнаков);
				ИндексыПоСметеКЭлементам.ТекЭксплМашин = Окр((ИтогоПоСмете.ТекЭксплМашин - ИтогоПоСмете.ЗарплМашин)* ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),КолЗнаков);
				ИндексыПоСметеКЭлементам.ТекЭксплМашин = ИндексыПоСметеКЭлементам.ТекЭксплМашин + ИндексыПоСметеКЭлементам.ТекЗарплМашин;
			КонецЕсли;	
			
			ИндексыПоСметеКЭлементам.ПрямЗатраты = Окр(ИндексыПоСметеКЭлементам.ОснЗарплата,КолЗнаков) + ИндексыПоСметеКЭлементам.СтоимМатер + ИндексыПоСметеКЭлементам.ЭксплМашин;
			ИндексыПоСметеКЭлементам.ТекПрямЗатраты = Окр(ИндексыПоСметеКЭлементам.ТекОснЗарплата,КолЗнаков) + ИндексыПоСметеКЭлементам.ТекСтоимМатер + ИндексыПоСметеКЭлементам.ТекЭксплМашин + ДобавПЗБезСоставл;
		КонецЕсли;
	КонецЕсли;
	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
		Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости Тогда	
			ВсегоСИндСМР = ТаблРасчета.Добавить();
			ВсегоСИндСМР.Итог = Справочники.СМ_ИтогиПоСмете.ВсегоСИндСМР;
			МассивВидовРабот = Новый Массив;
			МассивВидовРабот.Добавить(Справочники.СМ_ИтогиСметыПоВидамРабот.СтроитРаб);
			МассивВидовРабот.Добавить(Справочники.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб);
			МассивВидовРабот.Добавить(Справочники.СМ_ИтогиСметыПоВидамРабот.Металлоконстр);
			МассивВидовРабот.Добавить(Справочники.СМ_ИтогиСметыПоВидамРабот.СантехнРаб);
			МассивВидовРабот.Добавить(Справочники.СМ_ИтогиСметыПоВидамРабот.БуровзрывнРаб);
			МассивВидовРабот.Добавить(Справочники.СМ_ИтогиСметыПоВидамРабот.ГорнопрохРаб);
			Для Каждого СтрокаМассива Из МассивВидовРабот Цикл
				СтрокаИтога = ТаблицаИтоговПоВидамРабот.Найти(СтрокаМассива);
				Если НЕ СтрокаИтога = неопределено Тогда
					ВсегоСИндСМР.ПрямЗатраты 	= Окр(ВсегоСИндСМР.ПрямЗатраты,КолЗнаков) + Окр(СтрокаИтога.ПрямЗатраты,КолЗнаков);	
					ВсегоСИндСМР.ОснЗарплата 	= Окр(ВсегоСИндСМР.ОснЗарплата,КолЗнаков) + Окр(СтрокаИтога.ОснЗарплата,КолЗнаков);	
					ВсегоСИндСМР.ЭксплМашин 	= Окр(ВсегоСИндСМР.ЭксплМашин,КолЗнаков) + Окр(СтрокаИтога.ЭксплМашин,КолЗнаков);	
					ВсегоСИндСМР.ЗарплМашин 	= Окр(ВсегоСИндСМР.ЗарплМашин,КолЗнаков) + Окр(СтрокаИтога.ЗарплМашин,КолЗнаков);	
					ВсегоСИндСМР.СтоимМатер 	= Окр(ВсегоСИндСМР.СтоимМатер,КолЗнаков) + Окр(СтрокаИтога.СтоимМатер,КолЗнаков);	
					ВсегоСИндСМР.ВозвратМатер 	= Окр(ВсегоСИндСМР.ВозвратМатер,КолЗнаков) + Окр(СтрокаИтога.ВозвратМатер,КолЗнаков);	
					
					ВсегоСИндСМР.ТекПрямЗатраты = Окр(ВсегоСИндСМР.ТекПрямЗатраты,КолЗнаков) + Окр(СтрокаИтога.ТекПрямЗатраты,КолЗнаков);	
					ВсегоСИндСМР.ТекОснЗарплата = Окр(ВсегоСИндСМР.ТекОснЗарплата,КолЗнаков) + Окр(СтрокаИтога.ТекОснЗарплата,КолЗнаков);	
					ВсегоСИндСМР.ТекЭксплМашин 	= Окр(ВсегоСИндСМР.ТекЭксплМашин,КолЗнаков) + Окр(СтрокаИтога.ТекЭксплМашин,КолЗнаков);	
					ВсегоСИндСМР.ТекЗарплМашин 	= Окр(ВсегоСИндСМР.ТекЗарплМашин,КолЗнаков) + Окр(СтрокаИтога.ТекЗарплМашин,КолЗнаков);	
					ВсегоСИндСМР.ТекСтоимМатер 	= Окр(ВсегоСИндСМР.ТекСтоимМатер,КолЗнаков) + Окр(СтрокаИтога.ТекСтоимМатер,КолЗнаков);	
					ВсегоСИндСМР.ТекВозвратМатер 	= Окр(ВсегоСИндСМР.ТекВозвратМатер,КолЗнаков) + Окр(СтрокаИтога.ТекВозвратМатер,КолЗнаков);	
				КонецЕсли;
			КонецЦикла;
			
			
			ВсегоСИндСМР.ТекПрямЗатраты = Окр(ВсегоСИндСМР.ТекПрямЗатраты,КолЗнаков);	
			ВсегоСИндСМР.ТекОснЗарплата = Окр(ВсегоСИндСМР.ТекОснЗарплата,КолЗнаков);	
			ВсегоСИндСМР.ТекЭксплМашин 	= Окр(ВсегоСИндСМР.ТекЭксплМашин,КолЗнаков) ;	
			ВсегоСИндСМР.ТекЗарплМашин 	= Окр(ВсегоСИндСМР.ТекЗарплМашин,КолЗнаков) ;	
			ВсегоСИндСМР.ТекСтоимМатер 	= Окр(ВсегоСИндСМР.ТекСтоимМатер,КолЗнаков) ;
			ВсегоСИндСМР.ТекПрямЗатраты = ВсегоСИндСМР.ТекПрямЗатраты;
			ВсегоСИндСМР.ТекВозвратМатер = Окр(ВсегоСИндСМР.ТекВозвратМатер,КолЗнаков) ;

			ВсегоСИндНаПрочРаботы = ТаблРасчета.Добавить();
			ВсегоСИндНаПрочРаботы.Итог = Справочники.СМ_ИтогиПоСмете.ВсегоСИндНаПрочРаботы;
			СтрокаИтога = ТаблицаИтоговПоВидамРабот.Найти(Справочники.СМ_ИтогиСметыПоВидамРабот.ПрочРаб);
			Если НЕ СтрокаИтога = Неопределено Тогда
				ВсегоСИндНаПрочРаботы.ТекПрямЗатраты 	= Окр(СтрокаИтога.ТекПрямЗатраты,КолЗнаков);	
				ВсегоСИндНаПрочРаботы.ТекОснЗарплата 	= Окр(СтрокаИтога.ТекОснЗарплата,КолЗнаков);	
				ВсегоСИндНаПрочРаботы.ТекЭксплМашин 	= Окр(СтрокаИтога.ТекЭксплМашин,КолЗнаков);	
				ВсегоСИндНаПрочРаботы.ТекЗарплМашин 	= Окр(СтрокаИтога.ТекЗарплМашин,КолЗнаков);	
				ВсегоСИндНаПрочРаботы.ТекСтоимМатер 	= Окр(СтрокаИтога.ТекСтоимМатер,КолЗнаков);	
				ВсегоСИндНаПрочРаботы.ТекВозвратМатер 	= Окр(СтрокаИтога.ТекВозвратМатер,КолЗнаков);	
				ВсегоСИндНаПрочРаботы.ТекПрямЗатраты    = ВсегоСИндНаПрочРаботы.ТекПрямЗатраты;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета
		И СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат Тогда
		
		НаклСИндексом = ТаблРасчета.Добавить();
		НаклСИндексом.Итог = Справочники.СМ_ИтогиПоСмете.НаклСИндексом;
		Для каждого Колонка Из ТаблРасчета.Колонки Цикл
			Если ТипЗнч(НаклРасх[Колонка.Имя]) = Тип("Число") Тогда
				Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
					И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда 
						НаклСИндексом[Колонка.Имя] = Окр(НаклРасх[Колонка.Имя]*НаборКоэф.КоэффФОТ,КолЗнаков);
				Иначе
					НаклСИндексом[Колонка.Имя] = Окр(НаклРасх[Колонка.Имя],КолЗнаков);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		СметПрибыльСИндексом = ТаблРасчета.Добавить();
		СметПрибыльСИндексом.Итог = Справочники.СМ_ИтогиПоСмете.СметПрибыльСИндексом;
		Для Каждого Колонка Из ТаблРасчета.Колонки Цикл
			Если ТипЗнч(СметПрибыль[Колонка.Имя]) = Тип("Число") Тогда
				Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
					И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
						СметПрибыльСИндексом[Колонка.Имя] = Окр(СметПрибыль[Колонка.Имя]*НаборКоэф.КоэффФОТ,КолЗнаков);	
					Иначе
					СметПрибыльСИндексом[Колонка.Имя] = Окр(СметПрибыль[Колонка.Имя],КолЗнаков);	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета
		И СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости Тогда
		
		НаклСИндексом = ТаблРасчета.Добавить();
		НаклСИндексом.Итог = Справочники.СМ_ИтогиПоСмете.НаклСИндексом;
		Для каждого Колонка Из ТаблРасчета.Колонки Цикл
			Если ТипЗнч(НаклРасх[Колонка.Имя]) = Тип("Число") Тогда
				Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
					И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда 
					НаклСИндексом[Колонка.Имя] = Окр(НаклРасх[Колонка.Имя]*НаборКоэф.КоэффФОТ,КолЗнаков);
				Иначе
					НаклСИндексом[Колонка.Имя] = Окр(НаклРасх[Колонка.Имя],КолЗнаков);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		СметПрибыльСИндексом = ТаблРасчета.Добавить();
		СметПрибыльСИндексом.Итог = Справочники.СМ_ИтогиПоСмете.СметПрибыльСИндексом;
		Для Каждого Колонка Из ТаблРасчета.Колонки Цикл
			Если ТипЗнч(СметПрибыль[Колонка.Имя]) = Тип("Число") Тогда
				Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
					И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
					СметПрибыльСИндексом[Колонка.Имя] = Окр(СметПрибыль[Колонка.Имя]*НаборКоэф.КоэффФОТ,КолЗнаков);	
				Иначе
					СметПрибыльСИндексом[Колонка.Имя] = Окр(СметПрибыль[Колонка.Имя],КолЗнаков);	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
		ВсегоСИндКОборуд = ТаблРасчета.Добавить();
		ВсегоСИндКОборуд.Итог = Справочники.СМ_ИтогиПоСмете.ВсегоСИндКОборуд;
		Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости Тогда
			СтрокаИтога = ТаблицаИтоговПоВидамРабот.Найти(Справочники.СМ_ИтогиСметыПоВидамРабот.Оборуд);
			Если НЕ СтрокаИтога = неопределено Тогда
				ВсегоСИндКОборуд.Оборуд 	= Окр(СтрокаИтога.Оборуд,КолЗнаков);	
				ВсегоСИндКОборуд.ТекОборуд  = Окр(СтрокаИтога.ТекОборуд,КолЗнаков);
				ВсегоСИндКОборуд.ПрямЗатраты 	= Окр(СтрокаИтога.Оборуд,КолЗнаков);	
				ВсегоСИндКОборуд.ТекПрямЗатраты = Окр(СтрокаИтога.ТекОборуд,КолЗнаков);
			КонецЕсли;
		ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат Тогда	
			ВсегоСИндКОборуд.ПрямЗатраты 	= Окр(ИтогоПоСмете.Оборуд,КолЗнаков);
			ВсегоСИндКОборуд.ТекПрямЗатраты = Окр(ИтогоПоСмете.ТекОборуд * НаборКоэф.КоэффОборуд,КолЗнаков);
			ВсегоСИндКОборуд.Оборуд 	= Окр(ИтогоПоСмете.Оборуд,КолЗнаков);
			ВсегоСИндКОборуд.ТекОборуд = Окр(ИтогоПоСмете.ТекОборуд * НаборКоэф.КоэффОборуд,КолЗнаков);
		КонецЕсли;
	КонецЕсли;
	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
		И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
		Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости Тогда
			ВсегоСИндКСметСтоим 			= ТаблРасчета.Добавить();
			ВсегоСИндКСметСтоим.Итог 		= Справочники.СМ_ИтогиПоСмете.ВсегоСИндКСметСтоим;
			ВсегоСИндКСметСтоим.ПрямЗатраты = Окр(ИтогоПоСмете.ПрямЗатраты,КолЗнаков);
			ВсегоСИндКСметСтоим.ОснЗарплата = Окр(ИтогоПоСмете.ОснЗарплата,КолЗнаков);
			ВсегоСИндКСметСтоим.ЭксплМашин 	= Окр(ИтогоПоСмете.ЭксплМашин,КолЗнаков);
			ВсегоСИндКСметСтоим.ЗарплМашин 	= Окр(ИтогоПоСмете.ЗарплМашин,КолЗнаков);
			ВсегоСИндКСметСтоим.СтоимМатер 	= Окр(ИтогоПоСмете.СтоимМатер,КолЗнаков);
			ВсегоСИндКСметСтоим.ВозвратМатер= Окр(ИтогоПоСмете.ВозвратМатер,КолЗнаков);
			
			ВсегоСИндКСметСтоим.ТекПрямЗатраты 	= Окр(ВсегоСИндСМР.ТекПрямЗатраты,КолЗнаков) + ВсегоСИндНаПрочРаботы.ТекПрямЗатраты;
			ВсегоСИндКСметСтоим.ТекОснЗарплата 	= Окр(ВсегоСИндСМР.ТекОснЗарплата,КолЗнаков) + ВсегоСИндНаПрочРаботы.ТекОснЗарплата;
			ВсегоСИндКСметСтоим.ТекЭксплМашин	= Окр(ВсегоСИндСМР.ТекЭксплМашин,КолЗнаков) + ВсегоСИндНаПрочРаботы.ТекЭксплМашин;
			ВсегоСИндКСметСтоим.ТекЗарплМашин	= Окр(ВсегоСИндСМР.ТекЗарплМашин,КолЗнаков) + ВсегоСИндНаПрочРаботы.ТекЗарплМашин;
			ВсегоСИндКСметСтоим.ТекСтоимМатер 	= Окр(ВсегоСИндСМР.ТекСтоимМатер,КолЗнаков) + ВсегоСИндНаПрочРаботы.ТекСтоимМатер;
			ВсегоСИндКСметСтоим.ТекВозвратМатер = Окр(ВсегоСИндСМР.ТекВозвратМатер,КолЗнаков) + ВсегоСИндНаПрочРаботы.ТекВозвратМатер;
		КонецЕсли;
	КонецЕсли;
	
	ВсегоПоСмете = ТаблРасчета.Добавить();
	ВсегоПоСмете.Итог = Справочники.СМ_ИтогиПоСмете.ВсегоПоСмете;
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
		Если Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
			Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости Тогда 
				ВсегоПоСмете.ПрямЗатраты 	= ИтогоПоСмете.ПрямЗатраты + НаклРасх.ПрямЗатраты + СметПрибыль.ПрямЗатраты ;
				ВсегоПоСмете.ОснЗарплата 	= ИтогоПоСмете.ОснЗарплата;
				ВсегоПоСмете.ЭксплМашин 	= ИтогоПоСмете.ЭксплМашин;
				ВсегоПоСмете.ЗарплМашин 	= ИтогоПоСмете.ЗарплМашин;
				ВсегоПоСмете.СтоимМатер 	= ИтогоПоСмете.СтоимМатер;
				ВсегоПоСмете.Оборуд			= ИтогоПоСмете.Оборуд;
				ВсегоПоСмете.ВозвратМатер 	= ИтогоПоСмете.ВозвратМатер;
				
				ВсегоПоСмете.ТекПрямЗатраты = ВсегоСИндКСметСтоим.ТекПрямЗатраты + ВсегоСИндКОборуд.ТекПрямЗатраты;
				ВсегоПоСмете.ТекОснЗарплата = ВсегоСИндКСметСтоим.ТекОснЗарплата;
				ВсегоПоСмете.ТекЭксплМашин 	= ВсегоСИндКСметСтоим.ТекЭксплМашин;
				ВсегоПоСмете.ТекЗарплМашин 	= ВсегоСИндКСметСтоим.ТекЗарплМашин;
				ВсегоПоСмете.ТекСтоимМатер 	= ВсегоСИндКСметСтоим.ТекСтоимМатер;
				ВсегоПоСмете.ТекОборуд		= ВсегоСИндКСметСтоим.ТекОборуд;
				ВсегоПоСмете.ТекВозвратМатер = ВсегоСИндКСметСтоим.ТекВозвратМатер;

			ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат Тогда
				ВсегоПоСмете.ПрямЗатраты 	= ИтогоПоСмете.ПрямЗатраты + НаклРасх.ПрямЗатраты + СметПрибыль.ПрямЗатраты ;
				ВсегоПоСмете.ОснЗарплата 	= ИтогоПоСмете.ОснЗарплата;
				ВсегоПоСмете.ЭксплМашин 	= ИтогоПоСмете.ЭксплМашин ;
				ВсегоПоСмете.ЗарплМашин 	= ИтогоПоСмете.ЗарплМашин ;
				ВсегоПоСмете.СтоимМатер 	= ИтогоПоСмете.СтоимМатер ;
				ВсегоПоСмете.Оборуд			= ИтогоПоСмете.Оборуд ;
				ВсегоПоСмете.ВозвратМатер 	= ИтогоПоСмете.ВозвратМатер ;
				
				ВсегоПоСмете.ТекПрямЗатраты = ИндексыПоСметеКЭлементам.ТекПрямЗатраты + НаклСИндексом.ТекПрямЗатраты + СметПрибыльСИндексом.ТекПрямЗатраты + ВсегоСИндКОборуд.ТекПрямЗатраты;
				ВсегоПоСмете.ТекОснЗарплата = ИндексыПоСметеКЭлементам.ТекОснЗарплата  ;
				ВсегоПоСмете.ТекЭксплМашин 	= ИндексыПоСметеКЭлементам.ТекЭксплМашин ;
				ВсегоПоСмете.ТекЗарплМашин 	= ИндексыПоСметеКЭлементам.ТекЗарплМашин ;
				ВсегоПоСмете.ТекСтоимМатер 	= ИндексыПоСметеКЭлементам.ТекСтоимМатер ;
				ВсегоПоСмете.ТекОборуд		= ИндексыПоСметеКЭлементам.ТекОборуд;
				ВсегоПоСмете.ТекВозвратМатер = ИндексыПоСметеКЭлементам.ТекВозвратМатер ;
			КонецЕсли;
		Иначе
			ВсегоПоСмете.ПрямЗатраты 	= ИтогоПоСмете.ПрямЗатраты + НаклРасх.ПрямЗатраты + СметПрибыль.ПрямЗатраты;
			ВсегоПоСмете.ОснЗарплата 	= ИтогоПоСмете.ОснЗарплата ;
			ВсегоПоСмете.ЭксплМашин 	= ИтогоПоСмете.ЭксплМашин;
			ВсегоПоСмете.ЗарплМашин 	= ИтогоПоСмете.ЗарплМашин;
			ВсегоПоСмете.СтоимМатер 	= ИтогоПоСмете.СтоимМатер;
			ВсегоПоСмете.Оборуд		 	= ИтогоПоСмете.Оборуд;
			ВсегоПоСмете.ВозвратМатер 	= ИтогоПоСмете.ВозвратМатер;
			
			ВсегоПоСмете.ТекПрямЗатраты = ИтогоПоСмете.ТекПрямЗатраты + НаклРасх.ТекПрямЗатраты + СметПрибыль.ТекПрямЗатраты;
			ВсегоПоСмете.ТекОснЗарплата = ИтогоПоСмете.ТекОснЗарплата ;
			ВсегоПоСмете.ТекЭксплМашин 	= ИтогоПоСмете.ТекЭксплМашин ;
			ВсегоПоСмете.ТекЗарплМашин 	= ИтогоПоСмете.ТекЗарплМашин ;
			ВсегоПоСмете.ТекСтоимМатер 	= ИтогоПоСмете.ТекСтоимМатер;
			ВсегоПоСмете.ТекОборуд		= ИтогоПоСмете.ТекОборуд ;
			ВсегоПоСмете.ТекВозвратМатер = ИтогоПоСмете.ТекВозвратМатер;
		КонецЕсли;	
	КонецЕсли;
	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
		Если МетодикаРСНБ Тогда
			ВсегоПоСмете.ПрямЗатраты 	= ИтогоСУчетомНаклРасх2.ПрямЗатраты + СметПрибыль.ПрямЗатраты;
			ВсегоПоСмете.ТекПрямЗатраты = ИтогоСУчетомНаклРасх2.ТекПрямЗатраты + СметПрибыль.ТекПрямЗатраты;
		Иначе
			ВсегоПоСмете.ПрямЗатраты 	= ИтогоПоСмете.ПрямЗатраты + НаклРасх.ПрямЗатраты + СметПрибыль.ПрямЗатраты;
			ВсегоПоСмете.ТекПрямЗатраты = ИтогоПоСмете.ТекПрямЗатраты + НаклРасх.ТекПрямЗатраты + СметПрибыль.ТекПрямЗатраты;	
		КонецЕсли;
		ВсегоПоСмете.ОснЗарплата 	= ИтогоПоСмете.ОснЗарплата;
		ВсегоПоСмете.ЭксплМашин 	= ИтогоПоСмете.ЭксплМашин ;
		ВсегоПоСмете.ЗарплМашин 	= ИтогоПоСмете.ЗарплМашин ;
		ВсегоПоСмете.СтоимМатер 	= ИтогоПоСмете.СтоимМатер ;
		ВсегоПоСмете.Оборуд		 	= ИтогоПоСмете.Оборуд ;
		ВсегоПоСмете.ВозвратМатер 	= ИтогоПоСмете.ВозвратМатер ;
		
		ВсегоПоСмете.ТекОснЗарплата = ИтогоПоСмете.ТекОснЗарплата ;
		ВсегоПоСмете.ТекЭксплМашин 	= ИтогоПоСмете.ТекЭксплМашин;
		ВсегоПоСмете.ТекЗарплМашин 	= ИтогоПоСмете.ТекЗарплМашин ;
		ВсегоПоСмете.ТекСтоимМатер 	= ИтогоПоСмете.ТекСтоимМатер;
		ВсегоПоСмете.ТекОборуд		= ИтогоПоСмете.ТекОборуд;
		ВсегоПоСмете.ТекВозвратМатер 	= ИтогоПоСмете.ТекВозвратМатер;
	КонецЕсли;
	
	ТаблРасчета.ЗаполнитьЗначения(Ссылка,"Смета");
	Отбор = Новый Структура("Смета",Ссылка);
	СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_ИтогиПоСмете",Отбор,ТаблРасчета);
	
КонецПроцедуры

// Обработка расчета итогов по разделу, рассчитывает итоги для всех 
//	методов счета базисно-индексный(уровень задания индексов расценка, раздел, смета.
//	Способ задания индексов по эелементам затрат, к полной стоимости.
//
// Параметры:
//     ТекСсылка 	- ДокументСсылка.СМ_РазделЛокальнойСметы - ссылка на раздел.
//     ЛС 			- ДокументСсылка.СМ_ЛокальнаяСмета - ссылка на локальную смету.  
//     Акт 			- ДокументСсылка.СМ_АктыВыполненныхРабот - ссылка на акт выполненных работ.
//     СтруктураПараметровОтбораРС - Структура - содержит дополнительный отбор результирующего регистра сведений.
//
Процедура СформироватьИтогиПоРазделу(ТекСсылка, ЛС, Акт = неопределено, СтруктураПараметровОтбораРС = Неопределено) Экспорт
	
	Если СтруктураПараметровОтбораРС = Неопределено Тогда
		СтруктураПараметровОтбораРС = СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(ТекСсылка, Акт, "СМ_РазделЛокальнойСметы");
	КонецЕсли;
	
	//Методика1984 = ЛС.Методика1984;
	Методика1984 = Ложь;
	МетодикаРСНБ = Ложь;
	Если ЛС.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_Методика84года Тогда
		Методика1984 = Истина;	
	ИначеЕсли ЛС.МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_КЗ_РСНБ Тогда
		МетодикаРСНБ = Истина;
	КонецЕсли;
	РасчетНРиСПотПЗ = ЛС.РасчетНРиСПотПЗ;
	
	Если Акт = Неопределено Тогда
		Округлять 	= ЛС.ОкруглятьДоРублей;	
		ОкруглятьПромежуточное 	= ЛС.ПромежуточноеОкругление;	
		НаборКоэф 	= ТекСсылка;	
		ФлагАкт 	= Ложь;
	Иначе                                              
		НаборКоэф  	= Акт.Разделы.Найти(СтруктураПараметровОтбораРС.СсылкаНаРаздел);
		ФлагАкт 	= Истина;
		Округлять 	= Акт.ОкруглятьДоРублей;
		ОкруглятьПромежуточное 	= ЛС.ПромежуточноеОкругление;	
	КонецЕсли;
	
	Если Округлять Тогда
		КолЗнаков = 0;
		КолЗнаковРубли = 2;
	ИначеЕсли ОкруглятьПромежуточное Тогда
		КолЗнаков = 2;
		КолЗнаковРубли = 2;
	Иначе
		КолЗнаков = 6;
		КолЗнаковРубли = 6;
	КонецЕсли;
	
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6));

	ТаблРасчета = Новый ТаблицаЗначений();
	ТаблРасчета.Колонки.Добавить("Смета");
	ТаблРасчета.Колонки.Добавить("Раздел");
	ТаблРасчета.Колонки.Добавить("Итог");
	ТаблРасчета.Колонки.Добавить("ВозвратМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗарплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗатратыТрудаМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗатратыТрудаРабочих",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("Оборуд",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ОснЗарплата",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ПрямЗатраты",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("СтоимМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекВозвратМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекЗарплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекОборуд",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекОснЗарплата",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекПрямЗатраты",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекСтоимМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекЭксплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЭксплМашин",ОписаниеТипаЧисло);	   
	
	ТабРезультат = СМ_СметаВызовСервера.ПолучитьТаблицуПодчиненных(СтруктураПараметровОтбораРС.СсылкаНаРаздел, Истина, Ложь, Ложь, Ложь);
	
	СписокПодчиненныхРазделов = Новый СписокЗначений();
	СписокПодчиненныхРазделов.ЗагрузитьЗначения(ТабРезультат.ВыгрузитьКолонку("Ид"));	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СМ_ИтогиПоРазделу.Смета,
	|	СМ_ИтогиПоРазделу.Раздел,
	|	СМ_ИтогиПоРазделу.Итог,
	|	СМ_ИтогиПоРазделу.ВозвратМатер,
	|	СМ_ИтогиПоРазделу.ЗарплМашин,
	|	СМ_ИтогиПоРазделу.ЗатратыТрудаМашин,
	|	СМ_ИтогиПоРазделу.ЗатратыТрудаРабочих,
	|	СМ_ИтогиПоРазделу.Оборуд,
	|	СМ_ИтогиПоРазделу.ОснЗарплата,
	|	СМ_ИтогиПоРазделу.ПрямЗатраты,
	|	СМ_ИтогиПоРазделу.СтоимМатер,
	|	СМ_ИтогиПоРазделу.ТекВозвратМатер,
	|	СМ_ИтогиПоРазделу.ТекЗарплМашин,
	|	СМ_ИтогиПоРазделу.ТекОборуд,
	|	СМ_ИтогиПоРазделу.ТекОснЗарплата,
	|	СМ_ИтогиПоРазделу.ТекПрямЗатраты,
	|	СМ_ИтогиПоРазделу.ТекСтоимМатер,
	|	СМ_ИтогиПоРазделу.ТекЭксплМашин,
	|	СМ_ИтогиПоРазделу.ЭксплМашин
	|ИЗ
	|	РегистрСведений.СМ_ИтогиПоРазделу КАК СМ_ИтогиПоРазделу
	|ГДЕ
	|	СМ_ИтогиПоРазделу.Смета = &Смета
	|	И СМ_ИтогиПоРазделу.Раздел В(&Раздел)";
	
	Запрос.УстановитьПараметр("Смета", СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	Запрос.УстановитьПараметр("Раздел", СписокПодчиненныхРазделов);

	ТабРезультат = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаНабора Из ТабРезультат Цикл
		// Собираются итоги по подчиненным разделам нижнего уровня.
		
		СтрокаТаблицыРасчета = ТаблРасчета.Найти(СтрокаНабора.Итог,"Итог");
		Если СтрокаТаблицыРасчета = Неопределено Тогда
			СтрокаТаблицыРасчета = ТаблРасчета.Добавить();
			СтрокаТаблицыРасчета.Итог = СтрокаНабора.Итог;
		КонецЕсли;
		
		СтрокаТаблицыРасчета.ПрямЗатраты            = Окр(СтрокаТаблицыРасчета.ПрямЗатраты,КолЗнаков) + Окр(СтрокаНабора.ПрямЗатраты,КолЗнаков); 
		СтрокаТаблицыРасчета.ОснЗарплата 			= Окр(СтрокаТаблицыРасчета.ОснЗарплата,КолЗнаков) + Окр(СтрокаНабора.ОснЗарплата,КолЗнаков);
		СтрокаТаблицыРасчета.ЭксплМашин 			= Окр(СтрокаТаблицыРасчета.ЭксплМашин,КолЗнаков)  + Окр(СтрокаНабора.ЭксплМашин,КолЗнаков);
		СтрокаТаблицыРасчета.ЗарплМашин 			= Окр(СтрокаТаблицыРасчета.ЗарплМашин,КолЗнаков) + Окр(СтрокаНабора.ЗарплМашин,КолЗнаков);
		СтрокаТаблицыРасчета.СтоимМатер 			= Окр(СтрокаТаблицыРасчета.СтоимМатер,КолЗнаков) + Окр(СтрокаНабора.СтоимМатер,КолЗнаков);
		СтрокаТаблицыРасчета.Оборуд 				= Окр(СтрокаТаблицыРасчета.Оборуд,КолЗнаков) + Окр(СтрокаНабора.Оборуд,КолЗнаков);
		СтрокаТаблицыРасчета.ВозвратМатер 		    = Окр(СтрокаТаблицыРасчета.ВозвратМатер,КолЗнаков) + Окр(СтрокаНабора.ВозвратМатер,КолЗнаков);
		СтрокаТаблицыРасчета.ЗатратыТрудаРабочих 	= Окр(СтрокаТаблицыРасчета.ЗатратыТрудаРабочих + СтрокаНабора.ЗатратыТрудаРабочих,2);
		СтрокаТаблицыРасчета.ЗатратыТрудаМашин   	= Окр(СтрокаТаблицыРасчета.ЗатратыТрудаМашин + СтрокаНабора.ЗатратыТрудаМашин,2);
		
		СтрокаТаблицыРасчета.ТекПрямЗатраты 	= Окр(СтрокаТаблицыРасчета.ТекПрямЗатраты,КолЗнаков) + Окр(СтрокаНабора.ТекПрямЗатраты,КолЗнаков);
		СтрокаТаблицыРасчета.ТекОснЗарплата 	= Окр(СтрокаТаблицыРасчета.ТекОснЗарплата,КолЗнаков) + Окр(СтрокаНабора.ТекОснЗарплата,КолЗнаков);
		СтрокаТаблицыРасчета.ТекЭксплМашин 		= Окр(СтрокаТаблицыРасчета.ТекЭксплМашин,КолЗнаков) + Окр(СтрокаНабора.ТекЭксплМашин,КолЗнаков);
		СтрокаТаблицыРасчета.ТекЗарплМашин 		= Окр(СтрокаТаблицыРасчета.ТекЗарплМашин,КолЗнаков)  + Окр(СтрокаНабора.ТекЗарплМашин,КолЗнаков);
		СтрокаТаблицыРасчета.ТекСтоимМатер 		= Окр(СтрокаТаблицыРасчета.ТекСтоимМатер,КолЗнаков) + Окр(СтрокаНабора.ТекСтоимМатер,КолЗнаков);
		СтрокаТаблицыРасчета.ТекОборуд 			= Окр(СтрокаТаблицыРасчета.ТекОборуд,КолЗнаков) + Окр(СтрокаНабора.ТекОборуд,КолЗнаков);
		СтрокаТаблицыРасчета.ТекВозвратМатер 	= Окр(СтрокаТаблицыРасчета.ТекВозвратМатер,КолЗнаков) + Окр(СтрокаНабора.ТекВозвратМатер,КолЗнаков);
		
	КонецЦикла;
	
	МетодРасчета = ЛС.МетодРасчета;
	СпособРасчетаИндексов = ЛС.СпособРасчетаИндексов;
	ВариантПересчетаЭММ   = ЛС.ВариантПересчетаЭММ;
	Уровень   = ЛС.Уровень;
	
	МатериалыВТекЦенах = 0;
	ОборудованиеВТекЦенах = 0;
	ПрямыеЗатратыВТекЦенах = 0;
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
		Если Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			ЗапросНеИнд = Новый Запрос;
			Если ФлагАкт Тогда
				ЗапросНеИнд.Текст = "ВЫБРАТЬ
				|	ПозицияЛокальнойСметы.Ссылка,
				|	ПозицияЛокальнойСметы.Ссылка.ТекущаяЦена КАК ТекущаяЦена,
				|	ВЫБОР
				|		КОГДА ПозицияЛокальнойСметы.Ссылка.Определитель.ВидРасценки = &ВидРасценкиОборудование
				|			ТОГДА ПозицияЛокальнойСметы.Ссылка.ТекущаяЦена * АктВыполненныхРаботПозиции.ФактОбъем
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ТекСтоимОборудование,
				|	ВЫБОР
				|		КОГДА ПозицияЛокальнойСметы.Ссылка.Определитель.ВидРасценки = &ВидРасценкиМатериал
				|			ТОГДА ПозицияЛокальнойСметы.Ссылка.ТекущаяЦена * АктВыполненныхРаботПозиции.ФактОбъем
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ТекСтоимМатериалов,
				|	ВЫБОР
				|		КОГДА ПозицияЛокальнойСметы.Ссылка.Определитель.ВидРасценки <> &ВидРасценкиМатериал И
				|		 ПозицияЛокальнойСметы.Ссылка.Определитель.ВидРасценки <> &ВидРасценкиОборудование
				|			ТОГДА ПозицияЛокальнойСметы.Ссылка.ТекущаяЦена * АктВыполненныхРаботПозиции.ФактОбъем
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ТекСтоимПрямыхЗатрат
				|ИЗ
				|	Документ.СМ_ПозицияЛокальнойСметы КАК ПозицияЛокальнойСметы
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.Позиции КАК АктВыполненныхРаботПозиции
				|		ПО ПозицияЛокальнойСметы.Ссылка = АктВыполненныхРаботПозиции.Позиция
				|ГДЕ
				|	ПозицияЛокальнойСметы.Ссылка.ИДРодителя = &Раздел
				|	И АктВыполненныхРаботПозиции.Ссылка = &Смета
				|	И ПозицияЛокальнойСметы.Ссылка.Расчет = ИСТИНА
				|	И ПозицияЛокальнойСметы.Ссылка.НеПрименятьИндексы = ИСТИНА
				|ИТОГИ
				|	СУММА(ТекущаяЦена),
				|	СУММА(ТекСтоимОборудование),
				|	СУММА(ТекСтоимМатериалов),
				|	СУММА(ТекСтоимПрямыхЗатрат)
				|ПО
				|	ОБЩИЕ";
			Иначе
				ЗапросНеИнд.Текст = "ВЫБРАТЬ
				|	ПозицияЛокальнойСметы.Ссылка,
				|	ПозицияЛокальнойСметы.Ссылка.ТекущаяЦена КАК ТекущаяЦена,
				|	ВЫБОР
				|		КОГДА ПозицияЛокальнойСметы.Ссылка.Определитель.ВидРасценки = &ВидРасценкиОборудование
				|			ТОГДА ПозицияЛокальнойСметы.Ссылка.ТекущаяЦена * ПозицияЛокальнойСметы.ОбъемРабот
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ТекСтоимОборудование,
				|	ВЫБОР
				|		КОГДА ПозицияЛокальнойСметы.Ссылка.Определитель.ВидРасценки = &ВидРасценкиМатериал
				|			ТОГДА ПозицияЛокальнойСметы.Ссылка.ТекущаяЦена * ПозицияЛокальнойСметы.ОбъемРабот
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ТекСтоимМатериалов,
				|	ВЫБОР
				|		КОГДА ПозицияЛокальнойСметы.Ссылка.Определитель.ВидРасценки <> &ВидРасценкиМатериал И
				|		 ПозицияЛокальнойСметы.Ссылка.Определитель.ВидРасценки <> &ВидРасценкиОборудование
				|			ТОГДА ПозицияЛокальнойСметы.Ссылка.ТекущаяЦена * ПозицияЛокальнойСметы.ОбъемРабот
				|		ИНАЧЕ 0
				|	КОНЕЦ КАК ТекСтоимПрямыхЗатрат
				|ИЗ
				|	Документ.СМ_ПозицияЛокальнойСметы КАК ПозицияЛокальнойСметы
				|ГДЕ
				|	ПозицияЛокальнойСметы.Ссылка.ИДРодителя = &Раздел
				|	И ПозицияЛокальнойСметы.Ссылка.ИДСметы = &Смета
				|	И ПозицияЛокальнойСметы.Ссылка.Расчет = ИСТИНА
				|	И ПозицияЛокальнойСметы.Ссылка.НеПрименятьИндексы = ИСТИНА
				|ИТОГИ
				|	СУММА(ТекущаяЦена),
				|	СУММА(ТекСтоимОборудование),
				|	СУММА(ТекСтоимМатериалов),
				|	СУММА(ТекСтоимПрямыхЗатрат)
				|ПО
				|	ОБЩИЕ";
				
			КонецЕсли;
			
			ЗапросНеИнд.УстановитьПараметр("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);
			ЗапросНеИнд.УстановитьПараметр("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
			ЗапросНеИнд.УстановитьПараметр("ФлагАкт",ФлагАкт);
			ЗапросНеИнд.УстановитьПараметр("ВидРасценкиОборудование", Перечисления.СМ_ВидыРасценки.Оборудование);
			ЗапросНеИнд.УстановитьПараметр("ВидРасценкиМатериал", Перечисления.СМ_ВидыРасценки.Материал);
			// Итоги По разделу с признаком НеИндексировать в текущих ценах.
			ТаблПозицииНеИнд = ЗапросНеИнд.Выполнить().Выгрузить();
			Если ТаблПозицииНеИнд.Количество()=0 Тогда
				СтрокаТаблПозиции = ТаблПозицииНеИнд.Добавить();
				Для Сч = 0 По ТаблПозицииНеИнд.Колонки.Количество()-1 Цикл
					СтрокаТаблПозиции[Сч] = 0;	
				КонецЦикла;
			КонецЕсли;
			ИтоговаяСтрокаНеИнд = ТаблПозицииНеИнд[0];
			МатериалыВТекЦенах = Окр(ИтоговаяСтрокаНеИнд.ТекСтоимМатериалов,КолЗнаков);
			ОборудованиеВТекЦенах = Окр(ИтоговаяСтрокаНеИнд.ТекСтоимОборудование,КолЗнаков);
			ПрямыеЗатратыВТекЦенах = Окр(ИтоговаяСтрокаНеИнд.ТекСтоимПрямыхЗатрат,КолЗнаков);
		КонецЕсли;	
	КонецЕсли;	
	
	ЗапросБИ = Новый Запрос;
	Если ФлагАкт = Истина Тогда
		ЗапросБИ.Текст = " 
		|ВЫБРАТЬ
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимПрямЗатраты * АктВыполненныхРаботПозиции.ФактОбъем, 0) 	КАК СтоимПрямЗатраты,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата * АктВыполненныхРаботПозиции.ФактОбъем, 0) 	КАК СтоимОснЗарплата,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин * АктВыполненныхРаботПозиции.ФактОбъем, 0)	КАК СтоимЭксплМашин,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин * АктВыполненныхРаботПозиции.ФактОбъем, 0) 	КАК СтоимЗарплМашин,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер * АктВыполненныхРаботПозиции.ФактОбъем, 0)	КАК СтоимСтоимМатер,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд * АктВыполненныхРаботПозиции.ФактОбъем, 0)		КАК СтоимОборуд,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер * АктВыполненныхРаботПозиции.ФактОбъем, 0) 	КАК СтоимВозвратМатер,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаРабочих * АктВыполненныхРаботПозиции.ФактОбъем, 0)КАК ЗатратыТрудаРабочих,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаМашин * АктВыполненныхРаботПозиции.ФактОбъем, 0) 	КАК ЗатратыТрудаМашин,
		|	ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ДопЗМ * АктВыполненныхРаботПозиции.ФактОбъем, 0) 				КАК ДопЗМ,
		|   НРиСП.СуммаНРНаОбъем + НРиСП.СуммаНРМашинистовНаОбъем КАК СуммаНРБазисная,
		|   НРиСП.СуммаСПНаОбъем + НРиСП.СуммаСПМашинистовНаОбъем КАК СуммаСПБазисная,
		|   НРиСП.ТекСуммаНРНаОбъем + НРиСП.ТекСуммаНРМашинистовНаОбъем КАК СуммаНРТекущая,
		|   НРиСП.ТекСуммаСПНаОбъем + НРиСП.ТекСуммаСПМашинистовНаОбъем КАК СуммаСПТекущая,
		|   НРиСП.ДобавкаТР КАК СуммаДобавкаТР,
		|   НРиСП.ДобавкаОЗ КАК СуммаДобавкаОЗ
		|ИЗ
		|	РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.Позиции КАК АктВыполненныхРаботПозиции
		|	ПО БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = АктВыполненныхРаботПозиции.Позиция 
		|	 И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = АктВыполненныхРаботПозиции.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НРиСП КАК НРиСП
		|	ПО БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = НРиСП.Смета  
		|	   И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = НРиСП.Раздел 
		|	   И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = НРиСП.Позиция
		|ГДЕ
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = &Раздел 
		|	И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета 
		|	И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Расчет = ИСТИНА ";
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
			И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			
			ЗапросБИ.Текст = ЗапросБИ.Текст + "
			|	И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.НеПрименятьИндексы = Ложь";
		КонецЕсли;
		
		ЗапросБИ.Текст = ЗапросБИ.Текст + "
		|ИТОГИ
		|	СУММА(СтоимПрямЗатраты),
		|	СУММА(СтоимОснЗарплата),
		|	СУММА(СтоимЭксплМашин),
		|	СУММА(СтоимЗарплМашин),
		|	СУММА(СтоимСтоимМатер),
		|	СУММА(СтоимОборуд),
		|	СУММА(СтоимВозвратМатер),
		|	СУММА(ЗатратыТрудаРабочих),
		|	СУММА(ЗатратыТрудаМашин),
		|	СУММА(СуммаНРБазисная),
		|	СУММА(СуммаСПБазисная),
		|	СУММА(СуммаНРТекущая),
		|	СУММА(СуммаСПТекущая),
		|	СУММА(СуммаДобавкаТР),
		|	СУММА(СуммаДобавкаОЗ)
		|ПО
		|	ОБЩИЕ";
		
	Иначе	
		ЗапросБИ.Текст = " 
		|ВЫБРАТЬ
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимПрямЗатраты * ПозицияЛокальнойСметы.ОбъемРабот, 0) КАК СтоимПрямЗатраты,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата * ПозицияЛокальнойСметы.ОбъемРабот, 0) КАК СтоимОснЗарплата,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин * ПозицияЛокальнойСметы.ОбъемРабот, 0)	КАК СтоимЭксплМашин,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин * ПозицияЛокальнойСметы.ОбъемРабот, 0) КАК СтоимЗарплМашин,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер * ПозицияЛокальнойСметы.ОбъемРабот, 0)	КАК СтоимСтоимМатер,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд * ПозицияЛокальнойСметы.ОбъемРабот, 0)	КАК СтоимОборуд,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер * ПозицияЛокальнойСметы.ОбъемРабот, 0) КАК СтоимВозвратМатер,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаРабочих * ПозицияЛокальнойСметы.ОбъемРабот, 0) КАК ЗатратыТрудаРабочих,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаМашин * ПозицияЛокальнойСметы.ОбъемРабот, 0) КАК ЗатратыТрудаМашин,
		|		ЕСТЬNULL(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ДопЗМ * ПозицияЛокальнойСметы.ОбъемРабот, 0) КАК ДопЗМ,
		|    	НРиСП.СуммаНРНаОбъем + НРиСП.СуммаНРМашинистовНаОбъем КАК СуммаНРБазисная,
		|   	НРиСП.СуммаСПНаОбъем + НРиСП.СуммаСПМашинистовНаОбъем КАК СуммаСПБазисная,
		|   	НРиСП.ТекСуммаНРНаОбъем + НРиСП.ТекСуммаНРМашинистовНаОбъем КАК СуммаНРТекущая,
		|   	НРиСП.ТекСуммаСПНаОбъем + НРиСП.ТекСуммаСПМашинистовНаОбъем КАК СуммаСПТекущая,
		|  		НРиСП.ДобавкаТР КАК СуммаДобавкаТР,
		|   	НРиСП.ДобавкаОЗ КАК СуммаДобавкаОЗ
		|ИЗ
		|	РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК ПозицияЛокальнойСметы
		|	ПО БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = ПозицияЛокальнойСметы.Ссылка 
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НРиСП КАК НРиСП
		|	ПО БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = НРиСП.Смета  
		|	   И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = НРиСП.Раздел 
		|	   И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = НРиСП.Позиция
		|ГДЕ
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = &Раздел 
		|	И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета 
		|	И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Расчет = ИСТИНА ";
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
			И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			
			ЗапросБИ.Текст = ЗапросБИ.Текст + "
			|	И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.НеПрименятьИндексы = Ложь";
		КонецЕсли;
		
		ЗапросБИ.Текст = ЗапросБИ.Текст + "
		|ИТОГИ
		|	СУММА(СтоимПрямЗатраты),
		|	СУММА(СтоимОснЗарплата),
		|	СУММА(СтоимЭксплМашин),
		|	СУММА(СтоимЗарплМашин),
		|	СУММА(СтоимСтоимМатер),
		|	СУММА(СтоимОборуд),
		|	СУММА(СтоимВозвратМатер),
		|	СУММА(ЗатратыТрудаРабочих),
		|	СУММА(ЗатратыТрудаМашин),
		|	СУММА(ДопЗМ),
		|	СУММА(СуммаНРБазисная),
		|	СУММА(СуммаСПБазисная),
		|	СУММА(СуммаНРТекущая),
		|	СУММА(СуммаСПТекущая),
		|	СУММА(СуммаДобавкаТР),
		|	СУММА(СуммаДобавкаОЗ)
		|ПО
		|	ОБЩИЕ";
	КонецЕсли;
	
	ЗапросБИ.УстановитьПараметр("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);
	ЗапросБИ.УстановитьПараметр("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	
	ЗапросБЕ = Новый Запрос;
	Если ФлагАкт = Истина Тогда
		ЗапросБЕ.Текст = "
		|ВЫБРАТЬ
		|	ЕСТЬNULL(АктВыполненныхРаботПозиции.ФактОбъем, 0) 	КАК Объем,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимПрямЗатраты, 0) 	КАК СтоимПрямЗатраты,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОснЗарплата, 0) 	КАК СтоимОснЗарплата,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЭксплМашин, 0) 	КАК СтоимЭксплМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЗарплМашин, 0)  	КАК СтоимЗарплМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимСтоимМатер, 0)  	КАК СтоимСтоимМатер,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОборуд, 0)  		КАК СтоимОборуд,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимВозвратМатер, 0)  	КАК СтоимВозвратМатер,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаРабочих * АктВыполненныхРаботПозиции.ФактОбъем, 0)	КАК ЗатратыТрудаРабочих,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаМашин * АктВыполненныхРаботПозиции.ФактОбъем, 0)   КАК ЗатратыТрудаМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимПрямЗатраты, 0) КАК ТекСтоимПрямЗатраты,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата, 0)	КАК ТекСтоимОснЗарплата,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин, 0)  КАК ТекСтоимЭксплМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЗарплМашин, 0) 	КАК ТекСтоимЗарплМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер, 0) 	КАК ТекСтоимСтоимМатер,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОборуд, 0) 		КАК ТекСтоимОборуд,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимВозвратМатер, 0)КАК ТекСтоимВозвратМатер,
		|	НРиСП.СуммаНРНаОбъем + НРиСП.СуммаНРМашинистовНаОбъем КАК СуммаНРБазисная,
		|   НРиСП.СуммаСПНаОбъем + НРиСП.СуммаСПМашинистовНаОбъем КАК СуммаСПБазисная,
		|   НРиСП.ТекСуммаНРНаОбъем + НРиСП.ТекСуммаНРМашинистовНаОбъем КАК СуммаНРТекущая,
		|   НРиСП.ТекСуммаСПНаОбъем + НРиСП.ТекСуммаСПМашинистовНаОбъем КАК СуммаСПТекущая,
		|  	НРиСП.ДобавкаТР КАК СуммаДобавкаТР,
		|	НРиСП.ДобавкаОЗ КАК СуммаДобавкаОЗ
		|ИЗ
		|	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.Позиции КАК АктВыполненныхРаботПозиции
		|	ПО БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = АктВыполненныхРаботПозиции.Позиция 
		|   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = АктВыполненныхРаботПозиции.Ссылка
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НРиСП КАК НРиСП
		|	ПО БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = НРиСП.Смета  
		|	   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел = НРиСП.Раздел 
		|	   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = НРиСП.Позиция
		|ГДЕ
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел = &Раздел 
		|	И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = &Смета 
		|	И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Расчет = ИСТИНА
		|ИТОГИ
		|	СУММА(СтоимПрямЗатраты),
		|	СУММА(СтоимОснЗарплата),
		|	СУММА(СтоимЭксплМашин),
		|	СУММА(СтоимЗарплМашин),
		|	СУММА(СтоимСтоимМатер),
		|	СУММА(СтоимОборуд),
		|	СУММА(СтоимВозвратМатер),
		|	СУММА(ЗатратыТрудаРабочих),
		|	СУММА(ЗатратыТрудаМашин),
		|	СУММА(ТекСтоимПрямЗатраты),
		|	СУММА(ТекСтоимОснЗарплата),
		|	СУММА(ТекСтоимЭксплМашин),
		|	СУММА(ТекСтоимЗарплМашин),
		|	СУММА(ТекСтоимСтоимМатер),
		|	СУММА(ТекСтоимОборуд),
		|	СУММА(ТекСтоимВозвратМатер),
		|	СУММА(СуммаНРБазисная),
		|	СУММА(СуммаСПБазисная),
		|	СУММА(СуммаНРТекущая),
		|	СУММА(СуммаСПТекущая),
		|	СУММА(СуммаДобавкаТР),
		|	СУММА(СуммаДобавкаОЗ)
		|ПО
		|	ОБЩИЕ";
	Иначе
		ЗапросБЕ.Текст = "ВЫБРАТЬ
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.ОбъемРабот,0) КАК Объем,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимПрямЗатраты,0) КАК СтоимПрямЗатраты,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОснЗарплата,0) КАК СтоимОснЗарплата,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЭксплМашин,0)  КАК СтоимЭксплМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЗарплМашин,0)  КАК СтоимЗарплМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимСтоимМатер,0)  КАК СтоимСтоимМатер,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОборуд,0)  КАК СтоимОборуд,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимВозвратМатер,0)  КАК СтоимВозвратМатер,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаРабочих * ПозицияЛокальнойСметы.ОбъемРабот,0) КАК ЗатратыТрудаРабочих,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаМашин * ПозицияЛокальнойСметы.ОбъемРабот,0) КАК ЗатратыТрудаМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимПрямЗатраты,0)  КАК ТекСтоимПрямЗатраты,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата,0) КАК ТекСтоимОснЗарплата,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин,0) КАК ТекСтоимЭксплМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЗарплМашин,0) КАК ТекСтоимЗарплМашин,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер,0)  КАК ТекСтоимСтоимМатер,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОборуд,0)  КАК ТекСтоимОборуд,
		|	ЕСТЬNULL(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимВозвратМатер,0) КАК ТекСтоимВозвратМатер,
		|	НРиСП.СуммаНРНаОбъем + НРиСП.СуммаНРМашинистовНаОбъем КАК СуммаНРБазисная,
		|	НРиСП.СуммаСПНаОбъем + НРиСП.СуммаСПМашинистовНаОбъем КАК СуммаСПБазисная,
		|	НРиСП.ТекСуммаНРНаОбъем + НРиСП.ТекСуммаНРМашинистовНаОбъем КАК СуммаНРТекущая,
		|	НРиСП.ТекСуммаСПНаОбъем + НРиСП.ТекСуммаСПМашинистовНаОбъем КАК СуммаСПТекущая,
		|	НРиСП.ДобавкаТР КАК СуммаДобавкаТР,
		|	НРиСП.ДобавкаОЗ КАК СуммаДобавкаОЗ
		|ИЗ
		|	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_ПозицияЛокальнойСметы КАК ПозицияЛокальнойСметы
		|		ПО БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = ПозицияЛокальнойСметы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НРиСП КАК НРиСП
		|		ПО БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = НРиСП.Смета
		|			И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел = НРиСП.Раздел
		|			И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = НРиСП.Позиция
		|ГДЕ
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел = &Раздел
		|	И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = &Смета
		|	И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Расчет = ИСТИНА
		|ИТОГИ
		|	СУММА(СтоимПрямЗатраты),
		|	СУММА(СтоимОснЗарплата),
		|	СУММА(СтоимЭксплМашин),
		|	СУММА(СтоимЗарплМашин),
		|	СУММА(СтоимСтоимМатер),
		|	СУММА(СтоимОборуд),
		|	СУММА(СтоимВозвратМатер),
		|	СУММА(ЗатратыТрудаРабочих),
		|	СУММА(ЗатратыТрудаМашин),
		|	СУММА(ТекСтоимПрямЗатраты),
		|	СУММА(ТекСтоимОснЗарплата),
		|	СУММА(ТекСтоимЭксплМашин),
		|	СУММА(ТекСтоимЗарплМашин),
		|	СУММА(ТекСтоимСтоимМатер),
		|	СУММА(ТекСтоимОборуд),
		|	СУММА(ТекСтоимВозвратМатер),
		|	СУММА(СуммаНРБазисная),
		|	СУММА(СуммаСПБазисная),
		|	СУММА(СуммаНРТекущая),
		|	СУММА(СуммаСПТекущая),
		|	СУММА(СуммаДобавкаТР),
		|	СУММА(СуммаДобавкаОЗ)
		|ПО
		|	ОБЩИЕ";
	КонецЕсли;	
	ЗапросБЕ.УстановитьПараметр("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);
	ЗапросБЕ.УстановитьПараметр("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	
	// Строка в таблице СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.
	ТаблПозицииБИ = ЗапросБИ.Выполнить().Выгрузить();
	Если ТаблПозицииБИ.Количество()=0 Тогда
		СтрокаТаблПозиции = ТаблПозицииБИ.Добавить();
		Для Сч = 0 По ТаблПозицииБИ.Колонки.Количество()-1 Цикл
			СтрокаТаблПозиции[Сч] = 0;	
		КонецЦикла;
	КонецЕсли;
	ИтоговаяСтрокаБИ = ТаблПозицииБИ[0];
	
	// Округление составляющих.
	СтоимОснЗарплата = 0;
	СтоимЭксплМашин = 0;
	СтоимЗарплМашин = 0;
	СтоимСтоимМатер = 0;
	СтоимПрямЗатраты = 0;
	СтоимОборуд = 0;
	СтоимВозвратМатер = 0;
	ДопЗМ = 0;
	
	Для Сч = 1 По  ТаблПозицииБИ.Количество()-1 Цикл
		СтрокаБИ = ТаблПозицииБИ.Получить(Сч);
		ТекОЗ = Окр(СтрокаБИ.СтоимОснЗарплата,КолЗнаков);
		ТекЭМ = Окр(СтрокаБИ.СтоимЭксплМашин,КолЗнаков);
		ТекСМ = Окр(СтрокаБИ.СтоимСтоимМатер,КолЗнаков);
		ТекПЗ = Окр(СтрокаБИ.СтоимПрямЗатраты,КолЗнаков);
		Если  ТекПЗ <> 0 Тогда
			Если  ТекОЗ +  ТекЭМ + ТекСМ <> 0 Тогда
				ТекПЗ =  ТекОЗ +  ТекЭМ + ТекСМ;
			КонецЕсли;	
		ИначеЕсли  Окр(СтрокаБИ.СтоимОборуд,КолЗнаков) <> 0 Тогда	
			ТекПЗ = 0;
		КонецЕсли;	
		
		СтоимОснЗарплата = СтоимОснЗарплата + ТекОЗ;
		СтоимЭксплМашин = СтоимЭксплМашин + ТекЭМ;
		СтоимЗарплМашин = СтоимЗарплМашин + Окр(СтрокаБИ.СтоимЗарплМашин,КолЗнаков);
		СтоимСтоимМатер = СтоимСтоимМатер + ТекСМ;
		СтоимПрямЗатраты = СтоимПрямЗатраты + ТекПЗ;
		СтоимОборуд = СтоимОборуд + Окр(СтрокаБИ.СтоимОборуд,КолЗнаков);
		СтоимВозвратМатер = СтоимВозвратМатер  + Окр(СтрокаБИ.СтоимВозвратМатер,КолЗнаков);
		ДопЗМ = ДопЗМ  + Окр(СтрокаБИ.ДопЗМ,КолЗнаков);
		
	КонецЦикла;
	
	// Строка в таблице СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.
	ТаблПозицииБЕ = ЗапросБЕ.Выполнить().Выгрузить();
	Если ТаблПозицииБЕ.Количество()=0 Тогда
		СтрокаТаблПозиции = ТаблПозицииБЕ.Добавить();
		Для Сч = 0 По ТаблПозицииБЕ.Колонки.Количество()-1 Цикл
			СтрокаТаблПозиции[Сч] = 0;	
		КонецЦикла;
	КонецЕсли;
	ИтоговаяСтрокаБЕ = ТаблПозицииБЕ[0];
	// Округление составляющих.
	ТекСтоимОснЗарплата = 0;
	ТекСтоимЭксплМашин = 0;
	ТекСтоимЗарплМашин = 0;
	ТекСтоимСтоимМатер = 0;
	ТекСтоимПрямЗатраты = 0;
	ТекСтоимОборуд = 0;
	ТекСтоимВозвратМатер = 0;
	ПЗ 	= 0;
	ОЗ 	= 0;
	ЭМ 	= 0;
	ЗМ 	= 0;
	СМ 	= 0;
	ОБ 	= 0;
	ВМ 	= 0;
	
	Для Сч = 1 По  ТаблПозицииБЕ.Количество()-1 Цикл
	
		СтрокаБЕ = ТаблПозицииБЕ.Получить(Сч);
		// СУДАРИКОВ - убрал округление, ранее стояли РУБЛИ
		// ТекОЗ = Окр((СтрокаБЕ.ТекСтоимОснЗарплата) * СтрокаБЕ.Объем,КолЗнаков);
		ТекОЗ = ((СтрокаБЕ.ТекСтоимОснЗарплата) * СтрокаБЕ.Объем);
		ТекЭМ = ((СтрокаБЕ.ТекСтоимЭксплМашин)  * СтрокаБЕ.Объем);
		ТекСМ = ((СтрокаБЕ.ТекСтоимСтоимМатер)  * СтрокаБЕ.Объем);
		ТекПЗ = ((СтрокаБЕ.ТекСтоимПрямЗатраты) * СтрокаБЕ.Объем);
		Если  ТекПЗ <> 0 Тогда
			Если  ТекОЗ +  ТекЭМ + ТекСМ <> 0 Тогда
				ТекПЗ =  ТекОЗ +  ТекЭМ + ТекСМ;
			КонецЕсли;
		ИначеЕсли  Окр((СтрокаБЕ.ТекСтоимОборуд) * СтрокаБЕ.Объем,КолЗнаков) <> 0 Тогда
			ТекПЗ = 0;
		КонецЕсли;	
		
		ТекСтоимОснЗарплата = ТекСтоимОснЗарплата + ТекОЗ;
		ТекСтоимЭксплМашин  = ТекСтоимЭксплМашин  + ТекЭМ;
		ТекСтоимЗарплМашин  = ТекСтоимЗарплМашин  + Окр((СтрокаБЕ.ТекСтоимЗарплМашин) * СтрокаБЕ.Объем,КолЗнаков);
		ТекСтоимСтоимМатер  = ТекСтоимСтоимМатер  + ТекСМ;
		ТекСтоимПрямЗатраты = ТекСтоимПрямЗатраты + ТекПЗ;
		ТекСтоимОборуд = ТекСтоимОборуд + Окр((СтрокаБЕ.ТекСтоимОборуд) *  СтрокаБЕ.Объем ,КолЗнаков);
		ТекСтоимВозвратМатер = ТекСтоимВозвратМатер  + Окр((СтрокаБЕ.ТекСтоимВозвратМатер) *  СтрокаБЕ.Объем ,КолЗнаков);
		
		// Базисные.
		// ТекОЗ1 = Окр((СтрокаБЕ.СтоимОснЗарплата) * СтрокаБЕ.Объем,КолЗнаков);
		ТекОЗ1 = ((СтрокаБЕ.СтоимОснЗарплата) * СтрокаБЕ.Объем);
		ТекЭМ1 = ((СтрокаБЕ.СтоимЭксплМашин) * СтрокаБЕ.Объем);
		ТекСМ1 = ((СтрокаБЕ.СтоимСтоимМатер) * СтрокаБЕ.Объем);
		ТекПЗ1 = ((СтрокаБЕ.СтоимПрямЗатраты) * СтрокаБЕ.Объем);
		Если  ТекПЗ1 <> 0 Тогда
			Если  ТекОЗ1+  ТекЭМ1 + ТекСМ1 <> 0 Тогда
				ТекПЗ1 =  ТекОЗ1 +  ТекЭМ1 + ТекСМ1;
			КонецЕсли;	
		ИначеЕсли Окр((СтрокаБЕ.СтоимОборуд) * СтрокаБЕ.Объем,КолЗнаков) <> 0 Тогда
			ТекПЗ1 = 0;
		КонецЕсли;	
		ОЗ = ОЗ + ТекОЗ1;
		ЭМ = ЭМ + ТекЭМ1;
		ЗМ = ЗМ + ((СтрокаБЕ.СтоимЗарплМашин) * СтрокаБЕ.Объем);
		СМ = СМ + ТекСМ1;
		ПЗ = ПЗ + ТекПЗ1;
		ОБ = ОБ + ((СтрокаБЕ.СтоимОборуд) * СтрокаБЕ.Объем);
		ВМ = ВМ + ((СтрокаБЕ.СтоимВозвратМатер) * СтрокаБЕ.Объем);
		
	КонецЦикла;
	
	// Итог = Итого По разделу.
	ИтогоПоРазделу = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоПоРазделу,"Итог");
	Если  ИтогоПоРазделу = Неопределено Тогда
		ИтогоПоРазделу 						= ТаблРасчета.Добавить();
		ИтогоПоРазделу.Итог 				= Справочники.СМ_ИтогиПоРазделу.ИтогоПоРазделу;
	КонецЕсли;
	// Определение составляющих прямых затрат по позициям раздела.
	// Базисные.
	ЗТР = ?(ЗначениеЗаполнено(ИтоговаяСтрокаБЕ.ЗатратыТрудаРабочих),Окр(ИтоговаяСтрокаБЕ.ЗатратыТрудаРабочих,2),0);
	ЗТМ = ?(ЗначениеЗаполнено(ИтоговаяСтрокаБЕ.ЗатратыТрудаМашин),Окр(ИтоговаяСтрокаБЕ.ЗатратыТрудаМашин,2),0);
	ТекПЗБезСоставл = 0;
	
	// Текущие.
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
		ТекПЗ = СтоимПрямЗатраты;
		ТекОЗ = СтоимОснЗарплата;
		ТекЭМ = СтоимЭксплМашин;
		ТекЗМ = СтоимЗарплМашин;
		ТекСМ = СтоимСтоимМатер;
		ТекОБ = СтоимОборуд;
		ТекВМ = СтоимВозвратМатер;	
		ДопЗМ = ДопЗМ;
		ТекПЗБезСоставл = ТекПЗ - ТекОЗ - ТекЭМ - ТекСМ; 
	Иначе
		// Метод счета ресурсный.
		ТекПЗ = ТекСтоимПрямЗатраты;
		ТекОЗ = ТекСтоимОснЗарплата;
		ТекЭМ = ТекСтоимЭксплМашин;
		ТекЗМ = ТекСтоимЗарплМашин;
		ТекСМ = ТекСтоимСтоимМатер;
		ТекОБ = ТекСтоимОборуд;
		ТекВМ = ТекСтоимВозвратМатер;
	КонецЕсли;
	
	// Нормативная трудоемкость, базисная = текущей.
	НормативТрудоемкостиПоРазделу = ?(ЗначениеЗаполнено(ИтоговаяСтрокаБЕ.ЗатратыТрудаРабочих),ИтоговаяСтрокаБЕ.ЗатратыТрудаРабочих,0) + ?(ЗначениеЗаполнено(ИтоговаяСтрокаБЕ.ЗатратыТрудаМашин),ИтоговаяСтрокаБЕ.ЗатратыТрудаМашин,0);
	
	// Суммирование для итога Итого по разделу с данными, собранныим с подчиненных разделов.	
	Если (МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный) и МетодикаРСНБ Тогда
		ПрямЗатраты 			= Окр(ИтогоПоРазделу.ПрямЗатраты+ИтогоПоРазделу.Оборуд,КолЗнаков) + ПЗ + ОБ;
		ИтогоПоРазделу.ПрямЗатраты 			= ПрямЗатраты;
		ИтогоПоРазделу.ОснЗарплата 			= Окр(ИтогоПоРазделу.ОснЗарплата,КолЗнаков) + ОЗ;
		ИтогоПоРазделу.ЭксплМашин 			= Окр(ИтогоПоРазделу.ЭксплМашин,КолЗнаков) + ЭМ;
		ИтогоПоРазделу.ЗарплМашин 			= Окр(ИтогоПоРазделу.ЗарплМашин,КолЗнаков) + ЗМ;
		ИтогоПоРазделу.СтоимМатер 			= Окр(ИтогоПоРазделу.СтоимМатер,КолЗнаков) + СМ;
		ИтогоПоРазделу.Оборуд 				= Окр(ИтогоПоРазделу.Оборуд,КолЗнаков) + ОБ;
		ИтогоПоРазделу.ВозвратМатер 		= Окр(ИтогоПоРазделу.ВозвратМатер,КолЗнаков) + ВМ;
		ИтогоПоРазделу.ЗатратыТрудаРабочих 	= Окр(ИтогоПоРазделу.ЗатратыТрудаРабочих,2) + ЗТР;
		ИтогоПоРазделу.ЗатратыТрудаМашин 	= Окр(ИтогоПоРазделу.ЗатратыТрудаМашин,2) + ЗТМ;
		
		ИтогоПоРазделу.ТекПрямЗатраты 		= Окр(ИтогоПоРазделу.ТекПрямЗатраты,КолЗнаков)+ ТекПЗ + МатериалыВТекЦенах + ПрямыеЗатратыВТекЦенах ;
		ИтогоПоРазделу.ТекОснЗарплата 		= Окр(ИтогоПоРазделу.ТекОснЗарплата,КолЗнаков) + ТекОЗ;
		ИтогоПоРазделу.ТекЭксплМашин 		= Окр(ИтогоПоРазделу.ТекЭксплМашин,КолЗнаков) + ТекЭМ;
		ИтогоПоРазделу.ТекЗарплМашин 		= Окр(ИтогоПоРазделу.ТекЗарплМашин,КолЗнаков)  + ТекЗМ;
		ИтогоПоРазделу.ТекСтоимМатер 		= Окр(ИтогоПоРазделу.ТекСтоимМатер,КолЗнаков) + ТекСМ + МатериалыВТекЦенах;
		ИтогоПоРазделу.ТекОборуд 			= Окр(ИтогоПоРазделу.ТекОборуд,КолЗнаков) + ТекОБ + ОборудованиеВТекЦенах;
		ИтогоПоРазделу.ТекВозвратМатер 		= Окр(ИтогоПоРазделу.ТекВозвратМатер,КолЗнаков) + ТекВМ;
		
		// Формирование Итога Итого оборудование.
		ИтогоОборуд  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоОборуд,"Итог");
		Если  ИтогоОборуд = Неопределено Тогда
			ИтогоОборуд 					= ТаблРасчета.Добавить();
			ИтогоОборуд.Итог 				= Справочники.СМ_ИтогиПоРазделу.ИтогоОборуд;
		КонецЕсли;
		// Оборудование по позициям раздела.
		// Базисное значение.
		ОборудованиеПоРазделу = ОБ; 
		// Суммирование с подчиненными разделами.
		ИтогоОборуд.ПрямЗатраты = ИтогоОборуд.ПрямЗатраты + ОборудованиеПоРазделу ;
		// Текущее значение.
		ИтогоОборуд.ТекПрямЗатраты = ИтогоОборуд.ТекПрямЗатраты + ТекОБ + ОборудованиеВТекЦенах;
		ИтогоОборуд.ТекОборуд = ИтогоОборуд.ТекОборуд + ИтогоОборуд.ТекПрямЗатраты;

	Иначе	
		ПрямЗатраты 						= Окр(ИтогоПоРазделу.ПрямЗатраты,КолЗнаков) + ПЗ;
		ИтогоПоРазделу.ПрямЗатраты 			= ПрямЗатраты;
		ИтогоПоРазделу.ОснЗарплата 			= Окр(ИтогоПоРазделу.ОснЗарплата,КолЗнаков) + ОЗ;
		ИтогоПоРазделу.ЭксплМашин 			= Окр(ИтогоПоРазделу.ЭксплМашин,КолЗнаков) + ЭМ;
		ИтогоПоРазделу.ЗарплМашин 			= Окр(ИтогоПоРазделу.ЗарплМашин,КолЗнаков) + ЗМ;
		ИтогоПоРазделу.СтоимМатер 			= Окр(ИтогоПоРазделу.СтоимМатер,КолЗнаков) + СМ;
		ИтогоПоРазделу.Оборуд 				= Окр(ИтогоПоРазделу.Оборуд,КолЗнаков) + ОБ;
		ИтогоПоРазделу.ВозвратМатер 		= Окр(ИтогоПоРазделу.ВозвратМатер,КолЗнаков) + ВМ;
		ИтогоПоРазделу.ЗатратыТрудаРабочих 	= Окр(ИтогоПоРазделу.ЗатратыТрудаРабочих,2) + ЗТР;
		ИтогоПоРазделу.ЗатратыТрудаМашин 	= Окр(ИтогоПоРазделу.ЗатратыТрудаМашин,2) + ЗТМ;
		
		ИтогоПоРазделу.ТекПрямЗатраты 		= Окр(ИтогоПоРазделу.ТекПрямЗатраты,КолЗнаков)+ ТекПЗ + МатериалыВТекЦенах + ПрямыеЗатратыВТекЦенах ;
		ИтогоПоРазделу.ТекОснЗарплата 		= Окр(ИтогоПоРазделу.ТекОснЗарплата,КолЗнаков) + ТекОЗ;
		ИтогоПоРазделу.ТекЭксплМашин 		= Окр(ИтогоПоРазделу.ТекЭксплМашин,КолЗнаков) + ТекЭМ;
		ИтогоПоРазделу.ТекЗарплМашин 		= Окр(ИтогоПоРазделу.ТекЗарплМашин,КолЗнаков)  + ТекЗМ;
		ИтогоПоРазделу.ТекСтоимМатер 		= Окр(ИтогоПоРазделу.ТекСтоимМатер,КолЗнаков) + ТекСМ + МатериалыВТекЦенах;
		ИтогоПоРазделу.ТекОборуд 			= Окр(ИтогоПоРазделу.ТекОборуд,КолЗнаков) + ТекОБ + ОборудованиеВТекЦенах;
		ИтогоПоРазделу.ТекВозвратМатер 		= Окр(ИтогоПоРазделу.ТекВозвратМатер,КолЗнаков) + ТекВМ;
	
		// Формирование Итога Итого оборудование.
		ИтогоОборуд  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоОборуд,"Итог");
		Если  ИтогоОборуд = Неопределено Тогда
			ИтогоОборуд 					= ТаблРасчета.Добавить();
			ИтогоОборуд.Итог 				= Справочники.СМ_ИтогиПоРазделу.ИтогоОборуд;
		КонецЕсли;
		// Оборудование по позициям раздела.
		// Базисное значение.
		ОборудованиеПоРазделу = ОБ; 
		// Суммирование с подчиненными разделами.
		ИтогоОборуд.ПрямЗатраты = ?(ЗначениеЗаполнено(ИтогоОборуд.ПрямЗатраты),(ИтогоОборуд.ПрямЗатраты),0) + ОборудованиеПоРазделу ;
		// Текущее значение.
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			ТекущееОборудованиеПоРазделу = ТекСтоимОборуд ;	
		Иначе
			ТекущееОборудованиеПоРазделу =  СтоимОборуд;
		КонецЕсли;
		ИтогоОборуд.ТекПрямЗатраты = ?(ЗначениеЗаполнено(ИтогоОборуд.ТекПрямЗатраты),Окр(ИтогоОборуд.ТекПрямЗатраты,КолЗнаков),0) + ТекущееОборудованиеПоРазделу;
		ИтогоОборуд.ТекОборуд = ИтогоОборуд.ТекПрямЗатраты;
	
	КонецЕсли;
	
	// Для уровня задания индексов =  раздел дополнительно считаются итоги:
	// Итого с индексами к элементам затрат.
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный  Тогда
		
		Если Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			
			ИтогоСИндексКЭлемЗатрат  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоСИндексКЭлемЗатрат,"Итог");
			Если  ИтогоСИндексКЭлемЗатрат = Неопределено Тогда
				ИтогоСИндексКЭлемЗатрат 		= ТаблРасчета.Добавить();
				ИтогоСИндексКЭлемЗатрат.Итог 	= Справочники.СМ_ИтогиПоРазделу.ИтогоСИндексКЭлемЗатрат;
			КонецЕсли;
			ИтогоСИндексКЭлемЗатрат.ПрямЗатраты = Окр(ИтогоСИндексКЭлемЗатрат.ПрямЗатраты,КолЗнаков) + ПЗ;
			ИтогоСИндексКЭлемЗатрат.ОснЗарплата = Окр(ИтогоСИндексКЭлемЗатрат.ОснЗарплата,КолЗнаков) + ОЗ;
			ИтогоСИндексКЭлемЗатрат.ЭксплМашин 	= Окр(ИтогоСИндексКЭлемЗатрат.ЭксплМашин,КолЗнаков) + ЭМ;
			ИтогоСИндексКЭлемЗатрат.ЗарплМашин 	= Окр(ИтогоСИндексКЭлемЗатрат.ЗарплМашин,КолЗнаков) + ЗМ;
			ИтогоСИндексКЭлемЗатрат.СтоимМатер 	= Окр(ИтогоСИндексКЭлемЗатрат.СтоимМатер,КолЗнаков) + СМ;
			ИтогоСИндексКЭлемЗатрат.ВозвратМатер = Окр(ИтогоСИндексКЭлемЗатрат.ВозвратМатер,КолЗнаков) + ВМ;
			Если НаборКоэф <>Неопределено Тогда
				
				Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости 	
					Или (СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
					И НаборКоэф.КоэффПолнСтоимРабот <> 0) Тогда
					СИндексамиОЗ = Окр(ТекОЗ * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков);
					СИндексамиЭМ = Окр(ТекЭМ * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков);
					СИндексамиЗМ = Окр(ТекЗМ * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков);
					СИндексамиСМ = Окр(ТекСМ * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков) + МатериалыВТекЦенах;
					СИндексамиПЗ = Окр(ТекПЗ * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков) + МатериалыВТекЦенах + ПрямыеЗатратыВТекЦенах;
					СИндексамиВМ = Окр(ТекВМ * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков) ;
					ИтогоСИндексКЭлемЗатрат.ТекПрямЗатраты 	= Окр(ИтогоСИндексКЭлемЗатрат.ТекПрямЗатраты,КолЗнаков) + СИндексамиПЗ  ;
					ИтогоСИндексКЭлемЗатрат.ТекОснЗарплата 	= Окр(ИтогоСИндексКЭлемЗатрат.ТекОснЗарплата,КолЗнаков) + СИндексамиОЗ;
					ИтогоСИндексКЭлемЗатрат.ТекЭксплМашин 	= Окр(ИтогоСИндексКЭлемЗатрат.ТекЭксплМашин,КолЗнаков) + СИндексамиЭМ;
					ИтогоСИндексКЭлемЗатрат.ТекЗарплМашин 	= Окр(ИтогоСИндексКЭлемЗатрат.ТекЗарплМашин,КолЗнаков) + СИндексамиЗМ;
					ИтогоСИндексКЭлемЗатрат.ТекСтоимМатер 	= Окр(ИтогоСИндексКЭлемЗатрат.ТекСтоимМатер,КолЗнаков) + СИндексамиСМ ;
					ИтогоСИндексКЭлемЗатрат.ТекВозвратМатер = Окр(ИтогоСИндексКЭлемЗатрат.ТекВозвратМатер,КолЗнаков) + СИндексамиВМ ;
					
				ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат	
					И НаборКоэф.КоэффПолнСтоимРабот = 0  Тогда
					СИндексамиОЗ = Окр(ТекОЗ * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),КолЗнаков);
					СИндексамиСМ = Окр(ТекСМ * ?(НаборКоэф.КоэффСтоимМатериалов = 0,1,НаборКоэф.КоэффСтоимМатериалов),КолЗнаков) + МатериалыВТекЦенах;
					СИндексамиВМ = Окр(ТекВМ * ?(НаборКоэф.КоэффСтоимМатериалов = 0,1,НаборКоэф.КоэффСтоимМатериалов),КолЗнаков);
					ИтогоСИндексКЭлемЗатрат.ТекОснЗарплата 	= Окр(ИтогоСИндексКЭлемЗатрат.ТекОснЗарплата,КолЗнаков) + СИндексамиОЗ ;
					ИтогоСИндексКЭлемЗатрат.ТекСтоимМатер 	= Окр(ИтогоСИндексКЭлемЗатрат.ТекСтоимМатер,КолЗнаков) + СИндексамиСМ ;
					ИтогоСИндексКЭлемЗатрат.ТекВозвратМатер 	= Окр(ИтогоСИндексКЭлемЗатрат.ТекВозвратМатер,КолЗнаков) + СИндексамиВМ ;
					НачДобавЗМ = ДопЗМ;
					ТекЗМ = ТекЗМ;
					ТекЭМ = ТекЭМ - НачДобавЗМ;
					ИндексироватьДопЗМФот = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ИндексироватьДопЗМФот",Ложь);	
					КоэффЗМ = ?(ИндексироватьДопЗМФот, НаборКоэф.КоэффОснЗарплаты, НаборКоэф.КоэффСтоимЭксплМашин);					// к расценке применяются индексы
					Если ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.Разные Тогда
						СИндексамиЗМ = Окр(ТекЗМ  * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),КолЗнаков);
						СИндексамиЭМ = Окр((ТекЭМ) * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),КолЗнаков);
						ИтогоСИндексКЭлемЗатрат.ТекЭксплМашин = Окр(ИтогоСИндексКЭлемЗатрат.ТекЭксплМашин,КолЗнаков) + СИндексамиЭМ + Окр(НачДобавЗМ * КоэффЗМ,2);
						ИтогоСИндексКЭлемЗатрат.ТекЗарплМашин = Окр(ИтогоСИндексКЭлемЗатрат.ТекЗарплМашин,КолЗнаков) + СИндексамиЗМ;
						СИндексамиЭМ = СИндексамиЭМ + Окр(НачДобавЗМ * КоэффЗМ,КолЗнаков);
					ИначеЕсли ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.Одинаковые Тогда
						СИндексамиЗМ = Окр(ТекЗМ * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),КолЗнаков);
						СИндексамиЭМ = Окр(ТекЭМ * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),КолЗнаков);
						КоэффЗМ = ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин);
						ИтогоСИндексКЭлемЗатрат.ТекЭксплМашин = Окр(ИтогоСИндексКЭлемЗатрат.ТекЭксплМашин,КолЗнаков) + СИндексамиЭМ + Окр(НачДобавЗМ * КоэффЗМ,2);
						ИтогоСИндексКЭлемЗатрат.ТекЗарплМашин = Окр(ИтогоСИндексКЭлемЗатрат.ТекЗарплМашин,КолЗнаков) + СИндексамиЗМ;
						СИндексамиЭМ = СИндексамиЭМ + Окр(НачДобавЗМ * КоэффЗМ,КолЗнаков);
					ИначеЕсли ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.РазныеКРазности Тогда
						КоэффЗМ = ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин);
						СИндексамиЗМ = Окр(ТекЗМ * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),КолЗнаков);
						СИндексамиЭМ = Окр((ТекЭМ - ТекЗМ)* КоэффЗМ,КолЗнаков);
						СИндексамиЭМ = СИндексамиЭМ + СИндексамиЗМ + Окр(НачДобавЗМ * КоэффЗМ,2);
						ИтогоСИндексКЭлемЗатрат.ТекЭксплМашин = Окр(ИтогоСИндексКЭлемЗатрат.ТекЭксплМашин,КолЗнаков) + СИндексамиЭМ ;
						ИтогоСИндексКЭлемЗатрат.ТекЗарплМашин = Окр(ИтогоСИндексКЭлемЗатрат.ТекЗарплМашин,КолЗнаков) + СИндексамиЗМ;
					КонецЕсли;	
					СИндексамиЗМ = СИндексамиЗМ;
					СИндексамиПЗ = СИндексамиОЗ + СИндексамиЭМ + СИндексамиСМ + ПрямыеЗатратыВТекЦенах + ТекПЗБезСоставл ;
					ИтогоСИндексКЭлемЗатрат.ТекПрямЗатраты =  ИтогоСИндексКЭлемЗатрат.ТекПрямЗатраты  + СИндексамиПЗ ;
					
				КонецЕсли;
			КонецЕсли;
			
			// Всего стоимость оборудования с индексом.
			ИтогоСИндексКОборуд  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоСИндексКОборуд,"Итог");
			Если  ИтогоСИндексКОборуд = Неопределено Тогда
				ИтогоСИндексКОборуд 			= ТаблРасчета.Добавить();
				ИтогоСИндексКОборуд.Итог 		= Справочники.СМ_ИтогиПоРазделу.ИтогоСИндексКОборуд;
			КонецЕсли;
			ИтогоСИндексКОборуд.ПрямЗатраты = Окр(ИтогоСИндексКОборуд.ПрямЗатраты,КолЗнаков) + ОборудованиеПоРазделу;
			Если НаборКоэф <> Неопределено Тогда
				Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости 	
					Или (СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
					И НаборКоэф.КоэффПолнСтоимРабот <> 0) Тогда
					ТекущееОборудованиеПоРазделу = Окр(ТекущееОборудованиеПоРазделу * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков) ;
				ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат  
					И НаборКоэф.КоэффПолнСтоимРабот = 0  Тогда
					ТекущееОборудованиеПоРазделу = Окр(ТекущееОборудованиеПоРазделу * ?(НаборКоэф.КоэффОборуд = 0,1,НаборКоэф.КоэффОборуд),КолЗнаков) ;
				КонецЕсли;
			КонецЕсли;
			ИтогоСИндексКОборуд.ТекПрямЗатраты = ИтогоСИндексКОборуд.ТекПрямЗатраты + ТекущееОборудованиеПоРазделу + ОборудованиеВТекЦенах;
			ИтогоСИндексКОборуд.ТекОборуд = ИтогоСИндексКОборуд.ТекПрямЗатраты;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Накладные расходы.
	НаклРасх  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.НаклРасх,"Итог");
	Если  НаклРасх = Неопределено Тогда
		НаклРасх 				= ТаблРасчета.Добавить();
		НаклРасх.Итог 			= Справочники.СМ_ИтогиПоРазделу.НаклРасх;
	КонецЕсли;
	// В бвзисном уровне.
	НаклРасхРаздела = Окр(?(ИтоговаяСтрокаБЕ.СуммаНРБазисная = NULL, 0, ИтоговаяСтрокаБЕ.СуммаНРБазисная),КолЗнаков);
	НаклРасх.ПрямЗатраты = НаклРасх.ПрямЗатраты + НаклРасхРаздела ;
	// Накладные расходы с индексами по разделу.
	// В текущем уровне.
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
		НаклРасхРазделаТекущая = Окр(?(ИтоговаяСтрокаБЕ.СуммаНРТекущая = NULL, 0, ИтоговаяСтрокаБЕ.СуммаНРТекущая),КолЗнаков) ;
	Иначе	
		НаклРасхРазделаТекущая = ?(ИтоговаяСтрокаБИ.СуммаНРТекущая =  NULL, 0,ИтоговаяСтрокаБИ.СуммаНРТекущая) ;
	КонецЕсли;
	
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
		Если НаборКоэф <> Неопределено Тогда
			Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости 	
				Или (СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
				И НаборКоэф.КоэффПолнСтоимРабот <> 0) Тогда
				НаклРасхРазделаТекущая = Окр(НаклРасхРазделаТекущая * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков);
			ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
				И НаборКоэф.КоэффПолнСтоимРабот = 0  Тогда	
				НаклРасхРазделаТекущая = Окр(НаклРасхРазделаТекущая * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),КолЗнаков);
			КонецЕсли;
		КонецЕсли;
	Иначе
		НаклРасхРазделаТекущая = Окр(НаклРасхРазделаТекущая,КолЗнаков);
	КонецЕсли;
	НаклРасхРазделаТекущая = НаклРасхРазделаТекущая;
	НаклРасх.ТекПрямЗатраты	= НаклРасх.ТекПрямЗатраты + НаклРасхРазделаТекущая;
	
	// Методика 1984 года
	Если Методика1984 И РасчетНРиСПотПЗ  Тогда
		// Добавка к ОЗ 
		ИтогДобавкаНРвОЗ  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ОЗвНаклРасходах,"Итог");
		Если  ИтогДобавкаНРвОЗ = Неопределено Тогда
			ДобавкаНРвОЗ 				= ТаблРасчета.Добавить();
			ДобавкаНРвОЗ.Итог 			= Справочники.СМ_ИтогиПоРазделу.ОЗвНаклРасходах;
		КонецЕсли;
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			ДобавкакОЗ = Окр(?(ИтоговаяСтрокаБЕ.СуммаДобавкаОЗ = NULL, 0, ИтоговаяСтрокаБЕ.СуммаДобавкаОЗ),КолЗнаков) ;
		Иначе	
			ДобавкакОЗ = ?(ИтоговаяСтрокаБИ.СуммаДобавкаОЗ =  NULL, 0,ИтоговаяСтрокаБИ.СуммаДобавкаОЗ) ;
		КонецЕсли;
		ДобавкаНРвОЗ.ПрямЗатраты	= Окр(ДобавкаНРвОЗ.ПрямЗатраты,КолЗнаков) + ДобавкакОЗ;
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
			И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			Если НаборКоэф <> Неопределено Тогда
				Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости 	
					Или (СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
					И НаборКоэф.КоэффПолнСтоимРабот <> 0) Тогда
					ДобавкакОЗ = Окр(ДобавкакОЗ * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков);
				ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
					И  НаборКоэф.КоэффПолнСтоимРабот  = 0 Тогда	
					ДобавкакОЗ = Окр(ДобавкакОЗ * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),КолЗнаков);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ДобавкаНРвОЗ.ТекПрямЗатраты	= Окр(ДобавкаНРвОЗ.ТекПрямЗатраты,КолЗнаков) + ДобавкакОЗ;
		
		// Добавка к ТР 
		ИтогДобавкаНРвТР  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ТРвНаклРасходах,"Итог");
		Если  ИтогДобавкаНРвТР = Неопределено Тогда
			ДобавкаНРвТР 				= ТаблРасчета.Добавить();
			ДобавкаНРвТР.Итог 			= Справочники.СМ_ИтогиПоРазделу.ТРвНаклРасходах;
		КонецЕсли;
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			ДобавкакТР = Окр(?(ИтоговаяСтрокаБЕ.СуммаДобавкаТР = NULL, 0, ИтоговаяСтрокаБЕ.СуммаДобавкаТР),КолЗнаков) ;
		Иначе	
			ДобавкакТР = ?(ИтоговаяСтрокаБИ.СуммаДобавкаТР =  NULL, 0,ИтоговаяСтрокаБИ.СуммаДобавкаТР) ;
		КонецЕсли;
		ДобавкаНРвТР.ПрямЗатраты	= Окр(ДобавкаНРвТР.ПрямЗатраты,КолЗнаков) + ДобавкакТР;
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			Если НаборКоэф <> Неопределено Тогда
				Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости 	
					Или (СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
					И НаборКоэф.КоэффПолнСтоимРабот <> 0) Тогда
					ДобавкакТР = Окр(ДобавкакТР * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков);
				ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
					И НаборКоэф.КоэффПолнСтоимРабот = 0 Тогда	
					ДобавкакТР = Окр(ДобавкакТР * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),КолЗнаков);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		ДобавкаНРвТР.ТекПрямЗатраты	= Окр(ДобавкаНРвТР.ТекПрямЗатраты,КолЗнаков) + ДобавкакТР;
		
	КонецЕсли;
	//
	// Методика 1984 года
	
	// Итого с учетом накладных расходов.
	ИтогоСУчетомНаклРасх  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ИтогоСУчетомНаклРасх,"Итог");
	Если ИтогоСУчетомНаклРасх = Неопределено Тогда
		ИтогоСУчетомНаклРасх 				= ТаблРасчета.Добавить();
		ИтогоСУчетомНаклРасх.Итог		 	= Справочники.СМ_ИтогиПоРазделу.ИтогоСУчетомНаклРасх;
	КонецЕсли;
	// Суммирование с итогом по подчиненным разделам.
	
	// Базисное значение.
	Если (МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный) И МетодикаРСНБ Тогда
		ИтогоСУчетомНаклРасхСумма 		 = ИтогоСУчетомНаклРасх.ПрямЗатраты + НаклРасхРаздела + ПрямЗатраты;
		ИтогоСУчетомНаклРасх.ПрямЗатраты = ИтогоСУчетомНаклРасхСумма;
	Иначе
		ИтогоСУчетомНаклРасх.ПрямЗатраты = ИтогоСУчетомНаклРасх.ПрямЗатраты + НаклРасхРаздела + ПЗ;
	КонецЕсли;
	
	// Текущее значение.
	ИтогоСУчетомНаклРасх.ТекПрямЗатраты = ИтогоСУчетомНаклРасх.ТекПрямЗатраты + НаклРасхРазделаТекущая + ?(ЗначениеЗаполнено(СИндексамиПЗ),СИндексамиПЗ,ТекПЗ);
	
	// ***************************************************************
	// ++ AVV  Итоги по разделу (базисно-индексный метод по разделу)

	// Для подсчета обнуленной стоимости материала, в печатной форме.
	//ИтогоСУчетомНаклРасх.ТекСтоимМатер = ИтогоПоРазделу.ТекСтоимМатер; // Было
	
	// -- AVV 
	// ***************************************************************

	Если Не МетодикаРСНБ Тогда
		// Сметная прибыль.
		СметПрибыль  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.СметПрибыль,"Итог");
		Если  СметПрибыль = Неопределено Тогда
			СметПрибыль 				= ТаблРасчета.Добавить();
			СметПрибыль.Итог 			= Справочники.СМ_ИтогиПоРазделу.СметПрибыль;
		КонецЕсли;
		// Базисное значение.
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			СметПрибыльПоРазделу    = Окр(?(ИтоговаяСтрокаБЕ.СуммаСПБазисная = NULL,0,ИтоговаяСтрокаБЕ.СуммаСПБазисная),КолЗнаков) ;
		Иначе
			СметПрибыльПоРазделу    = Окр(?(ИтоговаяСтрокаБИ.СуммаСПБазисная = NULL,0,ИтоговаяСтрокаБИ.СуммаСПБазисная),КолЗнаков);
		КонецЕсли;
		СметПрибыль.ПрямЗатраты = СметПрибыль.ПрямЗатраты + СметПрибыльПоРазделу;
		// Текущее значение.
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
			ТекущаяСметПрибыльПоРазделу =  Окр(?(ИтоговаяСтрокаБЕ.СуммаСПТекущая = NULL,0,ИтоговаяСтрокаБЕ.СуммаСПТекущая),КолЗнаков); // + СуммаСПТекПодразд;
		Иначе	
			ТекущаяСметПрибыльПоРазделу = ?(ИтоговаяСтрокаБИ.СуммаСПТекущая = NULL,0,ИтоговаяСтрокаБИ.СуммаСПТекущая); // + СуммаСПТекПодразд;
		КонецЕсли;	
		// Сметная прибыль с коэффициентами к разделу.
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			Если НаборКоэф <> Неопределено Тогда
				Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости 	
					Или (СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат 
					И НаборКоэф.КоэффПолнСтоимРабот <> 0) Тогда
					ТекущаяСметПрибыльПоРазделу = Окр(ТекущаяСметПрибыльПоРазделу  * ?(НаборКоэф.КоэффПолнСтоимРабот = 0,1,НаборКоэф.КоэффПолнСтоимРабот),КолЗнаков);
				ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат
					И НаборКоэф.КоэффПолнСтоимРабот = 0 Тогда	
					ТекущаяСметПрибыльПоРазделу = Окр(ТекущаяСметПрибыльПоРазделу * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),КолЗнаков);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ТекущаяСметПрибыльПоРазделу = Окр(ТекущаяСметПрибыльПоРазделу,КолЗнаков);
		КонецЕсли;
		ТекущаяСметПрибыльПоРазделу = ТекущаяСметПрибыльПоРазделу  ;
		СметПрибыль.ТекПрямЗатраты 	= СметПрибыль.ТекПрямЗатраты + ТекущаяСметПрибыльПоРазделу;
	КонецЕсли;
	
	// Всего по разделу.
	ВсегоПоРазделу  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.ВсегоПоРазделу,"Итог");
	Если ВсегоПоРазделу = Неопределено Тогда
		ВсегоПоРазделу 					= ТаблРасчета.Добавить();
		ВсегоПоРазделу.Итог 			= Справочники.СМ_ИтогиПоРазделу.ВсегоПоРазделу;
	КонецЕсли;
	ВсегоПоРазделу.Раздел			= ТекСсылка;
	// Базисные значения.
	Если (МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный) и МетодикаРСНБ Тогда
		ВсегоПоРазделу.ПрямЗатраты = ИтогоСУчетомНаклРасхСумма;
	Иначе
		ВсегоПоРазделу.ПрямЗатраты = Окр(ИтогоПоРазделу.ПрямЗатраты,КолЗнаков) + СметПрибыль.ПрямЗатраты + НаклРасх.ПрямЗатраты + ИтогоОборуд.ПрямЗатраты ;
	КонецЕсли;
	ВсегоПоРазделу.ОснЗарплата 	= Окр(ИтогоПоРазделу.ОснЗарплата,КолЗнаков);
	ВсегоПоРазделу.СтоимМатер 	= Окр(ИтогоПоРазделу.СтоимМатер,КолЗнаков); 
	ВсегоПоРазделу.ЭксплМашин 	= Окр(ИтогоПоРазделу.ЭксплМашин,КолЗнаков);
	ВсегоПоРазделу.ЗарплМашин 	= Окр(ИтогоПоРазделу.ЗарплМашин,КолЗнаков);
	ВсегоПоРазделу.ВозвратМатер = Окр(ИтогоПоРазделу.ВозвратМатер,КолЗнаков); 
	
	ВсегоПоРазделу.ЗатратыТрудаРабочих = Окр(ВсегоПоРазделу.ЗатратыТрудаРабочих,2) + ЗТР;
	ВсегоПоРазделу.ЗатратыТрудаМашин =  Окр(ВсегоПоРазделу.ЗатратыТрудаМашин,2) + ЗТМ;
	
	// Текущие значения.
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
		ВсегоПоРазделу.ТекПрямЗатраты = Окр(ИтогоСИндексКЭлемЗатрат.ТекПрямЗатраты,КолЗнаков) + НаклРасх.ТекПрямЗатраты +  СметПрибыль.ТекПрямЗатраты + ИтогоСИндексКОборуд.ТекПрямЗатраты;
		ВсегоПоРазделу.ТекОснЗарплата = СИндексамиОЗ;
		// ***************************************************************
		// ++ AVV  Итоги по разделу (базисно-индексный метод по разделу)
		//ВсегоПоРазделу.ТекСтоимМатер = СИндексамиСМ + МатериалыВТекЦенах;  // было
		ВсегоПоРазделу.ТекСтоимМатер = СИндексамиСМ;                     	 // добавил
		// -- AVV 
		// ***************************************************************
		ВсегоПоРазделу.ТекЭксплМашин 	= СИндексамиЭМ;
		ВсегоПоРазделу.ТекЗарплМашин 	= СИндексамиЗМ;
		ВсегоПоРазделу.ТекВозвратМатер 	= СИндексамиВМ;
	Иначе
		ВсегоПоРазделу.ТекОснЗарплата 	= Окр(ИтогоПоРазделу.ТекОснЗарплата,КолЗнаков);
		ВсегоПоРазделу.ТекСтоимМатер 	= Окр(ИтогоПоРазделу.ТекСтоимМатер,КолЗнаков) ; 
		ВсегоПоРазделу.ТекЭксплМашин 	= Окр(ИтогоПоРазделу.ТекЭксплМашин,КолЗнаков);
		ВсегоПоРазделу.ТекЗарплМашин 	= Окр(ИтогоПоРазделу.ТекЗарплМашин,КолЗнаков);
		ВсегоПоРазделу.ТекПрямЗатраты 	= Окр(ИтогоПоРазделу.ТекПрямЗатраты,КолЗнаков) + НаклРасх.ТекПрямЗатраты +  ?(СметПрибыль = Неопределено,0,СметПрибыль.ТекПрямЗатраты) + ?(ИтогоОборуд = Неопределено,0,ИтогоОборуд.ТекПрямЗатраты);
		ВсегоПоРазделу.ТекВозвратМатер 	= Окр(ИтогоПоРазделу.ТекВозвратМатер,КолЗнаков) ; 
	КонецЕсли;
	
	// Нормативная трудоемкость.
	НормативТрудоемк  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.НормативТрудоемк,"Итог");
	Если  НормативТрудоемк = Неопределено Тогда
		НормативТрудоемк 			 	= ТаблРасчета.Добавить();
		НормативТрудоемк.Итог 		 	= Справочники.СМ_ИтогиПоРазделу.НормативТрудоемк;
	КонецЕсли;
	
	НормативТрудоемк.ПрямЗатраты 	= Окр(НормативТрудоемк.ПрямЗатраты,КолЗнаков) + НормативТрудоемкостиПоРазделу;
	НормативТрудоемк.ТекПрямЗатраты = Окр(НормативТрудоемк.ТекПрямЗатраты,КолЗнаков) + НормативТрудоемкостиПоРазделу;
	
	// Сметная зарплата.
	СметнЗарплата  = ТаблРасчета.Найти(Справочники.СМ_ИтогиПоРазделу.СметнЗарплата,"Итог");
	Если  СметнЗарплата = Неопределено Тогда
		СметнЗарплата 					= ТаблРасчета.Добавить();
		СметнЗарплата.Итог 				= Справочники.СМ_ИтогиПоРазделу.СметнЗарплата;
	КонецЕсли;
	// Базисное значение СЗ.
	ИтогоОЗ = ВсегоПоРазделу.ОснЗарплата + ВсегоПоРазделу.ЗарплМашин;
	СметнЗарплата.ПрямЗатраты 		= Окр(ИтогоОЗ,КолЗнаков);
	// Текущее значение СЗ.
	ИтогоОЗ = ВсегоПоРазделу.ТекОснЗарплата + ВсегоПоРазделу.ТекЗарплМашин;
	СметнЗарплата.ТекПрямЗатраты 	= ИтогоОЗ;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);
	
	ТаблРасчета.ЗаполнитьЗначения(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета,"Смета");
	Отбор.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	
	ТаблРасчета.ЗаполнитьЗначения(СтруктураПараметровОтбораРС.СсылкаНаРаздел,"Раздел");
	СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_ИтогиПоРазделу",Отбор,ТаблРасчета);
	
КонецПроцедуры

// Формирование итогов по видам работ, рассчитывает итоги по видам работ для всех 
//	методов счета базисно-индексный(уровень задания индексов расценка, раздел, смета.
//	Способ задания индексов по эелементам затрат, к полной стоимости.
//
// Параметры:
//     Ссылка 			- ДокументСсылка.СМ_ЛокальнаяСмета - ссылка на локальную смету.
//
Процедура СформироватьИтогиПоВидамРабот(Ссылка) Экспорт 
	
	// Ссылка Акт или смета.
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		ФлагАкт = Истина;
		МетодРасчета = Ссылка.ЛокальнаяСмета.МетодРасчета;
		Уровень = ССылка.ЛокальнаяСмета.Уровень;
		СпособРасчетаИндексов = Ссылка.ЛокальнаяСмета.СпособРасчетаИндексов;
		ВариантПересчетаЭММ =Ссылка.ЛокальнаяСмета.ВариантПересчетаЭММ;
	Иначе
		ФлагАкт = Ложь;
		МетодРасчета = Ссылка.МетодРасчета;
		Уровень = ССылка.Уровень;
		СпособРасчетаИндексов = Ссылка.СпособРасчетаИндексов;
		ВариантПересчетаЭММ =Ссылка.ВариантПересчетаЭММ;
	КонецЕсли;
	ПромОкр = Ссылка.ПромежуточноеОкругление;
	ОкрИтог = Ссылка.ОкруглятьДоРублей;
	КолЗнаков = ?(ПромОкр,2,6);
	Если ОкрИтог Тогда
		КолЗнаков = 0;
	КонецЕсли;	
	ОбрабПогр = Ссылка.ОбрабатыватьПогрешность;

	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда 
		Если Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
			НаборКоэф = Ссылка;
		КонецЕсли;
	КонецЕсли;

	// Судариков - избавляемся от чтения РС
    ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6));

	ТаблРасчета = Новый ТаблицаЗначений();
	ТаблРасчета.Колонки.Добавить("Смета");
	ТаблРасчета.Колонки.Добавить("Раздел");
	ТаблРасчета.Колонки.Добавить("Итог");
	ТаблРасчета.Колонки.Добавить("ВозвратМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗарплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗатратыТрудаМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЗатратыТрудаРабочих",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("Оборуд",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ОснЗарплата",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ПрямЗатраты",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("СтоимМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекВозвратМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекЗарплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекОборуд",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекОснЗарплата",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекПрямЗатраты",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекСтоимМатер",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ТекЭксплМашин",ОписаниеТипаЧисло);
	ТаблРасчета.Колонки.Добавить("ЭксплМашин",ОписаниеТипаЧисло);

	
	// Базисно-индексный метод.
	Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
			
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел КАК Раздел,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета КАК Смета,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция КАК Позиция,
		|	ВЫБОР
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.МонтажныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.МеталломонтажныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.Металлоконстр)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.СантехническиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.СантехнРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.БуровзрывныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.БуровзрывнРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ГорнопроходческиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ГорнопрохРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ПрочиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.Оборудование)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ПустаяСсылка)
		|	КОНЕЦ КАК Итог,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимПрямЗатраты) КАК ПрямЗатраты,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОснЗарплата) КАК ОснЗарплата,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЭксплМашин) КАК ЭксплМашин,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЗарплМашин) КАК ЗарплМашин,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимСтоимМатер) КАК СтоимМатер,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОборуд) КАК Оборуд,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимВозвратМатер) КАК ВозвратМатер,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаРабочих) КАК ЗатратыТрудаРабочих,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаМашин ) КАК ЗатратыТрудаМашин,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ДопЗМ ) КАК ДопЗМ,
		|	СУММА(НРиСП.СуммаНРНаОбъем + НРиСП.СуммаНРМашинистовНаОбъем) КАК СуммаНРБазисная,
		|	СУММА(НРиСП.СуммаСПНаОбъем + НРиСП.СуммаСПМашинистовНаОбъем) КАК СуммаСПБазисная,
		|	0 КАК ТекПрямЗатраты,
		|	0 КАК ТекОснЗарплата,
		|	0 КАК ТекЭксплМашин,
		|	0 КАК ТекЗарплМашин,
		|	0 КАК ТекСтоимМатер,
		|	0 КАК ТекОборуд,
		|	0 КАК ТекВозвратМатер,
		|	0 КАК ТекЗатратыТрудаРабочих,
		|	0 КАК ТекЗатратыТрудаМашин,
		|	0 КАК ТекДопЗМ, 
		|	0 КАК СуммаНРТекущая,
		|	0 КАК СуммаСПТекущая  
		|ИЗ 
		|	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП ";
	//Если ФлагАкт = Истина Тогда
	//		ТекстЗапроса = ТекстЗапроса + "
	//	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.Позиции КАК АктВыполненныхРаботПозиции
	//	|	ПО БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = АктВыполненныхРаботПозиции.Позиция 
	//	|	 И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = АктВыполненныхРаботПозиции.Ссылка";
	//КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НРиСП КАК НРиСП
		|	ПО БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = НРиСП.Смета  
		|	   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел = НРиСП.Раздел 
		|	   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = НРиСП.Позиция
		|ГДЕ
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = &Смета 
		|   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Расчет = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета, 
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел КАК Раздел,
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета КАК Смета,
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция КАК Позиция,
		|	ВЫБОР
		|		КОГДА БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.МонтажныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб)
		|		КОГДА БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб)
		|		КОГДА БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.МеталломонтажныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.Металлоконстр)
		|		КОГДА БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.СантехническиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.СантехнРаб)
		|		КОГДА БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.БуровзрывныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.БуровзрывнРаб)
		|		КОГДА БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ГорнопроходческиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ГорнопрохРаб)
		|		КОГДА БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ПрочиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб)
		|		КОГДА БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.Оборудование)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ПустаяСсылка)
		|	КОНЕЦ КАК Итог,
		|	0 КАК ПрямЗатраты,
		|	0 КАК ОснЗарплата,
		|	0 КАК ЭксплМашин,
		|	0 КАК ЗарплМашин,
		|	0 КАК СтоимМатер,
		|	0 КАК Оборуд,
		|	0 КАК ВозвратМатер,
		|	0 КАК ЗатратыТрудаРабочих,
		|	0 КАК ЗатратыТрудаМашин,
		|	0 КАК ДопЗМ,
		|	0 КАК СуммаНРБазисная,
		|	0 КАК СуммаСПБазисная,
		|
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимПрямЗатраты) КАК ТекПрямЗатраты,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата) КАК ТекОснЗарплата,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин) КАК ТекЭксплМашин,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин) КАК ТекЗарплМашин,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер) КАК ТекСтоимМатер,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд) КАК ТекОборуд,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер) КАК ТекВозвратМатер,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаРабочих) КАК ТекЗатратыТрудаРабочих,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ЗатратыТрудаМашин) КАК ТекЗатратыТрудаМашин,
		|	СУММА(БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.ДопЗМ) КАК ТекДопЗМ,
		|   СУММА(НРиСП.ТекСуммаНРНаОбъем + НРиСП.ТекСуммаНРМашинистовНаОбъем) КАК СуммаНРТекущая,
		|   СУММА(НРиСП.ТекСуммаСПНаОбъем + НРиСП.ТекСуммаСПМашинистовНаОбъем) КАК СуммаСПТекущая 
		|ИЗ 
		|	РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета ";
		//Если ФлагАкт = Истина Тогда
		//	ТекстЗапроса = ТекстЗапроса + "
		//	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.Позиции КАК АктВыполненныхРаботПозиции
		//	|	ПО БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = АктВыполненныхРаботПозиции.Позиция 
		//	|	 И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = АктВыполненныхРаботПозиции.Ссылка ";
		//КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НРиСП КАК НРиСП
		|	ПО БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = НРиСП.Смета  
		|	   И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = НРиСП.Раздел 
		|	   И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = НРиСП.Позиция
		|ГДЕ
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета 
		|   И БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Расчет = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета, 
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел,
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция,
		|	БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция.Определитель.ВидРабот";
		
	ИначеЕсли МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда

		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел КАК Раздел,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета КАК Смета,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция,
		|	ВЫБОР
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.МонтажныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.СтроитРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.МеталломонтажныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.Металлоконстр)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.СантехническиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.СантехнРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.БуровзрывныеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.БуровзрывнРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ГорнопроходческиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ГорнопрохРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.ПрочиеРаботы)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ПрочРаб)
		|		КОГДА БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот = ЗНАЧЕНИЕ(Перечисление.СМ_ВидыЗатратСмета.Оборудование)
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.Оборуд)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СМ_ИтогиСметыПоВидамРабот.ПустаяСсылка)
		|	КОНЕЦ КАК Итог,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимПрямЗатраты) КАК ПрямЗатраты,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОснЗарплата) КАК ОснЗарплата,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЭксплМашин)  КАК ЭксплМашин,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимЗарплМашин) КАК ЗарплМашин,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимСтоимМатер) КАК СтоимМатер,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимОборуд) КАК Оборуд,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.СтоимВозвратМатер) КАК ВозвратМатер,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаРабочих) КАК ЗатратыТрудаРабочих,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ЗатратыТрудаМашин) КАК ЗатратыТрудаМашин,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ДопЗМ) КАК ДопЗМ,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимПрямЗатраты) КАК ТекПрямЗатраты,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОснЗарплата) КАК ТекОснЗарплата,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЭксплМашин) КАК ТекЭксплМашин,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимЗарплМашин) КАК ТекЗарплМашин,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимСтоимМатер) КАК ТекСтоимМатер,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимОборуд) КАК ТекОборуд,
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ТекСтоимВозвратМатер) КАК ТекВозвратМатер, 
		|	СУММА(БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.ДопЗМТек) КАК ТекДопЗМ, 
		|   СУММА(НРиСП.СуммаНРНаОбъем + НРиСП.СуммаНРМашинистовНаОбъем) КАК СуммаНРБазисная,
		|   СУММА(НРиСП.СуммаСПНаОбъем + НРиСП.СуммаСПМашинистовНаОбъем) КАК СуммаСПБазисная,
		|   СУММА(НРиСП.ТекСуммаНРНаОбъем + НРиСП.ТекСуммаНРМашинистовНаОбъем) КАК СуммаНРТекущая,
		|   СУММА(НРиСП.ТекСуммаСПМашинистовНаОбъем + НРиСП.ТекСуммаСПНаОбъем) КАК СуммаСПТекущая 
		|ИЗ
		|	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП";
		//Если ФлагАкт = Истина Тогда
		//	ТекстЗапроса = ТекстЗапроса + "
		//	|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.СМ_АктВыполненныхРабот.Позиции КАК АктВыполненныхРаботПозиции
		//	|	ПО БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = АктВыполненныхРаботПозиции.Позиция 
		//	|	 И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = АктВыполненныхРаботПозиции.Ссылка ";
		//КонецЕсли;
		ТекстЗапроса = ТекстЗапроса + "
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СМ_НРиСП КАК НРиСП
		|	ПО БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = НРиСП.Смета  
		|	   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел = НРиСП.Раздел 
		|	   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция = НРиСП.Позиция
		|ГДЕ
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета = &Смета 
		|   И БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Расчет = ИСТИНА
		|СГРУППИРОВАТЬ ПО
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Смета, 
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Раздел,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция,
		|	БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Позиция.Определитель.ВидРабот";

	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ТекстЗапроса) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос 			= Новый Запрос;
	Запрос.Текст 	= ТекстЗапроса;
	Запрос.УстановитьПараметр("Смета",Ссылка);
	Запрос.УстановитьПараметр("ФлагАкт",ФлагАкт);
	
	ТаблПозиции = Запрос.Выполнить().Выгрузить();
	ТаблПозиции.Свернуть("Смета,Раздел,Итог,Позиция","ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,СуммаНРБазисная,СуммаСПБазисная,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер,СуммаНРТекущая,СуммаСПТекущая,ДопЗМ,ТекДопЗМ");
	Для Каждого ТекСтрока Из ТаблПозиции Цикл
		Объем = 0;
		Если ФлагАкт = Истина Тогда
			СтрокаВАкте = СМ_СметаВызовСервера.СтрокаПозицииАкта(Ссылка, ТекСтрока.Позиция.Ссылка);
			Если Не СтрокаВАкте = Неопределено Тогда
				Объем = СтрокаВАкте.ФактОбъем;
			КонецЕсли;
		Иначе
			Объем = ТекСтрока.Позиция.ОбъемРабот;
		КонецЕсли;
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
			И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			НеПрименятьИндексы = ТекСтрока.Позиция.НеПрименятьИндексы;
		Иначе
			НеПрименятьИндексы = Ложь;
		КонецЕсли;
		ВР = ТекСтрока.Позиция.Определитель.ВидРасценки;
		Если МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
			ТекСтрока.ПрямЗатраты 		= ?(ПромОкр,Окр(ТекСтрока.ПрямЗатраты * Объем,КолЗнаков),ТекСтрока.ПрямЗатраты * Объем);
			ТекСтрока.ОснЗарплата       = ?(ПромОкр,Окр(ТекСтрока.ОснЗарплата * Объем,КолЗнаков),ТекСтрока.ОснЗарплата * Объем);
			ТекСтрока.ЭксплМашин        = ?(ПромОкр,Окр(ТекСтрока.ЭксплМашин * Объем,КолЗнаков),ТекСтрока.ЭксплМашин * Объем);
			ТекСтрока.ЗарплМашин        = ?(ПромОкр,Окр(ТекСтрока.ЗарплМашин * Объем,КолЗнаков),ТекСтрока.ЗарплМашин * Объем);
			ТекСтрока.СтоимМатер        = ?(ПромОкр,Окр(ТекСтрока.СтоимМатер * Объем,КолЗнаков),ТекСтрока.СтоимМатер * Объем);
			ТекСтрока.Оборуд            = ?(ПромОкр,Окр(ТекСтрока.Оборуд * Объем,КолЗнаков),ТекСтрока.Оборуд * Объем);
			ТекСтрока.ВозвратМатер      = ?(ПромОкр,Окр(ТекСтрока.ВозвратМатер * Объем,КолЗнаков),ТекСтрока.ВозвратМатер * Объем);
			ТекСтрока.ДопЗМ			    = ?(ПромОкр,Окр(ТекСтрока.ДопЗМ * Объем,КолЗнаков),ТекСтрока.ДопЗМ * Объем);
			
			ТекСтрока.ТекПрямЗатраты    = ?(ПромОкр,Окр(ТекСтрока.ТекПрямЗатраты * Объем,КолЗнаков),ТекСтрока.ТекПрямЗатраты * Объем);
			ТекСтрока.ТекОснЗарплата    = ?(ПромОкр,Окр(ТекСтрока.ТекОснЗарплата * Объем,КолЗнаков),ТекСтрока.ТекОснЗарплата * Объем);
			ТекСтрока.ТекЭксплМашин     = ?(ПромОкр,Окр(ТекСтрока.ТекЭксплМашин * Объем,КолЗнаков),ТекСтрока.ТекЭксплМашин * Объем);
			ТекСтрока.ТекЗарплМашин     = ?(ПромОкр,Окр(ТекСтрока.ТекЗарплМашин * Объем,КолЗнаков),ТекСтрока.ТекЗарплМашин * Объем);
			ТекСтрока.ТекСтоимМатер     = ?(ПромОкр,Окр(ТекСтрока.ТекСтоимМатер * Объем,КолЗнаков),ТекСтрока.ТекСтоимМатер * Объем);
			ТекСтрока.ТекВозвратМатер   = ?(ПромОкр,Окр(ТекСтрока.ТекВозвратМатер * Объем,КолЗнаков),ТекСтрока.ТекВозвратМатер * Объем);
			ТекСтрока.ТекДопЗМ		    = ?(ПромОкр,Окр(ТекСтрока.ТекДопЗМ * Объем,КолЗнаков),ТекСтрока.ТекДопЗМ * Объем);
			ТекСтрока.ТекОборуд         = ?(ПромОкр,Окр(ТекСтрока.ТекОборуд * Объем,КолЗнаков),ТекСтрока.ТекОборуд * Объем);
		Иначе
			
			// *********************************************************************
			// ++ AVV
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
				МетодикаРасчета = Ссылка.ЛокальнаяСмета.МетодикаРасчета;
			Иначе	
				МетодикаРасчета = Ссылка.МетодикаРасчета;
			КонецЕсли;
			// ++ AVV
			// *********************************************************************

			// методика РСНБ
			//Если МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_КЗ_РСНБ Тогда
			//	
			//	НР2_ВС = Ссылка.НР2_ВС;
			//	СП_ВС = Ссылка.СП_ВС;
			//	
			//	ТекСтрока.ПрямЗатраты 		= ?(ПромОкр,Окр(Окр(ТекСтрока.ПрямЗатраты,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ПрямЗатраты) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ОснЗарплата       = ?(ПромОкр,Окр(Окр(ТекСтрока.ОснЗарплата,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ОснЗарплата) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ЭксплМашин        = ?(ПромОкр,Окр(Окр(ТекСтрока.ЭксплМашин,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ЭксплМашин) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ЗарплМашин        = ?(ПромОкр,Окр(Окр(ТекСтрока.ЗарплМашин,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ЗарплМашин) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.СтоимМатер        = ?(ПромОкр,Окр(Окр(ТекСтрока.СтоимМатер,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.СтоимМатер) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.Оборуд            = ?(ПромОкр,Окр(Окр(ТекСтрока.Оборуд,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.Оборуд) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ВозвратМатер      = ?(ПромОкр,Окр(Окр(ТекСтрока.ВозвратМатер,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ВозвратМатер) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ДопЗМ			    = ?(ПромОкр,Окр(ТекСтрока.ДопЗМ * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),ТекСтрока.ДопЗМ * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	
			//	ТекСтрока.ТекПрямЗатраты    = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекПрямЗатраты,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ТекПрямЗатраты) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ТекОснЗарплата    = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекОснЗарплата,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ТекОснЗарплата) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ТекЭксплМашин     = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекЭксплМашин,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ТекЭксплМашин) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ТекЗарплМашин     = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекЗарплМашин,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ТекЗарплМашин) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ТекСтоимМатер     = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекСтоимМатер,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ТекСтоимМатер) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ТекВозвратМатер   = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекВозвратМатер,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ТекВозвратМатер) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ТекДопЗМ		    = ?(ПромОкр,Окр(ТекСтрока.ТекДопЗМ * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),ТекСтрока.ТекДопЗМ * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	ТекСтрока.ТекОборуд         = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекОборуд,КолЗнаков) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100),КолЗнаков),(ТекСтрока.ТекОборуд) * Объем * ((НР2_ВС + 100)/100) *  ((СП_ВС + 100)/100));
			//	
			//Иначе
				
				ТекСтрока.ПрямЗатраты 		= ?(ПромОкр,Окр(Окр(ТекСтрока.ПрямЗатраты,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ПрямЗатраты) * Объем);
				ТекСтрока.ОснЗарплата       = ?(ПромОкр,Окр(Окр(ТекСтрока.ОснЗарплата,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ОснЗарплата) * Объем);
				ТекСтрока.ЭксплМашин        = ?(ПромОкр,Окр(Окр(ТекСтрока.ЭксплМашин,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ЭксплМашин) * Объем);
				ТекСтрока.ЗарплМашин        = ?(ПромОкр,Окр(Окр(ТекСтрока.ЗарплМашин,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ЗарплМашин) * Объем);
				ТекСтрока.СтоимМатер        = ?(ПромОкр,Окр(Окр(ТекСтрока.СтоимМатер,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.СтоимМатер) * Объем);
				ТекСтрока.Оборуд            = ?(ПромОкр,Окр(Окр(ТекСтрока.Оборуд,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.Оборуд) * Объем);
				ТекСтрока.ВозвратМатер      = ?(ПромОкр,Окр(Окр(ТекСтрока.ВозвратМатер,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ВозвратМатер) * Объем);
				ТекСтрока.ДопЗМ			    = ?(ПромОкр,Окр(ТекСтрока.ДопЗМ * Объем,КолЗнаков),ТекСтрока.ДопЗМ * Объем);
				
				ТекСтрока.ТекПрямЗатраты    = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекПрямЗатраты,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ТекПрямЗатраты) * Объем);
				ТекСтрока.ТекОснЗарплата    = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекОснЗарплата,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ТекОснЗарплата) * Объем);
				ТекСтрока.ТекЭксплМашин     = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекЭксплМашин,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ТекЭксплМашин) * Объем);
				ТекСтрока.ТекЗарплМашин     = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекЗарплМашин,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ТекЗарплМашин) * Объем);
				ТекСтрока.ТекСтоимМатер     = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекСтоимМатер,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ТекСтоимМатер) * Объем);
				ТекСтрока.ТекВозвратМатер   = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекВозвратМатер,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ТекВозвратМатер) * Объем);
				ТекСтрока.ТекДопЗМ		    = ?(ПромОкр,Окр(ТекСтрока.ТекДопЗМ * Объем,КолЗнаков),ТекСтрока.ТекДопЗМ * Объем);
				ТекСтрока.ТекОборуд         = ?(ПромОкр,Окр(Окр(ТекСтрока.ТекОборуд,КолЗнаков) * Объем,КолЗнаков),(ТекСтрока.ТекОборуд) * Объем);
				
			//КонецЕсли;
		КонецЕсли;
		
		Если ОкрИтог Тогда
			ТекСтрока.ОснЗарплата 	= Окр(ТекСтрока.ОснЗарплата,0);		
			ТекСтрока.ЭксплМашин 	= Окр(ТекСтрока.ЭксплМашин,0);		
			ТекСтрока.ЗарплМашин 	= Окр(ТекСтрока.ЗарплМашин,0);		
			ТекСтрока.СтоимМатер 	= Окр(ТекСтрока.СтоимМатер,0);		
			ТекСтрока.Оборуд 		= Окр(ТекСтрока.Оборуд,0);		
			ТекСтрока.ПрямЗатраты 	= Окр(ТекСтрока.ПрямЗатраты,0);
			Если  ТекСтрока.ПрямЗатраты <> 0 Тогда
				РассчитанныеПЗ = ТекСтрока.ОснЗарплата + ТекСтрока.ЭксплМашин + ТекСтрока.СтоимМатер;
				Если (РассчитанныеПЗ <> 0) и (МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный) Тогда
					ТекСтрока.ПрямЗатраты = РассчитанныеПЗ;
				КонецЕсли;	
			КонецЕсли;	
			
			ТекСтрока.ТекОснЗарплата    = Окр(ТекСтрока.ТекОснЗарплата,0);		
			ТекСтрока.ТекЭксплМашин     = Окр(ТекСтрока.ТекЭксплМашин,0);		
			ТекСтрока.ТекЗарплМашин 	= Окр(ТекСтрока.ТекЗарплМашин,0);		
			ТекСтрока.ТекСтоимМатер 	= Окр(ТекСтрока.ТекСтоимМатер,0);		
			ТекСтрока.ТекОборуд 	    = Окр(ТекСтрока.ТекОборуд,0);		
			ТекСтрока.ТекПрямЗатраты 	= Окр(ТекСтрока.ТекПрямЗатраты,0);
			Если  ТекСтрока.ТекПрямЗатраты <> 0 Тогда
				РассчитанныеПЗ = ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер;
				Если (РассчитанныеПЗ <> 0) и (МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный) Тогда
					ТекСтрока.ТекПрямЗатраты = РассчитанныеПЗ;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;
		
		
		ТекСтрока.ЗатратыТрудаРабочих 	= ТекСтрока.ЗатратыТрудаРабочих * Объем;
		ТекСтрока.ЗатратыТрудаМашин	  	= ТекСтрока.ЗатратыТрудаМашин * Объем;
		СуммаНРБазисная = ?(ТекСтрока.СуммаНРБазисная = NULL,0,ТекСтрока.СуммаНРБазисная);
		СуммаНРБазиснаяОкр = ?(ОкрИтог,Окр(СуммаНРБазисная,0),СуммаНРБазисная);
		
		СуммаСПБазисная = ?(ТекСтрока.СуммаСПБазисная = NULL,0,ТекСтрока.СуммаСПБазисная);
		СуммаСПБазиснаяОкр = ?(ОкрИтог,Окр(СуммаСПБазисная,0),СуммаСПБазисная);
		
		СуммаНРТекущая = ?(ТекСтрока.СуммаНРТекущая = NULL,0,ТекСтрока.СуммаНРТекущая);
		СуммаНРТекущаяОкр = ?(ОкрИтог,Окр(СуммаНРТекущая,0),СуммаНРТекущая);
		
		СуммаСПТекущая = ?(ТекСтрока.СуммаСПТекущая = NULL,0,ТекСтрока.СуммаСПТекущая);
		СуммаСПТекущаяОкр = ?(ОкрИтог,Окр(СуммаСПТекущая,0),СуммаСПТекущая);
	
		ТекСтрока.ПрямЗатраты	 = ТекСтрока.ПрямЗатраты  + СуммаСПБазисная + СуммаНРБазисная;
		ТекСтрока.ТекПрямЗатраты = ТекСтрока.ТекПрямЗатраты  + СуммаСПТекущая + СуммаНРТекущая;
		ДопЗМ = ТекСтрока.ДопЗМ;
			
		Если МетодикаРасчета = Справочники.СМ_МетодикиРасчета.СМ_КЗ_РСНБ И МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
				
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
				НР2_ВС 	= Ссылка.ЛокальнаяСмета.НР2_ВС;
				СП_ВС 	= Ссылка.ЛокальнаяСмета.СП_ВС;
			Иначе
				НР2_ВС 	= Ссылка.НР2_ВС;
				СП_ВС 	= Ссылка.СП_ВС;
			КонецЕсли;
			
			К_НР_СП = ((НР2_ВС + 100)/100) * ((СП_ВС + 100)/100);

			ТекСтрока.ПрямЗатраты 		= ?(ПромОкр,Окр(ТекСтрока.ПрямЗатраты*К_НР_СП,КолЗнаков),ТекСтрока.ПрямЗатраты*К_НР_СП);
			// Временно. Для итогов в форме...
			//ТекСтрока.ОснЗарплата       = ?(ПромОкр,Окр(ТекСтрока.ОснЗарплата*К_НР_СП,КолЗнаков),ТекСтрока.ОснЗарплата*К_НР_СП);
			//ТекСтрока.ЭксплМашин        = ?(ПромОкр,Окр(ТекСтрока.ЭксплМашин*К_НР_СП,КолЗнаков),ТекСтрока.ЭксплМашин*К_НР_СП);
			//ТекСтрока.ЗарплМашин        = ?(ПромОкр,Окр(ТекСтрока.ЗарплМашин*К_НР_СП,КолЗнаков),ТекСтрока.ЗарплМашин*К_НР_СП);
			//ТекСтрока.СтоимМатер        = ?(ПромОкр,Окр(ТекСтрока.СтоимМатер*К_НР_СП,КолЗнаков),ТекСтрока.СтоимМатер*К_НР_СП);
			ТекСтрока.Оборуд            = ?(ПромОкр,Окр(ТекСтрока.Оборуд*К_НР_СП,КолЗнаков),ТекСтрока.Оборуд*К_НР_СП);
			//ТекСтрока.ВозвратМатер      = ?(ПромОкр,Окр(ТекСтрока.ВозвратМатер*К_НР_СП,КолЗнаков),ТекСтрока.ВозвратМатер*К_НР_СП);
			//ТекСтрока.ДопЗМ			    = ?(ПромОкр,Окр(ТекСтрока.ДопЗМ*К_НР_СП,КолЗнаков),ТекСтрока.ДопЗМ*К_НР_СП);
				
			ТекСтрока.ТекПрямЗатраты    = ?(ПромОкр,Окр(ТекСтрока.ТекПрямЗатраты*К_НР_СП,КолЗнаков),ТекСтрока.ТекПрямЗатраты*К_НР_СП);
			// Временно. Для итогов в форме...
			//ТекСтрока.ТекОснЗарплата    = ?(ПромОкр,Окр(ТекСтрока.ТекОснЗарплата*К_НР_СП,КолЗнаков),ТекСтрока.ТекОснЗарплата*К_НР_СП);
			//ТекСтрока.ТекЭксплМашин     = ?(ПромОкр,Окр(ТекСтрока.ТекЭксплМашин*К_НР_СП,КолЗнаков),ТекСтрока.ТекЭксплМашин*К_НР_СП);
			//ТекСтрока.ТекЗарплМашин     = ?(ПромОкр,Окр(ТекСтрока.ТекЗарплМашин*К_НР_СП,КолЗнаков),ТекСтрока.ТекЗарплМашин*К_НР_СП);
			//ТекСтрока.ТекСтоимМатер     = ?(ПромОкр,Окр(ТекСтрока.ТекСтоимМатер*К_НР_СП,КолЗнаков),ТекСтрока.ТекСтоимМатер*К_НР_СП);
			//ТекСтрока.ТекВозвратМатер   = ?(ПромОкр,Окр(ТекСтрока.ТекВозвратМатер*К_НР_СП,КолЗнаков),ТекСтрока.ТекВозвратМатер*К_НР_СП);
			//ТекСтрока.ТекДопЗМ		    = ?(ПромОкр,Окр(ТекСтрока.ТекДопЗМ*К_НР_СП,КолЗнаков),ТекСтрока.ТекДопЗМ*К_НР_СП);
			ТекСтрока.ТекОборуд         = ?(ПромОкр,Окр(ТекСтрока.ТекОборуд*К_НР_СП,КолЗнаков),ТекСтрока.ТекОборуд*К_НР_СП);
				
		ИначеЕсли МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
			И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
			
			Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат Тогда
				
				
				ТекСтрока.ТекОснЗарплата    = ТекСтрока.ТекОснЗарплата * ?(НаборКоэф.КоэффФОТ = 0,1,НаборКоэф.КоэффФОТ);
				ТекСтрока.ТекЭксплМашин     = ТекСтрока.ТекЭксплМашин * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин);
				ТекСтрока.ТекЗарплМашин     = ТекСтрока.ТекЗарплМашин * ?(НаборКоэф.КоэффФОТ = 0,1,НаборКоэф.КоэффФОТ);
				ТекСтрока.ТекСтоимМатер     = ТекСтрока.ТекСтоимМатер * ?(НаборКоэф.КоэффСтоимМатериалов = 0,1,НаборКоэф.КоэффСтоимМатериалов);
				ТекСтрока.ТекОборуд         = ТекСтрока.ТекОборуд * ?(НаборКоэф.КоэффОборуд = 0,1,НаборКоэф.КоэффОборуд);
				ТекСтрока.ТекВозвратМатер   = ТекСтрока.ТекВозвратМатер * ?(НаборКоэф.КоэффСтоимМатериалов = 0,1,НаборКоэф.КоэффСтоимМатериалов);
				
				ТекСтрока.СуммаСПТекущая    = ТекСтрока.СуммаСПТекущая * ?(НаборКоэф.КоэффФОТ = 0,1,НаборКоэф.КоэффФОТ);
				ТекСтрока.СуммаНРТекущая    = ТекСтрока.СуммаНРТекущая * ?(НаборКоэф.КоэффФОТ = 0,1,НаборКоэф.КоэффФОТ);
				Если (ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер) <> 0 Тогда
					ТекСтрока.ТекПрямЗатраты    = ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер + ТекСтрока.СуммаСПТекущая + ТекСтрока.СуммаНРТекущая;
				Иначе
					ТекСтрока.ТекПрямЗатраты    = ТекСтрока.ТекПрямЗатраты;
				КонецЕсли;
			
			ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости Тогда
				
				Если ТекСтрока.Итог = Справочники.СМ_ИтогиСметыПоВидамРабот.ПрочРаб Тогда
					ТекКоэффициент	= НаборКоэф.КоэффПрочРаб;	
				ИначеЕсли ТекСтрока.Итог = Справочники.СМ_ИтогиСметыПоВидамРабот.Оборуд Тогда
					ТекКоэффициент	= НаборКоэф.КоэффОборуд;	
				Иначе
					ТекКоэффициент	= НаборКоэф.КоэффСМР;	
				КонецЕсли;
				
				Если ТекКоэффициент = 0 Тогда
					ТекКоэффициент = 1;
				КонецЕсли;				
				
				ТекСтрока.ТекОснЗарплата    = ТекСтрока.ТекОснЗарплата * ТекКоэффициент;
				ТекСтрока.ТекЭксплМашин     = ТекСтрока.ТекЭксплМашин * ТекКоэффициент;
				ТекСтрока.ТекЗарплМашин     = ТекСтрока.ТекЗарплМашин * ТекКоэффициент;
				ТекСтрока.ТекСтоимМатер     = ТекСтрока.ТекСтоимМатер * ТекКоэффициент;
				ТекСтрока.ТекОборуд         = ТекСтрока.ТекОборуд * ТекКоэффициент;
				ТекСтрока.ТекВозвратМатер   = ТекСтрока.ТекВозвратМатер * ТекКоэффициент;
				Если (ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер) <> 0 Тогда
					ТекСтрока.ТекПрямЗатраты    = ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер;
				Иначе
					ТекСтрока.ТекПрямЗатраты = ТекСтрока.ТекПрямЗатраты * ТекКоэффициент;
				КонецЕсли;
		
				СуммаСПТекущая    = СуммаСПТекущая * ТекКоэффициент; 
				СуммаНРТекущая    = СуммаНРТекущая * ТекКоэффициент; 
				
				ТекСтрока.ТекПрямЗатраты    = ТекСтрока.ТекПрямЗатраты + СуммаСПТекущая + СуммаНРТекущая;
				
			КонецЕсли;
			
		ИначеЕсли МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный
			И Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда	
			Если ФлагАкт  Тогда
				Отбор1 = Новый Структура();
				Отбор1.Вставить("Раздел", ТекСтрока.Раздел);
				МассивНаборКоэф = Ссылка.Разделы.НайтиСтроки(Отбор1);
				Если МассивНаборКоэф.Количество() = 1 Тогда
					НаборКоэф = МассивНаборКоэф[0];
				Иначе
					// Временно?
					НаборКоэф = ТекСтрока.Раздел;
				КонецЕсли;	
			Иначе
				НаборКоэф = ТекСтрока.Раздел;
			КонецЕсли;
			НеПрименятьИндексы = ТекСтрока.Позиция.НеПрименятьИндексы;
			Если НеПрименятьИндексы = Ложь Тогда
				Если СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат И
					НаборКоэф.КоэффПолнСтоимРабот = 0 Тогда
					УчитыватьДопЗМ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","УчитыватьДопЗМ",Ложь);	
					ИндексироватьДопЗМФот = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","ИндексироватьДопЗМФот",Ложь);	
					КоэффЗМ = ?(ИндексироватьДопЗМФот, ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты), ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин));	
					// К расценке применяются индексы.
					Если ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.Разные Тогда
						ТекСтрока.ТекЗарплМашин = Окр(ТекСтрока.ТекЗарплМашин * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),2);
						ТекСтрока.ТекЭксплМашин = Окр(ТекСтрока.ТекЭксплМашин * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),2);
						Если УчитыватьДопЗМ Тогда 
							ТекСтрока.ТекЭксплМашин     = (ТекСтрока.ТекЭксплМашин - Окр(ДопЗМ,2)*?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин)) + Окр(ДопЗМ,2) * КоэффЗМ;
						КонецЕсли;
					ИначеЕсли ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.Одинаковые Тогда
						ТекСтрока.ТекЗарплМашин = Окр(ТекСтрока.ТекЗарплМашин * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),2);
						ТекСтрока.ТекЭксплМашин = Окр(ТекСтрока.ТекЭксплМашин * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),2);
					ИначеЕсли ВариантПересчетаЭММ = Перечисления.СМ_ВариантыПересчетаЭММ.РазныеКРазности Тогда
						ТекСтрока.ТекЭксплМашин = Окр((ТекСтрока.ТекЭксплМашин - ТекСтрока.ТекЗарплМашин) * ?(НаборКоэф.КоэффСтоимЭксплМашин = 0,1,НаборКоэф.КоэффСтоимЭксплМашин),2);
						ТекСтрока.ТекЗарплМашин = Окр(ТекСтрока.ТекЗарплМашин * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты),2);
						ТекСтрока.ТекЭксплМашин = ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекЗарплМашин;
					КонецЕсли;	
					ТекСтрока.ТекОснЗарплата    = Окр(ТекСтрока.ТекОснЗарплата,2) * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты);
					ТекСтрока.ТекСтоимМатер     = Окр(ТекСтрока.ТекСтоимМатер,2) * ?(НаборКоэф.КоэффСтоимМатериалов = 0,1,НаборКоэф.КоэффСтоимМатериалов);
					ТекСтрока.ТекОборуд         = Окр(ТекСтрока.ТекОборуд,2) * ?(НаборКоэф.КоэффОборуд = 0,1,НаборКоэф.КоэффОборуд);
					ТекСтрока.ТекВозвратМатер   = Окр(ТекСтрока.ТекВозвратМатер,2) * ?(НаборКоэф.КоэффСтоимМатериалов = 0,1,НаборКоэф.КоэффСтоимМатериалов);
					
					СуммаСПТекущая    = СуммаСПТекущая * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты);
					СуммаСПТекущая    = ?(ОкрИтог,Окр(СуммаСПТекущая,0),Окр(СуммаСПТекущая,2));
					СуммаНРТекущая    = СуммаНРТекущая * ?(НаборКоэф.КоэффОснЗарплаты = 0,1,НаборКоэф.КоэффОснЗарплаты);
					СуммаНРТекущая    = ?(ОкрИтог,Окр(СуммаНРТекущая,0),Окр(СуммаНРТекущая,2));
					
					Если ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер <> 0 Тогда
						ТекСтрока.ТекПрямЗатраты    = ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер  + СуммаСПТекущая + СуммаНРТекущая;
					иначе
						 ТекСтрока.ТекПрямЗатраты    = ТекСтрока.ТекПрямЗатраты;
					КонецЕсли;	
					
				ИначеЕсли СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.КПолнойСтоимости ИЛИ
					(СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат И НаборКоэф.КоэффПолнСтоимРабот <> 0) Тогда
					
					ТекКоэффициент = НаборКоэф.КоэффПолнСтоимРабот;
					Если НаборКоэф.КоэффПолнСтоимРабот = 0 Тогда
						ТекКоэффициент = 1;	
					КонецЕсли;
					ТекСтрока.ТекОснЗарплата    = ТекСтрока.ТекОснЗарплата * ТекКоэффициент;
					ТекСтрока.ТекЭксплМашин     = ТекСтрока.ТекЭксплМашин * ТекКоэффициент;
					ТекСтрока.ТекЗарплМашин     = ТекСтрока.ТекЗарплМашин * ТекКоэффициент;
					ТекСтрока.ТекСтоимМатер     = ТекСтрока.ТекСтоимМатер * ТекКоэффициент;
					ТекСтрока.ТекОборуд         = ТекСтрока.ТекОборуд * ТекКоэффициент;
					ТекСтрока.ТекВозвратМатер   = ТекСтрока.ТекВозвратМатер * ТекКоэффициент;  					
					
					СуммаСПТекущая    = СуммаСПТекущая * ТекКоэффициент; 
					СуммаНРТекущая    = СуммаНРТекущая * ТекКоэффициент; 
					Если ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер <> 0 Тогда
						ТекСтрока.ТекПрямЗатраты    = ТекСтрока.ТекОснЗарплата + ТекСтрока.ТекЭксплМашин + ТекСтрока.ТекСтоимМатер; 
					Иначе
						ТекСтрока.ТекПрямЗатраты    = ТекСтрока.ТекПрямЗатраты * ТекКоэффициент;
					КонецЕсли;
					ТекСтрока.ТекПрямЗатраты = ТекСтрока.ТекПрямЗатраты + СуммаСПТекущая + СуммаНРТекущая ;
					
				КонецЕсли;
			КонецЕсли;
			Если ОкрИтог Тогда
				ТекСтрока.ОснЗарплата 	= Окр(ТекСтрока.ОснЗарплата,0);		
				ТекСтрока.ЭксплМашин 	= Окр(ТекСтрока.ЭксплМашин,0);		
				ТекСтрока.ЗарплМашин 	= Окр(ТекСтрока.ЗарплМашин,0);		
				ТекСтрока.СтоимМатер 	= Окр(ТекСтрока.СтоимМатер,0);		
				ТекСтрока.Оборуд 		= Окр(ТекСтрока.Оборуд,0);		
				ТекСтрока.ПрямЗатраты 	= Окр(ТекСтрока.ПрямЗатраты,0);
				
				ТекСтрока.ТекОснЗарплата 	= Окр(ТекСтрока.ТекОснЗарплата,0);		
				ТекСтрока.ТекЭксплМашин 	= Окр(ТекСтрока.ТекЭксплМашин,0);		
				ТекСтрока.ТекЗарплМашин 	= Окр(ТекСтрока.ТекЗарплМашин,0);		
				ТекСтрока.ТекСтоимМатер 	= Окр(ТекСтрока.ТекСтоимМатер,0);		
				ТекСтрока.ТекОборуд 		= Окр(ТекСтрока.ТекОборуд,0);		
				ТекСтрока.ТекПрямЗатраты 	= Окр(ТекСтрока.ТекПрямЗатраты,0);
			КонецЕсли;
			
		КонецЕсли;
		
		// Округление. 		
		Если ТекСтрока.ТекОборуд <> 0 Тогда
			ТекСтрока.ТекПрямЗатраты = ТекСтрока.ТекПрямЗатраты + ТекСтрока.ТекОборуд;
		КонецЕсли;
		
		Если ТекСтрока.Оборуд <> 0 Тогда
			ТекСтрока.ПрямЗатраты = ТекСтрока.ПрямЗатраты + ТекСтрока.Оборуд;
		КонецЕсли;      		
		
	КонецЦикла;
	
	ТаблПозиции.Свернуть("Смета,Раздел,Итог","ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,СуммаСПБазисная,СуммаНРБазисная,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер,СуммаСПТекущая,СуммаНРТекущая");
	Отбор = Новый Структура("Смета",Ссылка);
	СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_ИтогиПоВидамРабот",Отбор,ТаблПозиции);
	
КонецПроцедуры

#КонецОбласти

#Область РасчетЛимЗатрат

// Общая процедура вызова расчета лимитированных затрат из модулей менеджеров документов.
//
// Параметры:
//     Ссылка - ДокументСсылка - ссылка на смету любого уровня или акт выполненных работ.
//
Процедура РассчитатьЛимитированныеЗатраты(Ссылка) Экспорт
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		ОкрИтог = Ссылка.ПроводитьОкругление;
		Если ОкрИтог Тогда
			КолЗнаков = Ссылка.ФорматОкругления;
		Иначе
			КолЗнаков = 2;
		КонецЕсли;
	Иначе
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
			ЛокСмета = Ссылка.ЛокальнаяСмета;
		Иначе
			ЛокСмета = Ссылка;
		КонецЕсли;
		ОкрИтог = ЛокСмета.ОкруглятьДоРублей;
		Если ОкрИтог Тогда
			КолЗнаков = 0;
		Иначе
			КолЗнаков = 2;
		КонецЕсли;
	КонецЕсли;

	// 1. Создаем  таблицу значений, по набору записей регистра "СМ_ИтогиПоВидамРабот".
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда                 
		ИтогиПоВР = СобратьИтогиПоВидамРаботСС(Ссылка);
	Иначе	
		ИтогиПоВР = СобратьИтогиПоВидамРабот(Ссылка);
	КонецЕсли;
	
	// 2. Создаем пустую таблицу значений, по набору записей регистра "СМ_ИтогиПоГлавам".
	ИтогиПоГлавам = СобратьИтогиПоГлавам(Ссылка);

	// 3. Создаем список видов затрат.
	СписокВидыЗатрат = Новый Массив;
	СписокВидыЗатрат.Добавить(Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы);
	СписокВидыЗатрат.Добавить(Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы);
	СписокВидыЗатрат.Добавить(Перечисления.СМ_ВидыЗатратСмета.Оборудование);
	СписокВидыЗатрат.Добавить(Перечисления.СМ_ВидыЗатратСмета.ПрочиеРаботы);
	УкрупнениеИтоговПоВидамРабот(ИтогиПоВР,Ссылка);
	
	// Заполнение таблицы итогов по главам парами значений ИтогПоГлавам / ВидЗатрат.
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		ФормированиеТаблицыИтогиПоГлавамОС(ИтогиПоГлавам, ИтогиПоВР,Ссылка,СписокВидыЗатрат);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		ФормированиеТаблицыИтогиПоГлавамСС(ИтогиПоГлавам, ИтогиПоВР,Ссылка,СписокВидыЗатрат);
	Иначе
		ФормированиеТаблицыИтогиПоГлавам(ИтогиПоГлавам, ИтогиПоВР,Ссылка,СписокВидыЗатрат);
	КонецЕсли;
	
	РасчетЛимЗатраты(ИтогиПоГлавам, ИтогиПоВР,Ссылка,КолЗнаков);
	
	// Удаление пустых строк.
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ПрямЗатраты",0);
	СтруктураОтбора.Вставить("ОснЗарплата",0);
	СтруктураОтбора.Вставить("ЭксплМашин",0);
	СтруктураОтбора.Вставить("ЗарплМашин",0);
	СтруктураОтбора.Вставить("СтоимМатер",0);
	СтруктураОтбора.Вставить("Оборуд",0);
	СтруктураОтбора.Вставить("ВозвратМатер",0);
	СтруктураОтбора.Вставить("ТекПрямЗатраты",0);
	СтруктураОтбора.Вставить("ТекОснЗарплата",0);
	СтруктураОтбора.Вставить("ТекЭксплМашин",0);
	СтруктураОтбора.Вставить("ТекЗарплМашин",0);
	СтруктураОтбора.Вставить("ТекСтоимМатер",0);
	СтруктураОтбора.Вставить("ТекОборуд",0);
	СтруктураОтбора.Вставить("ТекВозвратМатер",0);
	СтруктураОтбора.Вставить("ЗатратыТрудаРабочих",0);
	СтруктураОтбора.Вставить("ЗатратыТрудаМашин",0);
		
	МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
	Для Каждого ТекСтр Из МассивСтрок Цикл
		ИтогиПоГлавам.Удалить(ТекСтр);
	КонецЦикла;	
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		Если Ссылка.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
			Для Каждого ТекСтр Из ИтогиПоГлавам Цикл
				ГлаваКапРемонта = НайтиСоответствиеГлавыСметы(ТекСтр.Глава);
				Если Не ГлаваКапРемонта = Неопределено Тогда
					ТекСтр.Глава = ГлаваКапРемонта;
				Иначе
					ИтогиПоГлавам.Удалить(ТекСтр);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Запись итоговых значений в регистр сведений "Итоги по главам".
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда 
		Отбор = Новый Структура("Смета",Ссылка);
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_ИтогиПоГлавамОС",Отбор,ИтогиПоГлавам);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		Отбор = Новый Структура("Смета",Ссылка);
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_ИтогиПоГлавамСС",Отбор,ИтогиПоГлавам);
	Иначе
		Отбор = Новый Структура("Смета",Ссылка);
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_ИтогиПоГлавам",Отбор,ИтогиПоГлавам);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область РасчетСреднихСтоимостейУСП

// Общая процедура заполнения регистров для целей блока УСП.
//
// Параметры:
//     Объект 						- ДокументОбъект.СМ_ПозицияЛокальнойСметы - объект позиции.
//     СтруктураДанныхРасчета 		- Структура - содержит таблицы данных для расчета (см. менеджер СМ_ПозицияЛокальнойСметы).
//     Смета 						- ДокументСсылка.СМ_ЛокальнаяСмета - ссылка на локальную смету.  
//     Акт 							- ДокументСсылка.СМ_АктыВыполненныхРабот - ссылка на акт выполненных работ.
//     СтруктураПараметровОтбораРС 	- Структура - содержит поля с дополнительным отбором результирующего регистра сведений.
//     ИспользоватьРС 				- Булево - если Ложь, то все считается без чтения и записи из РС.
//
Процедура ОтразитьСтоимостьПозицииВРегистреУСП(Объект, СтруктураДанныхРасчета, Смета, Акт = Неопределено, СтруктураПараметровОтбораРС = Неопределено, ИспользоватьРС = Истина) Экспорт
	
	РасчетАкта = Акт <> Неопределено;
	
	Если СтруктураПараметровОтбораРС = Неопределено Тогда
		СтруктураПараметровОтбораРС = СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(Объект, , "СМ_ПозицияЛокальнойСметы");
	КонецЕсли;
	// Параметры округления.
	КолЗнаков = 2;
	Если  СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета.ОкруглятьДоРублей = истина Тогда
		КолЗнаков = 0;		
	КонецЕсли;
	//
	ЗапросСтоимости = Новый Запрос;
	ЗапросСтоимости.УстановитьПараметр("Смета", СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	ЗапросСтоимости.УстановитьПараметр("Раздел", СтруктураПараметровОтбораРС.СсылкаНаРаздел);
	ЗапросСтоимости.УстановитьПараметр("Позиция", СтруктураПараметровОтбораРС.СсылкаНаПозицию);
	
	Индексы = Новый Структура();
	Индексы.Вставить("ОЗ", 1);
	Индексы.Вставить("ЭМ", 1);
	Индексы.Вставить("ЗМ", 1);
	Индексы.Вставить("СМ", 1);
	Индексы.Вставить("ОБ", 1);
	Индексы.Вставить("ПЗ", 1);
	
	Если Смета.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.Ресурсный Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Смета,
		|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Раздел,
		|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Позиция,
		|	ВЫБОР
		|		КОГДА СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимПрямЗатраты = 0
		|				И СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимОборуд <> 0
		|			ТОГДА ЕстьNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимОборуд,0)
		|		ИНАЧЕ ЕстьNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимПрямЗатраты,0)
		|	КОНЕЦ КАК ПрямыеЗатраты,
		|	ЕстьNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимОснЗарплата,0) КАК ОсновнаяЗарплата,
		|	ЕстьNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимЭксплМашин,0) КАК ЭксплуатацияМашин,
		|	ЕстьNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимЗарплМашин,0) КАК ЗарплатаМашинистов,
		|	ЕстьNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимСтоимМатер,0) КАК СтоимостьМатериалов,
		|	ЕстьNULL(СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.ТекСтоимВозвратМатер,0) КАК ВозвратМатериалов
		|ИЗ
		|	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками
		|ГДЕ
		|	СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Смета = &Смета
		|	И СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Раздел = &Раздел
		|	И СМ_БазиснаяЕдиничнаяСтоимостьПозицииСПоправками.Позиция = &Позиция";
		
	ИначеЕсли Смета.МетодРасчета = Перечисления.СМ_МетодыРасчетаЛС.БазисноИндексный Тогда
		Если Смета.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Расценка Тогда
			ТекстЗапроса = "ВЫБРАТЬ
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция,
			|	ВЫБОР
			|		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимПрямЗатраты = 0
			|				И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд <> 0
			|			ТОГДА ЕстьNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд,0)
			|		ИНАЧЕ ЕстьNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимПрямЗатраты,0)
			|	КОНЕЦ КАК ПрямыеЗатраты,
			|	ЕстьNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата,0) КАК ОсновнаяЗарплата,
			|	ЕстьNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин,0) КАК ЭксплуатацияМашин,
			|	ЕстьNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин,0) КАК ЗарплатаМашинистов,
			|	ЕстьNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер,0) КАК СтоимостьМатериалов,
			|	ЕстьNULL(СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер,0) КАК ВозвратМатериалов
			|ИЗ
			|	РегистрСведений.СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета КАК СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
			|ГДЕ
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета
			|	И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = &Раздел
			|	И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = &Позиция";
			// Сохраним индексы на всякий случай.
			Для Каждого ЗаписьИндексы Из Объект.КоэффициентыПересчета Цикл
				Индексы.ОЗ = Индексы.ОЗ*ЗаписьИндексы.КоэффОснЗарплаты; 
				Индексы.ЭМ = Индексы.ЭМ*ЗаписьИндексы.КоэффСтоимЭксплМашин;
				Индексы.ЗМ = Индексы.ЗМ*ЗаписьИндексы.КоэффСтоимЗарплатеМашин;
				Индексы.СМ = Индексы.СМ*ЗаписьИндексы.КоэффСтоимМатериалов;
				Индексы.ПЗ = Индексы.ПЗ*ЗаписьИндексы.КоэффПолнСтоимРабот;
				Индексы.ОБ = Индексы.ОБ*ЗаписьИндексы.КоэффОборуд;
			КонецЦикла;
		ИначеЕсли Смета.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Раздел Тогда
			// БИ метод расчета, уровень раздел по элементам затрат.
			ПоЭлементам = (Смета.СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат);
			
			КоэффРаздела = Новый ТаблицаЗначений;
			ОписаниеЧисла = Новый ОписаниеТипов("Число");
			КоэффРаздела.Колонки.Добавить("КоэффОснЗарплаты",ОписаниеЧисла);
			КоэффРаздела.Колонки.Добавить("КоэффПЗ",ОписаниеЧисла);
			КоэффРаздела.Колонки.Добавить("КоэффСтоимЗарплатеМашин",ОписаниеЧисла);
			КоэффРаздела.Колонки.Добавить("КоэффСтоимМатериалов",ОписаниеЧисла);
			КоэффРаздела.Колонки.Добавить("КоэффСтоимЭксплМашин",ОписаниеЧисла);
			КоэффРаздела.Колонки.Добавить("КоэффОборуд",ОписаниеЧисла);
			КоэффРаздела.Колонки.Добавить("КоэффПолнСтоимРабот",ОписаниеЧисла);
			КоэффРаздела.Колонки.Добавить("Смета", Новый ОписаниеТипов(?(РасчетАкта,"ДокументСсылка.СМ_АктВыполненныхРабот","ДокументСсылка.СМ_ЛокальнаяСмета")));
			КоэффРаздела.Колонки.Добавить("Раздел", Новый ОписаниеТипов("ДокументСсылка.СМ_РазделЛокальнойСметы"));
			КоэффРаздела.Колонки.Добавить("Позиция", Новый ОписаниеТипов("ДокументСсылка.СМ_ПозицияЛокальнойСметы"));
			СтрокаКоэффРаздела = КоэффРаздела.Добавить();
			КоэффРаздела.ЗаполнитьЗначения(1);
			СтрокаКоэффРаздела.Смета = СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета;    
			СтрокаКоэффРаздела.Раздел = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
			СтрокаКоэффРаздела.Позиция = СтруктураПараметровОтбораРС.СсылкаНаПозицию;
			Раздел = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
			Пока ЗначениеЗаполнено(Раздел) И Раздел <> Смета Цикл
				Если РасчетАкта Тогда
					СтрокаРаздела = СМ_СметаВызовСервера.СтрокаРазделаАкта(СтруктураПараметровОтбораРС.СсылкаНаАкт, СтруктураПараметровОтбораРС.СсылкаНаРаздел);
					СтрокаКоэффРаздела.КоэффОснЗарплаты =			СтрокаКоэффРаздела.КоэффОснЗарплаты * ?(СтрокаРаздела.КоэффОснЗарплаты=0,1,СтрокаРаздела.КоэффОснЗарплаты);
					СтрокаКоэффРаздела.КоэффПолнСтоимРабот = 		СтрокаКоэффРаздела.КоэффПолнСтоимРабот * ?(СтрокаРаздела.КоэффПолнСтоимРабот=0,1,СтрокаРаздела.КоэффПолнСтоимРабот);		
					СтрокаКоэффРаздела.КоэффСтоимЗарплатеМашин = 	СтрокаКоэффРаздела.КоэффСтоимЗарплатеМашин * ?(СтрокаРаздела.КоэффСтоимЗарплатеМашин=0,1,СтрокаРаздела.КоэффСтоимЗарплатеМашин);	
					СтрокаКоэффРаздела.КоэффСтоимМатериалов = 		СтрокаКоэффРаздела.КоэффСтоимМатериалов * ?(СтрокаРаздела.КоэффСтоимМатериалов=0,1,СтрокаРаздела.КоэффСтоимМатериалов);		
					СтрокаКоэффРаздела.КоэффСтоимЭксплМашин = 		СтрокаКоэффРаздела.КоэффСтоимЭксплМашин * ?(СтрокаРаздела.КоэффСтоимЭксплМашин=0,1,СтрокаРаздела.КоэффСтоимЭксплМашин);		
					СтрокаКоэффРаздела.КоэффОборуд = 				СтрокаКоэффРаздела.КоэффОборуд * ?(СтрокаРаздела.КоэффОборуд=0,1,СтрокаРаздела.КоэффОборуд);				
				Иначе					
					СтрокаКоэффРаздела.КоэффОснЗарплаты = 			?(ПоЭлементам, СтрокаКоэффРаздела.КоэффОснЗарплаты * ?(Раздел.КоэффОснЗарплаты=0,1,Раздел.КоэффОснЗарплаты), 						
																	СтрокаКоэффРаздела.КоэффОснЗарплаты * ?(Раздел.КоэффПолнСтоимРабот=0,1,Раздел.КоэффПолнСтоимРабот));
					СтрокаКоэффРаздела.КоэффПолнСтоимРабот = 		?(ПоЭлементам, СтрокаКоэффРаздела.КоэффПолнСтоимРабот * ?(Раздел.КоэффПолнСтоимРабот=0,1,Раздел.КоэффПолнСтоимРабот),
																	СтрокаКоэффРаздела.КоэффПолнСтоимРабот * ?(Раздел.КоэффПолнСтоимРабот=0,1,Раздел.КоэффПолнСтоимРабот));
					СтрокаКоэффРаздела.КоэффСтоимЗарплатеМашин = 	?(ПоЭлементам, СтрокаКоэффРаздела.КоэффСтоимЗарплатеМашин * ?(Раздел.КоэффСтоимЗарплатеМашин=0,1,Раздел.КоэффСтоимЗарплатеМашин),
																	СтрокаКоэффРаздела.КоэффСтоимЗарплатеМашин * ?(Раздел.КоэффПолнСтоимРабот=0,1,Раздел.КоэффПолнСтоимРабот));
					СтрокаКоэффРаздела.КоэффСтоимМатериалов = 		?(ПоЭлементам, СтрокаКоэффРаздела.КоэффСтоимМатериалов * ?(Раздел.КоэффСтоимМатериалов=0,1,Раздел.КоэффСтоимМатериалов),
																	СтрокаКоэффРаздела.КоэффСтоимМатериалов * ?(Раздел.КоэффПолнСтоимРабот=0,1,Раздел.КоэффПолнСтоимРабот));
					СтрокаКоэффРаздела.КоэффСтоимЭксплМашин = 		?(ПоЭлементам, СтрокаКоэффРаздела.КоэффСтоимЭксплМашин * ?(Раздел.КоэффСтоимЭксплМашин=0,1,Раздел.КоэффСтоимЭксплМашин),
																	СтрокаКоэффРаздела.КоэффСтоимЭксплМашин * ?(Раздел.КоэффПолнСтоимРабот=0,1,Раздел.КоэффПолнСтоимРабот));
					СтрокаКоэффРаздела.КоэффОборуд = 				?(ПоЭлементам, СтрокаКоэффРаздела.КоэффОборуд * ?(Раздел.КоэффОборуд=0,1,Раздел.КоэффОборуд),
																	СтрокаКоэффРаздела.КоэффОборуд * ?(Раздел.КоэффПолнСтоимРабот=0,1,Раздел.КоэффПолнСтоимРабот));
				КонецЕсли;
				Раздел = Раздел.ИДРодителя;
			КонецЦикла;
			Если КоэффРаздела.Количество() > 0 Тогда
				// Сохраним индексы на всякий случай.
				СтрокаКоэффРаздела = КоэффРаздела[0];
			    Индексы.ОЗ = СтрокаКоэффРаздела.КоэффОснЗарплаты; 
				Индексы.ЭМ = СтрокаКоэффРаздела.КоэффСтоимЭксплМашин;
				Индексы.ЗМ = СтрокаКоэффРаздела.КоэффСтоимЗарплатеМашин;
				Индексы.СМ = СтрокаКоэффРаздела.КоэффСтоимМатериалов;
				Индексы.ПЗ = СтрокаКоэффРаздела.КоэффПолнСтоимРабот;
				Индексы.ОБ = СтрокаКоэффРаздела.КоэффОборуд;
			КонецЕсли;

			
			ЗапросСтоимости.УстановитьПараметр("КоэффРаздела",КоэффРаздела);
			ТекстЗапроса = "ВЫБРАТЬ
			|	КоэффРаздела.КоэффОснЗарплаты,
			|	КоэффРаздела.КоэффПолнСтоимРабот,
			|	КоэффРаздела.КоэффСтоимЗарплатеМашин,
			|	КоэффРаздела.КоэффСтоимМатериалов,
			|	КоэффРаздела.КоэффСтоимЭксплМашин,
			|	КоэффРаздела.КоэффОборуд,
			|	КоэффРаздела.Смета,
			|	КоэффРаздела.Позиция,
			|	КоэффРаздела.Раздел
			|ПОМЕСТИТЬ Коэфф
			|ИЗ
			|	&КоэффРаздела КАК КоэффРаздела
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата * Коэфф.КоэффОснЗарплаты КАК ОсновнаяЗарплата,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин * Коэфф.КоэффСтоимЭксплМашин КАК ЭксплуатацияМашин,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин * Коэфф.КоэффСтоимЗарплатеМашин КАК ЗарплатаМашинистов,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер * Коэфф.КоэффСтоимМатериалов КАК СтоимостьМатериалов,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер КАК ВозвратМатериалов,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата * Коэфф.КоэффОснЗарплаты + СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин * Коэфф.КоэффСтоимЭксплМашин + СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер * Коэфф.КоэффСтоимМатериалов КАК ПрямыеЗатраты,
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд * Коэфф.КоэффОборуд КАК СтоимостьОборудования
			|ПОМЕСТИТЬ СуммыСКоэфф
			|ИЗ
			|	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Коэфф КАК Коэфф
			|		ПО СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = Коэфф.Смета
			|			И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = Коэфф.Позиция
			|			И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = Коэфф.Раздел
			|ГДЕ
			|	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета
			|	И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = &Позиция
			|	И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = &Раздел
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СуммыСКоэфф.Смета,
			|	СуммыСКоэфф.Раздел,
			|	СуммыСКоэфф.Позиция,
			|	ВЫБОР
			|		КОГДА СуммыСКоэфф.ПрямыеЗатраты = 0
			|				И СуммыСКоэфф.СтоимостьОборудования <> 0
			|			ТОГДА СуммыСКоэфф.СтоимостьОборудования
			|		ИНАЧЕ СуммыСКоэфф.ПрямыеЗатраты
			|	КОНЕЦ КАК ПрямыеЗатраты,
			|	СуммыСКоэфф.ОсновнаяЗарплата,
			|	СуммыСКоэфф.ЭксплуатацияМашин,
			|	СуммыСКоэфф.ЗарплатаМашинистов,
			|	СуммыСКоэфф.СтоимостьМатериалов,
			|	СуммыСКоэфф.ВозвратМатериалов
			|ИЗ
			|	СуммыСКоэфф КАК СуммыСКоэфф";
				
		ИначеЕсли Смета.Уровень = Перечисления.СМ_УровеньЗаданияИндексов.Смета Тогда
			// БИ метод расчета, уровень смета по элементам затрат.
			Если Смета.СпособРасчетаИндексов = Перечисления.СМ_СпособыРасчетаИндексов.ПоЭлементамЗатрат Тогда
				ТекстЗапроса  = "ВЫБРАТЬ
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата * ВЫБОР
                |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффФОТ = 0
                |			ТОГДА 1
                |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффФОТ
                |	КОНЕЦ КАК ОсновнаяЗарплата,
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин * ВЫБОР
                |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффСтоимЭксплМашин = 0
                |			ТОГДА 1
                |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффСтоимЭксплМашин
                |	КОНЕЦ КАК ЭксплуатацияМашин,
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин * ВЫБОР
                |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффФОТ = 0
                |			ТОГДА 1
                |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффФОТ
                |	КОНЕЦ КАК ЗарплатаМашинистов,
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер * ВЫБОР
                |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффСтоимМатериалов = 0
                |			ТОГДА 1
                |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффСтоимМатериалов
                |	КОНЕЦ КАК СтоимостьМатериалов,
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер КАК ВозвратМатериалов,
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета,
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел,
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция,
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд * ВЫБОР
                |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффОборуд = 0
                |			ТОГДА 1
                |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффОборуд
                |	КОНЕЦ КАК СтоимостьОборудования
                |ПОМЕСТИТЬ СуммыСКоэфф
                |ИЗ
                |	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
                |ГДЕ
                |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета
                |	И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = &Позиция
                |	И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = &Раздел
                |;
                |
                |////////////////////////////////////////////////////////////////////////////////
                |ВЫБРАТЬ
                |	СуммыСКоэфф.Смета,
                |	СуммыСКоэфф.Раздел,
                |	СуммыСКоэфф.Позиция,
                |	СуммыСКоэфф.ОсновнаяЗарплата,
                |	СуммыСКоэфф.ЭксплуатацияМашин,
                |	СуммыСКоэфф.ЗарплатаМашинистов,
                |	СуммыСКоэфф.СтоимостьМатериалов,
                |	СуммыСКоэфф.ВозвратМатериалов,
                |	ВЫБОР
                |		КОГДА СуммыСКоэфф.ОсновнаяЗарплата + СуммыСКоэфф.ЭксплуатацияМашин + СуммыСКоэфф.СтоимостьМатериалов = 0
                |			ТОГДА СуммыСКоэфф.СтоимостьОборудования
                |		ИНАЧЕ СуммыСКоэфф.ОсновнаяЗарплата + СуммыСКоэфф.ЭксплуатацияМашин + СуммыСКоэфф.СтоимостьМатериалов
                |	КОНЕЦ КАК ПрямыеЗатраты
                |ИЗ
                |	СуммыСКоэфф КАК СуммыСКоэфф";
				
				// Сохраним индексы на всякий случай.
				Если РасчетАкта Тогда
					Индексы.ОЗ = Акт.КоэффФОТ; 
					Индексы.ЭМ = Акт.КоэффСтоимЭксплМашин;
					Индексы.ЗМ = Акт.КоэффФОТ;
					Индексы.СМ = Акт.КоэффСтоимМатериалов;
					Индексы.ПЗ = Акт.КоэффПолнСтоимРабот;
					Индексы.ОБ = Акт.КоэффОборуд;
				Иначе
					Индексы.ОЗ = Смета.КоэффФОТ; 
					Индексы.ЭМ = Смета.КоэффСтоимЭксплМашин;
					Индексы.ЗМ = Смета.КоэффФОТ;
					Индексы.СМ = Смета.КоэффСтоимМатериалов;
					Индексы.ПЗ = Смета.КоэффПолнСтоимРабот;
					Индексы.ОБ = Смета.КоэффОборуд;
			    КонецЕсли;

			// БИ метод расчета, уровень смета к полной стоимости.
			Иначе
				ТекстЗапроса  = "ВЫБРАТЬ
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОснЗарплата * ВЫБОР
	            |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот = 0
	            |			ТОГДА 1
	            |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот
	            |	КОНЕЦ КАК ОсновнаяЗарплата,
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЭксплМашин * ВЫБОР
	            |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот = 0
	            |			ТОГДА 1
	            |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот
	            |	КОНЕЦ КАК ЭксплуатацияМашин,
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимЗарплМашин * ВЫБОР
	            |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот = 0
	            |			ТОГДА 1
	            |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот
	            |	КОНЕЦ КАК ЗарплатаМашинистов,
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимСтоимМатер * ВЫБОР
	            |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот = 0
	            |			ТОГДА 1
	            |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот
	            |	КОНЕЦ КАК СтоимостьМатериалов,
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимВозвратМатер КАК ВозвратМатериалов,
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета,
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел,
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция,
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.СтоимОборуд * ВЫБОР
	            |		КОГДА СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот = 0
	            |			ТОГДА 1
	            |		ИНАЧЕ СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета.КоэффПолнСтоимРабот
	            |	КОНЕЦ КАК СтоимостьОборудования
	            |ПОМЕСТИТЬ СуммыСКоэфф
	            |ИЗ
	            |	РегистрСведений.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП КАК СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета
	            |ГДЕ
	            |	СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Смета = &Смета
	            |	И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Позиция = &Позиция
	            |	И СМ_БазисноИндекснаяСтоимостьПозицииСКоэффициентамиПересчета.Раздел = &Раздел
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	СуммыСКоэфф.Смета,
	            |	СуммыСКоэфф.Раздел,
	            |	СуммыСКоэфф.Позиция,
	            |	СуммыСКоэфф.ОсновнаяЗарплата,
	            |	СуммыСКоэфф.ЭксплуатацияМашин,
	            |	СуммыСКоэфф.ЗарплатаМашинистов,
	            |	СуммыСКоэфф.СтоимостьМатериалов,
	            |	СуммыСКоэфф.ВозвратМатериалов,
	            |	ВЫБОР
	            |		КОГДА СуммыСКоэфф.ОсновнаяЗарплата + СуммыСКоэфф.ЭксплуатацияМашин + СуммыСКоэфф.СтоимостьМатериалов = 0
	            |			ТОГДА СуммыСКоэфф.СтоимостьОборудования
	            |		ИНАЧЕ СуммыСКоэфф.ОсновнаяЗарплата + СуммыСКоэфф.ЭксплуатацияМашин + СуммыСКоэфф.СтоимостьМатериалов
	            |	КОНЕЦ КАК ПрямыеЗатраты
	            |ИЗ
	            |	СуммыСКоэфф КАК СуммыСКоэфф";
				
				// Сохраним индексы на всякий случай.
				Если РасчетАкта Тогда
					Индексы.ОЗ = Акт.КоэффПолнСтоимРабот; 
					Индексы.ЭМ = Акт.КоэффПолнСтоимРабот;
					Индексы.ЗМ = Акт.КоэффПолнСтоимРабот;
					Индексы.СМ = Акт.КоэффПолнСтоимРабот;
					Индексы.ПЗ = Акт.КоэффПолнСтоимРабот;
					Индексы.ОБ = Акт.КоэффПолнСтоимРабот;
				Иначе
					Индексы.ОЗ = Смета.КоэффПолнСтоимРабот; 
					Индексы.ЭМ = Смета.КоэффПолнСтоимРабот;
					Индексы.ЗМ = Смета.КоэффПолнСтоимРабот;
					Индексы.СМ = Смета.КоэффПолнСтоимРабот;
					Индексы.ПЗ = Смета.КоэффПолнСтоимРабот;
					Индексы.ОБ = Смета.КоэффПолнСтоимРабот;
			    КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ТекстЗапроса = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно записать среднюю стоимость позиции'"));
		Возврат;
	КонецЕсли;
	
	ЗапросСтоимости.Текст = ТекстЗапроса;
	Выборка = ЗапросСтоимости.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		СтрокаНабора = Новый Структура();
		СтрокаНабора.Вставить("Позиция",СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		СтрокаНабора.Вставить("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);
		СтрокаНабора.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		СтрокаНабора.Вставить("ОбъемРабот",Объект.ОбъемРабот);
		СтрокаНабора.Вставить("ПрямыеЗатраты",		Окр(Объект.ОбъемРабот*	Выборка.ПрямыеЗатраты,КолЗнаков));
		СтрокаНабора.Вставить("ОсновнаяЗарплата",	Окр(Объект.ОбъемРабот*	Выборка.ОсновнаяЗарплата,КолЗнаков));
		СтрокаНабора.Вставить("ЭксплуатацияМашин",	Окр(Объект.ОбъемРабот*	Выборка.ЭксплуатацияМашин,КолЗнаков));
		СтрокаНабора.Вставить("ЗарплатаМашинистов",	Окр(Объект.ОбъемРабот*	Выборка.ЗарплатаМашинистов,КолЗнаков));
		СтрокаНабора.Вставить("СтоимостьМатериалов",Окр(Объект.ОбъемРабот*	Выборка.СтоимостьМатериалов,КолЗнаков));
		СтрокаНабора.Вставить("ВозвратМатериалов",	Окр(Объект.ОбъемРабот*	Выборка.ВозвратМатериалов,КолЗнаков));
		СтрокаНабора.Вставить("НакладныеРасходы",0);
		СтрокаНабора.Вставить("СметнаяПрибыль",0);
		СтрокаНабора.Вставить("Стоимость",0);
		СтрокаНабора.Вставить("ЕдиницаИзмерения",0);

		ЗапросНРиСП = Новый Запрос;
		ЗапросНРиСП.Текст = "ВЫБРАТЬ
							|	ВЫБОР
							|		КОГДА СМ_НРиСП.ТекСуммаНРНаОбъем + СМ_НРиСП.ТекСуммаСПНаОбъем = 0
							|			ТОГДА СМ_НРиСП.СуммаНРНаОбъем
							|		ИНАЧЕ СМ_НРиСП.ТекСуммаНРНаОбъем
							|	КОНЕЦ КАК НакладныеРасходы,
							|	ВЫБОР
							|		КОГДА СМ_НРиСП.ТекСуммаНРНаОбъем + СМ_НРиСП.ТекСуммаСПНаОбъем = 0
							|			ТОГДА СМ_НРиСП.СуммаСПНаОбъем
							|		ИНАЧЕ СМ_НРиСП.ТекСуммаСПНаОбъем
							|	КОНЕЦ КАК СметнаяПрибыль
							|ИЗ
							|	РегистрСведений.СМ_НРиСП КАК СМ_НРиСП
							|ГДЕ
							|	СМ_НРиСП.Смета = &Смета
							|	И СМ_НРиСП.Раздел = &Раздел
							|	И СМ_НРиСП.Позиция = &Позиция";
		ЗапросНРиСП.УстановитьПараметр("Смета", СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		ЗапросНРиСП.УстановитьПараметр("Раздел", СтруктураПараметровОтбораРС.СсылкаНаРаздел);
		ЗапросНРиСП.УстановитьПараметр("Позиция", СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		ВыборкаНРиСП = ЗапросНРиСП.Выполнить().Выбрать();
		Если ВыборкаНРиСП.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтрокаНабора, ВыборкаНРиСП);
		КонецЕсли;
		
		СтрокаНабора.ЕдиницаИзмерения = Объект.ЕдиницаИзмерения;
		СтрокаНабора.Стоимость = СтрокаНабора.НакладныеРасходы + СтрокаНабора.СметнаяПрибыль + СтрокаНабора.ПрямыеЗатраты;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Позиция",СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		Отбор.Вставить("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);
		Отбор.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_СредняяТекущаяСтоимостьПозиции",Отбор,СтрокаНабора);

	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Невозможно записать среднюю стоимость позиции'"));
		
	КонецЕсли;
	
	// Разберемся со стоимостью ресурсов.
	Если Не РасчетАкта Тогда
		ЗапросРесурсы 		= Новый Запрос;
		ЗапросРесурсы.Текст = "
		|ВЫБРАТЬ
		|	РесурсыПозицииЛокальнойСметы.Ресурс,
		|	РесурсыПозицииЛокальнойСметы.БазиснаяЦена,
		|	РесурсыПозицииЛокальнойСметы.БазиснаяЗарплатаМашинистов,
		|	РесурсыПозицииЛокальнойСметы.ТекущаяЦена,
		|	РесурсыПозицииЛокальнойСметы.ТекущаяЗарплатаМашинистов,
		|	РесурсыПозицииЛокальнойСметы.НаименованиеРесурса
		|ПОМЕСТИТЬ РесурсыПозиции
		|ИЗ
		|	&РесурсыПозицииЛокальнойСметы КАК РесурсыПозицииЛокальнойСметы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СМ_СтоимостьРесурсовПозиции.Смета,
		|	СМ_СтоимостьРесурсовПозиции.Раздел,
		|	СМ_СтоимостьРесурсовПозиции.Позиция,
		|	СМ_СтоимостьРесурсовПозиции.Ресурс,
		|	СМ_СтоимостьРесурсовПозиции.Количество,
		|	РесурсыПозиции.БазиснаяЦена КАК БазиснаяЦена,
		|	РесурсыПозиции.БазиснаяЗарплатаМашинистов КАК БазиснаяЗарплатаМашинистов,
		|	РесурсыПозиции.ТекущаяЦена КАК ТекущаяЦена,
		|	РесурсыПозиции.ТекущаяЗарплатаМашинистов КАК ЗарплатаМашинистов,
		|	СМ_СтоимостьРесурсовПозиции.Ресурс.ВидРесурса КАК ВидРесурса,
		|	СМ_СтоимостьРесурсовПозиции.Ресурс.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СМ_СтоимостьРесурсовПозиции.НаименованиеРесурса
		|ИЗ
		|	РегистрСведений.СМ_СтоимостьРесурсовПозиции КАК СМ_СтоимостьРесурсовПозиции
		// ************************************
		// ++ AV 
		//	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РесурсыПозиции КАК РесурсыПозиции
		//	|	ПО СМ_СтоимостьРесурсовПозиции.Ресурс = РесурсыПозиции.Ресурс
		//	|	 И СМ_СтоимостьРесурсовПозиции.НаименованиеРесурса = РесурсыПозиции.НаименованиеРесурса
		|	ЛЕВОЕ СОЕДИНЕНИЕ РесурсыПозиции КАК РесурсыПозиции
		|	ПО СМ_СтоимостьРесурсовПозиции.Ресурс = РесурсыПозиции.Ресурс И
		|	   СМ_СтоимостьРесурсовПозиции.Ресурс.Наименование = РесурсыПозиции.НаименованиеРесурса
		// -- AV 
		// ************************************
		|ГДЕ
		|	СМ_СтоимостьРесурсовПозиции.Смета = &Смета
		|	И СМ_СтоимостьРесурсовПозиции.Раздел = &Раздел
		|	И СМ_СтоимостьРесурсовПозиции.Позиция = &Позиция";
		
		ТаблицаРесурсов = Объект.РесурсыПозицииЛокальнойСметы.Выгрузить(,"НаименованиеРесурса,Ресурс,ВидРесурса,ЕдиницаИзмеренияРесурса,БазиснаяЦена,БазиснаяЗарплатаМашинистов,ТекущаяЦена,ТекущаяЗарплатаМашинистов");
		
		ЗапросРесурсы.УстановитьПараметр("Смета", СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
		ЗапросРесурсы.УстановитьПараметр("Раздел", СтруктураПараметровОтбораРС.СсылкаНаРаздел);
		ЗапросРесурсы.УстановитьПараметр("Позиция", СтруктураПараметровОтбораРС.СсылкаНаПозицию);
		ЗапросРесурсы.УстановитьПараметр("РесурсыПозицииЛокальнойСметы", ТаблицаРесурсов);
		ТаблицаРесурсовПозиции = ЗапросРесурсы.Выполнить().Выгрузить();
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Ресурс",Справочники.СМ_Ресурсы.ПустаяСсылка());
		ТаблицаПустыхРесурсов = ТаблицаРесурсов.Скопировать(СтруктураОтбора);
		
		Для Каждого СведенияОРесурсе Из ТаблицаРесурсовПозиции Цикл
			
			Если СведенияОРесурсе.Ресурс = Справочники.СМ_Ресурсы.ПустаяСсылка() Тогда
				Для Каждого ТекСтрокаРесурса Из ТаблицаПустыхРесурсов Цикл
					Если СтрЧислоВхождений(СведенияОРесурсе.НаименованиеРесурса,ТекСтрокаРесурса.НаименованиеРесурса) > 0 Тогда
						СведенияОРесурсе.БазиснаяЦена    			= ТекСтрокаРесурса.БазиснаяЦена;
						СведенияОРесурсе.БазиснаяЗарплатаМашинистов = ТекСтрокаРесурса.БазиснаяЗарплатаМашинистов;
						СведенияОРесурсе.ТекущаяЦена                = ТекСтрокаРесурса.ТекущаяЦена;
						СведенияОРесурсе.ЗарплатаМашинистов  		= ТекСтрокаРесурса.ТекущаяЗарплатаМашинистов;
						
						Если НЕ ЗначениеЗаполнено(СведенияОРесурсе.ВидРесурса) Тогда
							СведенияОРесурсе.ВидРесурса = ТекСтрокаРесурса.ВидРесурса;		
						КонецЕсли;
							
						Если НЕ ЗначениеЗаполнено(СведенияОРесурсе.ЕдиницаИзмерения) Тогда
							СведенияОРесурсе.ЕдиницаИзмерения = СМ_СметаВызовСервера.НайтиЕдиницуИзмеренияПоСтроке(ТекСтрокаРесурса.ЕдиницаИзмеренияРесурса);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Если СведенияОРесурсе.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				Индекс = Индексы.ЭМ;
			ИначеЕсли СведенияОРесурсе.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаРабочих Тогда
				Индекс = Индексы.ОЗ;
			ИначеЕсли СведенияОРесурсе.ВидРесурса = Перечисления.СМ_ВидыРесурсов.ЗатратыТрудаМашинистов Тогда
				Индекс = Индексы.ЗМ;
			Иначе
				Индекс = Индексы.СМ;
			КонецЕсли;
			
			Если ((СведенияОРесурсе.ТекущаяЦена=0)и(СведенияОРесурсе.БазиснаяЦена<>0)) Тогда
				СведенияОРесурсе.ТекущаяЦена = СведенияОРесурсе.БазиснаяЦена * ?(Индекс=0,1,Индекс);
			КонецЕсли;
			
			Если СведенияОРесурсе.ВидРесурса = Перечисления.СМ_ВидыРесурсов.МашиныИМеханизмы Тогда
				Если ((СведенияОРесурсе.ЗарплатаМашинистов=0)и(СведенияОРесурсе.БазиснаяЗарплатаМашинистов<>0)) Тогда
					СведенияОРесурсе.ЗарплатаМашинистов = СведенияОРесурсе.БазиснаяЗарплатаМашинистов * ?(Индексы.ЗМ=0,1,Индексы.ЗМ);
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;	
		
		ТаблицаРесурсовПозиции.Колонки.Удалить("ВидРесурса");
		ТаблицаРесурсовПозиции.Колонки.Удалить("БазиснаяЦена");
		ТаблицаРесурсовПозиции.Колонки.Удалить("БазиснаяЗарплатаМашинистов");
		
	Иначе
		
		МассивСтрокРесурсовПозицииАкта = СМ_СметаВызовСервера.МассивСтрокРесурсовПозицииАкта(СтруктураПараметровОтбораРС.СсылкаНаАкт, Объект);
		ТаблицаРесурсовПозиции = Новый ТаблицаЗначений;
		ТаблицаРесурсовПозиции.Колонки.Добавить("Смета");
		ТаблицаРесурсовПозиции.Колонки.Добавить("Раздел");
		ТаблицаРесурсовПозиции.Колонки.Добавить("Позиция");
		ТаблицаРесурсовПозиции.Колонки.Добавить("Ресурс");
		ТаблицаРесурсовПозиции.Колонки.Добавить("НаименованиеРесурса");
		ТаблицаРесурсовПозиции.Колонки.Добавить("Количество");
		ТаблицаРесурсовПозиции.Колонки.Добавить("ТекущаяЦена");
		ТаблицаРесурсовПозиции.Колонки.Добавить("ЗарплатаМашинистов");
		ТаблицаРесурсовПозиции.Колонки.Добавить("ЕдиницаИзмерения");
		Для Каждого СтрокаРесурса Из МассивСтрокРесурсовПозицииАкта Цикл
			НоваяСтрока = ТаблицаРесурсовПозиции.Добавить();
			НоваяСтрока.Смета = СтруктураПараметровОтбораРС.СсылкаНаАкт;
			НоваяСтрока.Раздел = СтруктураПараметровОтбораРС.СсылкаНаРаздел;
			НоваяСтрока.Позиция = СтруктураПараметровОтбораРС.СсылкаНаПозицию;
			НоваяСтрока.Ресурс = СтрокаРесурса.Ресурс;
			НоваяСтрока.НаименованиеРесурса = Строка(СтрокаРесурса.НомерСтроки)+" "+СтрокаРесурса.НаименованиеРесурса;
			НоваяСтрока.Количество = СтрокаРесурса.ФактРасходаОбъем;
			НоваяСтрока.ТекущаяЦена = СтрокаРесурса.ТекущаяЦена;
			НоваяСтрока.ЗарплатаМашинистов = СтрокаРесурса.ТекущаяЗарплатаМашинистов;
			НоваяСтрока.ЕдиницаИзмерения = СтрокаРесурса.Ресурс.ЕдиницаИзмерения
		КонецЦикла;
		
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Позиция",СтруктураПараметровОтбораРС.СсылкаНаПозицию);
	Отбор.Вставить("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);
	Отбор.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_СредняяТекущаяСтоимостьРесурсовПозиции",Отбор,ТаблицаРесурсовПозиции);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РасчетПозиции

// Процедура выполняет непосредственный расчет числовых параметров позиции локальной сметы и запись в регистр сведений.
//
Функция РасчетЧП(Позиция, СтруктураДанныхРасчета, ЛС, ТаблСПоправками, ТаблРасчета, РесурсныйРасчет, ПромОкр = Ложь, ОкрИтог = Ложь, ОбрабПогр = Неопределено, Акт = Неопределено, СтруктураПараметровОтбораРС = Неопределено, ИспользоватьРС = Ложь)
	
	УчитыватьДопЗМ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета", "УчитыватьДопЗМ", Ложь); // Значение по умолчанию (есди настройки не сохранялись).	
	
	Если СтруктураПараметровОтбораРС = Неопределено Тогда
		СтруктураПараметровОтбораРС = СМ_СметаВызовСервера.ПолучитьСтруктуруДанныхДляОтборовРегистра(Позиция, Акт, "СМ_ПозицияЛокальнойСметы");
	КонецЕсли;
	
	// 1. Итоги по разделу.
	НаборЗаписей = Справочники.СМ_ИтогиЧППоРазделу.Выбрать();
	Пока НаборЗаписей.Следующий() Цикл
		Если НЕ Позиция.Определитель.ВидРасценки = Перечисления.СМ_ВидыРасценки.Оборудование 
			И (НаборЗаписей.Ссылка.Идентификатор = "Оборуд"
			ИЛИ НаборЗаписей.Ссылка.Идентификатор = "СЗапЧастями"
		ИЛИ НаборЗаписей.Ссылка.Идентификатор = "ТранспРасхНаТонну"
			ИЛИ НаборЗаписей.Ссылка.Идентификатор = "ТараУпаковка"
			ИЛИ НаборЗаписей.Ссылка.Идентификатор = "СТаройУпаковкой"
			ИЛИ НаборЗаписей.Ссылка.Идентификатор = "ВсегоПоРазделуОборуд") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаРасчета 		= ТаблРасчета.Добавить();
		СтрокаРасчета.Итог 	= НаборЗаписей.Ссылка;
		Если НаборЗаписей.Накопительный Тогда
			ЗаполнитьЗначенияСвойств(СтрокаРасчета,ТаблСПоправками[0]);	
		КонецЕсли;
	КонецЦикла;
	
	// Добавка к зарплате машинистов с поправками и ЗУ.
	НачальноеДопЗМ = ТаблСПоправками[0].ДопЗМ; 
	НачальноеДопЗМТек = ТаблСПоправками[0].ДопЗМТек; 
	
	// 2. Числовые параметры. 
	// Применяются для значений параметров отличных от значений по умолчанию.
	// Сортировка по порядку расчета.
	ЧислПарамДляРасчета = Позиция.НачисленияПозиции.Выгрузить();
	ЧислПарамДляРасчета.Очистить();
	ЧислПарамДляРасчета.Колонки.Добавить("Порядок");
	Для Каждого СтрокаНачисления Из Позиция.НачисленияПозиции Цикл
		Если НЕ СтрокаНачисления.Значение = СтрокаНачисления.ЧисловойПараметр.СтандартноеЗначение Тогда
			СтрокаПарам = ЧислПарамДляРасчета.Добавить();	
			ЗаполнитьЗначенияСвойств(СтрокаПарам,СтрокаНачисления);
			СтрокаПарам.Порядок = СтрокаНачисления.ЧисловойПараметр.ПорядокРасчета;
		КонецЕсли
	КонецЦикла;
	ЧислПарамДляРасчета.Сортировать("Порядок");
	
	// 3. Расчет числовых параметров.
	// Соответсвие поля числового параметра "Источник.ОтЧего" с элементом справочника "СМ_ИтогиЧППоРазделу".
	Для Каждого СтрокаЧислПарам Из ЧислПарамДляРасчета Цикл
	  	
		ОтИтога 		= ТаблРасчета.Найти(СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ОтЧего);
		ФлагИсточника 	= СтрокаЧислПарам.ЧисловойПараметр.Источник[0];
		
		// Для базисно-индексного метода.
		ДобПарамПЗ 	= 0;
		ДобПарамОЗ 	= 0;
		ДобПарамЭМ 	= 0;
		ДобПарамЗМ 	= 0;
		ДобПарамСМ 	= 0;
		ДобПарамОБ	= 0;
		ДобПарамТР 	= 0;
		ДобПарамТМ 	= 0;
		ДобПарамБР 	= 0;
		ДобДопЗМ	= 0;
		ТекДобДопЗМ	= 0;
		
		// Для ресурсного метода.
		// Поправки должны считаться для ресурсного метода от составляющих прямых затрат в текущих ценах.
		ТекДобПарамПЗ 	= 0;
		ТекДобПарамОЗ 	= 0;
		ТекДобПарамЭМ 	= 0;
		ТекДобПарамЗМ 	= 0;
		ТекДобПарамСМ 	= 0;
		ТекДобПарамОБ	= 0;
		ТекДобПарамБР 	= 0;
		
		// Если в числовом параметре в источнике стоит флаг напротив одноименного элемента затрат,
		// то параметры суммируются.
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ПрямЗатраты Тогда
			ДобПарамПЗ 		= ДобПарамПЗ + ОтИтога.СтоимПрямЗатраты;	
			ТекДобПарамПЗ 	= ТекДобПарамПЗ + ОтИтога.ТекСтоимПрямЗатраты;	
		КонецЕсли;
		
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ОснЗарплата Тогда
			ДобПарамОЗ 		= ДобПарамОЗ + ОтИтога.СтоимОснЗарплата;	
			ТекДобПарамОЗ 	= ТекДобПарамОЗ + ОтИтога.ТекСтоимОснЗарплата;	
		КонецЕсли;
		
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ЭксплМашин Тогда
			ДобПарамЭМ 		= ДобПарамЭМ + ОтИтога.СтоимЭксплМашин;	
			ТекДобПарамЭМ 	= ТекДобПарамЭМ + ОтИтога.ТекСтоимЭксплМашин;	
		КонецЕсли;
		
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ЗарплМашинистов Тогда
			ДобПарамЗМ 		= ДобПарамЗМ + ОтИтога.СтоимЗарплМашин;	
			ТекДобПарамЗМ 	= ТекДобПарамЗМ + ОтИтога.ТекСтоимЗарплМашин;	
		КонецЕсли;
		
		// Если расчет ЧП только от ЗПМ, (источник ЭМ не задан), расчет ДопЗМ.
		Если УчитыватьДопЗМ Тогда
			Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ЗарплМашинистов
				И Не СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ЭксплМашин Тогда
				ДобДопЗМ 		= ДобДопЗМ + ОтИтога.СтоимЗарплМашин;	
				ТекДобДопЗМ 	= ТекДобДопЗМ + ОтИтога.ТекСтоимЗарплМашин;	
			КонецЕсли;	
		КонецЕсли;
		 
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].СтоимМатериалов Тогда
			ДобПарамСМ 		= ДобПарамСМ + ОтИтога.СтоимСтоимМатер;	
			ТекДобПарамСМ 	= ТекДобПарамСМ + ОтИтога.ТекСтоимСтоимМатер;	
		КонецЕсли;
		
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].Оборудование Тогда
			ДобПарамОБ 		= ДобПарамОБ + ОтИтога.СтоимОборуд;	
			ТекДобПарамОБ 	= ТекДобПарамОБ + ОтИтога.ТекСтоимОборуд;	
		КонецЕсли;
		
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ЗатратыТрудаРабочих Тогда
			ДобПарамТР 	= ДобПарамТР + ОтИтога.ЗатратыТрудаРабочих;	
		КонецЕсли;
		
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].ЗатратыТрудаМашинистов Тогда
			ДобПарамТМ 	= ДобПарамТМ + ОтИтога.ЗатратыТрудаМашин;	
		КонецЕсли;
		
		Если СтрокаЧислПарам.ЧисловойПараметр.Источник[0].МассаБрутто Тогда
			ДобПарамБР 	= ДобПарамБР + ОтИтога.МассаБрутто;	
		КонецЕсли;
		
		Если СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Сумма Тогда
			ДобПарамОБ 	= ДобПарамОБ * СтрокаЧислПарам.Значение;	
			ДобПарамТР 	= ДобПарамТР * СтрокаЧислПарам.Значение;	
			ДобПарамТМ 	= ДобПарамТМ * СтрокаЧислПарам.Значение;	
			ДобПарамПЗ 	= ДобПарамПЗ * СтрокаЧислПарам.Значение;	
			ДобПарамОЗ 	= ДобПарамОЗ * СтрокаЧислПарам.Значение;	
			ДобПарамЭМ 	= ДобПарамЭМ * СтрокаЧислПарам.Значение;	
			ДобПарамЗМ 	= ДобПарамЗМ * СтрокаЧислПарам.Значение;	
			ДобПарамСМ 	= ДобПарамСМ * СтрокаЧислПарам.Значение;	
			ДобПарамБР 	= ДобПарамБР * СтрокаЧислПарам.Значение;	
			
			ТекДобПарамОБ 	= ТекДобПарамОБ * СтрокаЧислПарам.Значение;	
			ТекДобПарамПЗ 	= ТекДобПарамПЗ * СтрокаЧислПарам.Значение;	
			ТекДобПарамОЗ 	= ТекДобПарамОЗ * СтрокаЧислПарам.Значение;	
			ТекДобПарамЭМ 	= ТекДобПарамЭМ * СтрокаЧислПарам.Значение;	
			ТекДобПарамЗМ 	= ТекДобПарамЗМ * СтрокаЧислПарам.Значение;	
			ТекДобПарамСМ 	= ТекДобПарамСМ * СтрокаЧислПарам.Значение;	
			ТекДобПарамБР 	= ТекДобПарамБР * СтрокаЧислПарам.Значение;	
			
		Иначе	
			
			ДобПарамОБ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамОБ * СтрокаЧислПарам.Значение/100,ДобПарамОБ * (СтрокаЧислПарам.Значение-1));	
			ДобПарамТР 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамТР * СтрокаЧислПарам.Значение/100,ДобПарамТР * (СтрокаЧислПарам.Значение-1));	
			ДобПарамТМ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамТМ * СтрокаЧислПарам.Значение/100,ДобПарамТМ * (СтрокаЧислПарам.Значение-1));	
			ДобПарамПЗ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамПЗ * СтрокаЧислПарам.Значение/100,ДобПарамПЗ * (СтрокаЧислПарам.Значение-1));	
			ДобПарамОЗ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамОЗ * СтрокаЧислПарам.Значение/100,ДобПарамОЗ * (СтрокаЧислПарам.Значение-1));	
			ДобПарамЭМ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамЭМ * СтрокаЧислПарам.Значение/100,ДобПарамЭМ * (СтрокаЧислПарам.Значение-1));	
			ДобПарамЗМ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамЗМ * СтрокаЧислПарам.Значение/100,ДобПарамЗМ * (СтрокаЧислПарам.Значение-1));	
			ДобПарамСМ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамСМ * СтрокаЧислПарам.Значение/100,ДобПарамСМ * (СтрокаЧислПарам.Значение-1));	
			ДобПарамБР 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобПарамСМ * СтрокаЧислПарам.Значение/100,ДобПарамСМ * (СтрокаЧислПарам.Значение-1));	
			
			ТекДобПарамОБ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ТекДобПарамОБ * СтрокаЧислПарам.Значение/100,ТекДобПарамОБ * (СтрокаЧислПарам.Значение-1));	
			ТекДобПарамПЗ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ТекДобПарамПЗ * СтрокаЧислПарам.Значение/100,ТекДобПарамПЗ * (СтрокаЧислПарам.Значение-1));	
			ТекДобПарамОЗ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ТекДобПарамОЗ * СтрокаЧислПарам.Значение/100,ТекДобПарамОЗ * (СтрокаЧислПарам.Значение-1));	
			ТекДобПарамЭМ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ТекДобПарамЭМ * СтрокаЧислПарам.Значение/100,ТекДобПарамЭМ * (СтрокаЧислПарам.Значение-1));	
			ТекДобПарамЗМ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ТекДобПарамЗМ * СтрокаЧислПарам.Значение/100,ТекДобПарамЗМ * (СтрокаЧислПарам.Значение-1));	
			ТекДобПарамСМ 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ТекДобПарамСМ * СтрокаЧислПарам.Значение/100,ТекДобПарамСМ * (СтрокаЧислПарам.Значение-1));	
			ТекДобПарамБР 	= ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ТекДобПарамСМ * СтрокаЧислПарам.Значение/100,ТекДобПарамСМ * (СтрокаЧислПарам.Значение-1));	
			                      
			// Добавки за счет ЗПМ.			
			ДобДопЗМ = ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ДобДопЗМ * СтрокаЧислПарам.Значение/100,ДобДопЗМ * (СтрокаЧислПарам.Значение-1));	
			ТекДобДопЗМ = ?(СтрокаЧислПарам.ЧисловойПараметр.ТипЗначения = Перечисления.СМ_ТипыЗначенийЧисловыхПараметров.Процент,ТекДобДопЗМ * СтрокаЧислПарам.Значение/100,ТекДобДопЗМ * (СтрокаЧислПарам.Значение-1));	
			
		КонецЕсли;

		Если ПромОкр Тогда
			ДобПарамОБ 	= Окр(ДобПарамОБ,2);
			ДобПарамТР 	= Окр(ДобПарамТР,2);
			ДобПарамТМ 	= Окр(ДобПарамТМ,2);
			ДобПарамПЗ 	= Окр(ДобПарамПЗ,2);
			ДобПарамОЗ 	= Окр(ДобПарамОЗ,2);
			ДобПарамЭМ 	= Окр(ДобПарамЭМ,2);
			ДобПарамЗМ 	= Окр(ДобПарамЗМ,2);
			ДобПарамСМ 	= Окр(ДобПарамСМ,2);
			ДобПарамБР 	= Окр(ДобПарамБР,2);
			ДобДопЗМ	= Окр(ДобДопЗМ,2);
			ТекДобПарамОБ 	= Окр(ТекДобПарамОБ,2);
			ТекДобПарамПЗ 	= Окр(ТекДобПарамПЗ,2);
			ТекДобПарамОЗ 	= Окр(ТекДобПарамОЗ,2);
			ТекДобПарамЭМ 	= Окр(ТекДобПарамЭМ,2);
			ТекДобПарамЗМ 	= Окр(ТекДобПарамЗМ,2);
			ТекДобПарамСМ 	= Окр(ТекДобПарамСМ,2);
			ТекДобПарамБР 	= Окр(ТекДобПарамБР,2);
	     	ТекДобДопЗМ		= Окр(ТекДобДопЗМ,2);

		КонецЕсли;
		
		// Суммирование стоимости добавки по элементам табличной части "Приемник", значение"К чему" числового параметра,
		// в соответствующие колонки таблицы разчета.
		Для Каждого СтрокаКИтогу Из СтрокаЧислПарам.ЧисловойПараметр.Приемник Цикл
			
			ПрямоеНачисление 	= ОпределитьСоотвИстПрием(СтрокаЧислПарам.ЧисловойПараметр.Источник[0],СтрокаКИтогу);
			КИтогу 				= ТаблРасчета.Найти(СтрокаКИтогу.КЧему);
			ДобавПЗ = 0;
			ТекДобавПЗ = 0;
			Если ПрямоеНачисление  Тогда
				// Прямое начисление это соответствие флагов у составляющих прямых затрат источника и приемника. 				
				Если СтрокаКИтогу.ПрямЗатраты Тогда
					КИтогу.СтоимПрямЗатраты 	= КИтогу.СтоимПрямЗатраты + ДобПарамОЗ + ДобПарамЭМ + ДобПарамСМ; 	
					КИтогу.ТекСтоимПрямЗатраты 	= КИтогу.ТекСтоимПрямЗатраты + ТекДобПарамОЗ + ТекДобПарамЭМ + ТекДобПарамСМ;
				КонецЕсли;
				
				Если СтрокаКИтогу.ОснЗарплата Тогда
					КИтогу.СтоимОснЗарплата 	= КИтогу.СтоимОснЗарплата + ДобПарамОЗ;
					КИтогу.ТекСтоимОснЗарплата 	= КИтогу.ТекСтоимОснЗарплата + ТекДобПарамОЗ;
				КонецЕсли;
				
				Если СтрокаКИтогу.ЭксплМашин Тогда
					КИтогу.СтоимЭксплМашин 		= КИтогу.СтоимЭксплМашин + ДобПарамЭМ; 	
					КИтогу.ТекСтоимЭксплМашин 	= КИтогу.ТекСтоимЭксплМашин + ТекДобПарамЭМ; 
				КонецЕсли;
				Если СтрокаКИтогу.ЗарплМашинистов Тогда
					КИтогу.СтоимЗарплМашин 		= КИтогу.СтоимЗарплМашин + ДобПарамЗМ; 	
					КИтогу.ТекСтоимЗарплМашин 	= КИтогу.ТекСтоимЗарплМашин + ТекДобПарамЗМ; 
				КонецЕсли;
				// Расчет ДопЗм.
				Если УчитыватьДопЗМ Тогда
					Если СтрокаКИтогу.ЗарплМашинистов Тогда
						КИтогу.СтоимЗарплМашин 		= КИтогу.СтоимЗарплМашин + (ДобДопЗМ - НачальноеДопЗМ ); 	
						КИтогу.ТекСтоимЗарплМашин 	= КИтогу.ТекСтоимЗарплМашин + (ТекДобДопЗМ -НачальноеДопЗМТек); 
					КонецЕсли;
					
					Если СтрокаКИтогу.ЭксплМашин Тогда
						КИтогу.СтоимЭксплМашин 		= КИтогу.СтоимЭксплМашин + (ДобДопЗМ - НачальноеДопЗМ ); 	
						КИтогу.ТекСтоимЭксплМашин 	= КИтогу.ТекСтоимЭксплМашин + (ТекДобДопЗМ - НачальноеДопЗМТек); 
					КонецЕсли;
					КИтогу.ДопЗМ = КИтогу.ДопЗМ + ДобДопЗМ;
					КИтогу.ДопЗМТек = КИтогу.ДопЗМТек + ТекДобДопЗМ;
				КонецЕсли;
				
				Если ФлагИсточника.ЗарплМашинистов Тогда
					Если (Не СтрокаКИтогу.ЭксплМашин) И (СтрокаКИтогу.ПрямЗатраты) Тогда
						ДобавПЗ = ДобавПЗ + ДобПарамЗМ;	
						ТекДобавПЗ = ТекДобавПЗ + ТекДобПарамЗМ;	
					КонецЕсли;	
					Если СтрокаКИтогу.ПрямЗатраты Тогда
						КИтогу.СтоимПрямЗатраты = КИтогу.СтоимПрямЗатраты + ДобавПЗ; 	
						КИтогу.ТекСтоимПрямЗатраты 	= КИтогу.ТекСтоимПрямЗатраты + ТекДобавПЗ;
					КонецЕсли;	
				КонецЕсли;	
				Если СтрокаКИтогу.СтоимМатериалов Тогда
					КИтогу.СтоимСтоимМатер 		= КИтогу.СтоимСтоимМатер + ДобПарамСМ; 	
					КИтогу.ТекСтоимСтоимМатер 	= КИтогу.ТекСтоимСтоимМатер + ТекДобПарамСМ; 
				КонецЕсли;
			Иначе
				// При не соответствии флагов составляющих прямых затрат
				// источника и приемника может быть несколько вариантов:
				// 1. от одной составляющей прямых затрат источника к другой 
				// (или нескольким) приемника.
				// 2. от нескольких составляющих прямых затрат источника 
				// к другой (или нескольким) составляющим прямых затрат приемника.
				// Вариант 2 (при условии от нескольких к нескольким)не однозначен
				// и таких числовых поправок в настоящее время в справочнике нет.
				ОбщДобав = 0;
				ТекОбщДобав = 0;
				Если ФлагИсточника.СтоимМатериалов Тогда
					ОбщДобав 	= ОбщДобав + ДобПарамСМ;
					ТекОбщДобав = ТекОбщДобав + ТекДобПарамСМ;
				КонецЕсли;
				Если ФлагИсточника.ЗарплМашинистов Тогда
					ОбщДобав 	= ОбщДобав + ДобПарамЗМ;
					ТекОбщДобав = ТекОбщДобав + ТекДобПарамЗМ;               
					КИтогу.ДопЗМ = КИтогу.ДопЗМ + ДобДопЗМ;
					КИтогу.ДопЗМТек = КИтогу.ДопЗМТек + ТекДобДопЗМ;
				КонецЕсли;
				Если ФлагИсточника.ЭксплМашин Тогда
					ОбщДобав 	= ОбщДобав + ДобПарамЭМ;
					ТекОбщДобав = ТекОбщДобав + ТекДобПарамЭМ;
				КонецЕсли;
				Если ФлагИсточника.ОснЗарплата Тогда
					ОбщДобав 	= ОбщДобав + ДобПарамОЗ;
					ТекОбщДобав = ТекОбщДобав + ТекДобПарамОЗ;
				КонецЕсли;
				
				Если СтрокаКИтогу.ПрямЗатраты Тогда
					КИтогу.СтоимПрямЗатраты 	= КИтогу.СтоимПрямЗатраты + ОбщДобав; 	
					КИтогу.ТекСтоимПрямЗатраты 	= КИтогу.ТекСтоимПрямЗатраты + ТекОбщДобав;
				КонецЕсли;
				Если СтрокаКИтогу.ОснЗарплата Тогда
					КИтогу.СтоимОснЗарплата 	= КИтогу.СтоимОснЗарплата + ОбщДобав; 	
					КИтогу.ТекСтоимОснЗарплата 	= КИтогу.ТекСтоимОснЗарплата + ТекОбщДобав; 	
				КонецЕсли;
				Если СтрокаКИтогу.ЭксплМашин Тогда
					КИтогу.СтоимЭксплМашин 		= КИтогу.СтоимЭксплМашин + ОбщДобав; 	
					КИтогу.ТекСтоимЭксплМашин 	= КИтогу.ТекСтоимЭксплМашин + ТекОбщДобав; 	
				КонецЕсли;
				Если СтрокаКИтогу.ЗарплМашинистов Тогда
					КИтогу.СтоимЗарплМашин 		= КИтогу.СтоимЗарплМашин + ОбщДобав; 	
					КИтогу.ТекСтоимЗарплМашин 	= КИтогу.ТекСтоимЗарплМашин + ТекОбщДобав; 	
				КонецЕсли;
				Если СтрокаКИтогу.СтоимМатериалов Тогда
					КИтогу.СтоимСтоимМатер 		= КИтогу.СтоимСтоимМатер + ОбщДобав; 	
					КИтогу.ТекСтоимСтоимМатер 	= КИтогу.ТекСтоимСтоимМатер + ТекОбщДобав; 	
				КонецЕсли;
				
			КонецЕсли;	
			// Оборудование и трудозатраты не являются составляющим прямых затрат. 
			// Эти составляющие расценки обрабатываются по своим правилам.
			Если СтрокаКИтогу.Оборудование Тогда
				КИтогу.СтоимОборуд 		= КИтогу.СтоимОборуд + ДобПарамОБ; 
				КИтогу.ТекСтоимОборуд 	= КИтогу.ТекСтоимОборуд + ТекДобПарамОБ; 
			КонецЕсли;
			
			Если СтрокаКИтогу.ЗатратыТрудаРабочих Тогда
				КИтогу.ЗатратыТрудаРабочих 	= КИтогу.ЗатратыТрудаРабочих + ДобПарамТР; 
			КонецЕсли;
			
			Если СтрокаКИтогу.ЗатратыТрудаМашинистов Тогда
				КИтогу.ЗатратыТрудаМашин 	= КИтогу.ЗатратыТрудаМашин + ДобПарамТМ;
			КонецЕсли;
			// Масса брутто может быть задана для расценок оборудование.  
			// В настоящий момент поправка за массу брутто применяется только к оборудованию.
			Если ФлагИсточника.МассаБрутто Тогда
				Если СтрокаКИтогу.Оборудование Тогда
					КИтогу.СтоимОборуд = КИтогу.СтоимОборуд + ДобПарамБР;
					КИтогу.ТекСтоимОборуд = КИтогу.ТекСтоимОборуд + ТекДобПарамБР;
				КонецЕсли;
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЦикла;
	
	// 5. Запись результатов расчета в соответствующие регистры.
	
	Отбор = Новый Структура();
	Отбор.Вставить("Позиция",СтруктураПараметровОтбораРС.СсылкаНаПозицию);
	Отбор.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
	Отбор.Вставить("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);
	
	Если ТипЗнч(ЛС) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Если Позиция.НачисленияПозиции.Количество() = 0 ИЛИ ЧислПарамДляРасчета.Количество() = 0 Тогда
			Если ИспользоватьРС Тогда
		
				СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНаборТаблицей("СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП", Отбор, ТаблСПоправками);
				
			Иначе
				
				СтруктураДанныхРасчета.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП = ТаблСПоправками.Скопировать();
				
			КонецЕсли;
		Иначе
			
			Параметры = Новый Структура();
			Параметры.Вставить("Позиция",СтруктураПараметровОтбораРС.СсылкаНаПозицию);
			Параметры.Вставить("Смета",СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета);
			Параметры.Вставить("Раздел",СтруктураПараметровОтбораРС.СсылкаНаРаздел);        
		
			Параметры.Вставить("СтоимПрямЗатраты",КИтогу.СтоимПрямЗатраты);
			Параметры.Вставить("СтоимОснЗарплата",КИтогу.СтоимОснЗарплата);
			Параметры.Вставить("СтоимЭксплМашин",КИтогу.СтоимЭксплМашин);
			Параметры.Вставить("СтоимЗарплМашин",КИтогу.СтоимЗарплМашин);
			Параметры.Вставить("СтоимСтоимМатер",КИтогу.СтоимСтоимМатер);
			Параметры.Вставить("СтоимОборуд",КИтогу.СтоимОборуд);
			Параметры.Вставить("СтоимВозвратМатер",ТаблСПоправками[0].СтоимВозвратМатер);
			Параметры.Вставить("ЗатратыТрудаРабочих",КИтогу.ЗатратыТрудаРабочих);
			Параметры.Вставить("ЗатратыТрудаМашин",КИтогу.ЗатратыТрудаМашин);
			
			Параметры.Вставить("ТекСтоимПрямЗатраты",КИтогу.ТекСтоимПрямЗатраты);
			Параметры.Вставить("ТекСтоимОснЗарплата",КИтогу.ТекСтоимОснЗарплата);
			Параметры.Вставить("ТекСтоимЭксплМашин",КИтогу.ТекСтоимЭксплМашин);
			Параметры.Вставить("ТекСтоимЗарплМашин",КИтогу.ТекСтоимЗарплМашин);
			Параметры.Вставить("ТекСтоимВозвратМатер",ТаблСПоправками[0].ТекСтоимВозвратМатер);
			Параметры.Вставить("ТекСтоимСтоимМатер",КИтогу.ТекСтоимСтоимМатер);
			Параметры.Вставить("ТекСтоимОборуд",КИтогу.ТекСтоимОборуд);
			Параметры.Вставить("ДопЗМ",КИтогу.ДопЗМ);
			Параметры.Вставить("ДопЗМТек",КИтогу.ДопЗМТек);
				
			Если ИспользоватьРС Тогда
		
				СМ_СметаВызовСервера.ЗаписатьРеквизитыРегистраСведенийНабор("СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП", Отбор, Параметры);
	
			Иначе
				
				НоваяСтрока = СтруктураДанныхРасчета.СМ_БазиснаяЕдиничнаяСтоимостьПозицииСНачислениямиПоправкамиИЧП.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Параметры);
				
			КонецЕсли;
		КонецЕсли;
				
	КонецЕсли;
	
	// 6. Подготовка таблицы расчета для записи в регистр "Итоги по разлелу".
	Если Акт <> Неопределено Тогда
		СтрокаВАкте = СМ_СметаВызовСервера.СтрокаПозицииАкта(Акт, Позиция);
		Если Не СтрокаВАкте = Неопределено Тогда
			ТекущийОбъем = СтрокаВАкте.ФактОбъем;
		Иначе 
			ТекущийОбъем = 0;
		КонецЕсли;	
	
	Иначе
		ТекущийОбъем = Позиция.ОбъемРабот;
	КонецЕсли;	
	
	Для Каждого СтрокаРасчета Из ТаблРасчета Цикл
		
		СтрокаРасчета.СтоимПрямЗатраты 		= ?(ПромОкр,Окр(СтрокаРасчета.СтоимПрямЗатраты * ТекущийОбъем,2),СтрокаРасчета.СтоимПрямЗатраты * ТекущийОбъем);		
		СтрокаРасчета.СтоимОснЗарплата 		= ?(ПромОкр,Окр(СтрокаРасчета.СтоимОснЗарплата * ТекущийОбъем,2),СтрокаРасчета.СтоимОснЗарплата * ТекущийОбъем);		
		СтрокаРасчета.СтоимЭксплМашин 		= ?(ПромОкр,Окр(СтрокаРасчета.СтоимЭксплМашин * ТекущийОбъем,2),СтрокаРасчета.СтоимЭксплМашин * ТекущийОбъем);		
		СтрокаРасчета.СтоимЗарплМашин 		= ?(ПромОкр,Окр(СтрокаРасчета.СтоимЗарплМашин * ТекущийОбъем,2),СтрокаРасчета.СтоимЗарплМашин * ТекущийОбъем);		
		СтрокаРасчета.СтоимСтоимМатер 		= ?(ПромОкр,Окр(СтрокаРасчета.СтоимСтоимМатер * ТекущийОбъем,2),СтрокаРасчета.СтоимСтоимМатер * ТекущийОбъем);		
		СтрокаРасчета.СтоимОборуд 			= ?(ПромОкр,Окр(СтрокаРасчета.СтоимОборуд * ТекущийОбъем,2),СтрокаРасчета.СтоимОборуд * ТекущийОбъем);		
		СтрокаРасчета.СтоимВозвратМатер 	= ?(ПромОкр,Окр(СтрокаРасчета.СтоимВозвратМатер * ТекущийОбъем,2),СтрокаРасчета.СтоимВозвратМатер * ТекущийОбъем);		
		СтрокаРасчета.ЗатратыТрудаРабочих 	= ?(ПромОкр,Окр(СтрокаРасчета.ЗатратыТрудаРабочих * ТекущийОбъем,2),СтрокаРасчета.ЗатратыТрудаРабочих * ТекущийОбъем);		
		СтрокаРасчета.ЗатратыТрудаМашин 	= ?(ПромОкр,Окр(СтрокаРасчета.ЗатратыТрудаМашин * ТекущийОбъем,2),СтрокаРасчета.ЗатратыТрудаМашин * ТекущийОбъем);		
		СтрокаРасчета.ТекСтоимПрямЗатраты 	= ?(ПромОкр,Окр(СтрокаРасчета.ТекСтоимПрямЗатраты * ТекущийОбъем,2),СтрокаРасчета.ТекСтоимПрямЗатраты * ТекущийОбъем);		
		СтрокаРасчета.ТекСтоимОснЗарплата 	= ?(ПромОкр,Окр(СтрокаРасчета.ТекСтоимОснЗарплата * ТекущийОбъем,2),СтрокаРасчета.ТекСтоимОснЗарплата * ТекущийОбъем);		
		СтрокаРасчета.ТекСтоимЭксплМашин 	= ?(ПромОкр,Окр(СтрокаРасчета.ТекСтоимЭксплМашин * ТекущийОбъем,2),СтрокаРасчета.ТекСтоимЭксплМашин * ТекущийОбъем);		
		СтрокаРасчета.ТекСтоимЗарплМашин 	= ?(ПромОкр,Окр(СтрокаРасчета.ТекСтоимЗарплМашин * ТекущийОбъем,2),СтрокаРасчета.ТекСтоимЗарплМашин * ТекущийОбъем);		
		СтрокаРасчета.ТекСтоимСтоимМатер 	= ?(ПромОкр,Окр(СтрокаРасчета.ТекСтоимСтоимМатер * ТекущийОбъем,2),СтрокаРасчета.ТекСтоимСтоимМатер * ТекущийОбъем);		
		СтрокаРасчета.ТекСтоимОборуд 		= ?(ПромОкр,Окр(СтрокаРасчета.ТекСтоимОборуд * ТекущийОбъем,2),СтрокаРасчета.ТекСтоимОборуд * ТекущийОбъем);		
		СтрокаРасчета.ТекСтоимВозвратМатер 	= ?(ПромОкр,Окр(СтрокаРасчета.ТекСтоимВозвратМатер * ТекущийОбъем,2),СтрокаРасчета.ТекСтоимВозвратМатер * ТекущийОбъем);		

		Если ОкрИтог Тогда
			СтрокаРасчета.СтоимОснЗарплата 	= Окр(СтрокаРасчета.СтоимОснЗарплата,0);		
			СтрокаРасчета.СтоимЭксплМашин 	= Окр(СтрокаРасчета.СтоимЭксплМашин,0);		
			СтрокаРасчета.СтоимЗарплМашин 	= Окр(СтрокаРасчета.СтоимЗарплМашин,0);		
			СтрокаРасчета.СтоимСтоимМатер 	= Окр(СтрокаРасчета.СтоимСтоимМатер,0);		
			СтрокаРасчета.СтоимОборуд 		= Окр(СтрокаРасчета.СтоимОборуд,0);		
			СтрокаРасчета.СтоимПрямЗатраты 	= Окр(СтрокаРасчета.СтоимПрямЗатраты,0);
			СтрокаРасчета.ТекСтоимОснЗарплата 	= Окр(СтрокаРасчета.ТекСтоимОснЗарплата,0);		
			СтрокаРасчета.ТекСтоимЭксплМашин 	= Окр(СтрокаРасчета.ТекСтоимЭксплМашин,0);		
			СтрокаРасчета.ТекСтоимЗарплМашин 	= Окр(СтрокаРасчета.ТекСтоимЗарплМашин,0);		
			СтрокаРасчета.ТекСтоимСтоимМатер 	= Окр(СтрокаРасчета.ТекСтоимСтоимМатер,0);		
			СтрокаРасчета.ТекСтоимОборуд 		= Окр(СтрокаРасчета.ТекСтоимОборуд,0);		
			СтрокаРасчета.ТекСтоимПрямЗатраты 	= Окр(СтрокаРасчета.ТекСтоимПрямЗатраты,0);
			Если  СтрокаРасчета.ТекСтоимПрямЗатраты <> 0 Тогда
				Если  СтрокаРасчета.ТекСтоимОснЗарплата + СтрокаРасчета.ТекСтоимЭксплМашин + СтрокаРасчета.ТекСтоимСтоимМатер <> 0 Тогда
					СтрокаРасчета.ТекСтоимПрямЗатраты = СтрокаРасчета.ТекСтоимОснЗарплата + СтрокаРасчета.ТекСтоимЭксплМашин + СтрокаРасчета.ТекСтоимСтоимМатер;	
				КонецЕсли;
			КонецЕсли;
			Если ОбрабПогр = Перечисления.СМ_ОбработкаПогрешностиОкругления.ПЗЧерезСумму Тогда
				СтрокаРасчета.СтоимПрямЗатраты = СтрокаРасчета.СтоимОснЗарплата + СтрокаРасчета.СтоимЭксплМашин + СтрокаРасчета.СтоимСтоимМатер;	
				СтрокаРасчета.ТекСтоимПрямЗатраты = СтрокаРасчета.ТекСтоимОснЗарплата + СтрокаРасчета.ТекСтоимЭксплМашин + СтрокаРасчета.ТекСтоимСтоимМатер;	
			ИначеЕсли ОбрабПогр = Перечисления.СМ_ОбработкаПогрешностиОкругления.РазницуНаНаибольшую Тогда
				Разница = СтрокаРасчета.СтоимОснЗарплата + СтрокаРасчета.СтоимЭксплМашин + СтрокаРасчета.СтоимСтоимМатер - СтрокаРасчета.СтоимПрямЗатраты;
				Если СтрокаРасчета.СтоимОснЗарплата > СтрокаРасчета.СтоимЭксплМашин И СтрокаРасчета.СтоимОснЗарплата > СтрокаРасчета.СтоимСтоимМатер Тогда
					СтрокаРасчета.СтоимОснЗарплата = СтрокаРасчета.СтоимОснЗарплата - Разница;	
				ИначеЕсли СтрокаРасчета.СтоимЭксплМашин > СтрокаРасчета.СтоимСтоимМатер Тогда
					СтрокаРасчета.СтоимЭксплМашин = СтрокаРасчета.СтоимЭксплМашин - Разница;	
				Иначе
					СтрокаРасчета.СтоимСтоимМатер = СтрокаРасчета.СтоимСтоимМатер - Разница;	
				КонецЕсли;
				Разница = СтрокаРасчета.ТекСтоимОснЗарплата + СтрокаРасчета.ТекСтоимЭксплМашин + СтрокаРасчета.ТекСтоимСтоимМатер - СтрокаРасчета.ТекСтоимПрямЗатраты;
				Если СтрокаРасчета.ТекСтоимОснЗарплата > СтрокаРасчета.ТекСтоимЭксплМашин И СтрокаРасчета.ТекСтоимОснЗарплата > СтрокаРасчета.ТекСтоимСтоимМатер Тогда
					СтрокаРасчета.ТекСтоимОснЗарплата = СтрокаРасчета.ТекСтоимОснЗарплата - Разница;	
				ИначеЕсли СтрокаРасчета.ТекСтоимЭксплМашин > СтрокаРасчета.ТекСтоимСтоимМатер Тогда
					СтрокаРасчета.ТекСтоимЭксплМашин = СтрокаРасчета.ТекСтоимЭксплМашин - Разница;	
				Иначе
					СтрокаРасчета.ТекСтоимСтоимМатер = СтрокаРасчета.ТекСтоимСтоимМатер - Разница;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблРасчета.ЗаполнитьЗначения(СтруктураПараметровОтбораРС.СсылкаДляОтбораСмета,"Смета");
  	ТаблРасчета.ЗаполнитьЗначения(СтруктураПараметровОтбораРС.СсылкаНаРаздел,"Раздел");
	ТаблРасчета.ЗаполнитьЗначения(СтруктураПараметровОтбораРС.СсылкаНаПозицию,"Позиция");
	
	Возврат ТаблРасчета;
	
КонецФункции

// Расчет зимнего удорожания для методики ТСН.
//
Процедура РасчетЗимнегоУдорожания(ТаблСПоправками,ПрименитьТрудРаб,ПрименитьТрудМаш,КоэффЗУ,КоэффЗУМат)
	
	УчитыватьДопЗМ = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиПользователяСмета","УчитыватьДопЗМ",Ложь);	
	Для Каждого СтрЗнач Из  ТаблСПоправками Цикл
		СтрЗнач.СтоимСтоимМатер = СтрЗнач.СтоимСтоимМатер * КоэффЗУМат;
		СтрЗнач.ТекСтоимСтоимМатер = СтрЗнач.ТекСтоимСтоимМатер * КоэффЗУМат;
		СтрЗнач.СтоимОснЗарплата = СтрЗнач.СтоимОснЗарплата * КоэффЗУ;
		СтрЗнач.ТекСтоимОснЗарплата = СтрЗнач.ТекСтоимОснЗарплата * КоэффЗУ;
		СтрЗнач.СтоимЭксплМашин = СтрЗнач.СтоимЭксплМашин * КоэффЗУ;
		СтрЗнач.ТекСтоимЭксплМашин = СтрЗнач.ТекСтоимЭксплМашин * КоэффЗУ;
		СтрЗнач.СтоимЗарплМашин = СтрЗнач.СтоимЗарплМашин * КоэффЗУ;
		СтрЗнач.ТекСтоимЗарплМашин = СтрЗнач.ТекСтоимЗарплМашин * КоэффЗУ;
		Если УчитыватьДопЗМ Тогда
			СтрЗнач.ДопЗМ = СтрЗнач.ДопЗМ * КоэффЗУ;
			СтрЗнач.ДопЗМТек = СтрЗнач.ДопЗМТек * КоэффЗУ;
		КонецЕсли;
		ПЗ = СтрЗнач.СтоимСтоимМатер + СтрЗнач.СтоимЭксплМашин + СтрЗнач.СтоимОснЗарплата;
		ТекПЗ = СтрЗнач.ТекСтоимЭксплМашин + СтрЗнач.ТекСтоимОснЗарплата + СтрЗнач.ТекСтоимСтоимМатер;
		Если ПЗ <> 0 Тогда
			СтрЗнач.СтоимПрямЗатраты = ПЗ;
		КонецЕсли;	
		Если ТекПЗ <> 0 Тогда
			СтрЗнач.ТекСтоимПрямЗатраты = ТекПЗ;
		КонецЕсли;	          				

		Если ПрименитьТрудРаб Тогда
			СтрЗнач.ЗатратыТрудаРабочих = СтрЗнач.ЗатратыТрудаРабочих * КоэффЗУ;
		КонецЕсли;
		Если ПрименитьТрудМаш Тогда
			СтрЗнач.ЗатратыТрудаМашин = СтрЗнач.ЗатратыТрудаМашин * КоэффЗУ;
		КонецЕсли;

	КонецЦикла;
КонецПроцедуры	

#КонецОбласти

#Область ПолучениеТаблицДляРасчетовИГрупповойОбработки

Функция ТаблицаБезГруппировкиПоЦенам(ТаблСтоимРес,ГруппироватьСтатусы,ДетализацияОтклонения)
	Если ГруппироватьСтатусы Тогда
		Возврат ПолучитьТаблицуБезГруппировкиПоЦенамСтатусы(ТаблСтоимРес);
	ИначеЕсли ДетализацияОтклонения Тогда
		Возврат ПолучитьТаблицуБезГруппировкиПоЦенамОтклонение(ТаблСтоимРес);
	Иначе
		Возврат ПолучитьТаблицуБезГруппировкиПоЦенам(ТаблСтоимРес);
	КонецЕсли;
КонецФункции

// Вспомогательная для функция получения сводных таблиц ресурсов.
//
Функция ПолучитьТаблицуБезГруппировкиПоЦенам(ТаблСтоимРес)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.ЦенаБазисная КАК ЦенаБазисная,
	|	СтоимостьРесурсов.ЦенаЗМБазисная КАК ЦенаЗМБазисная,
	|	СтоимостьРесурсов.ЦенаТекущая КАК ЦенаТекущая,
	|	СтоимостьРесурсов.ЦенаТекущаяЗМ КАК ЦенаТекущаяЗМ,
	|	СтоимостьРесурсов.Количество КАК Количество,
	|	СтоимостьРесурсов.РасходПоНорме КАК РасходПоНорме,
	|	СтоимостьРесурсов.РасходПоФакту КАК РасходПоФакту,
	|	СтоимостьРесурсов.СтоимостьБазисная КАК СтоимостьБазисная,
	|	СтоимостьРесурсов.СтоимостьЗМБазисная КАК СтоимостьЗМБазисная,
	|	СтоимостьРесурсов.СтоимостьТекущая КАК СтоимостьТекущая,
	|	СтоимостьРесурсов.СтоимостьТекущаяЗМ КАК СтоимостьТекущаяЗМ,
	|	СтоимостьРесурсов.Картинка КАК Картинка,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ РесурсыВрем
	|ИЗ
	|	&ТаблСтоимРес КАК СтоимостьРесурсов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаБазисная) КАК ЦенаБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаЗМБазисная) КАК ЦенаЗМБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущая) КАК ЦенаТекущая,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМ,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ СредниеПоРесурсам
	|ИЗ
	|	РесурсыВрем КАК СтоимостьРесурсов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)),
	|	СтоимостьРесурсов.ВидРесурса,
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)),
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаБазисная) КАК ЦенаБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаЗМБазисная) КАК ЦенаЗМБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущая) КАК ЦенаТекущая,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМ,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаБазисная) КАК ЦенаБазиснаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаЗМБазисная) КАК ЦенаЗМБазиснаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаТекущая) КАК ЦенаТекущаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМПроверка,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаБазисная <> СредниеПоРесурсам.ЦенаБазисная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаБазиснаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаЗМБазисная <> СредниеПоРесурсам.ЦенаЗМБазисная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаЗМБазиснаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаТекущая <> СредниеПоРесурсам.ЦенаТекущая
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаТекущаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаТекущаяЗМ <> СредниеПоРесурсам.ЦенаТекущаяЗМ
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаТекущаяЗМЕстьОтклонение,
	|	СУММА(СтоимостьРесурсов.Количество) КАК Количество,
	|	СУММА(СтоимостьРесурсов.РасходПоНорме) КАК РасходПоНорме,
	|	СУММА(СтоимостьРесурсов.РасходПоФакту) КАК РасходПоФакту,
	|	СУММА(СтоимостьРесурсов.СтоимостьБазисная) КАК СтоимостьБазисная,
	|	СУММА(СтоимостьРесурсов.СтоимостьЗМБазисная) КАК СтоимостьЗМБазисная,
	|	СУММА(СтоимостьРесурсов.СтоимостьТекущая) КАК СтоимостьТекущая,
	|	СУММА(СтоимостьРесурсов.СтоимостьТекущаяЗМ) КАК СтоимостьТекущаяЗМ,
	|	СтоимостьРесурсов.Картинка КАК Картинка,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ Ресурсы
	|ИЗ
	|	РесурсыВрем КАК СтоимостьРесурсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СредниеПоРесурсам КАК СредниеПоРесурсам
	|		ПО СтоимостьРесурсов.Ресурс = СредниеПоРесурсам.Ресурс
	|			И ((ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20))) = СредниеПоРесурсам.КодРесурса)
	|			И СтоимостьРесурсов.ВидРесурса = СредниеПоРесурсам.ВидРесурса
	|			И ((ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500))) = СредниеПоРесурсам.НаименованиеРесурса)
	|			И СтоимостьРесурсов.ЕдиницаИзмеренияРесурса = СредниеПоРесурсам.ЕдиницаИзмеренияРесурса
	|			И СтоимостьРесурсов.ЭтоУчтенный = СредниеПоРесурсам.ЭтоУчтенный
	|			И СтоимостьРесурсов.ЭтоНеучтенный = СредниеПоРесурсам.ЭтоНеучтенный
	|			И СтоимостьРесурсов.ЭтоОборудование = СредниеПоРесурсам.ЭтоОборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)),
	|	СтоимостьРесурсов.ВидРесурса,
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)),
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.Картинка,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ресурсы.Ресурс,
	|	Ресурсы.КодРесурса,
	|	Ресурсы.ВидРесурса,
	|	Ресурсы.НаименованиеРесурса,
	|	Ресурсы.ЕдиницаИзмеренияРесурса,
	|	Ресурсы.ЭтоУчтенный,
	|	Ресурсы.ЭтоНеучтенный,
	|	Ресурсы.ЭтоОборудование,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаБазиснаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаБазисная
	|	КОНЕЦ КАК ЦенаБазисная,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаЗМБазиснаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаЗМБазисная
	|	КОНЕЦ КАК ЦенаЗМБазисная,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаТекущаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаТекущая
	|	КОНЕЦ КАК ЦенаТекущая,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаТекущаяЗМЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаТекущаяЗМ
	|	КОНЕЦ КАК ЦенаТекущаяЗМ,
	|	Ресурсы.ЦенаБазиснаяЕстьОтклонение,
	|	Ресурсы.ЦенаЗМБазиснаяЕстьОтклонение,
	|	Ресурсы.ЦенаТекущаяЕстьОтклонение,
	|	Ресурсы.ЦенаТекущаяЗМЕстьОтклонение,
	|	Ресурсы.Количество,
	|	Ресурсы.РасходПоНорме,
	|	Ресурсы.РасходПоФакту,
	|	Ресурсы.СтоимостьБазисная,
	|	Ресурсы.СтоимостьЗМБазисная,
	|	Ресурсы.СтоимостьТекущая,
	|	Ресурсы.СтоимостьТекущаяЗМ,
	|	Ресурсы.Картинка,
	|	Ресурсы.НеИзменятьЦены
	|ИЗ
	|	Ресурсы КАК Ресурсы";
	
	Запрос.УстановитьПараметр("ТаблСтоимРес", ТаблСтоимРес);
	
	Возврат Запрос.Выполнить().Выгрузить();    	
	
КонецФункции

// Вспомогательная для функция получения сводных таблиц ресурсов со статусами.
//
Функция ПолучитьТаблицуБезГруппировкиПоЦенамСтатусы(ТаблСтоимРес)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.ЦенаБазисная КАК ЦенаБазисная,
	|	СтоимостьРесурсов.ЦенаЗМБазисная КАК ЦенаЗМБазисная,
	|	СтоимостьРесурсов.ЦенаТекущая КАК ЦенаТекущая,
	|	СтоимостьРесурсов.ЦенаТекущаяЗМ КАК ЦенаТекущаяЗМ,
	|	СтоимостьРесурсов.Количество КАК Количество,
	|	СтоимостьРесурсов.РасходПоНорме КАК РасходПоНорме,
	|	СтоимостьРесурсов.РасходПоФакту КАК РасходПоФакту,
	|	СтоимостьРесурсов.СтоимостьБазисная КАК СтоимостьБазисная,
	|	СтоимостьРесурсов.СтоимостьЗМБазисная КАК СтоимостьЗМБазисная,
	|	СтоимостьРесурсов.СтоимостьТекущая КАК СтоимостьТекущая,
	|	СтоимостьРесурсов.СтоимостьТекущаяЗМ КАК СтоимостьТекущаяЗМ,
	|	СтоимостьРесурсов.Картинка КАК Картинка,
	|	СтоимостьРесурсов.СтатусРесурса,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ РесурсыВрем
	|ИЗ
	|	&ТаблСтоимРес КАК СтоимостьРесурсов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаБазисная) КАК ЦенаБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаЗМБазисная) КАК ЦенаЗМБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущая) КАК ЦенаТекущая,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМ,
	|	СтоимостьРесурсов.СтатусРесурса,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ СредниеПоРесурсам
	|ИЗ
	|	РесурсыВрем КАК СтоимостьРесурсов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)),
	|	СтоимостьРесурсов.ВидРесурса,
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)),
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.СтатусРесурса,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаБазисная) КАК ЦенаБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаЗМБазисная) КАК ЦенаЗМБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущая) КАК ЦенаТекущая,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМ,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаБазисная) КАК ЦенаБазиснаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаЗМБазисная) КАК ЦенаЗМБазиснаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаТекущая) КАК ЦенаТекущаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМПроверка,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаБазисная <> СредниеПоРесурсам.ЦенаБазисная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаБазиснаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаЗМБазисная <> СредниеПоРесурсам.ЦенаЗМБазисная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаЗМБазиснаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаТекущая <> СредниеПоРесурсам.ЦенаТекущая
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаТекущаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаТекущаяЗМ <> СредниеПоРесурсам.ЦенаТекущаяЗМ
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаТекущаяЗМЕстьОтклонение,
	|	СУММА(СтоимостьРесурсов.Количество) КАК Количество,
	|	СУММА(СтоимостьРесурсов.РасходПоНорме) КАК РасходПоНорме,
	|	СУММА(СтоимостьРесурсов.РасходПоФакту) КАК РасходПоФакту,
	|	СУММА(СтоимостьРесурсов.СтоимостьБазисная) КАК СтоимостьБазисная,
	|	СУММА(СтоимостьРесурсов.СтоимостьЗМБазисная) КАК СтоимостьЗМБазисная,
	|	СУММА(СтоимостьРесурсов.СтоимостьТекущая) КАК СтоимостьТекущая,
	|	СУММА(СтоимостьРесурсов.СтоимостьТекущаяЗМ) КАК СтоимостьТекущаяЗМ,
	|	СтоимостьРесурсов.Картинка КАК Картинка,
	|	СтоимостьРесурсов.СтатусРесурса,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ Ресурсы
	|ИЗ
	|	РесурсыВрем КАК СтоимостьРесурсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СредниеПоРесурсам КАК СредниеПоРесурсам
	|		ПО СтоимостьРесурсов.Ресурс = СредниеПоРесурсам.Ресурс
	|			И ((ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20))) = СредниеПоРесурсам.КодРесурса)
	|			И СтоимостьРесурсов.ВидРесурса = СредниеПоРесурсам.ВидРесурса
	|			И ((ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500))) = СредниеПоРесурсам.НаименованиеРесурса)
	|			И СтоимостьРесурсов.ЕдиницаИзмеренияРесурса = СредниеПоРесурсам.ЕдиницаИзмеренияРесурса
	|			И СтоимостьРесурсов.ЭтоУчтенный = СредниеПоРесурсам.ЭтоУчтенный
	|			И СтоимостьРесурсов.ЭтоНеучтенный = СредниеПоРесурсам.ЭтоНеучтенный
	|			И СтоимостьРесурсов.ЭтоОборудование = СредниеПоРесурсам.ЭтоОборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)),
	|	СтоимостьРесурсов.ВидРесурса,
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)),
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.Картинка,
	|	СтоимостьРесурсов.СтатусРесурса,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ресурсы.Ресурс,
	|	Ресурсы.КодРесурса,
	|	Ресурсы.ВидРесурса,
	|	Ресурсы.НаименованиеРесурса,
	|	Ресурсы.ЕдиницаИзмеренияРесурса,
	|	Ресурсы.ЭтоУчтенный,
	|	Ресурсы.ЭтоНеучтенный,
	|	Ресурсы.ЭтоОборудование,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаБазиснаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаБазисная
	|	КОНЕЦ КАК ЦенаБазисная,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаЗМБазиснаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаЗМБазисная
	|	КОНЕЦ КАК ЦенаЗМБазисная,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаТекущаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаТекущая
	|	КОНЕЦ КАК ЦенаТекущая,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаТекущаяЗМЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаТекущаяЗМ
	|	КОНЕЦ КАК ЦенаТекущаяЗМ,
	|	Ресурсы.ЦенаБазиснаяЕстьОтклонение,
	|	Ресурсы.ЦенаЗМБазиснаяЕстьОтклонение,
	|	Ресурсы.ЦенаТекущаяЕстьОтклонение,
	|	Ресурсы.ЦенаТекущаяЗМЕстьОтклонение,
	|	Ресурсы.Количество,
	|	Ресурсы.РасходПоНорме,
	|	Ресурсы.РасходПоФакту,
	|	Ресурсы.СтоимостьБазисная,
	|	Ресурсы.СтоимостьЗМБазисная,
	|	Ресурсы.СтоимостьТекущая,
	|	Ресурсы.СтоимостьТекущаяЗМ,
	|	Ресурсы.Картинка,
	|	Ресурсы.СтатусРесурса,
	|	Ресурсы.НеИзменятьЦены
	|ИЗ
	|	Ресурсы КАК Ресурсы";
	
	Запрос.УстановитьПараметр("ТаблСтоимРес", ТаблСтоимРес);
	
	Возврат Запрос.Выполнить().Выгрузить();    	
	
КонецФункции

// Вспомогательная для функция получения сводных таблиц ресурсов с вариантами отклонения.
//
Функция ПолучитьТаблицуБезГруппировкиПоЦенамОтклонение(ТаблСтоимРес)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.ЦенаБазисная КАК ЦенаБазисная,
	|	СтоимостьРесурсов.ЦенаЗМБазисная КАК ЦенаЗМБазисная,
	|	СтоимостьРесурсов.ЦенаТекущая КАК ЦенаТекущая,
	|	СтоимостьРесурсов.ЦенаТекущаяЗМ КАК ЦенаТекущаяЗМ,
	|	СтоимостьРесурсов.Количество КАК Количество,
	|	СтоимостьРесурсов.РасходПоНорме КАК РасходПоНорме,
	|	СтоимостьРесурсов.РасходПоФакту КАК РасходПоФакту,
	|	СтоимостьРесурсов.СтоимостьБазисная КАК СтоимостьБазисная,
	|	СтоимостьРесурсов.СтоимостьЗМБазисная КАК СтоимостьЗМБазисная,
	|	СтоимостьРесурсов.СтоимостьТекущая КАК СтоимостьТекущая,
	|	СтоимостьРесурсов.СтоимостьТекущаяЗМ КАК СтоимостьТекущаяЗМ,
	|	СтоимостьРесурсов.Картинка КАК Картинка,
	|	СтоимостьРесурсов.ВариантОтклонения,
	|	СтоимостьРесурсов.ВариантПревышения,
	|	СтоимостьРесурсов.КомментарийКФайлу,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ РесурсыВрем
	|ИЗ
	|	&ТаблСтоимРес КАК СтоимостьРесурсов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаБазисная) КАК ЦенаБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаЗМБазисная) КАК ЦенаЗМБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущая) КАК ЦенаТекущая,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМ,
	|	СтоимостьРесурсов.ВариантОтклонения,
	|	СтоимостьРесурсов.ВариантПревышения,
	|	СтоимостьРесурсов.КомментарийКФайлу,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ СредниеПоРесурсам
	|ИЗ
	|	РесурсыВрем КАК СтоимостьРесурсов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)),
	|	СтоимостьРесурсов.ВидРесурса,
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)),
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.ВариантОтклонения,
	|	СтоимостьРесурсов.ВариантПревышения,
	|	СтоимостьРесурсов.КомментарийКФайлу,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)) КАК КодРесурса,
	|	СтоимостьРесурсов.ВидРесурса,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)) КАК НаименованиеРесурса,
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаБазисная) КАК ЦенаБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаЗМБазисная) КАК ЦенаЗМБазисная,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущая) КАК ЦенаТекущая,
	|	СРЕДНЕЕ(СтоимостьРесурсов.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМ,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаБазисная) КАК ЦенаБазиснаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаЗМБазисная) КАК ЦенаЗМБазиснаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаТекущая) КАК ЦенаТекущаяПроверка,
	|	СРЕДНЕЕ(СредниеПоРесурсам.ЦенаТекущаяЗМ) КАК ЦенаТекущаяЗМПроверка,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаБазисная <> СредниеПоРесурсам.ЦенаБазисная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаБазиснаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаЗМБазисная <> СредниеПоРесурсам.ЦенаЗМБазисная
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаЗМБазиснаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаТекущая <> СредниеПоРесурсам.ЦенаТекущая
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаТекущаяЕстьОтклонение,
	|	СУММА(ВЫБОР
	|			КОГДА СтоимостьРесурсов.ЦенаТекущаяЗМ <> СредниеПоРесурсам.ЦенаТекущаяЗМ
	|				ТОГДА 1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ЦенаТекущаяЗМЕстьОтклонение,
	|	СУММА(СтоимостьРесурсов.Количество) КАК Количество,
	|	СУММА(СтоимостьРесурсов.РасходПоНорме) КАК РасходПоНорме,
	|	СУММА(СтоимостьРесурсов.РасходПоФакту) КАК РасходПоФакту,
	|	СУММА(СтоимостьРесурсов.СтоимостьБазисная) КАК СтоимостьБазисная,
	|	СУММА(СтоимостьРесурсов.СтоимостьЗМБазисная) КАК СтоимостьЗМБазисная,
	|	СУММА(СтоимостьРесурсов.СтоимостьТекущая) КАК СтоимостьТекущая,
	|	СУММА(СтоимостьРесурсов.СтоимостьТекущаяЗМ) КАК СтоимостьТекущаяЗМ,
	|	СтоимостьРесурсов.Картинка КАК Картинка,
	|	СтоимостьРесурсов.ВариантОтклонения,
	|	СтоимостьРесурсов.КомментарийКФайлу,
	|	СтоимостьРесурсов.ВариантПревышения,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|ПОМЕСТИТЬ Ресурсы
	|ИЗ
	|	РесурсыВрем КАК СтоимостьРесурсов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СредниеПоРесурсам КАК СредниеПоРесурсам
	|		ПО СтоимостьРесурсов.Ресурс = СредниеПоРесурсам.Ресурс
	|			И ((ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20))) = СредниеПоРесурсам.КодРесурса)
	|			И СтоимостьРесурсов.ВидРесурса = СредниеПоРесурсам.ВидРесурса
	|			И ((ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500))) = СредниеПоРесурсам.НаименованиеРесурса)
	|			И СтоимостьРесурсов.ЕдиницаИзмеренияРесурса = СредниеПоРесурсам.ЕдиницаИзмеренияРесурса
	|			И СтоимостьРесурсов.ЭтоУчтенный = СредниеПоРесурсам.ЭтоУчтенный
	|			И СтоимостьРесурсов.ЭтоНеучтенный = СредниеПоРесурсам.ЭтоНеучтенный
	|			И СтоимостьРесурсов.ЭтоОборудование = СредниеПоРесурсам.ЭтоОборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.КодРесурса КАК СТРОКА(20)),
	|	СтоимостьРесурсов.ВидРесурса,
	|	СтоимостьРесурсов.Ресурс,
	|	ВЫРАЗИТЬ(СтоимостьРесурсов.НаименованиеРесурса КАК СТРОКА(500)),
	|	СтоимостьРесурсов.ЕдиницаИзмеренияРесурса,
	|	СтоимостьРесурсов.ЭтоУчтенный,
	|	СтоимостьРесурсов.ЭтоНеучтенный,
	|	СтоимостьРесурсов.ЭтоОборудование,
	|	СтоимостьРесурсов.Картинка,
	|	СтоимостьРесурсов.ВариантОтклонения,
	|	СтоимостьРесурсов.ВариантПревышения,
	|	СтоимостьРесурсов.КомментарийКФайлу,
	|	СтоимостьРесурсов.НеИзменятьЦены
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ресурсы.Ресурс,
	|	Ресурсы.КодРесурса,
	|	Ресурсы.ВидРесурса,
	|	Ресурсы.НаименованиеРесурса,
	|	Ресурсы.ЕдиницаИзмеренияРесурса,
	|	Ресурсы.ЭтоУчтенный,
	|	Ресурсы.ЭтоНеучтенный,
	|	Ресурсы.ЭтоОборудование,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаБазиснаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаБазисная
	|	КОНЕЦ КАК ЦенаБазисная,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаЗМБазиснаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаЗМБазисная
	|	КОНЕЦ КАК ЦенаЗМБазисная,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаТекущаяЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаТекущая
	|	КОНЕЦ КАК ЦенаТекущая,
	|	ВЫБОР
	|		КОГДА Ресурсы.ЦенаТекущаяЗМЕстьОтклонение > 0
	|			ТОГДА 0
	|		ИНАЧЕ Ресурсы.ЦенаТекущаяЗМ
	|	КОНЕЦ КАК ЦенаТекущаяЗМ,
	|	Ресурсы.ЦенаБазиснаяЕстьОтклонение,
	|	Ресурсы.ЦенаЗМБазиснаяЕстьОтклонение,
	|	Ресурсы.ЦенаТекущаяЕстьОтклонение,
	|	Ресурсы.ЦенаТекущаяЗМЕстьОтклонение,
	|	Ресурсы.Количество,
	|	Ресурсы.РасходПоНорме,
	|	Ресурсы.РасходПоФакту,
	|	Ресурсы.СтоимостьБазисная,
	|	Ресурсы.СтоимостьЗМБазисная,
	|	Ресурсы.СтоимостьТекущая,
	|	Ресурсы.СтоимостьТекущаяЗМ,
	|	Ресурсы.Картинка,
	|	Ресурсы.ВариантОтклонения,
	|	Ресурсы.ВариантПревышения,
	|	Ресурсы.КомментарийКФайлу,
	|	Ресурсы.НеИзменятьЦены
	|ИЗ
	|	Ресурсы КАК Ресурсы";
	
	Запрос.УстановитьПараметр("ТаблСтоимРес", ТаблСтоимРес);
	
	Возврат Запрос.Выполнить().Выгрузить();    	
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеФункции

// Определяет сооьветствие источник-приемник для начислений.
//
Функция ОпределитьСоотвИстПрием(Источник,Приемник)
	
	ПрямоеНачисление = Ложь;
	Если Источник.ОснЗарплата = Приемник.ОснЗарплата
		И Источник.ЭксплМашин = Приемник.ЭксплМашин
		И Источник.ЗарплМашинистов = Приемник.ЗарплМашинистов
		И Источник.СтоимМатериалов = Приемник.СтоимМатериалов Тогда
		ПрямоеНачисление = Истина;	
	КонецЕсли;
	
	Возврат ПрямоеНачисление;
	
КонецФункции

// Формирует таблицу со значениями составляющих прямых затрат выбранных по формуле.
//
Функция  СобратьИтогиПоФормуле(ЛимитЗатрата, ВидРаботИсточник, ИтогиГлав, ИтогиПоВР)
	СтрокаДействий = "+-";
	Табл = Новый ТаблицаЗначений;
	Табл.Колонки.Добавить("ПрямЗатраты",        Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ОснЗарплата",    Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ЭксплМашин",     Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ЗарплМашин", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("СтоимМатер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("Оборуд", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ЗатратыТрудаРабочих", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,2)));
	Табл.Колонки.Добавить("ЗатратыТрудаМашин", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,2)));
	Табл.Колонки.Добавить("ТекПрямЗатраты",        Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ТекОснЗарплата",    Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ТекЭксплМашин",     Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ТекЗарплМашин", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ТекСтоимМатер", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	Табл.Колонки.Добавить("ТекОборуд", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6)));
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора2 = Новый Структура;
	СтруктураОтбора.Вставить("ВидРабот", ВидРаботИсточник);
	ФормулаЛЗ = СокрЛП(ЛимитЗатрата.ОтФормулы);
	Если ФормулаЛЗ = Неопределено Тогда
		Возврат Табл;
	КонецЕсли;
	ФормулаЛЗ = СтрЗаменить(ФормулаЛЗ," ","");
	ПервыйИтог = Истина;
	ДействиеФормулы = "";
	Пока  СтрДлина(ФормулаЛЗ) <> 0  Цикл
		Поз = 0;
		Для Сч = 1 По СтрДлина(ФормулаЛЗ) Цикл
			ТекСимв = Сред(ФормулаЛЗ,сч,1);
			Если Найти(СтрокаДействий,ТекСимв) = 0 Тогда Продолжить;
			Иначе
				Поз = Сч;
				Прервать;
			КонецЕсли;	
		КонецЦикла;		
		Если Поз = 0 Тогда
			Итог = ФормулаЛЗ;
			ФормулаЛЗ = "";
		Иначе
			Итог = Сред(ФормулаЛЗ,1,Поз - 1);
			ДействиеФормулы = Сред(ФормулаЛЗ, Поз, 1);
			ФормулаЛЗ = Сред(ФормулаЛЗ, Поз + 1);
		КонецЕсли;
		Если Сред(Итог,1,1) = "И" Тогда
			ИтогиПоГлавам = Справочники.СМ_ИтогиПоГлавам;
			ТекущийИтог = ИтогиПоГлавам.НайтиПоРеквизиту("Идентификатор",Итог);
			Если Не  ТекущийИтог = Неопределено Тогда
				ТекГлава = ТекущийИтог.ГлаваССРС;
				СтруктураОтбора.Вставить("Глава",ТекГлава);
				СтруктураОтбора.Вставить("Итог",ТекущийИтог);
				МассивСтрок = ИтогиГлав.НайтиСтроки(СтруктураОтбора);
			КонецЕсли;
		ИначеЕсли Сред(Итог,1,1) = "Л" Тогда
			ЛимЗ = Справочники.СМ_ЛимитированныеЗатраты;
			ТекущийЛЗ = ЛимЗ.НайтиПоРеквизиту("Идентификатор",Итог);
			Если Не  ТекущийЛЗ = Неопределено Тогда
				СтруктураОтбора.Вставить("Итог", ТекущийЛЗ);
				СтруктураОтбора.Вставить("Глава",ТекущийЛЗ.ГлаваССРС);
				МассивСтрок = ИтогиГлав.НайтиСтроки(СтруктураОтбора);
			КонецЕсли;
		КонецЕсли;
		// Все складывается в таблицу.
		Если МассивСтрок.Количество() > 0 Тогда 
			НайденнаяСтрока = МассивСтрок[0];
			Если Табл.Количество() = 0 Тогда
				НоваяСтрока = Табл.Добавить();
			Иначе
				НоваяСтрока = Табл.Получить(0);
			КонецЕсли;
			Если ПервыйИтог = Истина Тогда
				Действие =  "+" ;
				ПервыйИтог = Ложь;
			Иначе
				Действие = ДействиеФормулы;
			КонецЕсли;	
			
			
			Если Сред(Итог,1,1) = "И"  Тогда
				Если ВидРаботИсточник = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы  Тогда
					Если ЛимитЗатрата.ИсточникСтроитРаботПЗ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + ?(Действие = "-",-НайденнаяСтрока.ТекПрямзатраты,НайденнаяСтрока.ТекПрямзатраты); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + ?(Действие = "-",-НайденнаяСтрока.Прямзатраты,НайденнаяСтрока.Прямзатраты); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникСтроитРаботОЗ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекОснЗарплата + ?(Действие = "-",-НайденнаяСтрока.ТекОснЗарплата,НайденнаяСтрока.ТекОснЗарплата); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ОснЗарплата + ?(Действие = "-",-НайденнаяСтрока.ОснЗарплата,НайденнаяСтрока.ОснЗарплата); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникСтроитРаботЭМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекЭксплМашин + ?(Действие = "-",-НайденнаяСтрока.ТекЭксплМашин,НайденнаяСтрока.ТекЭксплМашин); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ЭксплМашин + ?(Действие = "-",-НайденнаяСтрока.ЭксплМашин,НайденнаяСтрока.ЭксплМашин); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникСтроитРаботЗМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекЗарплМашин + ?(Действие = "-",-НайденнаяСтрока.ТекЗарплМашин,НайденнаяСтрока.ТекЗарплМашин); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ЗарплМашин + ?(Действие = "-",-НайденнаяСтрока.ЗарплМашин,НайденнаяСтрока.ЗарплМашин); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникСтроитРаботСМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекСтоимМатер + ?(Действие = "-",-НайденнаяСтрока.ТекСтоимМатер,НайденнаяСтрока.ТекСтоимМатер); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.СтоимМатер + ?(Действие = "-",-НайденнаяСтрока.СтоимМатер,НайденнаяСтрока.СтоимМатер); 
					КонецЕсли;
				КонецЕсли;
				Если ВидРаботИсточник = Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы  Тогда
					Если ЛимитЗатрата.ИсточникМонтажРаботПЗ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + ?(Действие = "-",-НайденнаяСтрока.ТекПрямзатраты,НайденнаяСтрока.ТекПрямзатраты); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + ?(Действие = "-",-НайденнаяСтрока.Прямзатраты,НайденнаяСтрока.Прямзатраты); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникМонтажРаботОЗ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекОснЗарплата + ?(Действие = "-",-НайденнаяСтрока.ТекОснЗарплата,НайденнаяСтрока.ТекОснЗарплата); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ОснЗарплата + ?(Действие = "-",-НайденнаяСтрока.ОснЗарплата,НайденнаяСтрока.ОснЗарплата); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникМонтажРаботЭМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекЭксплМашин + ?(Действие = "-",-НайденнаяСтрока.ТекЭксплМашин,НайденнаяСтрока.ТекЭксплМашин); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ЭксплМашин + ?(Действие = "-",-НайденнаяСтрока.ЭксплМашин,НайденнаяСтрока.ЭксплМашин); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникМонтажРаботЗМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекЗарплМашин + ?(Действие = "-",-НайденнаяСтрока.ТекЗарплМашин,НайденнаяСтрока.ТекЗарплМашин); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ЗарплМашин + ?(Действие = "-",-НайденнаяСтрока.ЗарплМашин,НайденнаяСтрока.ЗарплМашин); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникМонтажРаботСМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекСтоимМатер + ?(Действие = "-",-НайденнаяСтрока.ТекСтоимМатер,НайденнаяСтрока.ТекСтоимМатер); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.СтоимМатер + ?(Действие = "-",-НайденнаяСтрока.СтоимМатер,НайденнаяСтрока.СтоимМатер); 
					КонецЕсли;
				КонецЕсли;
				Если ВидРаботИсточник = Перечисления.СМ_ВидыЗатратСмета.ПрочиеРаботы  Тогда
					Если ЛимитЗатрата.ИсточникПрочихРаботПЗ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + ?(Действие = "-",-НайденнаяСтрока.ТекПрямзатраты,НайденнаяСтрока.ТекПрямзатраты); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + ?(Действие = "-",-НайденнаяСтрока.Прямзатраты,НайденнаяСтрока.Прямзатраты); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникПрочихРаботОЗ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекОснЗарплата + ?(Действие = "-",-НайденнаяСтрока.ТекОснЗарплата,НайденнаяСтрока.ТекОснЗарплата); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ОснЗарплата + ?(Действие = "-",-НайденнаяСтрока.ОснЗарплата,НайденнаяСтрока.ОснЗарплата); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникПрочихРаботЭМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекЭксплМашин + ?(Действие = "-",-НайденнаяСтрока.ТекЭксплМашин,НайденнаяСтрока.ТекЭксплМашин); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ЭксплМашин + ?(Действие = "-",-НайденнаяСтрока.ЭксплМашин,НайденнаяСтрока.ЭксплМашин); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникПрочихРаботЗМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекЗарплМашин + ?(Действие = "-",-НайденнаяСтрока.ТекЗарплМашин,НайденнаяСтрока.ТекЗарплМашин); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.ЗарплМашин + ?(Действие = "-",-НайденнаяСтрока.ЗарплМашин,НайденнаяСтрока.ЗарплМашин); 
					КонецЕсли;
					Если ЛимитЗатрата.ИсточникПрочихРаботСМ Тогда
						НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + НоваяСтрока.ТекСтоимМатер + ?(Действие = "-",-НайденнаяСтрока.ТекСтоимМатер,НайденнаяСтрока.ТекСтоимМатер); 
						НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + НоваяСтрока.СтоимМатер + ?(Действие = "-",-НайденнаяСтрока.СтоимМатер,НайденнаяСтрока.СтоимМатер); 
					КонецЕсли;
				КонецЕсли;
			Иначе
				НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + ?(Действие = "-",-НайденнаяСтрока.ТекПрямзатраты,НайденнаяСтрока.ТекПрямзатраты); 
				НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + ?(Действие = "-",-НайденнаяСтрока.Прямзатраты,НайденнаяСтрока.Прямзатраты); 
			КонецЕсли;
			НоваяСтрока.ОснЗарплата = НоваяСтрока.ОснЗарплата + ?(Действие = "-",-НайденнаяСтрока.ОснЗарплата,НайденнаяСтрока.ОснЗарплата);  
			НоваяСтрока.ЭксплМашин  = НоваяСтрока.ЭксплМашин + ?(Действие = "-",-НайденнаяСтрока.ЭксплМашин,НайденнаяСтрока.ЭксплМашин);  
			НоваяСтрока.ЗарплМашин  = НоваяСтрока.ЗарплМашин + ?(Действие = "-",-НайденнаяСтрока.ЗарплМашин,НайденнаяСтрока.ЗарплМашин); 
			НоваяСтрока.СтоимМатер  = НоваяСтрока.СтоимМатер + ?(Действие = "-",-НайденнаяСтрока.СтоимМатер,НайденнаяСтрока.СтоимМатер);  
			НоваяСтрока.Оборуд      = НоваяСтрока.Оборуд + ?(Действие = "-",-НайденнаяСтрока.Оборуд,НайденнаяСтрока.Оборуд);  
			НоваяСтрока.ТекОснЗарплата = НоваяСтрока.ТекОснЗарплата + ?(Действие = "-",-НайденнаяСтрока.ТекОснЗарплата,НайденнаяСтрока.ТекОснЗарплата);  
			НоваяСтрока.ТекЭксплМашин  = НоваяСтрока.ТекЭксплМашин + ?(Действие = "-",-НайденнаяСтрока.ТекЭксплМашин,НайденнаяСтрока.ТекЭксплМашин);  
			НоваяСтрока.ТекЗарплМашин  = НоваяСтрока.ТекЗарплМашин + ?(Действие = "-",-НайденнаяСтрока.ТекЗарплМашин,НайденнаяСтрока.ТекЗарплМашин); 
			НоваяСтрока.ТекСтоимМатер  = НоваяСтрока.ТекСтоимМатер + ?(Действие = "-",-НайденнаяСтрока.ТекСтоимМатер,НайденнаяСтрока.ТекСтоимМатер);  
			НоваяСтрока.ТекОборуд      = НоваяСтрока.ТекОборуд + ?(Действие = "-",-НайденнаяСтрока.ТекОборуд,НайденнаяСтрока.ТекОборуд);  
			НоваяСтрока.ЗатратыТрудаРабочих      = НоваяСтрока.ЗатратыТрудаРабочих + ?(Действие = "-",-НайденнаяСтрока.ЗатратыТрудаРабочих,НайденнаяСтрока.ЗатратыТрудаРабочих);  
			НоваяСтрока.ЗатратыТрудаМашин      = НоваяСтрока.ЗатратыТрудаМашин + ?(Действие = "-",-НайденнаяСтрока.ЗатратыТрудаМашин,НайденнаяСтрока.ЗатратыТрудаМашин);  
		КонецЕсли;		
		
	КонецЦикла;
	Возврат Табл;
	
	
КонецФункции

// Блок процедур расчета лимитированных затрат, заданных в документах
// СМ_ОбъектнаяСмета, СМ_ЛокальнаяСмета и АктВыполненных работ.
// Параметр Ссылка на докмент.
//
Функция СобратьИтогиПоВидамРаботСС(Ссылка)
	// Отдельно собрать итоги по видам работ ОС как сумму локальных. 
	ТипСоставляющей = Новый  ОписаниеТипов("Число");
	КолонкиСумм 	= "ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер";
	
	ИтогиПоВР = Новый ТаблицаЗначений;
	ИтогиПоВР.Колонки.Добавить("Итог");
	ИтогиПоВР.Колонки.Добавить("ВидРабот");
	ИтогиПоВР.Колонки.Добавить("ЛокальнаяСмета");
	ИтогиПоВР.Колонки.Добавить("ПрямЗатраты",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ОснЗарплата",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ЭксплМашин",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ЗарплМашин",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("СтоимМатер",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("Оборуд",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ВозвратМатер",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ЗатратыТрудаРабочих",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ЗатратыТрудаМашин",ТипСоставляющей);
	
	ИтогиПоВР.Колонки.Добавить("ТекПрямЗатраты",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ТекОснЗарплата",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ТекЭксплМашин",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ТекЗарплМашин",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ТекСтоимМатер",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ТекОборуд",ТипСоставляющей);
	ИтогиПоВР.Колонки.Добавить("ТекВозвратМатер",ТипСоставляющей);
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИтогиПоВидамРабот.Итог,
	|	ИтогиПоВидамРабот.Смета КАК ЛокальнаяСмета,
	|	СУММА(ИтогиПоВидамРабот.ПрямЗатраты) КАК ПрямЗатраты,
	|	СУММА(ИтогиПоВидамРабот.ОснЗарплата) КАК ОснЗарплата,
	|	СУММА(ИтогиПоВидамРабот.ЭксплМашин) КАК ЭксплМашин,
	|	СУММА(ИтогиПоВидамРабот.ЗарплМашин) КАК ЗарплМашин,
	|	СУММА(ИтогиПоВидамРабот.СтоимМатер) КАК СтоимМатер,
	|	СУММА(ИтогиПоВидамРабот.Оборуд) КАК Оборуд,
	|	СУММА(ИтогиПоВидамРабот.ВозвратМатер) КАК ВозвратМатер,
	|	СУММА(ИтогиПоВидамРабот.ЗатратыТрудаРабочих) КАК ЗатратыТрудаРабочих,
	|	СУММА(ИтогиПоВидамРабот.ЗатратыТрудаМашин) КАК ЗатратыТрудаМашин,
	|	СУММА(ИтогиПоВидамРабот.ТекПрямЗатраты) КАК ТекПрямЗатраты,
	|	СУММА(ИтогиПоВидамРабот.ТекОснЗарплата) КАК ТекОснЗарплата,
	|	СУММА(ИтогиПоВидамРабот.ТекЭксплМашин) КАК ТекЭксплМашин,
	|	СУММА(ИтогиПоВидамРабот.ТекЗарплМашин) КАК ТекЗарплМашин,
	|	СУММА(ИтогиПоВидамРабот.ТекСтоимМатер) КАК ТекСтоимМатер,
	|	СУММА(ИтогиПоВидамРабот.ТекОборуд) КАК ТекОборуд,
	|	СУММА(ИтогиПоВидамРабот.ТекВозвратМатер) КАК ТекВозвратМатер
	
	|ИЗ
	|	РегистрСведений.СМ_ИтогиПоВидамРабот КАК ИтогиПоВидамРабот
	|ГДЕ
	|	ИтогиПоВидамРабот.Смета В (&Смета)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтогиПоВидамРабот.Итог,
	|	ИтогиПоВидамРабот.Смета";
	
	ТаблСмет = Ссылка.Сметы.Выгрузить(,"Смета,Расчет");
	ТаблОбъектов = Ссылка.Сметы.Выгрузить(,"Смета,КоличествоОбъектов,Расчет");
	Для Каждого ТекСмета Из ТаблСмет Цикл
		Если  НЕ ТекСмета.Расчет Тогда
			Продолжить;
		КонецЕсли;	
		Если ТипЗнч(ТекСмета.Смета)= Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
			// Для ОС суммарное значение.
			ТаблСмет1 = ТекСмета.Смета.ЛокальныеСметы.Выгрузить(,"ЛокальнаяСмета");
			Запрос.УстановитьПараметр("Смета", ТаблСмет1);
		Иначе
			Запрос.УстановитьПараметр("Смета", ТекСмета.Смета);
		КонецЕсли;
		ИтогиПоВРОС = Запрос.Выполнить().Выгрузить();
		ИтогиПоВРОС.Свернуть("Итог",КолонкиСумм);
		
		Отбор1 = Новый Структура;
		Отбор1.Вставить("Смета",ТекСмета.Смета);
		СтрокиОтбора = ТаблОбъектов.НайтиСтроки(Отбор1);
		КоличествоОбъектов = 1;
		Если СтрокиОтбора.Количество()<> 0 Тогда
			ТекущаяСтрока = СтрокиОтбора[0];
			КоличествоОбъектов = ?(ТекущаяСтрока.КоличествоОбъектов = 0,1,ТекущаяСтрока.КоличествоОбъектов);
		КонецЕсли;	
		Для каждого ИтогОС Из ИтогиПоВРОС Цикл
			НоваяСтрока = ИтогиПоВР.Добавить();
			НоваяСтрока.ЛокальнаяСмета = ТекСмета.Смета.Ссылка; 
			НоваяСтрока.Итог = ИтогОС.Итог; 
			НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + ИтогОС.ПрямЗатраты * КоличествоОбъектов;
			НоваяСтрока.ОснЗарплата = НоваяСтрока.ОснЗарплата + ИтогОС.ОснЗарплата * КоличествоОбъектов;
			НоваяСтрока.ЭксплМашин = НоваяСтрока.ЭксплМашин + ИтогОС.ЭксплМашин * КоличествоОбъектов;
			НоваяСтрока.ЗарплМашин = НоваяСтрока.ЗарплМашин + ИтогОС.ЗарплМашин * КоличествоОбъектов;
			НоваяСтрока.СтоимМатер = НоваяСтрока.СтоимМатер + ИтогОС.СтоимМатер * КоличествоОбъектов;
			НоваяСтрока.Оборуд = НоваяСтрока.Оборуд + ИтогОС.Оборуд * КоличествоОбъектов;
			НоваяСтрока.ВозвратМатер = НоваяСтрока.ВозвратМатер + ИтогОС.ВозвратМатер * КоличествоОбъектов;
			НоваяСтрока.ЗатратыТрудаРабочих = НоваяСтрока.ЗатратыТрудаРабочих + ИтогОС.ЗатратыТрудаРабочих * КоличествоОбъектов;
			НоваяСтрока.ЗатратыТрудаМашин = НоваяСтрока.ЗатратыТрудаМашин + ИтогОС.ЗатратыТрудаМашин * КоличествоОбъектов;
			НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + ИтогОС.ТекПрямЗатраты * КоличествоОбъектов;
			НоваяСтрока.ТекОснЗарплата = НоваяСтрока.ТекОснЗарплата + ИтогОС.ТекОснЗарплата * КоличествоОбъектов;
			НоваяСтрока.ТекЭксплМашин = НоваяСтрока.ТекЭксплМашин + ИтогОС.ТекЭксплМашин * КоличествоОбъектов;
			НоваяСтрока.ТекЗарплМашин = НоваяСтрока.ТекЗарплМашин + ИтогОС.ТекЗарплМашин * КоличествоОбъектов;
			НоваяСтрока.ТекСтоимМатер = НоваяСтрока.ТекСтоимМатер + ИтогОС.ТекСтоимМатер * КоличествоОбъектов;
			НоваяСтрока.ТекОборуд = НоваяСтрока.ТекОборуд + ИтогОС.ТекОборуд * КоличествоОбъектов;
			НоваяСтрока.ТекВозвратМатер = НоваяСтрока.ТекВозвратМатер + ИтогОС.ТекВозвратМатер * КоличествоОбъектов;
		КонецЦикла;
	КонецЦикла;
	
	ИтогиПоВР.Колонки.Добавить("Смета");
	ЗначенияКолонки = Новый Массив;
	ЗначенияКолонки.Добавить(Ссылка);
	ИтогиПоВР.ЗагрузитьКолонку(ЗначенияКолонки,"Смета");
	Возврат(ИтогиПоВР);
КонецФункции	

// Собирает итоги по видам работ для документа.
// параметр Ссылка.
//
Функция СобратьИтогиПоВидамРабот(Ссылка)
	
	КолонкиСумм 	= "ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер";
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета")  Тогда
			ТаблСмет = Ссылка.ЛокальныеСметы.Выгрузить(,"ЛокальнаяСмета");
		
		// Отдельно собрать итоги по видам работ ОС как сумму локальных. 
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ИтогиПоВидамРабот.Итог,
		|	ИтогиПоВидамРабот.Смета КАК ЛокальнаяСмета,
		|	СУММА(ИтогиПоВидамРабот.ПрямЗатраты) КАК ПрямЗатраты,
		|	СУММА(ИтогиПоВидамРабот.ОснЗарплата) КАК ОснЗарплата,
		|	СУММА(ИтогиПоВидамРабот.ЭксплМашин) КАК ЭксплМашин,
		|	СУММА(ИтогиПоВидамРабот.ЗарплМашин) КАК ЗарплМашин,
		|	СУММА(ИтогиПоВидамРабот.СтоимМатер) КАК СтоимМатер,
		|	СУММА(ИтогиПоВидамРабот.Оборуд) КАК Оборуд,
		|	СУММА(ИтогиПоВидамРабот.ВозвратМатер) КАК ВозвратМатер,
		|	СУММА(ИтогиПоВидамРабот.ЗатратыТрудаРабочих) КАК ЗатратыТрудаРабочих,
		|	СУММА(ИтогиПоВидамРабот.ЗатратыТрудаМашин) КАК ЗатратыТрудаМашин,
		|	СУММА(ИтогиПоВидамРабот.ТекПрямЗатраты) КАК ТекПрямЗатраты,
		|	СУММА(ИтогиПоВидамРабот.ТекОснЗарплата) КАК ТекОснЗарплата,
		|	СУММА(ИтогиПоВидамРабот.ТекЭксплМашин) КАК ТекЭксплМашин,
		|	СУММА(ИтогиПоВидамРабот.ТекЗарплМашин) КАК ТекЗарплМашин,
		|	СУММА(ИтогиПоВидамРабот.ТекСтоимМатер) КАК ТекСтоимМатер,
		|	СУММА(ИтогиПоВидамРабот.ТекОборуд) КАК ТекОборуд,
		|	СУММА(ИтогиПоВидамРабот.ТекВозвратМатер) КАК ТекВозвратМатер
		
		|ИЗ
		|	РегистрСведений.СМ_ИтогиПоВидамРабот КАК ИтогиПоВидамРабот
		|ГДЕ
		|	ИтогиПоВидамРабот.Смета В (&Смета)
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтогиПоВидамРабот.Итог,
		|	ИтогиПоВидамРабот.Смета";
		
		Запрос.УстановитьПараметр("Смета", ТаблСмет);
		
		ИтогиПоВР = Запрос.Выполнить().Выгрузить();
		ИтогиПоВР.Свернуть("ЛокальнаяСмета,Итог",КолонкиСумм);
		Если ИтогиПоВР.Колонки.Найти("ВидРабот") = Неопределено Тогда 
			ИтогиПоВР.Колонки.Добавить("ВидРабот");
		КонецЕсли;
		ИтогиПоВР.Колонки.Добавить("Смета");
		ЗначенияКолонки = Новый Массив;
		ЗначенияКолонки.Добавить(Ссылка);
		ИтогиПоВР.ЗагрузитьКолонку(ЗначенияКолонки,"Смета");
		
	Иначе
		// Локальные сметы и акты.
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИтогиПоВидамРабот.Итог,
		               |	ИтогиПоВидамРабот.Смета,
		               |	ИтогиПоВидамРабот.ПрямЗатраты,
		               |	ИтогиПоВидамРабот.ОснЗарплата,
		               |	ИтогиПоВидамРабот.ЭксплМашин,
		               |	ИтогиПоВидамРабот.ЗарплМашин,
		               |	ИтогиПоВидамРабот.СтоимМатер,
		               |	ИтогиПоВидамРабот.Оборуд,
		               |	ИтогиПоВидамРабот.ВозвратМатер,
		               |	ИтогиПоВидамРабот.ЗатратыТрудаРабочих,
		               |	ИтогиПоВидамРабот.ЗатратыТрудаМашин,
		               |	ИтогиПоВидамРабот.ТекПрямЗатраты,
		               |	ИтогиПоВидамРабот.ТекОснЗарплата,
		               |	ИтогиПоВидамРабот.ТекЭксплМашин,
		               |	ИтогиПоВидамРабот.ТекЗарплМашин,
		               |	ИтогиПоВидамРабот.ТекСтоимМатер,
		               |	ИтогиПоВидамРабот.ТекОборуд,
		               |	ИтогиПоВидамРабот.ТекВозвратМатер
		               |ИЗ
		               |	РегистрСведений.СМ_ИтогиПоВидамРабот КАК ИтогиПоВидамРабот
		               |ГДЕ
		               |	ИтогиПоВидамРабот.Смета = &Смета";
		
		Запрос.УстановитьПараметр("Смета", Ссылка);
		
		ИтогиПоВР = Запрос.Выполнить().Выгрузить();
		
		// Судариков - избавляемся от чтения РС
		Если ИтогиПоВР.Колонки.Найти("Смета") = Неопределено Тогда
		    ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6));
		
			ИтогиПоВР = Новый ТаблицаЗначений();
			ИтогиПоВР.Колонки.Добавить("Смета");
			ИтогиПоВР.Колонки.Добавить("Раздел");
			ИтогиПоВР.Колонки.Добавить("Итог");
			ИтогиПоВР.Колонки.Добавить("ВозвратМатер",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ЗарплМашин",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ЗатратыТрудаМашин",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ЗатратыТрудаРабочих",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("Оборуд",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ОснЗарплата",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ПрямЗатраты",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("СтоимМатер",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ТекВозвратМатер",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ТекЗарплМашин",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ТекОборуд",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ТекОснЗарплата",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ТекПрямЗатраты",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ТекСтоимМатер",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ТекЭксплМашин",ОписаниеТипаЧисло);
			ИтогиПоВР.Колонки.Добавить("ЭксплМашин",ОписаниеТипаЧисло);
		КонецЕсли;

		
		//НаборЗаписей = РегистрыСведений.СМ_ИтогиПоВидамРабот.СоздатьНаборЗаписей();
		//НаборЗаписей.Отбор.Смета.Установить(Ссылка);
		//НаборЗаписей.Прочитать();
		
		//ИтогиПоВР = НаборЗаписей.Выгрузить();
		Если ИтогиПоВР.Колонки.Найти("ВидРабот") = Неопределено Тогда 
			ИтогиПоВР.Колонки.Добавить("ВидРабот");
		КонецЕсли;	
	КонецЕсли;
	Возврат(ИтогиПоВР);
КонецФункции	

// Собирает итоги по главам из регистров сведений работ для документа.
// параметр Ссылка.
//
Функция СобратьИтогиПоГлавам(Ссылка)
	
	//Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
	//	НаборЗаписей2 = РегистрыСведений.СМ_ИтогиПоГлавамОС.СоздатьНаборЗаписей();
	//ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
	//	НаборЗаписей2 = РегистрыСведений.СМ_ИтогиПоГлавамСС.СоздатьНаборЗаписей();
	//Иначе	
	//	НаборЗаписей2 = РегистрыСведений.СМ_ИтогиПоГлавам.СоздатьНаборЗаписей();
	//КонецЕсли;
	//НаборЗаписей2.Отбор.Смета.Установить(Ссылка);
	//НаборЗаписей2.Прочитать();
	//ИтогиПоГлавам = НаборЗаписей2.Выгрузить();
	//ИтогиПоГлавам.Очистить();
	
	// Судариков - избавляемся от чтения РС
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(20,6));
	
	ИтогиПоГлавам = Новый ТаблицаЗначений();
	ИтогиПоГлавам.Колонки.Добавить("Смета");
	ИтогиПоГлавам.Колонки.Добавить("Глава");
	ИтогиПоГлавам.Колонки.Добавить("Итог");
	ИтогиПоГлавам.Колонки.Добавить("ВидРабот");
	ИтогиПоГлавам.Колонки.Добавить("ВозвратМатер",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ЗарплМашин",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ЗатратыТрудаМашин",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ЗатратыТрудаРабочих",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("Оборуд",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ОснЗарплата",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ПрямЗатраты",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("СтоимМатер",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ТекВозвратМатер",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ТекЗарплМашин",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ТекОборуд",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ТекОснЗарплата",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ТекПрямЗатраты",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ТекСтоимМатер",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ТекЭксплМашин",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("ЭксплМашин",ОписаниеТипаЧисло);
	
	ИтогиПоГлавам.Колонки.Добавить("ПорНомерИтога",ОписаниеТипаЧисло);
	ИтогиПоГлавам.Колонки.Добавить("Накопительный");
	ИтогиПоГлавам.Колонки.Добавить("КодГлавы");
	
	Возврат(ИтогиПоГлавам);
	
КонецФункции	

// Процедура укрупнения видов работ на общестроительные, монтажные, оборудование, прочие.
//
Процедура УкрупнениеИтоговПоВидамРабот(ИтогиПоВР,Ссылка)	
	Для Каждого СтрокаИтогиПоВР Из ИтогиПоВР Цикл
		ТекВид = СтрокаИтогиПоВР.Итог;
		Если ТекВид = Справочники.СМ_ИтогиСметыПоВидамРабот.СтроитРаб
			ИЛИ ТекВид = Справочники.СМ_ИтогиСметыПоВидамРабот.Металлоконстр
			ИЛИ ТекВид = Справочники.СМ_ИтогиСметыПоВидамРабот.СантехнРаб
			ИЛИ ТекВид = Справочники.СМ_ИтогиСметыПоВидамРабот.БуровзрывнРаб
			ИЛИ ТекВид = Справочники.СМ_ИтогиСметыПоВидамРабот.ГорнопрохРаб Тогда
			СтрокаИтогиПоВР.ВидРабот = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;
		ИначеЕсли ТекВид = Справочники.СМ_ИтогиСметыПоВидамРабот.МонтажнРаб Тогда
			СтрокаИтогиПоВР.ВидРабот = Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы;
	 	ИначеЕсли ТекВид = Справочники.СМ_ИтогиСметыПоВидамРабот.Оборуд Тогда
			СтрокаИтогиПоВР.ВидРабот = Перечисления.СМ_ВидыЗатратСмета.Оборудование;	
		ИначеЕсли ТекВид = Справочники.СМ_ИтогиСметыПоВидамРабот.ПрочРаб Тогда
			СтрокаИтогиПоВР.ВидРабот = Перечисления.СМ_ВидыЗатратСмета.ПрочиеРаботы;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Неизвестный итог по видам работ'"));
		КонецЕсли;
	КонецЦикла;
	
	СписокКолонок = "ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер";
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		ИтогиПоВР.Свернуть("Смета,ЛокальнаяСмета,ВидРабот",СписокКолонок);
	Иначе
		ИтогиПоВР.Свернуть("Смета,ВидРабот",СписокКолонок);
	КонецЕсли;
КонецПроцедуры

// Формирование таблицы для расчета лимитированных затрат Объектных смет.
//
Процедура ФормированиеТаблицыИтогиПоГлавамОС(ИтогиПоГлавам, ИтогиПоВР,Ссылка,СписокВидыЗатрат)
	СписокСвойств 	= "ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер";
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИтогиПоГлавам.Ссылка КАК Итог,
	|	ИтогиПоГлавам.Наименование,
	|	ИтогиПоГлавам.ГлаваССРС,
	|	ИтогиПоГлавам.Накопительный,
	|	ИтогиПоГлавам.ПорядковыйНомер
	|ИЗ
	|	Справочник.СМ_ИтогиПоГлавам КАК ИтогиПоГлавам
	|ГДЕ
	|	ИтогиПоГлавам.ПометкаУдаления = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	ИтогиПоГлавам.ГлаваССРС.НомерГлавы";	
	
	ВыборкаГлав = Запрос.Выполнить().Выгрузить();
	ТипСоставляющей = Новый  ОписаниеТипов("Число");
	СоставляющиеПЗ = Новый ТаблицаЗначений;
	СоставляющиеПЗ.Колонки.Добавить("ВидЗатрат");
	СоставляющиеПЗ.Колонки.Добавить("ПрямЗатраты",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ОснЗарплата",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ЭксплМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ЗарплМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("СтоимМатер",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("Оборуд",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ЗатратыТрудаРабочих",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ЗатратыТрудаМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ВозвратМатер",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекПрямЗатраты",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекОснЗарплата",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекЭксплМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекЗарплМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекСтоимМатер",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекОборуд",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекВозвратМатер",ТипСоставляющей);
	
	
	НомерГлавыЛС = 2;	
	СписокСмет = Ссылка.ЛокальныеСметы.Выгрузить();
	Для Каждого  ТекВыборка Из ВыборкаГлав Цикл
		
		Для Каждого ТекВидЗатрат Из СписокВидыЗатрат Цикл
			НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
			НоваяСтрока.Смета       	= Ссылка;
			НоваяСтрока.Глава      	 	= ТекВыборка.ГлаваССРС;
			НоваяСтрока.Итог        	= ТекВыборка.Итог;
			НоваяСтрока.ВидРабот    	= ТекВидЗатрат;
			НоваяСтрока.Накопительный 	= ТекВыборка.Накопительный;
			НоваяСтрока.ПорНомерИтога 	= ТекВыборка.ПорядковыйНомер;
			НоваяСтрока.КодГлавы		= ТекВыборка.ГлаваССРС.Код;
			ОбнулениеСоставляющих(НоваяСтрока);
			ИтогПоиска = ТекВыборка.Итог;
			Если ТекВыборка.ГлаваССРС.НомерГлавы = НомерГлавыЛС Тогда
				Если ТекВыборка.Накопительный = Ложь Тогда
					Для каждого СметаИзСписка Из СписокСмет Цикл
						Если СметаИзСписка.Расчет = Ложь Тогда
							Продолжить;
						КонецЕсли;
						НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
						НоваяСтрока.Итог  			= СметаИзСписка.ЛокальнаяСмета.Ссылка;
						НоваяСтрока.Смета       	= Ссылка;
						НоваяСтрока.Глава      	 	= ТекВыборка.ГлаваССРС;
						НоваяСтрока.ВидРабот    	= ТекВидЗатрат;
						НоваяСтрока.Накопительный 	= ТекВыборка.Накопительный;
						НоваяСтрока.ПорНомерИтога 	= ТекВыборка.ПорядковыйНомер;
						НоваяСтрока.КодГлавы		= ТекВыборка.ГлаваССРС.Код;
						СтруктураОтбора = Новый Структура;
						СтруктураОтбора.Вставить("ВидРабот",ТекВидЗатрат);
						СтруктураОтбора.Вставить("ЛокальнаяСмета",СметаИзСписка.ЛокальнаяСмета);
						
						МассивСтрок = ИтогиПоВР.НайтиСтроки(СтруктураОтбора);
						Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
							
							СуммированиеСоставляющих(НоваяСтрока,НайденнаяСтрока);
							// Просуммировать по главе 2.
							Отбор1 = Новый Структура;
							Отбор1.Вставить("ВидЗатрат",ТекВидЗатрат);
							СтрокиОтбора = СоставляющиеПЗ.НайтиСтроки(Отбор1);
							Если СтрокиОтбора.Количество() = 0 Тогда
								ТекущаяСтрока = СоставляющиеПЗ.Добавить();
								ТекущаяСтрока.ВидЗатрат = ТекВидЗатрат;
							Иначе
								ТекущаяСтрока = СтрокиОтбора[0];
							КонецЕсли;	
							СуммированиеСоставляющих(ТекущаяСтрока,НайденнаяСтрока);
							
						КонецЦикла;
					КонецЦикла;	
				КонецЕсли;
			Иначе
				// Перенести в накопительные.
				Если ТекВыборка.Накопительный = Истина Тогда
					Отбор1 = Новый Структура;
					Отбор1.Вставить("ВидЗатрат",ТекВидЗатрат);
					СтрокиОтбора = СоставляющиеПЗ.НайтиСтроки(Отбор1);
					Если СтрокиОтбора.Количество() <> 0 Тогда
						ТекущаяСтрока = СтрокиОтбора[0];
						ЗаполнитьЗначенияСвойств(НоваяСтрока,ТекущаяСтрока,СписокСвойств);
					КонецЕсли;	
					
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	// Добавление ЛЗ локальных смет
	СписокЛЗ = Новый ТаблицаЗначений;
	СписокЛЗ.Колонки.Добавить("ЛимЗатрата");
	СписокЛЗ.Колонки.Добавить("ЛокСмета");
	СписокЛЗ.Колонки.Добавить("Номер");
	СписокСмет = Ссылка.ЛокальныеСметы.Выгрузить();
	Для каждого Смета Из СписокСмет Цикл
		Если  Смета.Расчет = Ложь Тогда
			Продолжить;
		КонецЕсли;
		ТекСмета = Смета.ЛокальнаяСмета;
		ТЧЛимЗатраты = ТекСмета.ЛимитированныеЗатраты.Выгрузить();
		Если ТЧЛимЗатраты.Количество()<> 0 Тогда
			Для Каждого ЛЗ Из ТЧЛимЗатраты Цикл
				Если ЛЗ.Расчет = Истина Тогда
					НоваяЗатрата = СписокЛЗ.Добавить();
					НоваяЗатрата.ЛимЗатрата = ЛЗ.ЛимитированнаяЗатрата;
					НоваяЗатрата.Номер = ЛЗ.ЛимитированнаяЗатрата.НомерПоПорядку;
					НоваяЗатрата.ЛокСмета = ТекСмета.Ссылка;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
	КонецЦикла;	
	Если СписокЛЗ.Количество() <> 0 Тогда
		СписокЛЗ.Сортировать("Номер");
		ДобавитьЛимЗатратыЛокальныхСмет(ИтогиПоГлавам, СписокЛЗ,Ссылка);
	КонецЕсли;
	// Добавление ЛЗ локальных смет
	
	ИтогиПоГлавам.Сортировать("ПорНомерИтога Возр");
КонецПроцедуры	

// Формирование таблицы для расчета лимитированных затрат Сводных смет.
//
Процедура ФормированиеТаблицыИтогиПоГлавамСС(ИтогиПоГлавам, ИтогиПоВР,Ссылка,СписокВидыЗатрат)
	СписокСвойств 	= "ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер";
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИтогиПоГлавам.Ссылка КАК Итог,
	|	ИтогиПоГлавам.Наименование,
	|	ИтогиПоГлавам.ГлаваССРС,
	|	ИтогиПоГлавам.Накопительный,
	|	ИтогиПоГлавам.ПорядковыйНомер
	|ИЗ
	|	Справочник.СМ_ИтогиПоГлавам КАК ИтогиПоГлавам
	|ГДЕ
	|	ИтогиПоГлавам.ПометкаУдаления = ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	ИтогиПоГлавам.ГлаваССРС.НомерГлавы";	
	
	ВыборкаГлав = Запрос.Выполнить().Выгрузить();
	ТипСоставляющей = Новый  ОписаниеТипов("Число");
	СоставляющиеПЗ = Новый ТаблицаЗначений;
	СоставляющиеПЗ.Колонки.Добавить("ВидЗатрат");
	СоставляющиеПЗ.Колонки.Добавить("ПрямЗатраты",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ОснЗарплата",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ЭксплМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ЗарплМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("СтоимМатер",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("Оборуд",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ЗатратыТрудаРабочих",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ЗатратыТрудаМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ВозвратМатер",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекПрямЗатраты",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекОснЗарплата",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекЭксплМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекЗарплМашин",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекСтоимМатер",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекОборуд",ТипСоставляющей);
	СоставляющиеПЗ.Колонки.Добавить("ТекВозвратМатер",ТипСоставляющей);
	
	СписокСмет = Ссылка.Сметы.Выгрузить();
	Для Каждого  ТекВыборка Из ВыборкаГлав Цикл
		Для Каждого ТекВидЗатрат Из СписокВидыЗатрат Цикл
			// Есть Глава, видРабот.
			Если Не ТекВыборка.Накопительный Тогда
				// Сметы вставляются в ненакопительные Итоги.
				СтруктураОтбора = Новый Структура;
				Если Ссылка.ТипСтроительства = Перечисления.СМ_ТипыСтроительства.КапитальныйРемонт Тогда
					ГлаваКапРемонта = НайтиСоответствиеГлавыСметы(ТекВыборка.ГлаваССРС);
					СтруктураОтбора.Вставить("ГлаваССРС",ГлаваКапРемонта);
				Иначе	
					СтруктураОтбора.Вставить("ГлаваССРС",ТекВыборка.ГлаваССРС);
				КонецЕсли;
				СметыИзСписка = СписокСмет.НайтиСтроки(СтруктураОтбора);
				Для Каждого ТекСтрокаСметы Из СметыИзСписка Цикл
					Если ТекСтрокаСметы.Расчет = Ложь Тогда
						Продолжить;
					КонецЕсли;
					
					СтруктураОтбора = Новый Структура;
					СтруктураОтбора.Вставить("ВидРабот",ТекВидЗатрат);
					СтруктураОтбора.Вставить("ЛокальнаяСмета",ТекСтрокаСметы.Смета);
					
					МассивСтрок = ИтогиПоВР.НайтиСтроки(СтруктураОтбора);
					Если МассивСтрок.Количество() <> 0 Тогда
						
						НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
						НоваяСтрока.Итог  			= ТекСтрокаСметы.Смета.Ссылка;
						НоваяСтрока.Смета       	= Ссылка;
						НоваяСтрока.Глава      	 	= ТекВыборка.ГлаваССРС;
						НоваяСтрока.ВидРабот    	= ТекВидЗатрат;
						НоваяСтрока.Накопительный 	= ТекВыборка.Накопительный;
						НоваяСтрока.ПорНомерИтога 	= ТекВыборка.ПорядковыйНомер;
						НоваяСтрока.КодГлавы		= ТекВыборка.ГлаваССРС.Код;
						Для каждого НайденнаяСтрока Из МассивСтрок Цикл
							СуммированиеСоставляющих(НоваяСтрока,НайденнаяСтрока);
						КонецЦикла;
						
						// Просуммировать по главе 2.
						Отбор1 = Новый Структура;
						Отбор1.Вставить("ВидЗатрат",ТекВидЗатрат);
						СтрокиОтбора = СоставляющиеПЗ.НайтиСтроки(Отбор1);
						Если СтрокиОтбора.Количество() = 0 Тогда
							ТекущаяСтрока = СоставляющиеПЗ.Добавить();
							ТекущаяСтрока.ВидЗатрат = ТекВидЗатрат;
						Иначе
							ТекущаяСтрока = СтрокиОтбора[0];
						КонецЕсли;	
						СуммированиеСоставляющих(ТекущаяСтрока,НоваяСтрока);
					КонецЕсли; // Для Сметы и вида затрат.
				КонецЦикла;	 // Цикл по сметам.
				
				// Итог по Главе для вида работ, должны быть добавлены итоги
				// по сметам для этого вида работ, если они Были. 
				НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
				НоваяСтрока.Смета       	= Ссылка;
				НоваяСтрока.Глава      	 	= ТекВыборка.ГлаваССРС;
				НоваяСтрока.Итог        	= ТекВыборка.Итог;
				НоваяСтрока.ВидРабот    	= ТекВидЗатрат;
				НоваяСтрока.Накопительный 	= ТекВыборка.Накопительный;
				НоваяСтрока.ПорНомерИтога 	= ТекВыборка.ПорядковыйНомер;
				НоваяСтрока.КодГлавы		= ТекВыборка.ГлаваССРС.Код;
				
				// Вставить Сумму итога по виду затрат для этого итога.
				ОбнулениеСоставляющих(НоваяСтрока);
			
			Иначе // Итог накопительный.
				
				НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
				НоваяСтрока.Смета       	= Ссылка;
				НоваяСтрока.Глава      	 	= ТекВыборка.ГлаваССРС;
				НоваяСтрока.Итог        	= ТекВыборка.Итог;
				НоваяСтрока.ВидРабот    	= ТекВидЗатрат;
				НоваяСтрока.Накопительный 	= ТекВыборка.Накопительный;
				НоваяСтрока.ПорНомерИтога 	= ТекВыборка.ПорядковыйНомер;
				НоваяСтрока.КодГлавы		= ТекВыборка.ГлаваССРС.Код;
				// Перенести в накопительные.
				Отбор1 = Новый Структура;
				Отбор1.Вставить("ВидЗатрат",ТекВидЗатрат);
				СтрокиОтбора = СоставляющиеПЗ.НайтиСтроки(Отбор1);
				Если СтрокиОтбора.Количество() <> 0 Тогда
					НайденнаяСтрока = СтрокиОтбора[0];
					СуммированиеСоставляющих(НоваяСтрока,НайденнаяСтрока);
				Иначе
					ОбнулениеСоставляющих(НоваяСтрока);
				КонецЕсли;	
				
			КонецЕсли;// Сметы вставляются в ненакопительные Итоги.
			
			
		КонецЦикла;  //Виды Затрат.
		
	КонецЦикла;  // По главам.
	СписокЛЗ = Новый ТаблицаЗначений;
	СписокЛЗ.Колонки.Добавить("ЛимЗатрата");
	СписокЛЗ.Колонки.Добавить("ОбСмета");
	СписокЛЗ.Колонки.Добавить("Номер");
	СписокСмет = Ссылка.Сметы.Выгрузить();
	Для каждого Смета Из СписокСмет Цикл
		Если  Смета.Расчет = Ложь Тогда
			Продолжить;
		КонецЕсли;
		ТекСмета = Смета.Смета;
		ТЧЛимЗатраты = ТекСмета.ЛимитированныеЗатраты.Выгрузить();
		Если ТЧЛимЗатраты.Количество()<> 0 Тогда
			Для Каждого ЛЗ Из ТЧЛимЗатраты Цикл
				Если ЛЗ.Расчет = Истина Тогда
					НоваяЗатрата = СписокЛЗ.Добавить();
					НоваяЗатрата.ЛимЗатрата = ЛЗ.ЛимитированнаяЗатрата;
					НоваяЗатрата.Номер = ЛЗ.ЛимитированнаяЗатрата.НомерПоПорядку;
					НоваяЗатрата.ОбСмета = ТекСмета.Ссылка;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		Если ТипЗнч(ТекСмета) =  Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
			ДобавитьЛИмЗатратыПодчиненныхЛокСмет(ТекСмета,СписокЛЗ);	
		КонецЕсли;
		
	КонецЦикла;	

	Если СписокЛЗ.Количество() <> 0 Тогда
		СписокЛЗ.Сортировать("Номер");
		ДобавитьЛимЗатратыОбъектныхСмет(ИтогиПоГлавам, СписокЛЗ,Ссылка);
	КонецЕсли;
	ИтогиПоГлавам.Сортировать("ПорНомерИтога Возр");

КонецПроцедуры

// Добавляются ЛЗ из ТЧ локальных смет, входящих в ОС,если их нет в ТЧ ОС.
Процедура ДобавитьЛИмЗатратыПодчиненныхЛокСмет(ТекСмета,СписокЛЗ)
	
	СписокЛокСмет = ТекСмета.ЛокальныеСметы.Выгрузить();
	Для каждого Смета Из СписокЛокСмет Цикл
		Если  Смета.Расчет = Ложь Тогда
			Продолжить;
		КонецЕсли;
		ЛокСмета = Смета.ЛокальнаяСмета;
		ТЧЛимЗатраты = ЛокСмета.ЛимитированныеЗатраты.Выгрузить();
		Если ТЧЛимЗатраты.Количество()<> 0 Тогда
			Для Каждого ЛЗ Из ТЧЛимЗатраты Цикл
				Если ЛЗ.Расчет = Истина Тогда
					// СУДАРИКОВ БЫЛО:
					//Отбор = Новый Структура;
					//Отбор.Вставить("ЛимЗатрата",ЛЗ.ЛимитированнаяЗатрата);
					//СтрокиОтбора = СписокЛЗ.НайтиСтроки(Отбор);
					//Если СтрокиОтбора.Количество() = 0 Тогда
					//	НоваяЗатрата = СписокЛЗ.Добавить();
					//	НоваяЗатрата.ЛимЗатрата = ЛЗ.ЛимитированнаяЗатрата;
					//	НоваяЗатрата.Номер = ЛЗ.ЛимитированнаяЗатрата.НомерПоПорядку;
					//	НоваяЗатрата.ОбСмета = ТекСмета.Ссылка;
					//	
					//КонецЕсли;	
					// ПРИЧИНА: собиралась только 1 ЛЗ из ЛС в СС
					// СТАЛО:
					НоваяЗатрата = СписокЛЗ.Добавить();
					НоваяЗатрата.ЛимЗатрата = ЛЗ.ЛимитированнаяЗатрата;
					НоваяЗатрата.Номер = ЛЗ.ЛимитированнаяЗатрата.НомерПоПорядку;
					НоваяЗатрата.ОбСмета = Смета.ЛокальнаяСмета;   					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

// Найти соответствие Главы кап ремонта главе ССРС.
//
Функция НайтиСоответствиеГлавыСметы(ТекГлаваССРС)
	Глава = Неопределено;
	ИтогиПоГлавам = Справочники.СМ_ИтогиПоГлавам;
	Отбор = Новый Структура;
	Результат = ИтогиПоГлавам.ПолучитьДанныеВыбора(Отбор);
	Если Не Результат = Неопределено Тогда
		Для каждого ТекРезультат Из Результат Цикл
			Если ТекРезультат.Значение.ГлаваССРС = ТекГлаваССРС Тогда
					Глава = ТекРезультат.Значение.ГлаваРемонт;	
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	Возврат(Глава);
КонецФункции

// Получить строку для расчета лимитированной затраты для конкретного вида работ.
//
Функция СобратьСтрокуРасчета(Ссылка,ВидРаботИсточник,ТекСтрока,ИтогиПоГлавам, ИтогиПоВР)
	ТекИтог  		= ТекСтрока.ЛимитированнаяЗатрата.ОтИтога;
	ТекГлава		= ТекИтог.ГлаваССРС;
	ЛимитЗатрата =  ТекСтрока.ЛимитированнаяЗатрата;
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Глава",ТекГлава);
	СтруктураОтбора.Вставить("Итог",ТекИтог);
	
	СтруктураОтбора2 = Новый Структура;
	СтруктураОтбора2.Вставить("Смета",Ссылка);
	СтруктураОтбора.Вставить("ВидРабот",ВидРаботИсточник);
	Если ЛимитЗатрата.Откуда = 3 Тогда
		МассивСтрок = СобратьИтогиПоФормуле(ЛимитЗатрата, ВидРаботИсточник, ИтогиПоГлавам, ИтогиПоВР);
	ИначеЕсли ЛимитЗатрата.Откуда = 2 Тогда
		СтруктураОтбора.Итог = ЛимитЗатрата.ОтЗатраты;
		СтруктураОтбора.Глава = ЛимитЗатрата.ОтЗатраты.ГлаваССРС;
		МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
	Иначе
		Если ТекИтог.Накопительный Тогда
			СтруктураОтбора.Глава = ТекГлава;
			СтруктураОтбора.Итог = ТекИтог;
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
		Иначе
			СтруктураОтбора2.Вставить("ВидРабот",ВидРаботИсточник);
			МассивСтрок = ИтогиПоВР.НайтиСтроки(СтруктураОтбора2);
		КонецЕсли;
	КонецЕсли;
	Возврат(МассивСтрок);
КонецФункции

// Процедура добавления уже рассчитанных лим. затрат в таблицу итоги по главам СС.
//
Процедура ДобавитьЛимЗатратыОбъектныхСмет(ИтогиПоГлавам, СписокЛЗ, Ссылка)
	СписокСвойств 	= "ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер";

	ИтогиПоГлавам.Сортировать("ПорНомерИтога Возр");
	ФлагИндекса = Новый ТаблицаЗначений;
	ФлагИндекса.Колонки.Добавить("ВидРабот");
	ФлагИндекса.Колонки.Добавить("Итог");
	
	

	Для каждого ЛЗ Из СписокЛЗ Цикл
		Смета = ЛЗ.ОбСмета;
		ЛимЗатрата = ЛЗ.ЛимЗатрата;
		Если ТипЗнч(Смета) =  Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
			ИсточникЗапроса = "СМ_ИтогиПоГлавамОС";
		Иначе 
			ИсточникЗапроса = "СМ_ИтогиПоГлавам";
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ИтогиПоГлавам.Итог,
		|	ИтогиПоГлавам.ВидРабот,
		|	СУММА(ИтогиПоГлавам.ТекПрямЗатраты) КАК ТекПрямЗатраты,
		|	СУММА(ИтогиПоГлавам.ТекОснЗарплата) КАК ТекОснЗарплата,
		|	СУММА(ИтогиПоГлавам.ТекЭксплМашин) КАК ТекЭксплМашин,
		|	СУММА(ИтогиПоГлавам.ТекЗарплМашин) КАК ТекЗарплМашин,
		|	СУММА(ИтогиПоГлавам.ТекСтоимМатер) КАК ТекСтоимМатер,
		|	СУММА(ИтогиПоГлавам.ТекОборуд) КАК ТекОборуд,
		|	СУММА(ИтогиПоГлавам.ТекВозвратМатер) КАК ТекВозвратМатер,
		|	СУММА(ИтогиПоГлавам.ПрямЗатраты) КАК ПрямЗатраты,
		|	СУММА(ИтогиПоГлавам.ОснЗарплата) КАК ОснЗарплата,
		|	СУММА(ИтогиПоГлавам.ЭксплМашин) КАК ЭксплМашин,
		|	СУММА(ИтогиПоГлавам.ЗарплМашин) КАК ЗарплМашин,
		|	СУММА(ИтогиПоГлавам.СтоимМатер) КАК СтоимМатер,
		|	СУММА(ИтогиПоГлавам.Оборуд) КАК Оборуд,
		|	СУММА(ИтогиПоГлавам.ВозвратМатер) КАК ВозвратМатер,
		|	СУММА(ИтогиПоГлавам.ЗатратыТрудаРабочих) КАК ЗатратыТрудаРабочих,
		|	СУММА(ИтогиПоГлавам.ЗатратыТрудаМашин) КАК ЗатратыТрудаМашин
		|ИЗ
		|	РегистрСведений." + ИсточникЗапроса+" КАК ИтогиПоГлавам
		|ГДЕ
		|	ИтогиПоГлавам.Смета = &Смета 
		|   И ИтогиПоГлавам.Итог = &ЛимЗатрата
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтогиПоГлавам.Итог,
		|	ИтогиПоГлавам.ВидРабот
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИтогиПоГлавам.Итог.ГлаваССРС.ПорядковыйНомер";
		
		Запрос.УстановитьПараметр("Смета", Смета);
		Запрос.УстановитьПараметр("ЛимЗатрата", ЛимЗатрата);
		
		ИтогиПоЛимЗатрате = Запрос.Выполнить().Выгрузить();
		Для каждого ИтогПоЛимЗатрате Из ИтогиПоЛимЗатрате Цикл
			Итог = ИтогПоЛимЗатрате.Итог;
			ГлаваССРС = Итог.ГлаваССРС;
			ВидРабот = ИтогПоЛимЗатрате.ВидРабот;
			Отбор = Новый Структура;
			Отбор.Вставить("Накопительный",Ложь);
			Отбор.Вставить("ВидРабот",ВидРабот);
			Отбор.Вставить("Итог",Итог);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(Отбор);
			Если МассивСтрок.Количество() <> 0 Тогда
				СтрокаМассива = МассивСтрок[0];
				СуммированиеСоставляющих(СтрокаМассива,ИтогПоЛимЗатрате);
			Иначе
				НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
				НоваяСтрока.Смета       	= Ссылка;
				НоваяСтрока.Глава      	 	= ГлаваССРС;
				НоваяСтрока.Итог        	= Итог;
				НоваяСтрока.ВидРабот    	= ВидРабот;
				НоваяСтрока.Накопительный 	= Ложь;
				ИтогСоответствиеИтогаГлаве = НайтиИтогСоответствиеИтогаГлаве(ГлаваССРС);
				Если Не ИтогСоответствиеИтогаГлаве = Неопределено Тогда
					НоваяСтрока.ПорНомерИтога 	= ИтогСоответствиеИтогаГлаве.ПорядковыйНомер;
				КонецЕсли;
				НоваяСтрока.КодГлавы		= Итог.ГлаваССРС.Код;
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ИтогПоЛимЗатрате,СписокСвойств);
				СтрокаМассива = НоваяСтрока;
			КонецЕсли;	
			// Добавить В Итоги  Накопительные.
			ИтогНакоп = ЛимЗатрата.КИтогу;
			ТабНакопительныхИтогов = ПолучитьИтогиПоГлавамДляДобавленияЛЗ(ИтогНакоп);
			Для каждого НакопительныйИтог Из  ТабНакопительныхИтогов Цикл
				Отбор3 = Новый Структура;
				Отбор3.Вставить("Накопительный",Истина);
				Отбор3.Вставить("ВидРабот",ВидРабот);
				Отбор3.Вставить("Итог",НакопительныйИтог.Итог);
				МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(Отбор3);
				Если МассивСтрок3.Количество() <> 0 Тогда
					Строки3 = МассивСтрок3[0];
					Если Лимзатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						ОтборФлага = Новый Структура;
						ОтборФлага.Вставить("ВидРабот",ВидРабот);
						ОтборФлага.Вставить("Итог",НакопительныйИтог.Итог);
						ЕстьФлаг = ФлагИндекса.НайтиСтроки(ОтборФлага);
						Флаг = ?(ЕстьФлаг.Количество() = 0,Ложь,Истина);
						Если Флаг = Ложь Тогда
							ПеренесениеИндексаВПряЗатраты(Строки3,СтрокаМассива);	
						Иначе
							СуммированиеСоставляющих(Строки3,СтрокаМассива);
						КонецЕсли;	
						Если Флаг = Ложь Тогда
							СтрокаФлага = ФлагИндекса.Добавить();
							СтрокаФлага.ВидРабот = ВидРабот;
							СтрокаФлага.Итог = Итог;
						КонецЕсли;	
					Иначе	
						СуммированиеСоставляющих(Строки3,ИтогПоЛимЗатрате);
					КонецЕсли;
				Иначе
					// Надо создать итог для этого вида работ.
					НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
					НоваяСтрока.Смета       	= Ссылка;
					НоваяСтрока.Глава      	 	= НакопительныйИтог.Итог.ГлаваССРС;
					НоваяСтрока.Итог        	= НакопительныйИтог.Итог;
					НоваяСтрока.ВидРабот    	= ВидРабот;
					НоваяСтрока.Накопительный 	= Истина;
					НоваяСтрока.ПорНомерИтога 	= НакопительныйИтог.Итог.ПорядковыйНомер;
					НоваяСтрока.КодГлавы		= НакопительныйИтог.Итог.ГлаваССРС.Код;
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ИтогПоЛимЗатрате,СписокСвойств);
				КонецЕсли;
			КонецЦикла;	
	
		КонецЦикла;	
		
	КонецЦикла;	
		
КонецПроцедуры

// Процедура добавления уже рассчитанных лим. затрат в таблицу итоги по главам ОС.
//
Процедура ДобавитьЛимЗатратыЛокальныхСмет(ИтогиПоГлавам, СписокЛЗ, Ссылка)
	СписокСвойств 	= "ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер";

	ИтогиПоГлавам.Сортировать("ПорНомерИтога Возр");
	ФлагИндекса = Новый ТаблицаЗначений;
	ФлагИндекса.Колонки.Добавить("ВидРабот");
	ФлагИндекса.Колонки.Добавить("Итог");
	
	

	Для каждого ЛЗ Из СписокЛЗ Цикл
		Смета = ЛЗ.ЛокСмета;
		ЛимЗатрата = ЛЗ.ЛимЗатрата;
		ИсточникЗапроса = "СМ_ИтогиПоГлавам";
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ИтогиПоГлавам.Итог,
		|	ИтогиПоГлавам.ВидРабот,
		|	СУММА(ИтогиПоГлавам.ТекПрямЗатраты) КАК ТекПрямЗатраты,
		|	СУММА(ИтогиПоГлавам.ТекОснЗарплата) КАК ТекОснЗарплата,
		|	СУММА(ИтогиПоГлавам.ТекЭксплМашин) КАК ТекЭксплМашин,
		|	СУММА(ИтогиПоГлавам.ТекЗарплМашин) КАК ТекЗарплМашин,
		|	СУММА(ИтогиПоГлавам.ТекСтоимМатер) КАК ТекСтоимМатер,
		|	СУММА(ИтогиПоГлавам.ТекОборуд) КАК ТекОборуд,
		|	СУММА(ИтогиПоГлавам.ТекВозвратМатер) КАК ТекВозвратМатер,
		|	СУММА(ИтогиПоГлавам.ПрямЗатраты) КАК ПрямЗатраты,
		|	СУММА(ИтогиПоГлавам.ОснЗарплата) КАК ОснЗарплата,
		|	СУММА(ИтогиПоГлавам.ЭксплМашин) КАК ЭксплМашин,
		|	СУММА(ИтогиПоГлавам.ЗарплМашин) КАК ЗарплМашин,
		|	СУММА(ИтогиПоГлавам.СтоимМатер) КАК СтоимМатер,
		|	СУММА(ИтогиПоГлавам.Оборуд) КАК Оборуд,
		|	СУММА(ИтогиПоГлавам.ВозвратМатер) КАК ВозвратМатер,
		|	СУММА(ИтогиПоГлавам.ЗатратыТрудаРабочих) КАК ЗатратыТрудаРабочих,
		|	СУММА(ИтогиПоГлавам.ЗатратыТрудаМашин) КАК ЗатратыТрудаМашин
		|ИЗ
		|	РегистрСведений." + ИсточникЗапроса+" КАК ИтогиПоГлавам
		|ГДЕ
		|	ИтогиПоГлавам.Смета = &Смета 
		|   И ИтогиПоГлавам.Итог = &ЛимЗатрата
		|
		|СГРУППИРОВАТЬ ПО
		|	ИтогиПоГлавам.Итог,
		|	ИтогиПоГлавам.ВидРабот
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИтогиПоГлавам.Итог.ГлаваССРС.ПорядковыйНомер";
		
		Запрос.УстановитьПараметр("Смета", Смета);
		Запрос.УстановитьПараметр("ЛимЗатрата", ЛимЗатрата);
		
		ИтогиПоЛимЗатрате = Запрос.Выполнить().Выгрузить();
		Для каждого ИтогПоЛимЗатрате Из ИтогиПоЛимЗатрате Цикл
			Итог = ИтогПоЛимЗатрате.Итог;
			ГлаваССРС = Итог.ГлаваССРС;
			ВидРабот = ИтогПоЛимЗатрате.ВидРабот;
			Отбор = Новый Структура;
			Отбор.Вставить("Накопительный",Ложь);
			Отбор.Вставить("ВидРабот",ВидРабот);
			Отбор.Вставить("Итог",Итог);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(Отбор);
			Если МассивСтрок.Количество() <> 0 Тогда
				СтрокаМассива = МассивСтрок[0];
				СуммированиеСоставляющих(СтрокаМассива,ИтогПоЛимЗатрате);
			Иначе
				НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
				НоваяСтрока.Смета       	= Ссылка;
				НоваяСтрока.Глава      	 	= ГлаваССРС;
				НоваяСтрока.Итог        	= Итог;
				НоваяСтрока.ВидРабот    	= ВидРабот;
				НоваяСтрока.Накопительный 	= Ложь;
				ИтогСоответствиеИтогаГлаве = НайтиИтогСоответствиеИтогаГлаве(ГлаваССРС);
				Если Не ИтогСоответствиеИтогаГлаве = Неопределено Тогда
					НоваяСтрока.ПорНомерИтога 	= ИтогСоответствиеИтогаГлаве.ПорядковыйНомер;
				КонецЕсли;
				НоваяСтрока.КодГлавы		= Итог.ГлаваССРС.Код;
				ЗаполнитьЗначенияСвойств(НоваяСтрока,ИтогПоЛимЗатрате,СписокСвойств);
				СтрокаМассива = НоваяСтрока;
			КонецЕсли;	
			// Добавить В Итоги  Накопительные.
			ИтогНакоп = ЛимЗатрата.КИтогу;
			ТабНакопительныхИтогов = ПолучитьИтогиПоГлавамДляДобавленияЛЗ(ИтогНакоп);
			Для каждого НакопительныйИтог Из  ТабНакопительныхИтогов Цикл
				Отбор3 = Новый Структура;
				Отбор3.Вставить("Накопительный",Истина);
				Отбор3.Вставить("ВидРабот",ВидРабот);
				Отбор3.Вставить("Итог",НакопительныйИтог.Итог);
				МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(Отбор3);
				Если МассивСтрок3.Количество() <> 0 Тогда
					Строки3 = МассивСтрок3[0];
					Если Лимзатрата.ТипЗначенияЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						ОтборФлага = Новый Структура;
						ОтборФлага.Вставить("ВидРабот",ВидРабот);
						ОтборФлага.Вставить("Итог",НакопительныйИтог.Итог);
						ЕстьФлаг = ФлагИндекса.НайтиСтроки(ОтборФлага);
						Флаг = ?(ЕстьФлаг.Количество() = 0,Ложь,Истина);
						Если Флаг = Ложь Тогда
							ПеренесениеИндексаВПряЗатраты(Строки3,СтрокаМассива);	
						Иначе
							СуммированиеСоставляющих(Строки3,СтрокаМассива);
						КонецЕсли;	
						Если Флаг = Ложь Тогда
							СтрокаФлага = ФлагИндекса.Добавить();
							СтрокаФлага.ВидРабот = ВидРабот;
							СтрокаФлага.Итог = Итог;
						КонецЕсли;	
					Иначе	
						СуммированиеСоставляющих(Строки3,ИтогПоЛимЗатрате);
					КонецЕсли;
				Иначе
					// Надо создать итог для этого вида работ.
					НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
					НоваяСтрока.Смета       	= Ссылка;
					НоваяСтрока.Глава      	 	= НакопительныйИтог.Итог.ГлаваССРС;
					НоваяСтрока.Итог        	= НакопительныйИтог.Итог;
					НоваяСтрока.ВидРабот    	= ВидРабот;
					НоваяСтрока.Накопительный 	= Истина;
					НоваяСтрока.ПорНомерИтога 	= НакопительныйИтог.Итог.ПорядковыйНомер;
					НоваяСтрока.КодГлавы		= НакопительныйИтог.Итог.ГлаваССРС.Код;
					ЗаполнитьЗначенияСвойств(НоваяСтрока,ИтогПоЛимЗатрате,СписокСвойств);
				КонецЕсли;
			КонецЦикла;	
	
		КонецЦикла;	
		
	КонецЦикла;	
		
КонецПроцедуры

// Процедура обнуления составляющих Прямых затрат.
//
Процедура ОбнулениеСоставляющих(СтрокаПриемник)
	СтрокаПриемник.ПрямЗатраты  	 = 0 ;
	СтрокаПриемник.ОснЗарплата  	 = 0 ;
	СтрокаПриемник.ЭксплМашин 	     = 0 ;
	СтрокаПриемник.ЗарплМашин  	     = 0 ;
	СтрокаПриемник.СтоимМатер        = 0 ;
	СтрокаПриемник.Оборуд		     = 0;
	СтрокаПриемник.ТекПрямЗатраты    = 0;
	СтрокаПриемник.ТекОснЗарплата    = 0;
	СтрокаПриемник.ТекЭксплМашин     = 0;
	СтрокаПриемник.ТекЗарплМашин     = 0;
	СтрокаПриемник.ТекСтоимМатер  	 = 0 ;
	СтрокаПриемник.ТекОборуд         = 0;
	СтрокаПриемник.ВозвратМатер      = 0 ;
	СтрокаПриемник.ЗатратыТрудаРабочих  = 0;
	СтрокаПриемник.ЗатратыТрудаМашин    = 0;
КонецПроцедуры

// Процедура суммирования составляющих Прямых затрат.
//
Процедура СуммированиеСоставляющих(СтрокаПриемник,СтрокаИсточник)
	
	СтрокаПриемник.ПрямЗатраты     = СтрокаПриемник.ПрямЗатраты    + СтрокаИсточник.ПрямЗатраты;
	СтрокаПриемник.ОснЗарплата     = СтрокаПриемник.ОснЗарплата    + СтрокаИсточник.ОснЗарплата;
	СтрокаПриемник.ЭксплМашин      = СтрокаПриемник.ЭксплМашин     + СтрокаИсточник.ЭксплМашин;
	СтрокаПриемник.ЗарплМашин      = СтрокаПриемник.ЗарплМашин     + СтрокаИсточник.ЗарплМашин;
	СтрокаПриемник.СтоимМатер      = СтрокаПриемник.СтоимМатер     + СтрокаИсточник.СтоимМатер;
	СтрокаПриемник.Оборуд		   = СтрокаПриемник.Оборуд         + СтрокаИсточник.Оборуд;
	СтрокаПриемник.ТекПрямЗатраты  = СтрокаПриемник.ТекПрямЗатраты + СтрокаИсточник.ТекПрямЗатраты;
	СтрокаПриемник.ТекОснЗарплата  = СтрокаПриемник.ТекОснЗарплата + СтрокаИсточник.ТекОснЗарплата;
	СтрокаПриемник.ТекЭксплМашин   = СтрокаПриемник.ТекЭксплМашин  + СтрокаИсточник.ТекЭксплМашин;
	СтрокаПриемник.ТекЗарплМашин   = СтрокаПриемник.ТекЗарплМашин  + СтрокаИсточник.ТекЗарплМашин;
	СтрокаПриемник.ТекСтоимМатер   = СтрокаПриемник.ТекСтоимМатер  + СтрокаИсточник.ТекСтоимМатер;
	СтрокаПриемник.ТекОборуд       = СтрокаПриемник.ТекОборуд      + СтрокаИсточник.ТекОборуд;
	СтрокаПриемник.ВозвратМатер    = СтрокаПриемник.ВозвратМатер   + СтрокаИсточник.ВозвратМатер;
	СтрокаПриемник.ЗатратыТрудаРабочих  = СтрокаПриемник.ЗатратыТрудаРабочих + СтрокаИсточник.ЗатратыТрудаРабочих;
	СтрокаПриемник.ЗатратыТрудаМашин    = СтрокаПриемник.ЗатратыТрудаМашин   + СтрокаИсточник.ЗатратыТрудаМашин;
	
КонецПроцедуры

// Процедура перенесения итогв по ЛЗ Индекс в Прямые затраты.
//
Процедура ПеренесениеИндексаВПряЗатраты(СтрокаПриемник,СтрокаИсточник)
	
	СтрокаПриемник.ПрямЗатраты     = СтрокаИсточник.ПрямЗатраты;
	СтрокаПриемник.ОснЗарплата     = СтрокаИсточник.ОснЗарплата;
	СтрокаПриемник.ЭксплМашин      = СтрокаИсточник.ЭксплМашин;
	СтрокаПриемник.ЗарплМашин      = СтрокаИсточник.ЗарплМашин;
	СтрокаПриемник.СтоимМатер      = СтрокаИсточник.СтоимМатер;
	СтрокаПриемник.Оборуд		   = СтрокаИсточник.Оборуд;
	СтрокаПриемник.ТекПрямЗатраты  = СтрокаИсточник.ТекПрямЗатраты;
	СтрокаПриемник.ТекОснЗарплата  = СтрокаИсточник.ТекОснЗарплата;
	СтрокаПриемник.ТекЭксплМашин   = СтрокаИсточник.ТекЭксплМашин;
	СтрокаПриемник.ТекЗарплМашин   = СтрокаИсточник.ТекЗарплМашин;
	СтрокаПриемник.ТекСтоимМатер   = СтрокаИсточник.ТекСтоимМатер;
	СтрокаПриемник.ТекОборуд       = СтрокаИсточник.ТекОборуд;
	СтрокаПриемник.ВозвратМатер    = СтрокаИсточник.ВозвратМатер;
	СтрокаПриемник.ЗатратыТрудаРабочих  = СтрокаИсточник.ЗатратыТрудаРабочих;
	СтрокаПриемник.ЗатратыТрудаМашин    = СтрокаИсточник.ЗатратыТрудаМашин;
	
КонецПроцедуры

// Функция для определения итога по главе. 
// Параметр 1 - Глава.
//
Функция НайтиИтогСоответствиеИтогаГлаве(ТекГлава)
	
	Итог = Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИтогиПоГлавам.Ссылка КАК Итог
	               |ИЗ
	               |	Справочник.СМ_ИтогиПоГлавам КАК ИтогиПоГлавам
	               |ГДЕ
	               |	ИтогиПоГлавам.ПометкаУдаления = ЛОЖЬ
	               |	И ИтогиПоГлавам.ГлаваССРС = &Глава";	
	
	Запрос.УстановитьПараметр("Глава", ТекГлава);

	ВыборкаГлав = Запрос.Выполнить().Выгрузить();
	Если  ВыборкаГлав.Количество() <> 0 Тогда
		Итог = ВыборкаГлав[0].Итог;  
	КонецЕсли;	
	Возврат(Итог);
КонецФункции

// Формирование таблицы для расчета лимитированных затрат Локальных смет и актов.
//
Процедура ФормированиеТаблицыИтогиПоГлавам(ИтогиПоГлавам, ИтогиПоВР,Ссылка,СписокВидыЗатрат)
	
	ТекВыборка = Справочники.СМ_ИтогиПоГлавам.Выбрать();
			
	Пока ТекВыборка.Следующий() Цикл
		
		Если ТекВыборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ТекВидЗатрат Из СписокВидыЗатрат Цикл
			НоваяСтрока 				= ИтогиПоГлавам.Добавить();	
			НоваяСтрока.Смета       	= Ссылка;
			НоваяСтрока.Глава      	 	= ТекВыборка.ГлаваССРС;
			НоваяСтрока.Итог        	= ТекВыборка.Ссылка;
			НоваяСтрока.ВидРабот    	= ТекВидЗатрат;
			НоваяСтрока.Накопительный 	= ТекВыборка.Накопительный;
			НоваяСтрока.ПорНомерИтога 	= ТекВыборка.ПорядковыйНомер;
			НоваяСтрока.КодГлавы		= ТекВыборка.ГлаваССРС.Код;
			ПрямЗатраты             	= 0;
			ОснЗарплата             	= 0;
			ЭксплМашин             		= 0;
			ЗарплМашин              	= 0;
			СтоимМатер              	= 0;
			Оборуд                 	 	= 0;
			ТекПрямЗатраты             	= 0;
			ТекОснЗарплата             	= 0;
			ТекЭксплМашин             	= 0;
			ТекЗарплМашин              	= 0;
			ТекСтоимМатер              	= 0;
			ТекОборуд                 	= 0;
			ВозвратМатер           		= 0;
			ЗатратыТрудаРабочих     	= 0;
			ЗатратыТрудаМашин      		= 0;
		КонецЦикла;                 
	КонецЦикла;
	
	Итог0 			= Справочники.СМ_ИтогиПоГлавам.НайтиПоРеквизиту("Идентификатор","И0");
	СписокСвойств 	= "ПрямЗатраты,ОснЗарплата,ЭксплМашин,ЗарплМашин,СтоимМатер,Оборуд,ВозвратМатер,ЗатратыТрудаРабочих,ЗатратыТрудаМашин,ТекПрямЗатраты,ТекОснЗарплата,ТекЭксплМашин,ТекЗарплМашин,ТекСтоимМатер,ТекОборуд,ТекВозвратМатер";
	
				
		Для Каждого ТекСтрока Из ИтогиПоВР Цикл
			
			// Заполнение нулевого итога.
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Итог",Итог0);
			СтруктураОтбора.Вставить("ВидРабот",ТекСтрока.ВидРабот);
			
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока,ТекСтрока,СписокСвойств);
			КонецЦикла;
			
			// Заполнение накопительных итогов.
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Накопительный",Истина);
			СтруктураОтбора.Вставить("ВидРабот",ТекСтрока.ВидРабот);
			
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
				ЗаполнитьЗначенияСвойств(НайденнаяСтрока,ТекСтрока,СписокСвойств);
			КонецЦикла;
			
		КонецЦикла;
	
  ИтогиПоГлавам.Сортировать("ПорНомерИтога Возр");  
  
КонецПроцедуры	

// Процедура добавления лимитированной затраты (сумма) в накопительные итоги.
//
Процедура ДобавлениеЗатратыВНакопительныеИтоги(ИтогиПоГлавам,ТабНакопительныхИтогов,ТекВидРабот,ЛимитЗатрата,БазисЗначениеЗатраты,ЗначениеЗатраты)
	
	Для Каждого ТекущийИтог Из ТабНакопительныхИтогов Цикл
		СтруктураОтбора3 = Новый Структура;
		СтруктураОтбора3.Вставить("Глава",ТекущийИтог.Итог.ГлаваССРС);
		СтруктураОтбора3.Вставить("Итог",ТекущийИтог.Итог);
		СтруктураОтбора3.Вставить("ВидРабот",ТекВидРабот);
		Если ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы Тогда
			ПриемникПЗ = ЛимитЗатрата.ПриемникСтроитРаботПЗ;
			ПриемникОЗ = ЛимитЗатрата.ПриемникСтроитРаботОЗ;
			ПриемникЭМ = ЛимитЗатрата.ПриемникСтроитРаботЭМ;
			ПриемникЗМ = ЛимитЗатрата.ПриемникСтроитРаботЗМ;
			ПриемникСМ = ЛимитЗатрата.ПриемникСтроитРаботСМ;
		ИначеЕсли ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы	Тогда
			ПриемникПЗ = ЛимитЗатрата.ПриемникМонтажРаботПЗ;
			ПриемникОЗ = ЛимитЗатрата.ПриемникМонтажРаботОЗ;
			ПриемникЭМ = ЛимитЗатрата.ПриемникМонтажРаботЭМ;
			ПриемникЗМ = ЛимитЗатрата.ПриемникМонтажРаботЗМ;
			ПриемникСМ = ЛимитЗатрата.ПриемникМонтажРаботСМ;
			
		ИначеЕсли ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ПрочиеРаботы	Тогда
			ПриемникПЗ = ЛимитЗатрата.ПриемникПрочихРаботПЗ;
			ПриемникОЗ = ЛимитЗатрата.ПриемникПрочихРаботОЗ;
			ПриемникЭМ = ЛимитЗатрата.ПриемникПрочихРаботЭМ;
			ПриемникЗМ = ЛимитЗатрата.ПриемникПрочихРаботЗМ;
			ПриемникСМ = ЛимитЗатрата.ПриемникПрочихРаботСМ;

		ИначеЕсли ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.Оборудование	Тогда
			ПриемникОборуд = ЛимитЗатрата.ПриемникОборуд;
			МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
			Если МассивСтрок3.Количество() > 0 Тогда
				ТекущаяСтрока3 = МассивСтрок3[0];
				ТекущаяСтрока3.Оборуд = ТекущаяСтрока3.Оборуд + ?(ПриемникОборуд,БазисЗначениеЗатраты,0);
				ТекущаяСтрока3.ТекОборуд 	= ТекущаяСтрока3.ТекОборуд + ?(ПриемникОборуд,ЗначениеЗатраты,0);
				ТекущаяСтрока3.ПрямЗатраты	= ТекущаяСтрока3.Оборуд + ?(ПриемникОборуд,БазисЗначениеЗатраты,0);
				ТекущаяСтрока3.ТекПрямЗатраты = ТекущаяСтрока3.ТекОборуд + ?(ПриемникОборуд,ЗначениеЗатраты,0);
			КонецЕсли;
			Возврат;
		КонецЕсли;	

		МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
		Если МассивСтрок3.Количество() > 0 Тогда
			ТекущаяСтрока3 = МассивСтрок3[0];
			
			ТекущаяСтрока3.ПрямЗатраты		= ТекущаяСтрока3.ПрямЗатраты + ?(ПриемникПЗ,БазисЗначениеЗатраты,0);
			ТекущаяСтрока3.ОснЗарплата     	= ТекущаяСтрока3.ОснЗарплата + ?(ПриемникОЗ,БазисЗначениеЗатраты,0);
			ТекущаяСтрока3.ЭксплМашин      	= ТекущаяСтрока3.ЭксплМашин + ?(ПриемникЭМ,БазисЗначениеЗатраты,0);
			ТекущаяСтрока3.ЗарплМашин      	= ТекущаяСтрока3.ЗарплМашин + ?(ПриемникЗМ,БазисЗначениеЗатраты,0);
			ТекущаяСтрока3.СтоимМатер      	= ТекущаяСтрока3.СтоимМатер + ?(ПриемникСМ,БазисЗначениеЗатраты,0);
			
			ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ПриемникПЗ,ЗначениеЗатраты,0);
			ТекущаяСтрока3.ТекОснЗарплата  	= ТекущаяСтрока3.ТекОснЗарплата + ?(ПриемникОЗ,ЗначениеЗатраты,0);
			ТекущаяСтрока3.ТекЭксплМашин   	= ТекущаяСтрока3.ТекЭксплМашин + ?(ПриемникЭМ,ЗначениеЗатраты,0);
			ТекущаяСтрока3.ТекЗарплМашин   	= ТекущаяСтрока3.ТекЗарплМашин + ?(ПриемникЗМ,ЗначениеЗатраты,0);
			ТекущаяСтрока3.ТекСтоимМатер   	= ТекущаяСтрока3.ТекСтоимМатер + ?(ПриемникСМ,ЗначениеЗатраты,0);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры	

// Функция определяет соответствие источник-приемник для лимитированных затрат.
//
Функция ОпределитьСоотвИстПриемЛимЗатрат(ЛимЗатр)
	
	ПрямоеНачисление = Ложь;
	Если ЛимЗатр.ИсточникМонтажРабот = ЛимЗатр.ПриемникМонтажРабот
		И ЛимЗатр.ИсточникСтроитРабот = ЛимЗатр.ПриемникСтроитРабот
		И ЛимЗатр.ИсточникОборуд = ЛимЗатр.ПриемникОборуд
		И ЛимЗатр.ИсточникПрочихРабот = ЛимЗатр.ПриемникПрочихРабот Тогда
		ПрямоеНачисление = Истина;	
	КонецЕсли;
	
	Возврат ПрямоеНачисление;
	
КонецФункции

// функция определяет итоги, следующие за итогом с порядковым номером.
//
Функция ПолучитьИтогиПоГлавамПоПорядковомуНомеру(ПорНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИтогиПоГлавам.Ссылка КАК Итог,
	               |	ИтогиПоГлавам.Наименование,
	               |	ИтогиПоГлавам.ГлаваССРС,
	               |	ИтогиПоГлавам.Накопительный,
	               |	ИтогиПоГлавам.ПорядковыйНомер
	               |ИЗ
	               |	Справочник.СМ_ИтогиПоГлавам КАК ИтогиПоГлавам
	               |ГДЕ
	               |	ИтогиПоГлавам.ПорядковыйНомер > &ПорядковыйНомер
	               |	И ИтогиПоГлавам.Накопительный = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПорядковыйНомер",ПорНомер);
	ТабИтогов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабИтогов;
	
КонецФункции

// Функция определяет итог и итоги, следующие за тем, к которому прибавляется затрата.
//
Функция ПолучитьИтогиПоГлавамДляДобавленияЛЗ(Итог)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИтогиПоГлавам.Ссылка КАК Итог,
	               |	ИтогиПоГлавам.Наименование,
	               |	ИтогиПоГлавам.ГлаваССРС,
	               |	ИтогиПоГлавам.Накопительный,
	               |	ИтогиПоГлавам.ПорядковыйНомер
	               |ИЗ
	               |	Справочник.СМ_ИтогиПоГлавам КАК ИтогиПоГлавам
	               |ГДЕ
	               |	ИтогиПоГлавам.ПорядковыйНомер >= &ПорядковыйНомер
	               |	И ИтогиПоГлавам.Накопительный = ИСТИНА";
	
	Запрос.УстановитьПараметр("ПорядковыйНомер",Итог.ПорядковыйНомер);
	ТабИтогов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТабИтогов;
	
КонецФункции

#КонецОбласти

#Область РасчетЛимЗатрат

// Функция для поиска лимитированной затраты в таблице расчета ИтогиПоГлавам для конкретного вида работ.
//
Функция НайтиЛимЗатрату(ИтогиПоГлавам,СсылкаЛЗ,Ссылка,ТекВидРабот)
	СтруктураОтбораЛЗ = Новый Структура;
	СтруктураОтбораЛЗ.Вставить("ВидРабот",ТекВидРабот);
	СтруктураОтбораЛЗ.Вставить("Итог",СсылкаЛЗ);
	СтруктураОтбораЛЗ.Вставить("Смета",Ссылка);
	МассивСтрокЛЗ = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбораЛЗ);
	Если МассивСтрокЛЗ.Количество() > 0 Тогда 
		НоваяСтрока 			= МассивСтрокЛЗ[0];
	Иначе
		НоваяСтрока 			= ИтогиПоГлавам.Добавить(); 
		НоваяСтрока.Смета       = Ссылка;
		НоваяСтрока.Глава      	= СсылкаЛЗ.ГлаваССРС;
		НоваяСтрока.Итог        = СсылкаЛЗ;
		НоваяСтрока.ВидРабот    = ТекВидРабот;
		
	КонецЕсли;
	Возврат(НоваяСтрока);	
КонецФункции

// Процедура расчета лимитированных затрат, заданных в документе.
//
Процедура РасчетЛимЗатраты(ИтогиПоГлавам, ИтогиПоВР,Ссылка,КолЗнаковРасчета)
	// Значения реквизита "Откуда":
	// 1 - от итога. 
	// 2 - от затраты.
	// 3 - по формуле.
	// Нужно лим затраты сортировать по реквизиту НомерПоПорядку, справочника лимитированные затраты.
	ТаблицаЗатрат = Ссылка.ЛимитированныеЗатраты.Выгрузить();
	ТаблицаЗатрат.Колонки.Добавить("НомерПоПорядку");
	Для каждого ЛЗ Из ТаблицаЗатрат Цикл
		ЛЗ.НомерПоПорядку = ЛЗ.ЛимитированнаяЗатрата.НомерПоПорядку;
	КонецЦикла;	
	ТаблицаЗатрат.Сортировать("НомерПоПорядку Возр", );
	
	Для Каждого ТекСтрока Из ТаблицаЗатрат Цикл
		
		ЛимитЗатрата 	= ТекСтрока.ЛимитированнаяЗатрата;
		КолЗнаков = КолЗнаковРасчета;
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Или ТипЗнч(Ссылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
			Если Ссылка.НеОкруглятьНДС Тогда
				Если  ЛимитЗатрата.Идентификатор = "ЛЗ64" Тогда
					КолЗнаков = 2;
				КонецЕсли;	
			КонецЕсли;	
		КонецЕсли;	

		Расчет =  ТекСтрока.Расчет;
		
		Если  Расчет = Ложь Тогда  Продолжить; 	КонецЕсли;	
		
		ТипЗатраты		= ЛимитЗатрата.ТипЗначенияЗатраты;
		ЗначениеЗатраты	= ТекСтрока.ЗначениеЛимЗатраты;
		БазисЗначениеЗатраты	= ТекСтрока.БазисноеЗначениеЛимЗатраты;
		
		КоэффициентТрудоемкости = ТекСтрока.КоэффициентТрудоемкости;
		КоэффициентСметнойЗарплаты = ТекСтрока.КоэффициентСметнойЗарплаты;

		ТекИтог  		= ТекСтрока.ЛимитированнаяЗатрата.ОтИтога;
		ТекГлава		= ТекИтог.ГлаваССРС;
		
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Глава",ТекГлава);
		СтруктураОтбора.Вставить("Итог",ТекИтог);
		
		СтруктураОтбора2 = Новый Структура;
		СтруктураОтбора2.Вставить("Смета",Ссылка);
		
		// Базисный уровень цен.
		ИсточникСтроитРаботПЗ = 0;
		ИсточникСтроитРаботОЗ = 0;
		ИсточникСтроитРаботЭМ = 0;
		ИсточникСтроитРаботЗМ = 0;
		ИсточникСтроитРаботСМ = 0;

		ИсточникМонтажРаботПЗ = 0;
		ИсточникМонтажРаботОЗ = 0;
		ИсточникМонтажРаботЭМ = 0;
		ИсточникМонтажРаботЗМ = 0;
		ИсточникМонтажРаботСМ = 0;

		ИсточникОборуд = 0;
		
		ИсточникПрочихРаботПЗ = 0;
		ИсточникПрочихРаботОЗ = 0;
		ИсточникПрочихРаботЭМ = 0;
		ИсточникПрочихРаботЗМ = 0;
		ИсточникПрочихРаботСМ = 0;
		
		// Текущий уровень цен.
		ТекИсточникСтроитРаботПЗ = 0;
		ТекИсточникСтроитРаботОЗ = 0;
		ТекИсточникСтроитРаботЭМ = 0;
		ТекИсточникСтроитРаботЗМ = 0;
		ТекИсточникСтроитРаботСМ = 0;

		ТекИсточникМонтажРаботПЗ = 0;
		ТекИсточникМонтажРаботОЗ = 0;
		ТекИсточникМонтажРаботЭМ = 0;
		ТекИсточникМонтажРаботЗМ = 0;
		ТекИсточникМонтажРаботСМ = 0;

		ТекИсточникОборуд = 0;
		
		ТекИсточникПрочихРаботПЗ = 0;
		ТекИсточникПрочихРаботОЗ = 0;
		ТекИсточникПрочихРаботЭМ = 0;
		ТекИсточникПрочихРаботЗМ = 0;
		ТекИсточникПрочихРаботСМ = 0;
		
		// Трудозатраты. 
		ЗатратыТрудаРабочих	= 0;
		ЗатратыТрудаМашин	= 0;
		
		// Добавка к Трудозатратам за счет Коэфф. к НормТрудоемкости. 
		ДобавкаКЗатратамТруда = 0;
		
		// Сметная зарплата.
		БазисСЗП = 0;
		СЗП      = 0;
		БазисСЗПМашин = 0;
		СЗПМашин      = 0;
		
		// Добавка к сметной зарплате.
		ДобавкаКСметнойЗарплате = 0;
		ДобавкаКСметнойЗарплатеМашин = 0;
		БазисДобавкаКСметнойЗарплате  = 0;
		БазисДобавкаКСметнойЗарплатеМашин  = 0;
		РасчетнаяЗатрата = 0;
		БазисРасчетнаяЗатрата = 0;
		
		ОбщаяДобавкаИсточникПЗ = 0;
		ОбщаяДобавкаИсточникОЗ = 0;
		ОбщаяДобавкаИсточникЭМ = 0;
		ОбщаяДобавкаИсточникЗМ = 0;
		ОбщаяДобавкаИсточникСМ = 0;
		ОбщаяДобавкаИсточникОборуд = 0;
		// Базисные.
		БазисОбщаяДобавкаИсточникПЗ = 0;
		БазисОбщаяДобавкаИсточникОЗ = 0;
		БазисОбщаяДобавкаИсточникЭМ = 0;
		БазисОбщаяДобавкаИсточникЗМ = 0;
		БазисОбщаяДобавкаИсточникСМ = 0;
		БазисОбщаяДобавкаИсточникОборуд = 0;
		// Добавки для ЛимЗатраты индекс.
		ИндексДобавкаИсточникПЗСР = 0;
		ИндексДобавкаИсточникОЗСР = 0;
		ИндексДобавкаИсточникЭМСР = 0;
		ИндексДобавкаИсточникЗМСР = 0;
		ИндексДобавкаИсточникСМСР = 0;
		ИндексДобавкаИсточникПЗМР = 0;
		ИндексДобавкаИсточникОЗМР = 0;
		ИндексДобавкаИсточникЭММР = 0;
		ИндексДобавкаИсточникЗММР = 0;
		ИндексДобавкаИсточникСММР = 0;
		ИндексДобавкаИсточникПЗПР = 0;
		ИндексДобавкаИсточникОЗПР = 0;
		ИндексДобавкаИсточникЭМПР = 0;
		ИндексДобавкаИсточникЗМПР = 0;
		ИндексДобавкаИсточникСМПР = 0;
		ИндексДобавкаИсточникОборуд = 0;
		// Базисные.
		ИндексБазисДобавкаИсточникПЗСР = 0;
		ИндексБазисДобавкаИсточникОЗСР = 0;
		ИндексБазисДобавкаИсточникЭМСР = 0;
		ИндексБазисДобавкаИсточникЗМСР = 0;
		ИндексБазисДобавкаИсточникСМСР = 0;
		ИндексБазисДобавкаИсточникПЗМР = 0;
		ИндексБазисДобавкаИсточникОЗМР = 0;
		ИндексБазисДобавкаИсточникЭММР = 0;
		ИндексБазисДобавкаИсточникЗММР = 0;
		ИндексБазисДобавкаИсточникСММР = 0;
		ИндексБазисДобавкаИсточникПЗПР = 0;
		ИндексБазисДобавкаИсточникОЗПР = 0;
		ИндексБазисДобавкаИсточникЭМПР = 0;
		ИндексБазисДобавкаИсточникЗМПР = 0;
		ИндексБазисДобавкаИсточникСМПР = 0;
		ИндексБазисДобавкаИсточникОборуд = 0;

		СуммироватьДобавки = НЕ ОпределитьСоотвИстПриемЛимЗатрат(ТекСтрока.ЛимитированнаяЗатрата);
		
		Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРабот Тогда
			ВидРаботИсточник = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;	
			МассивСтрок = СобратьСтрокуРасчета(Ссылка,ВидРаботИсточник,ТекСтрока,ИтогиПоГлавам, ИтогиПоВР);	
			
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока = МассивСтрок[0];
				ЗатратыТрудаРабочих	= ЗатратыТрудаРабочих + НайденнаяСтрока.ЗатратыТрудаРабочих;
				ЗатратыТрудаМашин	= ЗатратыТрудаМашин + НайденнаяСтрока.ЗатратыТрудаМашин;
				БазисСЗП = БазисСЗП + НайденнаяСтрока.ОснЗарплата ;
				БазисСЗПМашин = БазисСЗПМашин + НайденнаяСтрока.ЗарплМашин;
				СЗП 	 = СЗП + НайденнаяСтрока.ТекОснЗарплата ;
				СЗПМашин 	 = СЗПМашин +  НайденнаяСтрока.ТекЗарплМашин;
				Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						ИндексБазисДобавкаИсточникПЗСР = Окр(НайденнаяСтрока.ПрямЗатраты * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникОЗСР = Окр(НайденнаяСтрока.ОснЗарплата * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникЭМСР = Окр(НайденнаяСтрока.ЭксплМашин * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникЗМСР = Окр(НайденнаяСтрока.ЗарплМашин * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникСМСР = Окр(НайденнаяСтрока.СтоимМатер * (БазисЗначениеЗатраты),КолЗнаков);
						
						ИсточникСтроитРаботПЗ 	= Окр(НайденнаяСтрока.ПрямЗатраты * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникСтроитРаботОЗ 	= Окр(НайденнаяСтрока.ОснЗарплата * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникСтроитРаботЭМ 	= Окр(НайденнаяСтрока.ЭксплМашин * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникСтроитРаботЗМ 	= Окр(НайденнаяСтрока.ЗарплМашин * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникСтроитРаботСМ 	= Окр(НайденнаяСтрока.СтоимМатер * (БазисЗначениеЗатраты-1),КолЗнаков);
					КонецЕсли;
					Если ЗначениеЗатраты <> 0 Тогда
						ИндексДобавкаИсточникПЗСР = Окр(НайденнаяСтрока.ТекПрямЗатраты * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникОЗСР = Окр(НайденнаяСтрока.ТекОснЗарплата * (ЗначениеЗатраты),КолЗнаков);;
						ИндексДобавкаИсточникЭМСР = Окр(НайденнаяСтрока.ТекЭксплМашин * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникЗМСР = Окр(НайденнаяСтрока.ТекЗарплМашин * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникСМСР = Окр(НайденнаяСтрока.ТекСтоимМатер * (ЗначениеЗатраты),КолЗнаков);
	
						ТекИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникСтроитРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникСтроитРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникСтроитРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникСтроитРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * (ЗначениеЗатраты-1),КолЗнаков);
					КонецЕсли;
					
				ИначеЕсли ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Коэффициент Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
								ИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда	
								ИсточникСтроитРаботОЗ = Окр(НайденнаяСтрока.ОснЗарплата * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда	
								ИсточникСтроитРаботЭМ = Окр(НайденнаяСтрока.ЭксплМашин * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда	
								ИсточникСтроитРаботЗМ = Окр(НайденнаяСтрока.ЗарплМашин * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда	
								ИсточникСтроитРаботСМ = Окр(НайденнаяСтрока.СтоимМатер * БазисЗначениеЗатраты,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботСМ;
							КонецЕсли;
						Иначе	
							ИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботПЗ;
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
								ТекИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда	
								ТекИсточникСтроитРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда	
								ТекИсточникСтроитРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда	
								ТекИсточникСтроитРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда	
								ТекИсточникСтроитРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * ЗначениеЗатраты,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботСМ;
							КонецЕсли;
						Иначе	
							ТекИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты  * ЗначениеЗатраты, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботПЗ;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
								ИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда	
								ИсточникСтроитРаботОЗ = Окр(НайденнаяСтрока.ОснЗарплата * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда	
								ИсточникСтроитРаботЭМ = Окр(НайденнаяСтрока.ЭксплМашин * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда	
								ИсточникСтроитРаботЗМ = Окр(НайденнаяСтрока.ЗарплМашин * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда	
								ИсточникСтроитРаботСМ = Окр(НайденнаяСтрока.СтоимМатер * БазисЗначениеЗатраты / 100,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботСМ;
							КонецЕсли;
						Иначе	
							ИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты / 100, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникСтроитРаботПЗ;
						КонецЕсли;
					КонецЕсли;
					Если ЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
								ТекИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда	
								ТекИсточникСтроитРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда	
								ТекИсточникСтроитРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда	
								ТекИсточникСтроитРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда	
								ТекИсточникСтроитРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * ЗначениеЗатраты / 100,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботСМ;
							КонецЕсли;
						Иначе	
							ТекИсточникСтроитРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты / 100, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботПЗ;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если СуммироватьДобавки Тогда
			ОбщаяДобавкаИсточникПЗ = ОбщаяДобавкаИсточникПЗ + ТекИсточникСтроитРаботПЗ;
			ОбщаяДобавкаИсточникОЗ = ОбщаяДобавкаИсточникОЗ + ТекИсточникСтроитРаботОЗ;
			ОбщаяДобавкаИсточникЭМ = ОбщаяДобавкаИсточникЭМ + ТекИсточникСтроитРаботЭМ;
			ОбщаяДобавкаИсточникСМ = ОбщаяДобавкаИсточникСМ + ТекИсточникСтроитРаботСМ;
			ОбщаяДобавкаИсточникЗМ = ОбщаяДобавкаИсточникЗМ + ТекИсточникСтроитРаботЗМ;
			БазисОбщаяДобавкаИсточникПЗ = БазисОбщаяДобавкаИсточникПЗ + ИсточникСтроитРаботПЗ;
			БазисОбщаяДобавкаИсточникОЗ = БазисОбщаяДобавкаИсточникОЗ + ИсточникСтроитРаботОЗ;
			БазисОбщаяДобавкаИсточникЭМ = БазисОбщаяДобавкаИсточникЭМ + ИсточникСтроитРаботЭМ;
			БазисОбщаяДобавкаИсточникСМ = БазисОбщаяДобавкаИсточникСМ + ИсточникСтроитРаботСМ;
			БазисОбщаяДобавкаИсточникЗМ = БазисОбщаяДобавкаИсточникЗМ + ИсточникСтроитРаботЗМ;
		КонецЕсли;
		
		Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРабот Тогда
			
			ВидРаботИсточник = Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы;
			МассивСтрок = СобратьСтрокуРасчета(Ссылка,ВидРаботИсточник,ТекСтрока,ИтогиПоГлавам, ИтогиПоВР);	
			
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока = МассивСтрок[0];
				ЗатратыТрудаРабочих	= ЗатратыТрудаРабочих + НайденнаяСтрока.ЗатратыТрудаРабочих;
				ЗатратыТрудаМашин	= ЗатратыТрудаМашин + НайденнаяСтрока.ЗатратыТрудаМашин;
				БазисСЗП = БазисСЗП + НайденнаяСтрока.ОснЗарплата ;
				БазисСЗПМашин = БазисСЗПМашин + НайденнаяСтрока.ЗарплМашин;
				СЗП 	 = СЗП + НайденнаяСтрока.ТекОснЗарплата ;
				СЗПМашин 	 = СЗПМашин +  НайденнаяСтрока.ТекЗарплМашин;
				
				Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						ИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникМонтажРаботОЗ = Окр(НайденнаяСтрока.ОснЗарплата * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникМонтажРаботЭМ = Окр(НайденнаяСтрока.ЭксплМашин * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникМонтажРаботЗМ = Окр(НайденнаяСтрока.ЗарплМашин * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникМонтажРаботСМ = Окр(НайденнаяСтрока.СтоимМатер * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИндексБазисДобавкаИсточникПЗМР = Окр(НайденнаяСтрока.ПрямЗатраты * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникОЗМР = Окр(НайденнаяСтрока.ОснЗарплата * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникЭММР = Окр(НайденнаяСтрока.ЭксплМашин * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникЗММР = Окр(НайденнаяСтрока.ЗарплМашин * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникСММР = Окр(НайденнаяСтрока.СтоимМатер * (БазисЗначениеЗатраты),КолЗнаков);
					КонецЕсли;	
					Если ЗначениеЗатраты <> 0 Тогда
						ТекИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникМонтажРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникМонтажРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникМонтажРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникМонтажРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * (ЗначениеЗатраты-1),КолЗнаков);
						
						ИндексДобавкаИсточникПЗМР = Окр(НайденнаяСтрока.ТекПрямЗатраты * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникОЗМР = Окр(НайденнаяСтрока.ТекОснЗарплата * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникЭММР = Окр(НайденнаяСтрока.ТекЭксплМашин * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникЗММР = Окр(НайденнаяСтрока.ТекЗарплМашин * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникСММР = Окр(НайденнаяСтрока.ТекСтоимМатер * (ЗначениеЗатраты),КолЗнаков);
					КонецЕсли;
				ИначеЕсли ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Коэффициент Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
								ИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда	
								ИсточникМонтажРаботОЗ = Окр(НайденнаяСтрока.ОснЗарплата * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда	
								ИсточникМонтажРаботЭМ = Окр(НайденнаяСтрока.ЭксплМашин * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда	
								ИсточникМонтажРаботЗМ = Окр(НайденнаяСтрока.ЗарплМашин * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда	
								ИсточникМонтажРаботСМ = Окр(НайденнаяСтрока.СтоимМатер * БазисЗначениеЗатраты,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботСМ;
							КонецЕсли;
						Иначе	
							ИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботПЗ;
						КонецЕсли;
					КонецЕсли;
					
					Если ЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
								ТекИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда	
								ТекИсточникМонтажРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда	
								ТекИсточникМонтажРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда	
								ТекИсточникМонтажРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникСтроитРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда	
								ТекИсточникМонтажРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * ЗначениеЗатраты,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботСМ;
							КонецЕсли;
						Иначе	
							ТекИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботПЗ;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
								ИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда	
								ИсточникМонтажРаботОЗ = Окр(НайденнаяСтрока.ОснЗарплата * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда	
								ИсточникМонтажРаботЭМ = Окр(НайденнаяСтрока.ЭксплМашин * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда	
								ИсточникМонтажРаботЗМ = Окр(НайденнаяСтрока.ЗарплМашин * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда	
								ИсточникМонтажРаботСМ = Окр(НайденнаяСтрока.СтоимМатер * БазисЗначениеЗатраты / 100,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботСМ;
							КонецЕсли;
						Иначе	
							ИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты / 100, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникМонтажРаботПЗ;
						КонецЕсли;
					КонецЕсли;
					Если ЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
								ТекИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда	
								ТекИсточникМонтажРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда	
								ТекИсточникМонтажРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда	
								ТекИсточникМонтажРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда	
								ТекИсточникМонтажРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * ЗначениеЗатраты / 100,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботСМ;
							КонецЕсли;
						Иначе	
							ТекИсточникМонтажРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты / 100, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникМонтажРаботПЗ;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				Если СуммироватьДобавки Тогда
					ОбщаяДобавкаИсточникПЗ = ОбщаяДобавкаИсточникПЗ + ТекИсточникМонтажРаботПЗ;
					ОбщаяДобавкаИсточникОЗ = ОбщаяДобавкаИсточникОЗ + ТекИсточникМонтажРаботОЗ;
					ОбщаяДобавкаИсточникЭМ = ОбщаяДобавкаИсточникЭМ + ТекИсточникМонтажРаботЭМ;
					ОбщаяДобавкаИсточникСМ = ОбщаяДобавкаИсточникСМ + ТекИсточникМонтажРаботСМ;
					ОбщаяДобавкаИсточникЗМ = ОбщаяДобавкаИсточникЗМ + ТекИсточникМонтажРаботЗМ;
					БазисОбщаяДобавкаИсточникПЗ = БазисОбщаяДобавкаИсточникПЗ + ИсточникМонтажРаботПЗ;
					БазисОбщаяДобавкаИсточникОЗ = БазисОбщаяДобавкаИсточникОЗ + ИсточникМонтажРаботОЗ;
					БазисОбщаяДобавкаИсточникЭМ = БазисОбщаяДобавкаИсточникЭМ + ИсточникМонтажРаботЭМ;
					БазисОбщаяДобавкаИсточникСМ = БазисОбщаяДобавкаИсточникСМ + ИсточникМонтажРаботСМ;
					БазисОбщаяДобавкаИсточникЗМ = БазисОбщаяДобавкаИсточникЗМ + ИсточникМонтажРаботЗМ;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
		Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникОборуд Тогда
			ВидРаботИсточник = Перечисления.СМ_ВидыЗатратСмета.Оборудование;
			МассивСтрок = СобратьСтрокуРасчета(Ссылка,ВидРаботИсточник,ТекСтрока,ИтогиПоГлавам, ИтогиПоВР);	

			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока = МассивСтрок[0];
				Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						ИндексБазисДобавкаИсточникОборуд = Окр(НайденнаяСтрока.Оборуд * (БазисЗначениеЗатраты),КолЗнаков);
						ИсточникОборуд 		= Окр(НайденнаяСтрока.Оборуд * (БазисЗначениеЗатраты-1),КолЗнаков);	
					КонецЕсли;
					Если ЗначениеЗатраты <> 0 Тогда
						ТекИсточникОборуд 	= Окр(НайденнаяСтрока.ТекОборуд * (ЗначениеЗатраты-1),КолЗнаков);	
						ИндексДобавкаИсточникОборуд 	= Окр(НайденнаяСтрока.ТекОборуд * (ЗначениеЗатраты),КолЗнаков);	
					КонецЕсли;	
				ИначеЕсли ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Коэффициент Тогда
					ИсточникОборуд 		= Окр(НайденнаяСтрока.Оборуд * БазисЗначениеЗатраты,КолЗнаков);	
					ТекИсточникОборуд 	= Окр(НайденнаяСтрока.ТекОборуд * ЗначениеЗатраты,КолЗнаков);	
				ИначеЕсли ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент Тогда
					ИсточникОборуд 		= Окр(НайденнаяСтрока.Оборуд * БазисЗначениеЗатраты / 100,КолЗнаков);
					ТекИсточникОборуд 	= Окр(НайденнаяСтрока.ТекОборуд * ЗначениеЗатраты / 100,КолЗнаков);
				КонецЕсли;
				РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникОборуд + ИндексДобавкаИсточникОборуд;
				БазисРасчетнаяЗатрата = БазисРасчетнаяЗатрата + ИсточникОборуд;
				Если СуммироватьДобавки Тогда
					ОбщаяДобавкаИсточникОборуд = ОбщаяДобавкаИсточникОборуд+ ТекИсточникОборуд;
					ОбщаяДобавкаИсточникПЗ     = ОбщаяДобавкаИсточникПЗ + ТекИсточникОборуд;
					БазисОбщаяДобавкаИсточникОборуд = БазисОбщаяДобавкаИсточникОборуд + ИсточникОборуд;
					БазисОбщаяДобавкаИсточникПЗ     = БазисОбщаяДобавкаИсточникПЗ + ИсточникОборуд;
				КонецЕсли;

			КонецЕсли;
		КонецЕсли;
	
		Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРабот Тогда
			ВидРаботИсточник = Перечисления.СМ_ВидыЗатратСмета.ПрочиеРаботы;	
			МассивСтрок = СобратьСтрокуРасчета(Ссылка,ВидРаботИсточник,ТекСтрока,ИтогиПоГлавам, ИтогиПоВР);	
			
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока = МассивСтрок[0];
				ЗатратыТрудаРабочих	= ЗатратыТрудаРабочих + НайденнаяСтрока.ЗатратыТрудаРабочих;
				ЗатратыТрудаМашин	= ЗатратыТрудаМашин + НайденнаяСтрока.ЗатратыТрудаМашин;
				БазисСЗП = БазисСЗП + НайденнаяСтрока.ОснЗарплата ;
				БазисСЗПМашин = БазисСЗПМашин + НайденнаяСтрока.ЗарплМашин;
				СЗП 	 = СЗП + НайденнаяСтрока.ТекОснЗарплата ;
				СЗПМашин 	 = СЗПМашин +  НайденнаяСтрока.ТекЗарплМашин;
				Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						ИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникПрочихРаботОЗ = Окр(НайденнаяСтрока.ОснЗарплата * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникПрочихРаботЭМ = Окр(НайденнаяСтрока.ЭксплМашин * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникПрочихРаботЗМ = Окр(НайденнаяСтрока.ЗарплМашин * (БазисЗначениеЗатраты-1),КолЗнаков);
						ИсточникПрочихРаботСМ = Окр(НайденнаяСтрока.СтоимМатер * (БазисЗначениеЗатраты-1),КолЗнаков);
						
						ИндексБазисДобавкаИсточникПЗПР = Окр(НайденнаяСтрока.ПрямЗатраты * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникОЗПР = Окр(НайденнаяСтрока.ОснЗарплата * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникЭМПР = Окр(НайденнаяСтрока.ЭксплМашин * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникЗМПР = Окр(НайденнаяСтрока.ЗарплМашин * (БазисЗначениеЗатраты),КолЗнаков);
						ИндексБазисДобавкаИсточникСМПР = Окр(НайденнаяСтрока.СтоимМатер * (БазисЗначениеЗатраты),КолЗнаков);
					КонецЕсли;	
					Если ЗначениеЗатраты <> 0 Тогда
						ТекИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникПрочихРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникПрочихРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникПрочихРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * (ЗначениеЗатраты-1),КолЗнаков);
						ТекИсточникПрочихРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * (ЗначениеЗатраты-1),КолЗнаков);
						
						ИндексДобавкаИсточникПЗПР	 = Окр(НайденнаяСтрока.ТекПрямЗатраты * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникОЗПР  = Окр(НайденнаяСтрока.ТекОснЗарплата * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникЭМПР  = Окр(НайденнаяСтрока.ТекЭксплМашин * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникЗМПР  = Окр(НайденнаяСтрока.ТекЗарплМашин * (ЗначениеЗатраты),КолЗнаков);
						ИндексДобавкаИсточникСМПР  = Окр(НайденнаяСтрока.ТекСтоимМатер * (ЗначениеЗатраты),КолЗнаков);
				КонецЕсли;	
				ИначеЕсли ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Коэффициент Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
								ИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда	
								ИсточникПрочихРаботОЗ = Окр(НайденнаяСтрока.ОснЗарплата * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда	
								ИсточникПрочихРаботЭМ = Окр(НайденнаяСтрока.ЭксплМашин * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда	
								ИсточникПрочихРаботЗМ = Окр(НайденнаяСтрока.ЗарплМашин * БазисЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда	
								ИсточникПрочихРаботСМ = Окр(НайденнаяСтрока.СтоимМатер * БазисЗначениеЗатраты,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботСМ;
							КонецЕсли;
						Иначе	
							ИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботПЗ;
						КонецЕсли;
						
					КонецЕсли;	
					
					Если ЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
								ТекИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда	
								ТекИсточникПрочихРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда	
								ТекИсточникПрочихРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда	
								ТекИсточникПрочихРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * ЗначениеЗатраты,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда	
								ТекИсточникПрочихРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * ЗначениеЗатраты,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботСМ;
							КонецЕсли;
						Иначе	
							ТекИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты  * ЗначениеЗатраты, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботПЗ;
						КонецЕсли;
					КонецЕсли;	
				ИначеЕсли ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Процент Тогда
					Если БазисЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
								ИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда	
								ИсточникПрочихРаботОЗ = Окр(НайденнаяСтрока.ОснЗарплата * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда	
								ИсточникПрочихРаботЭМ = Окр(НайденнаяСтрока.ЭксплМашин * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда	
								ИсточникПрочихРаботЗМ = Окр(НайденнаяСтрока.ЗарплМашин * БазисЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда	
								ИсточникПрочихРаботСМ = Окр(НайденнаяСтрока.СтоимМатер * БазисЗначениеЗатраты / 100,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботСМ;
							КонецЕсли;
						Иначе	
							ИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ПрямЗатраты * БазисЗначениеЗатраты / 100, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ИсточникПрочихРаботПЗ;
						КонецЕсли;
					КонецЕсли;	
					Если ЗначениеЗатраты <> 0 Тогда
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Истина Тогда	
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
								ТекИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботПЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда	
								ТекИсточникПрочихРаботОЗ = Окр(НайденнаяСтрока.ТекОснЗарплата * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботОЗ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда	
								ТекИсточникПрочихРаботЭМ = Окр(НайденнаяСтрока.ТекЭксплМашин * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботЭМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда	
								ТекИсточникПрочихРаботЗМ = Окр(НайденнаяСтрока.ТекЗарплМашин * ЗначениеЗатраты / 100,КолЗнаков);
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботЗМ;
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда	
								ТекИсточникПрочихРаботСМ = Окр(НайденнаяСтрока.ТекСтоимМатер * ЗначениеЗатраты / 100,КолЗнаков);						
								РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботСМ;
							КонецЕсли;
						Иначе	
							ТекИсточникПрочихРаботПЗ = Окр(НайденнаяСтрока.ТекПрямЗатраты * ЗначениеЗатраты / 100, КолЗнаков);
							РасчетнаяЗатрата = РасчетнаяЗатрата + ТекИсточникПрочихРаботПЗ;
						КонецЕсли;
						
					КонецЕсли;	
				КонецЕсли;
				Если СуммироватьДобавки Тогда
					ОбщаяДобавкаИсточникПЗ = ОбщаяДобавкаИсточникПЗ + ТекИсточникПрочихРаботПЗ;
					ОбщаяДобавкаИсточникОЗ = ОбщаяДобавкаИсточникОЗ + ТекИсточникПрочихРаботОЗ;
					ОбщаяДобавкаИсточникЭМ = ОбщаяДобавкаИсточникЭМ + ТекИсточникПрочихРаботЭМ;
					ОбщаяДобавкаИсточникСМ = ОбщаяДобавкаИсточникСМ + ТекИсточникПрочихРаботСМ;
					ОбщаяДобавкаИсточникЗМ = ОбщаяДобавкаИсточникЗМ + ТекИсточникПрочихРаботЗМ;
					БазисОбщаяДобавкаИсточникПЗ = БазисОбщаяДобавкаИсточникПЗ + ИсточникПрочихРаботПЗ;
					БазисОбщаяДобавкаИсточникОЗ = БазисОбщаяДобавкаИсточникОЗ + ИсточникПрочихРаботОЗ;
					БазисОбщаяДобавкаИсточникЭМ = БазисОбщаяДобавкаИсточникЭМ + ИсточникПрочихРаботЭМ;
					БазисОбщаяДобавкаИсточникСМ = БазисОбщаяДобавкаИсточникСМ + ИсточникПрочихРаботСМ;
					БазисОбщаяДобавкаИсточникЗМ = БазисОбщаяДобавкаИсточникЗМ + ИсточникПрочихРаботЗМ;
				КонецЕсли;

			КонецЕсли;
			
		КонецЕсли;	
		
		// Обработка коэфф. трудоемкости.
		НормТрудоемкость    = ЗатратыТрудаРабочих +  ЗатратыТрудаМашин;
		Если ЛимитЗатрата.РезервНаНепредвиденные Тогда
			ДобавкаКЗатратамТруда = Окр(НормТрудоемкость * КоэффициентТрудоемкости,2);
		Иначе	
			Если КоэффициентТрудоемкости <> 0 Тогда
				ДобавкаКЗатратамТруда = Окр((ТекИсточникСтроитРаботПЗ + ТекИсточникПрочихРаботПЗ + ТекИсточникМонтажРаботПЗ) * КоэффициентТрудоемкости,2);
			КонецЕсли;	 
		КонецЕсли;
		
		//  Обработка коэффициента к сметной зарплате.
		Если ТипЗатраты <> Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Сумма Тогда
			Если ЛимитЗатрата.РезервНаНепредвиденные Тогда	
				ДобавкаКСметнойЗарплате = Окр(СЗП * КоэффициентСметнойЗарплаты,КолЗнаков);
				БазисДобавкаКСметнойЗарплате = Окр(БазисСЗП * КоэффициентСметнойЗарплаты,КолЗнаков);
				ДобавкаКСметнойЗарплатеМашин = Окр(СЗПМашин * КоэффициентСметнойЗарплаты,КолЗнаков);
				БазисДобавкаКСметнойЗарплатеМашин = Окр(БазисСЗПМашин * КоэффициентСметнойЗарплаты,КолЗнаков);
			Иначе
				ДобавкаКСметнойЗарплате = Окр((ТекИсточникСтроитРаботПЗ + ТекИсточникПрочихРаботПЗ + ТекИсточникМонтажРаботПЗ) * КоэффициентСметнойЗарплаты,КолЗнаков);
				БазисДобавкаКСметнойЗарплате = Окр((ИсточникСтроитРаботПЗ + ИсточникПрочихРаботПЗ + ИсточникМонтажРаботПЗ) * КоэффициентСметнойЗарплаты,КолЗнаков);
				БазисДобавкаКСметнойЗарплатеМашин = 0;
				ДобавкаКСметнойЗарплатеМашин = 0;
			КонецЕсли;
		КонецЕсли;	
		
		// Добавление рассчитанной затраты к итогам и затратам.
		ТекИтог  		= ТекСтрока.ЛимитированнаяЗатрата.КИтогу;
		ТекГлава		= ТекИтог.ГлаваССРС;
	
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("Глава",ТекГлава);
		СтруктураОтбора.Вставить("Итог",ТекИтог);
		Если ТекСтрока.ЛимитированнаяЗатрата.ПриемникСтроитРабот Тогда
			ТекВидРабот 			= Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;	
			ТабНакопительныхИтогов 	= ПолучитьИтогиПоГлавамПоПорядковомуНомеру(ТекИтог.ПорядковыйНомер);
			
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				
				НайденнаяСтрока 		= МассивСтрок[0];
				НоваяСтрока = НайтиЛимЗатрату(ИтогиПоГлавам,ЛимитЗатрата.Ссылка,Ссылка,ТекВидРабот);
				Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Сумма Тогда
					
					// Базисные значения.
					НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ПрямЗатраты + БазисЗначениеЗатраты,НайденнаяСтрока.ПрямЗатраты);
					НайденнаяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,НайденнаяСтрока.ОснЗарплата + БазисЗначениеЗатраты,НайденнаяСтрока.ОснЗарплата);
					НайденнаяСтрока.ЭксплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,НайденнаяСтрока.ЭксплМашин + БазисЗначениеЗатраты,НайденнаяСтрока.ЭксплМашин);
					НайденнаяСтрока.ЗарплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,НайденнаяСтрока.ЗарплМашин + БазисЗначениеЗатраты,НайденнаяСтрока.ЗарплМашин);
					НайденнаяСтрока.СтоимМатер 	= ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,НайденнаяСтрока.СтоимМатер + БазисЗначениеЗатраты,НайденнаяСтрока.СтоимМатер);
					
					НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ОснЗарплата = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ЭксплМашин 	= НоваяСтрока.ЭксплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ЗарплМашин 	= НоваяСтрока.ЗарплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,БазисЗначениеЗатраты,0);
					НоваяСтрока.СтоимМатер 	= НоваяСтрока.СтоимМатер + ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,БазисЗначениеЗатраты,0);
					
					// Текущие значения.
					НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ЗначениеЗатраты,НайденнаяСтрока.ТекПрямЗатраты);
					НайденнаяСтрока.ТекОснЗарплата = ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,НайденнаяСтрока.ТекОснЗарплата + ЗначениеЗатраты,НайденнаяСтрока.ТекОснЗарплата);
					НайденнаяСтрока.ТекЭксплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,НайденнаяСтрока.ТекЭксплМашин + ЗначениеЗатраты,НайденнаяСтрока.ТекЭксплМашин);
					НайденнаяСтрока.ТекЗарплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,НайденнаяСтрока.ТекЗарплМашин + ЗначениеЗатраты,НайденнаяСтрока.ТекЗарплМашин);
					НайденнаяСтрока.ТекСтоимМатер 	= ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,НайденнаяСтрока.ТекСтоимМатер + ЗначениеЗатраты,НайденнаяСтрока.ТекСтоимМатер);
					
					НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекОснЗарплата  = НоваяСтрока.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекЭксплМашин 	= НоваяСтрока.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекЗарплМашин 	= НоваяСтрока.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекСтоимМатер 	= НоваяСтрока.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,ЗначениеЗатраты,0);
					
					// Добавление рассчитанной лимитированной затраты к накопительным итогам (следующим после текущего итога).
					ТекВидРабот 			= Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;	
					ДобавлениеЗатратыВНакопительныеИтоги(ИтогиПоГлавам,ТабНакопительныхИтогов,ТекВидРабот,ЛимитЗатрата,БазисЗначениеЗатраты,ЗначениеЗатраты);
					
				Иначе
					Если СуммироватьДобавки Тогда
						ТекИсточникСтроитРаботПЗ = ОбщаяДобавкаИсточникПЗ; 
						ТекИсточникСтроитРаботОЗ = ОбщаяДобавкаИсточникОЗ; 
						ТекИсточникСтроитРаботЭМ = ОбщаяДобавкаИсточникЭМ; 
						ТекИсточникСтроитРаботЗМ = ОбщаяДобавкаИсточникЗМ; 
						ТекИсточникСтроитРаботСМ = ОбщаяДобавкаИсточникСМ; 
						ИсточникСтроитРаботПЗ = БазисОбщаяДобавкаИсточникПЗ; 
						ИсточникСтроитРаботОЗ = БазисОбщаяДобавкаИсточникОЗ; 
						ИсточникСтроитРаботЭМ = БазисОбщаяДобавкаИсточникЭМ; 
						ИсточникСтроитРаботЗМ = БазисОбщаяДобавкаИсточникЗМ; 
						ИсточникСтроитРаботСМ = БазисОбщаяДобавкаИсточникСМ; 
					КонецЕсли;
					// Базисные значения.
					Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
						НайденнаяСтрока.ПрямЗатраты = НайденнаяСтрока.ПрямЗатраты + ИсточникСтроитРаботПЗ;
					Иначе	
						Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
							НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникСтроитРаботПЗ,НайденнаяСтрока.ПрямЗатраты);
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникСтроитРаботОЗ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникСтроитРаботЭМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникСтроитРаботЗМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникСтроитРаботСМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					НайденнаяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,НайденнаяСтрока.ОснЗарплата + ИсточникСтроитРаботОЗ,НайденнаяСтрока.ОснЗарплата);
					НайденнаяСтрока.ЭксплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,НайденнаяСтрока.ЭксплМашин + ИсточникСтроитРаботЭМ,НайденнаяСтрока.ЭксплМашин);
					НайденнаяСтрока.ЗарплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,НайденнаяСтрока.ЗарплМашин + ИсточникСтроитРаботЗМ,НайденнаяСтрока.ЗарплМашин);
					НайденнаяСтрока.СтоимМатер 	= ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,НайденнаяСтрока.СтоимМатер + ИсточникСтроитРаботСМ,НайденнаяСтрока.СтоимМатер);
					
					Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						
						НоваяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИндексБазисДобавкаИсточникПЗСР,0);
						НоваяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,ИндексБазисДобавкаИсточникОЗСР,0);
						НоваяСтрока.ЭксплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,ИндексБазисДобавкаИсточникЭМСР,0);
						НоваяСтрока.ЗарплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,ИндексБазисДобавкаИсточникЗМСР,0);
						НоваяСтрока.СтоимМатер 	= ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,ИндексБазисДобавкаИсточникСМСР,0);
					
					Иначе
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
							НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ИсточникСтроитРаботПЗ;
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
								НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботПЗ,0);
							Иначе
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботОЗ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботЭМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботЗМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботСМ,0);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;

						НоваяСтрока.ОснЗарплата = НоваяСтрока.ОснЗарплата + ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,ИсточникСтроитРаботОЗ,0);
						НоваяСтрока.ЭксплМашин 	= НоваяСтрока.ЭксплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,ИсточникСтроитРаботЭМ,0);
						НоваяСтрока.ЗарплМашин 	= НоваяСтрока.ЗарплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,ИсточникСтроитРаботЗМ,0);
						НоваяСтрока.СтоимМатер 	= НоваяСтрока.СтоимМатер + ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,ИсточникСтроитРаботСМ,0);
					КонецЕсли;
					// Текущие значения.
					Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
						НайденнаяСтрока.ТекПрямЗатраты = НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникСтроитРаботПЗ;
					Иначе	
						Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
							НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникСтроитРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты);
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникСтроитРаботОЗ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникСтроитРаботЭМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникСтроитРаботЗМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникСтроитРаботСМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					НайденнаяСтрока.ТекОснЗарплата = ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,НайденнаяСтрока.ТекОснЗарплата + ТекИсточникСтроитРаботОЗ,НайденнаяСтрока.ТекОснЗарплата);
					НайденнаяСтрока.ТекЭксплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,НайденнаяСтрока.ТекЭксплМашин + ТекИсточникСтроитРаботЭМ,НайденнаяСтрока.ТекЭксплМашин);
					НайденнаяСтрока.ТекЗарплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,НайденнаяСтрока.ТекЗарплМашин + ТекИсточникСтроитРаботЗМ,НайденнаяСтрока.ТекЗарплМашин);
					НайденнаяСтрока.ТекСтоимМатер 	= ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,НайденнаяСтрока.ТекСтоимМатер + ТекИсточникСтроитРаботСМ,НайденнаяСтрока.ТекСтоимМатер);
					Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						НоваяСтрока.ТекПрямЗатраты  =  ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИндексДобавкаИсточникПЗСР,0);
						НоваяСтрока.ТекОснЗарплата  = ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,ИндексДобавкаИсточникОЗСР,0);
						НоваяСтрока.ТекЭксплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,ИндексДобавкаИсточникЭМСР,0);
						НоваяСтрока.ТекЗарплМашин 	= ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,ИндексДобавкаИсточникЗМСР,0);
						НоваяСтрока.ТекСтоимМатер 	=  ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,ИндексДобавкаИсточникСМСР,0);
					Иначе
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
							НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ТекИсточникСтроитРаботПЗ;
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
								НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботПЗ,0);
							Иначе
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботОЗ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботЭМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботЗМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботСМ,0);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;

						НоваяСтрока.ТекОснЗарплата  = НоваяСтрока.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,ТекИсточникСтроитРаботОЗ,0);
						НоваяСтрока.ТекЭксплМашин 	= НоваяСтрока.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,ТекИсточникСтроитРаботЭМ,0);
						НоваяСтрока.ТекЗарплМашин 	= НоваяСтрока.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,ТекИсточникСтроитРаботЗМ,0);
						НоваяСтрока.ТекСтоимМатер 	= НоваяСтрока.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,ТекИсточникСтроитРаботСМ,0);
					КонецЕсли;	
					// Добавление рассчитанной лимитированной затраты к накопительным итогам (следующим после текущего итога).
					Для Каждого ТекущийИтог Из ТабНакопительныхИтогов Цикл
						ТекВидРабот 			= Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;	
						СтруктураОтбора3 = Новый Структура;
						СтруктураОтбора3.Вставить("Глава",ТекущийИтог.Итог.ГлаваССРС);
						СтруктураОтбора3.Вставить("Итог",ТекущийИтог.Итог);
						СтруктураОтбора3.Вставить("ВидРабот",ТекВидРабот);
						
						МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
						Если МассивСтрок3.Количество() > 0 Тогда
							ТекущаяСтрока3 = МассивСтрок3[0];
							Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
								ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ИсточникСтроитРаботПЗ;
							Иначе	
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
									ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботПЗ,0);
								Иначе
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботОЗ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботЭМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботЗМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ИсточникСтроитРаботСМ,0);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							ТекущаяСтрока3.ОснЗарплата		= ТекущаяСтрока3.ОснЗарплата + ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,ИсточникСтроитРаботОЗ,0);
							ТекущаяСтрока3.ЭксплМашин      	= ТекущаяСтрока3.ЭксплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,ИсточникСтроитРаботЭМ,0);
							ТекущаяСтрока3.ЗарплМашин      	= ТекущаяСтрока3.ЗарплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,ИсточникСтроитРаботЗМ,0);
							ТекущаяСтрока3.СтоимМатер      	= ТекущаяСтрока3.СтоимМатер + ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,ИсточникСтроитРаботСМ,0);
							Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
								ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ТекИсточникСтроитРаботПЗ;
							Иначе	
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботПЗ Тогда	
									ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботПЗ,0);
								Иначе
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботОЗ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботОЗ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЭМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботЭМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботЗМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботЗМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникСтроитРаботСМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникСтроитРаботПЗ,ТекИсточникСтроитРаботСМ,0);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							ТекущаяСтрока3.ТекОснЗарплата  	= ТекущаяСтрока3.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникСтроитРаботОЗ,ТекИсточникСтроитРаботОЗ,0);
							ТекущаяСтрока3.ТекЭксплМашин   	= ТекущаяСтрока3.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЭМ,ТекИсточникСтроитРаботЭМ,0);
							ТекущаяСтрока3.ТекЗарплМашин   	= ТекущаяСтрока3.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникСтроитРаботЗМ,ТекИсточникСтроитРаботЗМ,0);
							ТекущаяСтрока3.ТекСтоимМатер   	= ТекущаяСтрока3.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникСтроитРаботСМ,ТекИсточникСтроитРаботСМ,0);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
		Если ТекСтрока.ЛимитированнаяЗатрата.ПриемникМонтажРабот Тогда
			ТекВидРабот 			= Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы;	
			ТабНакопительныхИтогов 	= ПолучитьИтогиПоГлавамПоПорядковомуНомеру(ТекИтог.ПорядковыйНомер);
			
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество() > 0 Тогда 
				
				НайденнаяСтрока 		= МассивСтрок[0];
				НоваяСтрока = НайтиЛимЗатрату(ИтогиПоГлавам,ЛимитЗатрата.Ссылка,Ссылка,ТекВидРабот);

				Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Сумма Тогда
					// Базисные значения.
					НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ПрямЗатраты + БазисЗначениеЗатраты,НайденнаяСтрока.ПрямЗатраты);
					НайденнаяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,НайденнаяСтрока.ОснЗарплата + БазисЗначениеЗатраты,НайденнаяСтрока.ОснЗарплата);
					НайденнаяСтрока.ЭксплМашин = ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,НайденнаяСтрока.ЭксплМашин + БазисЗначениеЗатраты,НайденнаяСтрока.ЭксплМашин);
					НайденнаяСтрока.ЗарплМашин = ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,НайденнаяСтрока.ЗарплМашин + БазисЗначениеЗатраты,НайденнаяСтрока.ЗарплМашин);
					НайденнаяСтрока.СтоимМатер = ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,НайденнаяСтрока.СтоимМатер + БазисЗначениеЗатраты,НайденнаяСтрока.СтоимМатер);
					
					НоваяСтрока.ПрямЗатраты = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ОснЗарплата = НоваяСтрока.ОснЗарплата + ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ЭксплМашин = НоваяСтрока.ЭксплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ЗарплМашин = НоваяСтрока.ЗарплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,БазисЗначениеЗатраты,0);
					НоваяСтрока.СтоимМатер = НоваяСтрока.СтоимМатер + ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,БазисЗначениеЗатраты,0);
					
					// Текущие значения.
					НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ЗначениеЗатраты,НайденнаяСтрока.ТекПрямЗатраты);
					НайденнаяСтрока.ТекОснЗарплата = ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,НайденнаяСтрока.ТекОснЗарплата + ЗначениеЗатраты,НайденнаяСтрока.ТекОснЗарплата);
					НайденнаяСтрока.ТекЭксплМашин = ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,НайденнаяСтрока.ТекЭксплМашин + ЗначениеЗатраты,НайденнаяСтрока.ТекЭксплМашин);
					НайденнаяСтрока.ТекЗарплМашин = ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,НайденнаяСтрока.ТекЗарплМашин + ЗначениеЗатраты,НайденнаяСтрока.ТекЗарплМашин);
					НайденнаяСтрока.ТекСтоимМатер = ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,НайденнаяСтрока.ТекСтоимМатер + ЗначениеЗатраты,НайденнаяСтрока.ТекСтоимМатер);
					
					НоваяСтрока.ТекПрямЗатраты = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекОснЗарплата = НоваяСтрока.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекЭксплМашин = НоваяСтрока.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекЗарплМашин = НоваяСтрока.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекСтоимМатер = НоваяСтрока.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,ЗначениеЗатраты,0);
					
					// Добавление рассчитанной лимитированной затраты к накопительным итогам (следующим после текущего итога).
					ТекВидРабот 			= Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы;	
					ДобавлениеЗатратыВНакопительныеИтоги(ИтогиПоГлавам,ТабНакопительныхИтогов,ТекВидРабот,ЛимитЗатрата,БазисЗначениеЗатраты,ЗначениеЗатраты);
					
				Иначе
					// Базисные значения.
					Если СуммироватьДобавки Тогда
						ТекИсточникМонтажРаботПЗ = ОбщаяДобавкаИсточникПЗ; 
						ТекИсточникМонтажРаботОЗ = ОбщаяДобавкаИсточникОЗ; 
						ТекИсточникМонтажРаботЭМ = ОбщаяДобавкаИсточникЭМ; 
						ТекИсточникМонтажРаботЗМ = ОбщаяДобавкаИсточникЗМ; 
						ТекИсточникМонтажРаботСМ = ОбщаяДобавкаИсточникСМ; 
						ИсточникМонтажРаботПЗ = БазисОбщаяДобавкаИсточникПЗ; 
						ИсточникМонтажРаботОЗ = БазисОбщаяДобавкаИсточникОЗ; 
						ИсточникМонтажРаботЭМ = БазисОбщаяДобавкаИсточникЭМ; 
						ИсточникМонтажРаботЗМ = БазисОбщаяДобавкаИсточникЗМ; 
						ИсточникМонтажРаботСМ = БазисОбщаяДобавкаИсточникСМ; 
					КонецЕсли;
					
		            Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
						НайденнаяСтрока.ПрямЗатраты = НайденнаяСтрока.ПрямЗатраты + ИсточникМонтажРаботПЗ;
					Иначе	
						Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
							НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникМонтажРаботПЗ,НайденнаяСтрока.ПрямЗатраты);
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникМонтажРаботОЗ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникМонтажРаботЭМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникМонтажРаботЗМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникМонтажРаботСМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;

					НайденнаяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,НайденнаяСтрока.ОснЗарплата + ИсточникМонтажРаботОЗ,НайденнаяСтрока.ОснЗарплата);
					НайденнаяСтрока.ЭксплМашин = ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,НайденнаяСтрока.ЭксплМашин + ИсточникМонтажРаботЭМ,НайденнаяСтрока.ЭксплМашин);
					НайденнаяСтрока.ЗарплМашин = ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,НайденнаяСтрока.ЗарплМашин + ИсточникМонтажРаботЗМ,НайденнаяСтрока.ЗарплМашин);
					НайденнаяСтрока.СтоимМатер = ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,НайденнаяСтрока.СтоимМатер + ИсточникМонтажРаботСМ,НайденнаяСтрока.СтоимМатер);
					Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						НоваяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИндексБазисДобавкаИсточникПЗМР,0);
						НоваяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,ИндексБазисДобавкаИсточникОЗМР,0);
						НоваяСтрока.ЭксплМашин 	= ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,ИндексБазисДобавкаИсточникЭММР,0);
						НоваяСтрока.ЗарплМашин 	= ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,ИндексБазисДобавкаИсточникЗММР,0);
						НоваяСтрока.СтоимМатер 	= ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,ИндексБазисДобавкаИсточникСММР,0);
					Иначе
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
							НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ИсточникМонтажРаботПЗ;
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
								НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботПЗ,0);
							Иначе
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботОЗ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботЭМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботЗМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботСМ,0);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						НоваяСтрока.ОснЗарплата = НоваяСтрока.ОснЗарплата + ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,ИсточникМонтажРаботОЗ,0);
						НоваяСтрока.ЭксплМашин = НоваяСтрока.ЭксплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,ИсточникМонтажРаботЭМ,0);
						НоваяСтрока.ЗарплМашин = НоваяСтрока.ЗарплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,ИсточникМонтажРаботЗМ,0);
						НоваяСтрока.СтоимМатер = НоваяСтрока.СтоимМатер + ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,ИсточникМонтажРаботСМ,0);
					КонецЕсли;
					// Текущие значения.
					Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
						НайденнаяСтрока.ТекПрямЗатраты = НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникМонтажРаботПЗ;
					Иначе	
						Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
							НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникМонтажРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты);
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникМонтажРаботОЗ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникМонтажРаботЭМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникМонтажРаботЗМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникМонтажРаботСМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;

					НайденнаяСтрока.ТекОснЗарплата = ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,НайденнаяСтрока.ТекОснЗарплата + ТекИсточникМонтажРаботОЗ,НайденнаяСтрока.ТекОснЗарплата);
					НайденнаяСтрока.ТекЭксплМашин = ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,НайденнаяСтрока.ТекЭксплМашин + ТекИсточникМонтажРаботЭМ,НайденнаяСтрока.ТекЭксплМашин);
					НайденнаяСтрока.ТекЗарплМашин = ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,НайденнаяСтрока.ТекЗарплМашин + ТекИсточникМонтажРаботЗМ,НайденнаяСтрока.ТекЗарплМашин);
					НайденнаяСтрока.ТекСтоимМатер = ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,НайденнаяСтрока.ТекСтоимМатер + ТекИсточникМонтажРаботСМ,НайденнаяСтрока.ТекСтоимМатер);
					Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						НоваяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИндексДобавкаИсточникПЗМР,0);
						НоваяСтрока.ТекОснЗарплата = ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,ИндексДобавкаИсточникОЗМР,0);
						НоваяСтрока.ТекЭксплМашин  = ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,ИндексДобавкаИсточникЭММР,0);
						НоваяСтрока.ТекЗарплМашин  = ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,ИндексДобавкаИсточникЗММР,0);
						НоваяСтрока.ТекСтоимМатер  = ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,ИндексДобавкаИсточникСММР,0);
					Иначе
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
							НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ТекИсточникМонтажРаботПЗ;
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
								НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботПЗ,0);
							Иначе
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботОЗ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботЭМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботЗМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботСМ,0);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						НоваяСтрока.ТекОснЗарплата = НоваяСтрока.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,ТекИсточникМонтажРаботОЗ,0);
						НоваяСтрока.ТекЭксплМашин = НоваяСтрока.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,ТекИсточникМонтажРаботЭМ,0);
						НоваяСтрока.ТекЗарплМашин = НоваяСтрока.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,ТекИсточникМонтажРаботЗМ,0);
						НоваяСтрока.ТекСтоимМатер = НоваяСтрока.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,ТекИсточникМонтажРаботСМ,0);
					КонецЕсли;
					// Добавление рассчитанной лимитированной затраты к накопительным итогам (следующим после текущего итога).
					Для Каждого ТекущийИтог Из ТабНакопительныхИтогов Цикл
						ТекВидРабот 			= Перечисления.СМ_ВидыЗатратСмета.МонтажныеРаботы;	

						СтруктураОтбора3 = Новый Структура;
						СтруктураОтбора3.Вставить("Глава",ТекущийИтог.Итог.ГлаваССРС);
						СтруктураОтбора3.Вставить("Итог",ТекущийИтог.Итог);
						СтруктураОтбора3.Вставить("ВидРабот",ТекВидРабот);
						
						МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
						Если МассивСтрок3.Количество() > 0 Тогда
							ТекущаяСтрока3 = МассивСтрок3[0];
							
							Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
								ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ИсточникМонтажРаботПЗ;
							Иначе	
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
									ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботПЗ,0);
								Иначе
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботОЗ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботЭМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботЗМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ИсточникМонтажРаботСМ,0);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							ТекущаяСтрока3.ОснЗарплата		= ТекущаяСтрока3.ОснЗарплата + ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,ИсточникМонтажРаботОЗ,0);
							ТекущаяСтрока3.ЭксплМашин      	= ТекущаяСтрока3.ЭксплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,ИсточникМонтажРаботЭМ,0);
							ТекущаяСтрока3.ЗарплМашин      	= ТекущаяСтрока3.ЗарплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,ИсточникМонтажРаботЗМ,0);
							ТекущаяСтрока3.СтоимМатер      	= ТекущаяСтрока3.СтоимМатер + ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,ИсточникМонтажРаботСМ,0);
							
							Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
								ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ТекИсточникМонтажРаботПЗ;
							Иначе	
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботПЗ Тогда	
									ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботПЗ,0);
								Иначе
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботОЗ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботОЗ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЭМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботЭМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботЗМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботЗМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникМонтажРаботСМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникМонтажРаботПЗ,ТекИсточникМонтажРаботСМ,0);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						
							ТекущаяСтрока3.ТекОснЗарплата  	= ТекущаяСтрока3.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникМонтажРаботОЗ,ТекИсточникМонтажРаботОЗ,0);
							ТекущаяСтрока3.ТекЭксплМашин   	= ТекущаяСтрока3.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЭМ,ТекИсточникМонтажРаботЭМ,0);
							ТекущаяСтрока3.ТекЗарплМашин   	= ТекущаяСтрока3.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникМонтажРаботЗМ,ТекИсточникМонтажРаботЗМ,0);
							ТекущаяСтрока3.ТекСтоимМатер   	= ТекущаяСтрока3.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникМонтажРаботСМ,ТекИсточникМонтажРаботСМ,0);
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;

		Если ТекСтрока.ЛимитированнаяЗатрата.ПриемникОборуд Тогда
		
			ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.Оборудование;
			ТабНакопительныхИтогов 	= ПолучитьИтогиПоГлавамПоПорядковомуНомеру(ТекИтог.ПорядковыйНомер);
			
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			
			Если МассивСтрок.Количество() > 0 Тогда 
				
				НайденнаяСтрока 		= МассивСтрок[0];
				НоваяСтрока = НайтиЛимЗатрату(ИтогиПоГлавам,ЛимитЗатрата.Ссылка,Ссылка,ТекВидРабот);

				Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Сумма Тогда
					// Базисные значения.
					НайденнаяСтрока.Оборуд 	= ?(ЛимитЗатрата.ПриемникОборуд,НайденнаяСтрока.Оборуд + БазисЗначениеЗатраты,НайденнаяСтрока.Оборуд);
					НоваяСтрока.Оборуд 		= ?(ЛимитЗатрата.ПриемникОборуд,ЗначениеЗатраты,0);
					НоваяСтрока.ПрямЗатраты		= ?(ЛимитЗатрата.ПриемникОборуд,ЗначениеЗатраты,0);
					
					// Текущие значения.
					НайденнаяСтрока.ТекОборуд 	= ?(ЛимитЗатрата.ПриемникОборуд,НайденнаяСтрока.ТекОборуд + ЗначениеЗатраты,НайденнаяСтрока.ТекОборуд);
					НоваяСтрока.ТекОборуд 		= НоваяСтрока.ТекОборуд + ?(ЛимитЗатрата.ПриемникОборуд,ЗначениеЗатраты,0);
					НоваяСтрока.ТекПрямЗатраты		= НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникОборуд,ЗначениеЗатраты,0);
					// Добавление рассчитанной лимитированной затраты к накопительным итогам (следующим после текущего итога).
					ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.Оборудование;
					ДобавлениеЗатратыВНакопительныеИтоги(ИтогиПоГлавам,ТабНакопительныхИтогов,ТекВидРабот,ЛимитЗатрата,БазисЗначениеЗатраты,ЗначениеЗатраты);
		
				Иначе
					Если СуммироватьДобавки Тогда
						ТекИсточникОборуд = ОбщаяДобавкаИсточникОборуд; 
						ИсточникОборуд = БазисОбщаяДобавкаИсточникОборуд; 
					КонецЕсли;

					// Базисные значения.
					Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						НоваяСтрока.Оборуд 		= ?(ЛимитЗатрата.ПриемникОборуд,ИндексБазисДобавкаИсточникОборуд,0);					
						НоваяСтрока.ПрямЗатраты	= ?(ЛимитЗатрата.ПриемникОборуд,ИндексБазисДобавкаИсточникОборуд,0);					
						НайденнаяСтрока.Оборуд 	= ?(ЛимитЗатрата.ПриемникОборуд,ИндексБазисДобавкаИсточникОборуд,НайденнаяСтрока.Оборуд);
						НайденнаяСтрока.ПрямЗатраты	= ?(ЛимитЗатрата.ПриемникОборуд,НайденнаяСтрока.ПрямЗатраты + ИсточникОборуд,НайденнаяСтрока.ПрямЗатраты);
					Иначе	
						НоваяСтрока.Оборуд 		= НоваяСтрока.Оборуд + ?(ЛимитЗатрата.ПриемникОборуд,ИсточникОборуд,0);					
						НоваяСтрока.ПрямЗатраты	= НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникОборуд,ИсточникОборуд,0);					
						НайденнаяСтрока.Оборуд 	= ?(ЛимитЗатрата.ПриемникОборуд,НайденнаяСтрока.Оборуд + ИсточникОборуд,НайденнаяСтрока.Оборуд);
						НайденнаяСтрока.ПрямЗатраты	= ?(ЛимитЗатрата.ПриемникОборуд,НайденнаяСтрока.ПрямЗатраты + ИсточникОборуд,НайденнаяСтрока.ПрямЗатраты);
					КонецЕсли;
					// Текущие значения.
					Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						НайденнаяСтрока.ТекОборуд 	= ?(ЛимитЗатрата.ПриемникОборуд,ИндексДобавкаИсточникОборуд,НайденнаяСтрока.ТекОборуд);
						НайденнаяСтрока.ТекПрямЗатраты 	= ?(ЛимитЗатрата.ПриемникОборуд,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникОборуд,НайденнаяСтрока.ТекПрямЗатраты);
						НоваяСтрока.ТекОборуд	   = ?(ЛимитЗатрата.ПриемникОборуд,ИндексДобавкаИсточникОборуд,0);	
						НоваяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникОборуд,ИндексДобавкаИсточникОборуд,0);
					Иначе
						НайденнаяСтрока.ТекОборуд 	= ?(ЛимитЗатрата.ПриемникОборуд,НайденнаяСтрока.ТекОборуд + ТекИсточникОборуд,НайденнаяСтрока.ТекОборуд);
						НайденнаяСтрока.ТекПрямЗатраты 	= ?(ЛимитЗатрата.ПриемникОборуд,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникОборуд,НайденнаяСтрока.ТекПрямЗатраты);
						НоваяСтрока.ТекОборуд		= НоваяСтрока.ТекОборуд + ?(ЛимитЗатрата.ПриемникОборуд,ТекИсточникОборуд,0);						
						НоваяСтрока.ТекПрямЗатраты	= НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникОборуд,ТекИсточникОборуд,0);						
					КонецЕсли;
					// Добавление рассчитанной лимитированной затраты к накопительным итогам (следующим после текущего итога).
					Для Каждого ТекущийИтог Из ТабНакопительныхИтогов Цикл
						// Оборудование  добавляется независимо от вида работ к ПЗ Итога. 
						СтруктураОтбора3 = Новый Структура;
						СтруктураОтбора3.Вставить("Глава",ТекущийИтог.Итог.ГлаваССРС);
						СтруктураОтбора3.Вставить("Итог",ТекущийИтог.Итог);
						МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
						Если МассивСтрок3.Количество() > 0 Тогда
							ТекущаяСтрока3 				= МассивСтрок3[0];
							ТекущаяСтрока3.Оборуд		= ТекущаяСтрока3.Оборуд + ?(ЛимитЗатрата.ПриемникОборуд,ИсточникОборуд,0);
							ТекущаяСтрока3.ПрямЗатраты		= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникОборуд,ИсточникОборуд,0);
							ТекущаяСтрока3.ТекОборуд 	= ТекущаяСтрока3.ТекОборуд + ?(ЛимитЗатрата.ПриемникОборуд,ТекИсточникОборуд,0);
							ТекущаяСтрока3.ТекПрямЗатраты 	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникОборуд,ТекИсточникОборуд,0);
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	
		Если ТекСтрока.ЛимитированнаяЗатрата.ПриемникПрочихРабот Тогда
			ТабНакопительныхИтогов 	= ПолучитьИтогиПоГлавамПоПорядковомуНомеру(ТекИтог.ПорядковыйНомер);
			ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ПрочиеРаботы;
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				
				НайденнаяСтрока 		= МассивСтрок[0];
				НоваяСтрока = НайтиЛимЗатрату(ИтогиПоГлавам,ЛимитЗатрата.Ссылка,Ссылка,ТекВидРабот);

				Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Сумма Тогда
					// Базисные значения.
					НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ПрямЗатраты + БазисЗначениеЗатраты,НайденнаяСтрока.ПрямЗатраты);
					НайденнаяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,НайденнаяСтрока.ОснЗарплата + БазисЗначениеЗатраты,НайденнаяСтрока.ОснЗарплата);
					НайденнаяСтрока.ЭксплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,НайденнаяСтрока.ЭксплМашин + БазисЗначениеЗатраты,НайденнаяСтрока.ЭксплМашин);
					НайденнаяСтрока.ЗарплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,НайденнаяСтрока.ЗарплМашин + БазисЗначениеЗатраты,НайденнаяСтрока.ЗарплМашин);
					НайденнаяСтрока.СтоимМатер 	= ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,НайденнаяСтрока.СтоимМатер + БазисЗначениеЗатраты,НайденнаяСтрока.СтоимМатер);
					
					НоваяСтрока.ПрямЗатраты 	= НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ОснЗарплата 	= НоваяСтрока.ОснЗарплата + ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ЭксплМашин 		= НоваяСтрока.ЭксплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,БазисЗначениеЗатраты,0);
					НоваяСтрока.ЗарплМашин 		= НоваяСтрока.ЗарплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,БазисЗначениеЗатраты,0);
					НоваяСтрока.СтоимМатер 		= НоваяСтрока.СтоимМатер + ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,БазисЗначениеЗатраты,0);
					
					// Текущие значения.
					НайденнаяСтрока.ТекПрямЗатраты 	= ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ЗначениеЗатраты,НайденнаяСтрока.ТекПрямЗатраты);
					НайденнаяСтрока.ТекОснЗарплата 	= ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,НайденнаяСтрока.ТекОснЗарплата + ЗначениеЗатраты,НайденнаяСтрока.ТекОснЗарплата);
					НайденнаяСтрока.ТекЭксплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,НайденнаяСтрока.ТекЭксплМашин + ЗначениеЗатраты,НайденнаяСтрока.ТекЭксплМашин);
					НайденнаяСтрока.ТекЗарплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,НайденнаяСтрока.ТекЗарплМашин + ЗначениеЗатраты,НайденнаяСтрока.ТекЗарплМашин);
					НайденнаяСтрока.ТекСтоимМатер 	= ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,НайденнаяСтрока.ТекСтоимМатер + ЗначениеЗатраты,НайденнаяСтрока.ТекСтоимМатер);
					
					НоваяСтрока.ТекПрямЗатраты 	= НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекОснЗарплата 	= НоваяСтрока.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекЭксплМашин 	= НоваяСтрока.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекЗарплМашин 	= НоваяСтрока.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,ЗначениеЗатраты,0);
					НоваяСтрока.ТекСтоимМатер 	= НоваяСтрока.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,ЗначениеЗатраты,0);
					
					// Добавление рассчитанной лимитированной затраты к накопительным итогам (следующим после текущего итога).
					ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ПрочиеРаботы;
					ДобавлениеЗатратыВНакопительныеИтоги(ИтогиПоГлавам,ТабНакопительныхИтогов,ТекВидРабот,ЛимитЗатрата,БазисЗначениеЗатраты,ЗначениеЗатраты);

				Иначе
					// Базисные значения.
					Если СуммироватьДобавки Тогда
						ТекИсточникПрочихРаботПЗ = ОбщаяДобавкаИсточникПЗ; 
						ТекИсточникПрочихРаботОЗ = ОбщаяДобавкаИсточникОЗ; 
						ТекИсточникПрочихРаботЭМ = ОбщаяДобавкаИсточникЭМ; 
						ТекИсточникПрочихРаботЗМ = ОбщаяДобавкаИсточникЗМ; 
						ТекИсточникПрочихРаботСМ = ОбщаяДобавкаИсточникСМ; 
						ИсточникПрочихРаботПЗ = БазисОбщаяДобавкаИсточникПЗ; 
						ИсточникПрочихРаботОЗ = БазисОбщаяДобавкаИсточникОЗ; 
						ИсточникПрочихРаботЭМ = БазисОбщаяДобавкаИсточникЭМ; 
						ИсточникПрочихРаботЗМ = БазисОбщаяДобавкаИсточникЗМ; 
						ИсточникПрочихРаботСМ = БазисОбщаяДобавкаИсточникСМ; 
					КонецЕсли;
	    	        Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
						НайденнаяСтрока.ПрямЗатраты = НайденнаяСтрока.ПрямЗатраты + ИсточникПрочихРаботПЗ;
					Иначе	
						Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
							НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникПрочихРаботПЗ,НайденнаяСтрока.ПрямЗатраты);
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникПрочихРаботОЗ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникПрочихРаботЭМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникПрочихРаботЗМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда
								НайденнаяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ПрямЗатраты + ИсточникПрочихРаботСМ,НайденнаяСтрока.ПрямЗатраты);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;

					НайденнаяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,НайденнаяСтрока.ОснЗарплата + ИсточникПрочихРаботОЗ,НайденнаяСтрока.ОснЗарплата);
					НайденнаяСтрока.ЭксплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,НайденнаяСтрока.ЭксплМашин + ИсточникПрочихРаботЭМ,НайденнаяСтрока.ЭксплМашин);
					НайденнаяСтрока.ЗарплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,НайденнаяСтрока.ЗарплМашин + ИсточникПрочихРаботЗМ,НайденнаяСтрока.ЗарплМашин);
					НайденнаяСтрока.СтоимМатер 	= ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,НайденнаяСтрока.СтоимМатер + ИсточникПрочихРаботСМ,НайденнаяСтрока.СтоимМатер);
					Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						НоваяСтрока.ПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИндексБазисДобавкаИсточникПЗПР,0);
						НоваяСтрока.ОснЗарплата = ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,ИндексБазисДобавкаИсточникОЗПР,0);
						НоваяСтрока.ЭксплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,ИндексБазисДобавкаИсточникЭМПР,0);
						НоваяСтрока.ЗарплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,ИндексБазисДобавкаИсточникЗМПР,0);
						НоваяСтрока.СтоимМатер 	= ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,ИндексБазисДобавкаИсточникСМПР,0);
					Иначе
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
							НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ИсточникПрочихРаботПЗ;
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
								НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботПЗ,0);
							Иначе
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботОЗ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботЭМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботЗМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда
									НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботСМ,0);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						НоваяСтрока.ОснЗарплата = НоваяСтрока.ОснЗарплата + ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,ИсточникПрочихРаботОЗ,0);
						НоваяСтрока.ЭксплМашин 	= НоваяСтрока.ЭксплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,ИсточникПрочихРаботЭМ,0);
						НоваяСтрока.ЗарплМашин 	= НоваяСтрока.ЗарплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,ИсточникПрочихРаботЗМ,0);
						НоваяСтрока.СтоимМатер 	= НоваяСтрока.СтоимМатер + ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,ИсточникПрочихРаботСМ,0);
						// Если  только ПЗ.
						Если НоваяСтрока.ОснЗарплата + НоваяСтрока.ЭксплМашин + НоваяСтрока.СтоимМатер = 0
							И НоваяСтрока.ПрямЗатраты = 0 Тогда
							НоваяСтрока.ПрямЗатраты  = НоваяСтрока.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботПЗ,0);
			            КонецЕсли;
						// Если  только ПЗ.
						
					КонецЕсли;
					// Текущие значения.
					Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
						НайденнаяСтрока.ТекПрямЗатраты = НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникПрочихРаботПЗ;
					Иначе	
						Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
							НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникПрочихРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты);
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникПрочихРаботОЗ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникПрочихРаботЭМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникПрочихРаботЗМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда
								НайденнаяСтрока.ТекПрямЗатраты = ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,НайденнаяСтрока.ТекПрямЗатраты + ТекИсточникПрочихРаботСМ,НайденнаяСтрока.ТекПрямЗатраты);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					НайденнаяСтрока.ТекОснЗарплата 	= ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,НайденнаяСтрока.ТекОснЗарплата + ТекИсточникПрочихРаботОЗ,НайденнаяСтрока.ТекОснЗарплата);
					НайденнаяСтрока.ТекЭксплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,НайденнаяСтрока.ТекЭксплМашин + ТекИсточникПрочихРаботЭМ,НайденнаяСтрока.ТекЭксплМашин);
					НайденнаяСтрока.ТекЗарплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,НайденнаяСтрока.ТекЗарплМашин + ТекИсточникПрочихРаботЗМ,НайденнаяСтрока.ТекЗарплМашин);
					НайденнаяСтрока.ТекСтоимМатер 	= ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,НайденнаяСтрока.ТекСтоимМатер + ТекИсточникПрочихРаботСМ,НайденнаяСтрока.ТекСтоимМатер);
					Если ТипЗатраты = Перечисления.СМ_ТипыЗначенийЛимитированныхЗатрат.Индекс Тогда
						НоваяСтрока.ТекПрямЗатраты =  ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИндексДобавкаИсточникПЗПР,0);
						НоваяСтрока.ТекОснЗарплата =  ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,ИндексДобавкаИсточникОЗПР,0);
						НоваяСтрока.ТекЭксплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,ИндексДобавкаИсточникЭМПР,0);
						НоваяСтрока.ТекЗарплМашин 	= ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,ИндексДобавкаИсточникЗМПР,0);
						НоваяСтрока.ТекСтоимМатер 	= ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,ИндексДобавкаИсточникСМПР,0);
					Иначе
						Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
							НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ТекИсточникПрочихРаботПЗ;
						Иначе
							Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
								НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботПЗ,0);
							Иначе
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботОЗ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботЭМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботЗМ,0);
								КонецЕсли;
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда
									НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботСМ,0);
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						НоваяСтрока.ТекОснЗарплата 	= НоваяСтрока.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,ТекИсточникПрочихРаботОЗ,0);
						НоваяСтрока.ТекЭксплМашин 	= НоваяСтрока.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,ТекИсточникПрочихРаботЭМ,0);
						НоваяСтрока.ТекЗарплМашин 	= НоваяСтрока.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,ТекИсточникПрочихРаботЗМ,0);
						НоваяСтрока.ТекСтоимМатер 	= НоваяСтрока.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,ТекИсточникПрочихРаботСМ,0);
						// Если только ПЗ.
						Если НоваяСтрока.ТекОснЗарплата + НоваяСтрока.ТекЭксплМашин + НоваяСтрока.ТекСтоимМатер = 0
							И НоваяСтрока.ТекПрямЗатраты = 0 Тогда
							НоваяСтрока.ТекПрямЗатраты  = НоваяСтрока.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботПЗ,0);
			            КонецЕсли;
						// Если только ПЗ.
					КонецЕсли;
					// Добавление рассчитанной лимитированной затраты к накопительным итогам (следующим после текущего итога).
					Для Каждого ТекущийИтог Из ТабНакопительныхИтогов Цикл
						ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ПрочиеРаботы;
						СтруктураОтбора3 = Новый Структура;
						СтруктураОтбора3.Вставить("Глава",ТекущийИтог.Итог.ГлаваССРС);
						СтруктураОтбора3.Вставить("Итог",ТекущийИтог.Итог);
						СтруктураОтбора3.Вставить("ВидРабот",ТекВидРабот);
						
						МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
						Если МассивСтрок3.Количество() > 0 Тогда
							ТекущаяСтрока3 = МассивСтрок3[0];
							
							Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
								ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ИсточникПрочихРаботПЗ;
							Иначе	
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
									ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботПЗ,0);
								Иначе
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботОЗ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботЭМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботЗМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда
										ТекущаяСтрока3.ПрямЗатраты  	= ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботСМ,0);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							ТекущаяСтрока3.ОснЗарплата		= ТекущаяСтрока3.ОснЗарплата + ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,ИсточникПрочихРаботОЗ,0);
							ТекущаяСтрока3.ЭксплМашин      	= ТекущаяСтрока3.ЭксплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,ИсточникПрочихРаботЭМ,0);
							ТекущаяСтрока3.ЗарплМашин      	= ТекущаяСтрока3.ЗарплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,ИсточникПрочихРаботЗМ,0);
							ТекущаяСтрока3.СтоимМатер      	= ТекущаяСтрока3.СтоимМатер + ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,ИсточникПрочихРаботСМ,0);
							// Если только ПЗ.
							Если ТекущаяСтрока3.ОснЗарплата + ТекущаяСтрока3.ЭксплМашин + ТекущаяСтрока3.СтоимМатер = 0
								И ТекущаяСтрока3.ПрямЗатраты = 0 Тогда
								ТекущаяСтрока3.ПрямЗатраты  = ТекущаяСтрока3.ПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ИсточникПрочихРаботПЗ,0);
							КонецЕсли;
							// Если только ПЗ.

							Если ПустаяСтрока(ТекСтрока.ЛимитированнаяЗатрата.ОтФормулы) = Ложь Тогда	
								ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ТекИсточникПрочихРаботПЗ;
							Иначе	
								Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботПЗ Тогда	
									ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботПЗ,0);
								Иначе
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботОЗ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботОЗ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЭМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботЭМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботЗМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботЗМ,0);
									КонецЕсли;
									Если ТекСтрока.ЛимитированнаяЗатрата.ИсточникПрочихРаботСМ Тогда
										ТекущаяСтрока3.ТекПрямЗатраты  	= ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботСМ,0);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						
							ТекущаяСтрока3.ТекОснЗарплата  	= ТекущаяСтрока3.ТекОснЗарплата + ?(ЛимитЗатрата.ПриемникПрочихРаботОЗ,ТекИсточникПрочихРаботОЗ,0);
							ТекущаяСтрока3.ТекЭксплМашин   	= ТекущаяСтрока3.ТекЭксплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЭМ,ТекИсточникПрочихРаботЭМ,0);
							ТекущаяСтрока3.ТекЗарплМашин   	= ТекущаяСтрока3.ТекЗарплМашин + ?(ЛимитЗатрата.ПриемникПрочихРаботЗМ,ТекИсточникПрочихРаботЗМ,0);
							ТекущаяСтрока3.ТекСтоимМатер   	= ТекущаяСтрока3.ТекСтоимМатер + ?(ЛимитЗатрата.ПриемникПрочихРаботСМ,ТекИсточникПрочихРаботСМ,0);
							// Если только ПЗ.
							Если ТекущаяСтрока3.ТекОснЗарплата + ТекущаяСтрока3.ТекЭксплМашин + ТекущаяСтрока3.ТекСтоимМатер = 0
								И ТекущаяСтрока3.ТекПрямЗатраты = 0 Тогда
								ТекущаяСтрока3.ТекПрямЗатраты  = ТекущаяСтрока3.ТекПрямЗатраты + ?(ЛимитЗатрата.ПриемникПрочихРаботПЗ,ТекИсточникПрочихРаботПЗ,0);
							КонецЕсли;
							// Если только ПЗ.
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		// Если изменились Трудозатраты за счет Коэффицментов.
		Если  ДобавкаКЗатратамТруда <> 0 Тогда
			ТабНакопительныхИтогов 	= ПолучитьИтогиПоГлавамПоПорядковомуНомеру(ТекИтог.ПорядковыйНомер);
			ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;	
			СтруктураОтбора.Итог = ЛимитЗатрата.Ссылка;
			СтруктураОтбора.Глава = ЛимитЗатрата.Ссылка.ГлаваССРС;
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока 		= МассивСтрок[0];
				НайденнаяСтрока.ЗатратыТрудаРабочих = НайденнаяСтрока.ЗатратыТрудаРабочих + ДобавкаКЗатратамТруда;
				НайденнаяСтрока.ЗатратыТрудаМашин = 0;
			КонецЕсли;
			СтруктураОтбора.Итог = ЛимитЗатрата.Ссылка.КИтогу;
			СтруктураОтбора.Глава = ЛимитЗатрата.Ссылка.КИтогу.ГлаваССРС;
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока 		= МассивСтрок[0];
				НайденнаяСтрока.ЗатратыТрудаРабочих = НайденнаяСтрока.ЗатратыТрудаРабочих + ДобавкаКЗатратамТруда;
				НайденнаяСтрока.ЗатратыТрудаМашин = 0;
			КонецЕсли;
			// Добавление добавки к трудозатратам к накопительным итогам (следующим после текущего итога).
			Для Каждого ТекущийИтог Из ТабНакопительныхИтогов Цикл
				
				СтруктураОтбора3 = Новый Структура;
				СтруктураОтбора3.Вставить("Глава",ТекущийИтог.Итог.ГлаваССРС);
				СтруктураОтбора3.Вставить("Итог",ТекущийИтог.Итог);
				СтруктураОтбора3.Вставить("ВидРабот",ТекВидРабот);
				
				МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
				Если МассивСтрок3.Количество() > 0 Тогда
					ТекущаяСтрока3 = МассивСтрок3[0];
					
					ТекущаяСтрока3.ЗатратыТрудаРабочих	= ДобавкаКЗатратамТруда;
					ТекущаяСтрока3.ЗатратыТрудаМашин	= 0;
				КонецЕсли;
			КонецЦикла;
		Иначе
			ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;	
			СтруктураОтбора.Вставить("Итог",ЛимитЗатрата.Ссылка);
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока 		= МассивСтрок[0];
				НайденнаяСтрока.ЗатратыТрудаРабочих = ЗатратыТрудаРабочих;
				НайденнаяСтрока.ЗатратыТрудаМашин = ЗатратыТрудаМашин;
			КонецЕсли;

		КонецЕсли;
		Если БазисДобавкаКСметнойЗарплате <> 0 Тогда
			ТабНакопительныхИтогов 	= ПолучитьИтогиПоГлавамПоПорядковомуНомеру(ТекИтог.ПорядковыйНомер);
			ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;	
			СтруктураОтбора.Итог = ЛимитЗатрата.Ссылка;
			СтруктураОтбора.Глава = ЛимитЗатрата.Ссылка.ГлаваССРС;
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока 		= МассивСтрок[0];
				НайденнаяСтрока.ОснЗарплата =  БазисДобавкаКСметнойЗарплате + БазисДобавкаКСметнойЗарплатеМашин;
				НайденнаяСтрока.ЗарплМашин= 0;
			КонецЕсли;
			СтруктураОтбора.Итог = ЛимитЗатрата.Ссылка.КИтогу;
			СтруктураОтбора.Глава = ЛимитЗатрата.Ссылка.КИтогу.ГлаваССРС;
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока 		= МассивСтрок[0];
				НайденнаяСтрока.ТекОснЗарплата = БазисДобавкаКСметнойЗарплате + БазисДобавкаКСметнойЗарплатеМашин;
				НайденнаяСтрока.ТекЗарплМашин= 0;
			КонецЕсли;

			// Добавление добавки к СЗП к накопительным итогам (следующим после текущего итога).
			Для Каждого ТекущийИтог Из ТабНакопительныхИтогов Цикл
				
				СтруктураОтбора3 = Новый Структура;
				СтруктураОтбора3.Вставить("Глава",ТекущийИтог.Итог.ГлаваССРС);
				СтруктураОтбора3.Вставить("Итог",ТекущийИтог.Итог);
				СтруктураОтбора3.Вставить("ВидРабот",ТекВидРабот);
				
				МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
				Если МассивСтрок3.Количество() > 0 Тогда
					ТекущаяСтрока3 = МассивСтрок3[0];
					
					ТекущаяСтрока3.ОснЗарплата	= БазисДобавкаКСметнойЗарплате + БазисДобавкаКСметнойЗарплатеМашин;
					ТекущаяСтрока3.ЗарплМашин	= 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ДобавкаКСметнойЗарплате <> 0 Тогда
			ТабНакопительныхИтогов 	= ПолучитьИтогиПоГлавамПоПорядковомуНомеру(ТекИтог.ПорядковыйНомер);
			ТекВидРабот = Перечисления.СМ_ВидыЗатратСмета.ОбщестроительныеРаботы;	
			СтруктураОтбора.Итог = ЛимитЗатрата.Ссылка;
			СтруктураОтбора.Глава = ЛимитЗатрата.Ссылка.ГлаваССРС;
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока 		= МассивСтрок[0];
				НайденнаяСтрока.ТекОснЗарплата = ДобавкаКСметнойЗарплате + ДобавкаКСметнойЗарплатеМашин;
				НайденнаяСтрока.ТекЗарплМашин= 0;
			КонецЕсли;
			СтруктураОтбора.Итог = ЛимитЗатрата.Ссылка.КИтогу;
			СтруктураОтбора.Глава = ЛимитЗатрата.Ссылка.КИтогу.ГлаваССРС;
			СтруктураОтбора.Вставить("ВидРабот",ТекВидРабот);
			МассивСтрок = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора);
			Если МассивСтрок.Количество() > 0 Тогда 
				НайденнаяСтрока 		= МассивСтрок[0];
				НайденнаяСтрока.ТекОснЗарплата = ДобавкаКСметнойЗарплате + ДобавкаКСметнойЗарплатеМашин;
				НайденнаяСтрока.ТекЗарплМашин= 0;
			КонецЕсли;
			// Добавление добавки к СЗП к накопительным итогам (следующим после текущего итога).
			Для Каждого ТекущийИтог Из ТабНакопительныхИтогов Цикл
				
				СтруктураОтбора3 = Новый Структура;
				СтруктураОтбора3.Вставить("Глава",ТекущийИтог.Итог.ГлаваССРС);
				СтруктураОтбора3.Вставить("Итог",ТекущийИтог.Итог);
				СтруктураОтбора3.Вставить("ВидРабот",ТекВидРабот);
				
				МассивСтрок3 = ИтогиПоГлавам.НайтиСтроки(СтруктураОтбора3);
				Если МассивСтрок3.Количество() > 0 Тогда
					ТекущаяСтрока3 = МассивСтрок3[0];
					
					ТекущаяСтрока3.ТекОснЗарплата	= ТекущаяСтрока3.ТекОснЗарплата + ДобавкаКСметнойЗарплате + ДобавкаКСметнойЗарплатеМашин;
					ТекущаяСтрока3.ТекЗарплМашин	= 0;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;       		

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

