#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	Параметры.ЕстьАкт = СМ_УчетВыполненныхРаботСервер.СуществуютАктыПоСмете(Параметры.Смета);
	УстановитьУсловноеОформление();
	ВерсииСметы.Параметры.УстановитьЗначениеПараметра("Объект",Параметры.Смета);
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Текущая версия
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВерсииСметы.НомерВерсии");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = ПолучитьНомерТекущейВерсии();
	
	Шрифт = Новый Шрифт(Элементы.ВерсииСметыНомерВерсии.Шрифт, , , Истина, , , , );
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВерсииСметы.Имя);
	
	Элементы.ВосстановитьВерсию.Видимость = Не Параметры.ЕстьАкт;
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьВерсию(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПричиныОткат", ЭтотОбъект);
	ПоказатьВводЗначения(Оповещение,ПредопределенноеЗначение("Справочник.СМ_ПричиныСозданияВерсии.ПустаяСсылка"), "Причина отката до версии");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПричиныОткат(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьПереходНаВыбраннуюВерсию(Результат);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПереходНаВыбраннуюВерсию(Причина = "",Удалять = Истина)
	
	ТекущиеДанные = Элементы.ВерсииСметы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Результат = ПерейтиНаВерсиюСервер(Параметры.Смета, ТекущиеДанные.НомерВерсии,ТекущиеДанные.КонтрольнаяСумма,ТекущиеДанные.ДатаВерсии,Удалять,Причина);
	Если Удалять Тогда
		ЭтаФорма.ВладелецФормы.Закрыть();
	КонецЕсли;
	ПоказатьЗначение(,Результат);
	Оповестить("ОбновитьДеревоСмет",Новый Структура("Смета,Стройка",Результат,ВернутьСтройку(Результат)));
	
КонецПроцедуры

&НаСервере
Функция ВернутьСтройку(Смета)
    Возврат Смета.Стройка;
КонецФункции

&НаСервере
Функция ПерейтиНаВерсиюСервер(Ссылка, НомерВерсии, КонтрольнаяСумма,ДатаВерсии,Удалять,Причина = "")
	
	СМ_ВерсионированиеСервер.ЗаписатьВерсиюОбъекта(Ссылка,,Причина);
	
	Информация = СМ_ВерсионированиеСервер.СведенияОВерсииОбъекта(Ссылка, НомерВерсии,КонтрольнаяСумма);
	
	Объект = СМ_ВерсионированиеСервер.ВосстановитьОбъект(Ссылка,Информация.ВерсияОбъекта,Удалять);
	//ДокОбъект = Объект.ПолучитьОбъект();
	//ДокОбъект.Наименование = ДокОбъект.Наименование + " (восстановлена из копии от "+ДатаВерсии+")";
	//ДокОбъект.ОбменДанными.Загрузка = Истина;
	//ДокОбъект.Записать();
	
	//СМ_ВерсионированиеСервер.ЗаписатьВерсиюОбъекта(Объект,,Причина);
	Возврат Объект;
	
КонецФункции

&НаКлиенте
Процедура СкопироватьВерсию(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораПричиныВосстановления", ЭтотОбъект);
	ПоказатьВводЗначения(Оповещение,ПредопределенноеЗначение("Справочник.СМ_ПричиныСозданияВерсии.ПустаяСсылка"), "Причина восстановления версии");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПричиныВосстановления(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьПереходНаВыбраннуюВерсию(Результат,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВерсииСметыПриАктивизацииСтроки(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	ВыбранаОднаВерсия = Элементы.ВерсииСметы.ВыделенныеСтроки.Количество() = 1;
	ОтчетПоИзменениям = Элементы.ВерсииСметы.ВыделенныеСтроки.Количество() = 1 ИЛИ Элементы.ВерсииСметы.ВыделенныеСтроки.Количество() = 2;
	ВыбраноНесколькоВерсий = Элементы.ВерсииСметы.ВыделенныеСтроки.Количество() > 1;
	
	Элементы.ВосстановитьВерсию.Доступность = ВыбранаОднаВерсия;
	Элементы.СкопироватьВерсию.Доступность = ВыбранаОднаВерсия;
	Элементы.ОтчетПоИзменениям.Доступность = ОтчетПоИзменениям;
	Элементы.ПросмотретьВерсию.Доступность = ВыбранаОднаВерсия;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчетПоИзменениям(Команда)
	
	ВыделенныеСтроки = Элементы.ВерсииСметы.ВыделенныеСтроки;
	СравниваемыеВерсии = СформироватьСписокВыбранныхВерсий(ВыделенныеСтроки);
	
	Если ВыделенныеСтроки.Количество() =0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для формирования отчета по изменениям необходимо выбрать версию.'"));
		Возврат;
	ИначеЕсли ВыделенныеСтроки.Количество() > 2 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для формирования отчета по изменениям необходимо выбрать не более двух версий.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуОтчета(СравниваемыеВерсии);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуОтчета(СравниваемыеВерсии,Просмотр = Ложь)
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("Ссылка", Параметры.Смета);
	ПараметрыОтчета.Вставить("СравниваемыеВерсии", СравниваемыеВерсии);
	ПараметрыОтчета.Вставить("Просмотр", Просмотр);
	ПараметрыОтчета.Вставить("ТолькоОтклонения", ТолькоОтклонения);
	ПараметрыОтчета.Вставить("ТолькоРасчет", ТолькоРасчет);
	ОткрытьФорму("РегистрСведений.СМ_ВерсииОбъектов.Форма.ОтчетПоВерсиямОбъекта",
		ПараметрыОтчета,
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьСписокВыбранныхВерсий(ВыделенныеСтроки)
	
	СравниваемыеВерсии = Новый СписокЗначений;
	
	Для Каждого НомерВыделеннойСтроки Из ВыделенныеСтроки Цикл
		ДанныеСтроки = Элементы.ВерсииСметы.ДанныеСтроки(НомерВыделеннойСтроки);
		СравниваемыеВерсии.Добавить(ДанныеСтроки.НомерВерсии,Строка(ДанныеСтроки.НомерВерсии));
	КонецЦикла;
	
	СравниваемыеВерсии.СортироватьПоЗначению(НаправлениеСортировки.Возр);
	
	
	// Если СравниваемыеВерсии.Количество() = 1 Тогда
	//	НомерТекущейВерсии = ПолучитьНомерТекущейВерсии();
	//	Если СравниваемыеВерсии.НайтиПоЗначению(НомерТекущейВерсии) = Неопределено Тогда
	//		СравниваемыеВерсии.Добавить(НомерТекущейВерсии,Строка(НомерТекущейВерсии));
	//	КонецЕсли;
	// КонецЕсли;
	
	Возврат СравниваемыеВерсии;
	
КонецФункции

&НаСервере
Функция ПолучитьНомерТекущейВерсии()
	Возврат СМ_ВерсионированиеСервер.НомерПоследнейВерсии(Параметры.Смета);
КонецФункции

&НаКлиенте
Процедура ПросмотретьВерсию(Команда)
	ВыделенныеСтроки = Элементы.ВерсииСметы.ВыделенныеСтроки;
	СравниваемыеВерсии = СформироватьСписокВыбранныхВерсий(ВыделенныеСтроки);
	
	Если ВыделенныеСтроки.Количество() =0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать версию для просмотра.'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуОтчета(СравниваемыеВерсии,Истина);
КонецПроцедуры

&НаКлиенте
Процедура Обновление()
	
	Элементы.ВерсииСметы.Обновить();
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьВерсии" Тогда
		Обновление();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВерсииСметыПередУдалением(Элемент, Отказ)
	Возврат;
КонецПроцедуры

#КонецОбласти