#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры.РеквизитыПечати);
	РеквизитыИсточника = Параметры.РеквизитыПечати;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	РеквизитыПечати = Новый Структура();
	Для Каждого Реквизит Из РеквизитыИсточника Цикл
		
		Если Реквизит.Значение <> ЭтаФорма[Реквизит.Ключ] Тогда
			РеквизитыПечати.Вставить(Реквизит.Ключ, ЭтаФорма[Реквизит.Ключ]);
		КонецЕсли;
		
	КонецЦикла;
	ЭтаФорма.Закрыть(РеквизитыПечати);
	
КонецПроцедуры

#КонецОбласти
