
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресТаблицы = "";
	
	Если Параметры.Свойство("Организация") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец.Организация", Параметры.Организация, ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектСтроительства") И НЕ Параметры.Свойство("СценарийПланирования") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", ПолучитьСписокВладельцев(Параметры.ОбъектСтроительства), ВидСравненияКомпоновкиДанных.ВСписке, , Истина);
		Заголовок = ""+Параметры.ОбъектСтроительства;
	КонецЕсли;
	
	Если Параметры.Свойство("ПометкаУдаления") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ПометкаУдаления", Параметры.ПометкаУдаления, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("Утверждена") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Утверждена", Параметры.Утверждена, ВидСравненияКомпоновкиДанных.Равно, , Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("СписокРабот") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ссылка", Параметры.СписокРабот, ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии, , Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("СценарийПланирования") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец", Параметры.СценарийПланирования, ВидСравненияКомпоновкиДанных.Равно, , Истина);
		Элементы.Список.РежимВыделения = РежимВыделенияТаблицы.Одиночный;
		Заголовок = ""+Параметры.СценарийПланирования;
		
		Если Параметры.Свойство("АдресТаблицы") Тогда
			АдресТаблицы = Параметры.АдресТаблицы;
		КонецЕсли; 		
		
	КонецЕсли;
	
	Если Параметры.Свойство("ДокументУтверждения") Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Владелец",?(Параметры.ДокументУтверждения.СценарийПланирования.НовыйВариант = Истина, Параметры.ДокументУтверждения.КопияСценария,Параметры.ДокументУтверждения.СценарийПланирования), ВидСравненияКомпоновкиДанных.Равно, , Истина);
		Заголовок = ""+Параметры.ДокументУтверждения.КопияСценария +"( № "+Параметры.ДокументУтверждения.КопияСценария.НомерВерсии+" от "+Формат(Параметры.ДокументУтверждения.КопияСценария.ДатаСохранения,"ДФ=dd.MM.yyyy")+")";
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,"АдресТаблицы",АдресТаблицы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСписокВладельцев(ОбъектСтроительства)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_СценарииПланированияПроектовСтроительства.Ссылка КАК Владелец
	|ИЗ
	|	Справочник.УСОERP_СценарииПланированияПроектовСтроительства КАК УСОERP_СценарииПланированияПроектовСтроительства
	|ГДЕ
	|	УСОERP_СценарииПланированияПроектовСтроительства.Владелец = &ОбъектСтроительств
	|	И УСОERP_СценарииПланированияПроектовСтроительства.ВидСценария = ЗНАЧЕНИЕ(Перечисление.УСОERP_ВидыСценариевПланирования.Рабочий)";
	Запрос.УстановитьПараметр("ОбъектСтроительств", ОбъектСтроительства);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Владелец");
	
КонецФункции		

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	АдресТаблицы = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("АдресТаблицы")).Значение;
	
	Если НЕ ПустаяСтрока(АдресТаблицы) Тогда
		
		ТаблицаПроекта = ПолучитьИзВременногоХранилища(АдресТаблицы); 		
		
		Для Каждого НайденнаяСтрока ИЗ Строки Цикл 
			
			ДанныеСтроки = НайденнаяСтрока.Значение.Данные;
			
			Работа = НайденнаяСтрока.Ключ;					
			
			СтрокаРаботы = ТаблицаПроекта.Найти(Работа,"Работа");
			
			Если СтрокаРаботы = Неопределено Тогда
				Продолжить;
			КонецЕсли; 		
			
			ЗаполнитьЗначенияСвойств(ДанныеСтроки,СтрокаРаботы,"ДатаНачала,ДатаОкончания");
			
			НайденнаяСтрока.Значение.Данные.КодСДР = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьКодСДР(Работа);
			
			
		КонецЦикла; 	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
