#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Печать

// Сформировать печатные формы объектов
//
// Параметры:
// 		МассивОбъектов - Массив - Массив ссылок на объекты которые нужно распечатать
// 		ПараметрыПечати - Структура - Структура дополнительных параметров печати
// 		КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
// 		ОбъектыПечати - Объекты печати
// 		ПараметрыВывода - Структура - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл	
		Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ОЗ2") Тогда
		    ИмяМакета = "";
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
				КоллекцияПечатныхФорм,
				"ОЗ2",
				НСтр("ru='Форма ОЗ-2';uk='Форма ОЗ-2'"),
				СформироватьПечатнуюФормуОЗ2(
					МассивОбъектов,
					ОбъектыПечати,
					ПараметрыПечати,
					ИмяМакета),, ИмяМакета);
		
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция СформироватьПечатнуюФормуОЗ2(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ИмяМакета)
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивОбъектов);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;

	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОЗ2";
	
	НомерТипаДокумента = 0;
	
	СведенияАктуальны = Истина;
		
	Для Каждого СтруктураОбъектов Из СтруктураТипов Цикл
				
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтруктураОбъектов.Ключ); 
				
		Для Каждого Элемент Из СтруктураОбъектов.Значение Цикл
			
			НомерТипаДокумента = НомерТипаДокумента + 1;
			Если НомерТипаДокумента > 1 Тогда                          	
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыОЗ2(ПараметрыПечати, Элемент.Ссылка);
 	        НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			ЗаполнитьМакетОЗ2(ТабличныйДокумент, ДанныеДляПечати, ОбъектыПечати, СведенияАктуальны, Элемент.Ссылка);
			
			// В табличном документе зададим имя области, в которую был 
			// выведен объект. Нужно для возможности печати покомплектно.
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Элемент.Ссылка); 			
			
		КонецЦикла;
		

		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьМакетОЗ2(ТабличныйДокумент, ВыборкаПоДокументам, ОбъектыПечати, СведенияАктуальны, Ссылка)
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьОЗ2.ПФ_MXL_UK_ОЗ2");

	ВыборкаПоОС = ВыборкаПоДокументам.Выбрать();

	
						
		
	Пока ВыборкаПоОС.Следующий() Цикл
				
		ОбластьМакета = Макет.ПолучитьОбласть("ОЗ2");
		ОбластьМакета.Параметры.Заполнить(ВыборкаПоОС);
		
		ОсновныеСотрудникиФизическихЛицПринял = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ВыборкаПоОС.Принял, Истина, Ссылка.Организация, Ссылка.Дата);
		Если ЗначениеЗаполнено(ОсновныеСотрудникиФизическихЛицПринял) Тогда
			Для каждого Строка Из ОсновныеСотрудникиФизическихЛицПринял Цикл
			    ДанныеФизЛицаПолучил = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Строка.Сотрудник, "Должность", Ссылка.Дата);			
			КонецЦикла;
			Для каждого СтрокаДанныеПолучил Из ДанныеФизЛицаПолучил Цикл			
				ОбластьМакета.Параметры.ПринялДолжность = СтрокаДанныеПолучил.Должность;
				ОбластьМакета.Параметры.Принял 			= СтрокаДанныеПолучил.ФизическоеЛицо;			
			КонецЦикла;
		КонецЕсли;
		ОсновныеСотрудникиФизическихЛицСдал = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ВыборкаПоОС.Сдал, Истина, Ссылка.Организация, Ссылка.Дата);
		Если ЗначениеЗаполнено(ОсновныеСотрудникиФизическихЛицСдал) Тогда		
			Для каждого Строка Из ОсновныеСотрудникиФизическихЛицСдал Цикл
				ДанныеФизЛицаСдал = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Строка.Сотрудник, "Должность", Ссылка.Дата);
			КонецЦикла;
			Для каждого СтрокаДанныеСдал Из ДанныеФизЛицаСдал Цикл
				ОбластьМакета.Параметры.СдалДолжность 	= СтрокаДанныеСдал.Должность;
				ОбластьМакета.Параметры.Сдал	 		= СтрокаДанныеСдал.ФизическоеЛицо;
			КонецЦикла;			
		КонецЕсли;
		ОсновныеСотрудникиФизическихЛицРуководительОтдела = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(ВыборкаПоОС.РуководительОтдела, Истина, Ссылка.Организация, Ссылка.Дата); 
		Если ЗначениеЗаполнено(ОсновныеСотрудникиФизическихЛицРуководительОтдела) Тогда
			Для каждого СтрокаДанныеРуководительОтдела Из ОсновныеСотрудникиФизическихЛицРуководительОтдела Цикл
				ДанныеФизЛицаРуководительОтдела = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СтрокаДанныеРуководительОтдела.Сотрудник, "Должность", Ссылка.Дата);
			КонецЦикла;
			Для каждого СтрокаДанныеРуководительОтдела Из ДанныеФизЛицаРуководительОтдела Цикл
				ОбластьМакета.Параметры.РуководительОтдела = СтрокаДанныеРуководительОтдела.ФизическоеЛицо;
			КонецЦикла;
		КонецЕсли;
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Ссылка.Организация, Ссылка.Дата);

		ОбластьМакета.Параметры.ГлавныйБухгалтер 	= ОтветственныеЛица.ГлавныйБухгалтерПредставление;
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли