Функция Виза_ДокументДоступен_НовыеСостояния(пПараметры, пРезультат = Неопределено, пДопы = Неопределено)   Экспорт 
	
	Если ТипЗнч(пПараметры) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") тогда 
		
		лЗапрос = Новый Запрос();
		лЗапрос.Текст = "ВЫБРАТЬ
		                |	Т1.Автор,
		                |	Т1.Ответственный,
		                |	Т1.Ссылка,
		                |	Т1.Виза_Состояние
		                |ИЗ
		                |	Документ.СчетНаОплатуПоставщика КАК Т1
		                |ГДЕ
		                |	Т1.Ссылка = &Ссылка
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	Т2.Ссылка,
		                |	Т2.НомерСтроки,
		                |	Т2.Пользователь
		                |ИЗ
		                |	Документ.СчетНаОплатуПоставщика.ТекущиеВизирующие КАК Т2
		                |ГДЕ
		                |	Т2.Ссылка = &Ссылка
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	Т_ПредварительныеВизы.Ссылка,
		                |	Т_ПредварительныеВизы.НомерСтроки,
		                |	Т_ПредварительныеВизы.Пользователь,
		                |	Т_ПредварительныеВизы.Утверждено,
		                |	Т_ПредварительныеВизы.ДатаУтверждения,
		                |	Т_ПредварительныеВизы.Роли
		                |ИЗ
		                |	Документ.СчетНаОплатуПоставщика.ПредварительныеВизы КАК Т_ПредварительныеВизы
		                |ГДЕ
		                |	Т_ПредварительныеВизы.Ссылка = &Ссылка";
		лЗапрос.УстановитьПараметр("Ссылка", пПараметры);
		
		лРезультат = лЗапрос.ВыполнитьПакет();
		лПараметры = Новый  Структура("Автор, Ответственный, Ссылка, ТекущиеВизирующие, Виза_Состояние, ПредварительныеВизы ");
		ЗаполнитьЗначенияСвойств(лПараметры, лРезультат[0].Выгрузить()[0]);
		лПараметры.ТекущиеВизирующие 	= лРезультат[1].Выгрузить();
		лПараметры.ПредварительныеВизы	= лРезультат[2].Выгрузить();
	Иначе
		лПараметры = пПараметры;
	КонецЕсли;
	
	лТекПользователь 			= Неопределено;
	лРольДоступна_ПолныеПрава 	= Истина;	
	Если НЕ пДопы = Неопределено Тогда 
		пДопы.Свойство("ТекущийПользователь", 		лТекПользователь);
		пДопы.Свойство("РольДоступна_ПолныеПрава", 	лРольДоступна_ПолныеПрава);
	Иначе
		лТекПользователь 			= Пользователи.ТекущийПользователь();
		лРольДоступна_ПолныеПрава 	= РольДоступна("ПолныеПрава");
	КонецЕсли;

	
	лДоступнаФорма 		= Ложь;
	лТекСостояние 		= ?( ЗначениеЗаполнено(лПараметры.Виза_Состояние), лПараметры.Виза_Состояние, Перечисления.Визы_Состояния.Черновик);
	лПредварительныеВизы= лПараметры.ПредварительныеВизы;
	лДоступныеСостояния = Новый Массив();
	лЭтоАвтор 			= лПараметры.Ответственный = лТекПользователь ИЛИ лПараметры.Автор = лТекПользователь или НЕ ЗначениеЗаполнено( лПараметры.Ссылка );   
	
	Если 		НЕ ЗначениеЗаполнено(лПараметры.Ссылка) Тогда 
		лДоступнаФорма 	= Истина;
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Утвержден);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденСКомментариями);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденПоСхеме);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Черновик);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Отклонено);
		лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Анулировано);
		
	ИначеЕсли	лТекСостояние = Перечисления.Визы_Состояния.Черновик 
		ИЛИ		лТекСостояние = Перечисления.Визы_Состояния.Анулировано
		ИЛИ		лТекСостояние = Перечисления.Визы_Состояния.Отклонено Тогда 
		
		лДоступнаФорма	= лЭтоАвтор ИЛИ лРольДоступна_ПолныеПрава;
		
		Если лЭтоАвтор ИЛИ лРольДоступна_ПолныеПрава тогда   
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Утвержден);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденСКомментариями);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденПоСхеме);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Черновик);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Отклонено);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Анулировано);
		КонецЕсли;
		
	ИначеЕсли 	лТекСостояние = Перечисления.Визы_Состояния.НаВизировании Тогда 
		
		Если	лРольДоступна_ПолныеПрава 
			ИЛИ НЕ лПараметры.ТекущиеВизирующие.НайтиСтроки( Новый Структура("Пользователь",  лТекПользователь) ).Количество() = 0 тогда 
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Утвержден);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.УтвержденСКомментариями);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Отклонено);
		КонецЕсли;
	
		Если лЭтоАвтор ИЛИ лРольДоступна_ПолныеПрава тогда   
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Черновик);
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Анулировано);
		КонецЕсли;
		
		//Сава 2016/08 - предварительная виза
		Если НЕ лПредварительныеВизы.НайтиСтроки(Новый Структура("Пользователь", лТекПользователь) ).Количество() = 0  тогда   
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.ПустаяСсылка());//Предварительная виза
		КонецЕсли;
		
		
	ИначеЕсли   лТекСостояние = Перечисления.Визы_Состояния.Утвержден Тогда 
		
		Если	лРольДоступна_ПолныеПрава тогда
			лДоступныеСостояния.Добавить(Перечисления.Визы_Состояния.Отклонено);
		КонецЕсли;
			
	КонецЕсли;
		
	//Сава: 2016/05/18 переводим из массива в структуру 
	лСоотвИмен = Новый Соответствие();
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.Анулировано , 	"Анулировать");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.НаВизировании, "На визирование");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.Отклонено , 	"Оклонить");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.Утвержден, 	"Утвердить");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.УтвержденПоСхеме, "Утвердить (по схеме)");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.УтвержденСКомментариями, 	"Утвердить (с комментариями)");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.Черновик, 		"Черновик");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.ОтложеноСКомментарием, "Отложено (с комментарием)");
	лСоотвИмен.Вставить(Перечисления.Визы_Состояния.ПустаяСсылка(),"ОТЛОЖЕНО (виза)");
	лСписОК = Новый СписокЗначений();
	
	Для Каждого лСтрока Из лДоступныеСостояния Цикл 
		лВремПерем = лСоотвИмен.Получить(лСтрока);
	  	лСписОК.Добавить(лСтрока, ?(лВремПерем = Неопределено, Строка(лСтрока),  лВремПерем) );
	КонецЦикла;
	
	
	пРезультат = ?( ТипЗнч(пРезультат) = Тип("Структура"), пРезультат, Новый Структура);
	пРезультат.Вставить("ФормаДоступна",	лДоступнаФорма);
	//пРезультат.Вставить("Состояния", 		лДоступныеСостояния);
	пРезультат.Вставить("Состояния", 		лСписОК);
	
	пРезультат.Вставить("СкипатьЭлФормы", 	"");
	Если  	лРольДоступна_ПолныеПрава 
		ИЛИ НЕ лПараметры.ТекущиеВизирующие.НайтиСтроки( Новый Структура("Пользователь",  лТекПользователь) ).Количество() = 0 тогда 
		//**пРезультат.Вставить("СкипатьЭлФормы", 	"СуммаДокумента, Комментарий");
		//zhukoff++ Временно разрешаем менять статью
		//пРезультат.Вставить("СкипатьЭлФормы", 	"СуммаДокумента, Комментарий, СтатьяДвиженияДенежныхСредств");
		пРезультат.Вставить("СкипатьЭлФормы", 	"ПриоритетнаяСхемаВизирования,СуммаДокумента, Комментарий, СтатьяДвиженияДенежныхСредств, Визы, ТекущиеВизирующие, ПредварительныеВизы");
	КонецЕсли;

	//++ Бахтишаев А.Э. , 26/09/16 06:29,290
	Если РольДоступна("ДоступностьСчетовПоОрганизациям")
		И лТекСостояние = Перечисления.Визы_Состояния.НаВизировании
		И ТипЗнч(пПараметры) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
		Если пПараметры.Подразделение.ДетализацияДоСекций Тогда
			пРезультат.Вставить("СкипатьЭлФормы", 	"СуммаДокумента, Комментарий, СтатьяДвиженияДенежныхСредств, Визы, ТекущиеВизирующие, ПредварительныеВизы, Организация, Секция");
		Иначе
			пРезультат.Вставить("СкипатьЭлФормы", 	"СуммаДокумента, Комментарий, СтатьяДвиженияДенежныхСредств, Визы, ТекущиеВизирующие, ПредварительныеВизы, Организация");
		КонецЕсли;
	КонецЕсли;		
	//-- Бахтишаев А.Э. , 26/09/16 06:29
	
	//++ Павел Чистяков 11.10.2016 15:49:12 №316
	//Сава по просьбе ГлБуха - запечатываем
	//Если РольДоступна(Метаданные.Роли.Казначей)
	//	И ТипЗнч(пПараметры) = Тип("ДокументСсылка.СчетНаОплатуПоставщика") Тогда
	//	Если пРезультат.Свойство("СкипатьЭлФормы") Тогда
	//		пРезультат.СкипатьЭлФормы = пРезультат.СкипатьЭлФормы + ", Контрагент, СчетКонтрагента";
	//	Иначе
	//		пРезультат.Вставить("СкипатьЭлФормы","Контрагент, СчетКонтрагента");
	//	КонецЕсли;
	//КонецЕсли; 
	
	//-- Павел Чистяков 11.10.2016 15:49:55 
	
	Возврат лДоступнаФорма
		ИЛИ ( НЕ 	лТекСостояние = Перечисления.Визы_Состояния.Утвержден И лРольДоступна_ПолныеПрава )  
		ИЛИ  РольДоступна("СчетПокупателя_ИзменениеУтвержденных") 
		ИЛИ ( 		лТекСостояние = Перечисления.Визы_Состояния.Утвержден И РольДоступна("СчетПокупателя_ИзменениеУтвержденных") )  ;
	
КонецФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Процедура ОбновитьСтрокуСчетаОснования(Объект, Строка) Экспорт
	
	Если Объект.СтатьяДвиженияДенежныхСредств=Константы.СтатьяКомисияНал.Получить() Тогда
		Строка.Сумма = Строка.Счет.СуммаКоммисии;
	Иначе
		Строка.Сумма = Строка.Счет.СуммаДокумента;
	КонецЕсли;
	Объект.СуммаДокумента = Объект.СчетаОснования.Итог("Сумма");
	
КонецПроцедуры