Процедура ВыполнитьПриход(Объект) Экспорт
	
	НоваяСтрока = ЭтотОбъект.Добавить();
	
	НоваяСтрока.Период		= Объект.Дата;
	НоваяСтрока.ВидДвижения	= ВидДвиженияНакопления.Приход;
	НоваяСтрока.Документ	= Объект.Ссылка;
	НоваяСтрока.Сумма		= Объект.СуммаДокумента;
	
	Записывать = Истина;
	
конецПроцедуры

Процедура ВыполнитьПриходДляПодчиненного(Объект) Экспорт
	
	НоваяСтрока = ЭтотОбъект.Добавить();
	
	НоваяСтрока.Период		= Объект.Дата;
	НоваяСтрока.ВидДвижения	= ВидДвиженияНакопления.Приход;
	НоваяСтрока.Документ	= Объект.СчетНаОплатуПоставщика;
	НоваяСтрока.Сумма		= Объект.СуммаДокумента;
	
	Записывать = Истина;
	
конецПроцедуры
Процедура ВыполнитьРасход(Объект) Экспорт
	
	Для Каждого Строка Из Объект.СчетаОснования Цикл
		
		НоваяСтрока = ЭтотОбъект.Добавить();
		
		НоваяСтрока.Период		= Объект.Дата;
		НоваяСтрока.ВидДвижения	= ВидДвиженияНакопления.Расход;
		НоваяСтрока.Документ	= Строка.Счет;
		НоваяСтрока.Сумма		= Строка.Счет.СуммаДокумента;
		
	КонецЦикла;
	
	Записывать = Истина;
	
КонецПроцедуры

Процедура ВыполнитьСторноОстатка(Ссылка, Дата) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетаНалОстатки.Документ,
	|	-СчетаНалОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.СчетаНал.Остатки(&Дата, Документ = &Документ) КАК СчетаНалОстатки"
	);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НоваяСтрока = Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
	КонецЕсли; 
	
	Записывать = Истина;
	
КонецПроцедуры