#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает текст подсказки по методике управления производством
//
// Параметры:
//  Методика - ПеречислениеСсылка.МетодикаУправленияПроизводством - методика управления производством.
// 
// Возвращаемое значение:
//  Строка - подсказка по методике управления производством.
//
Функция ПодсказкаПоМетодике(Методика) Экспорт
	
	Если Методика = Перечисления.МетодикаУправленияПроизводством.ПланированиеПроизводственныхРесурсов Тогда
		
		Возврат НСтр("ru='График производства рассчитывается на основе доступности видов рабочих центров и потребности в материалах. Этапам назначаются сроки выполнения.';uk='Графік виробництва розраховується на основі доступності видів робочих центрів і потреби в матеріалах. Етапам призначаються строки виконання.'");
		
	ИначеЕсли Методика = Перечисления.МетодикаУправленияПроизводством.ПланированиеПотребностиВМатериалах Тогда
		
		Возврат НСтр("ru='Расчет графика производства выполняется с учетом потребности в материалах. Виды рабочих центров не используются при расчете графика. Этапам назначаются сроки выполнения.';uk='Розрахунок графіка виробництва виконується з урахуванням потреби в матеріалах. Види робочих центрів не використовуються при розрахунку графіка. Етапам призначаються терміни виконання.'");
		
	Иначе
		
		Возврат НСтр("ru='График производства не рассчитывается. Сроки выполнения этапов не назначаются, этапы выполняются согласно очереди.';uk='Графік виробництва не розраховується. Строки виконання етапів не призначаються, етапи виконуються згідно з чергою.'");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли