
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Массив")  Тогда
		Если Параметры.Массив <> Неопределено Тогда
			Для Каждого ТекСтрока Из Параметры.Массив Цикл
				НоваяСтрока = ВыработкаАгрегатов.Добавить();
				НоваяСтрока.ТС = ТекСтрока.ТС;
				НоваяСтрока.Агрегат = ТекСтрока.Агрегат;
				НоваяСтрока.ПараметрВыработки = ТекСтрока.ПараметрВыработки;
				НоваяСтрока.Количество = ТекСтрока.Количество;
			КонецЦикла;
			Если ВыработкаАгрегатов.Количество() = 0 Тогда
				Отказ = Истина;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет выработки по агрегатам, установленным на ТС!");
			КонецЕсли;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

























