
#Область СлужебныйПрограммныйИнтерфейс

// Обработчик формирования строки наименования позиции штатного расписания.
//
Процедура ПриЗаполненииНаименованияПозицииШтатногоРасписания(Форма, СтандартнаяОбработка) Экспорт
	
	Если Форма.Элементы.Найти("МестоВСтруктуреПредприятия") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.МестоВСтруктуреПредприятия.Подразделение) Тогда
		// Если управленческое подразделение не заполнено, сохраняем прежний порядок именования позиции.
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Объект = Форма.Объект; 
	
	Объект.Наименование = ОрганизационнаяСтруктураКлиентСервер.НаименованиеПозицииШтатногоРасписания(
		Объект.Владелец, 
		Объект.Должность, 
		Форма.МестоВСтруктуреПредприятия.Подразделение)
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВыбратьУправленческуюПозициюИзСписка(Форма, АдресСпискаПодобранных) Экспорт 
	
	УправленческаяОрганизация = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");

	
	СтруктураОтбор = Новый Структура;
	СтруктураОтбор.Вставить("Владелец", УправленческаяОрганизация);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Отбор", СтруктураОтбор);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	ПараметрыОткрытия.Вставить("СкрытьПанельВводаДокументов", Истина);
	ПараметрыОткрытия.Вставить("АдресСпискаПодобранных", АдресСпискаПодобранных);
	
	ОткрытьФорму("Справочник.ШтатноеРасписание.ФормаВыбора", ПараметрыОткрытия, Форма.Элементы.Позиции);
	
КонецПроцедуры

#КонецОбласти
