#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ДанныеРегистрацийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДанныеРегистраций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиКРегистрацииПрограммы(ТекущиеДанные.АдресХранилищаРегистрации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьФайлРегистрации(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьРасширениеРаботыСФайламиЗавершение", ЭтотОбъект,
		Новый Структура("ИдентификаторФормы", УникальныйИдентификатор));
	ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРегистрацию(Команда)
	
	ТекущиеДанные = Элементы.ДанныеРегистраций.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиКРегистрацииПрограммы(ТекущиеДанные.АдресХранилищаРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРаботу(Команда)
	
	Если ДанныеОрганизации.Организация.Пустая() ИЛИ ДанныеОрганизации.КодПоЕДРПОУ = КодПоЕДРПОУРегистрации Тогда
		
		ЗавершитьАктивацию();
		
	Иначе
		
		ШаблонВопроса = НСтр("ru='В информационной базе уже ведется учет по организации %1 с кодом ЕДРПОУ %2.
            |После выполнения активации кодом ЕДРПОУ будет заменен на %3.'
            |;uk='В інформаційній базі вже ведеться облік по організації %1 з кодом ЄДРПОУ %2.
            |Після виконання активації кодом ЄДРПОУ буде замінений на %3.'");
		ТекстВопроса = СтрШаблон(ШаблонВопроса, ДанныеОрганизации.НаименованиеСокращенное, 
			ДанныеОрганизации.КодПоЕДРПОУ, КодПоЕДРПОУРегистрации);
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.ОК, НСтр("ru='Выполнить активацию';uk='Виконати активацію'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена);
		Оповещение = Новый ОписаниеОповещения("НачатьРаботуЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, Кнопки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьАктивацию()
	
	СоздатьОрганизацию();
	
	Если ЭтотОбъект.Открыта() Тогда
		ЭтотОбъект.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьРаботуЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт

	Если РезультатВопроса = КодВозвратаДиалога.ОК Тогда
		ЗавершитьАктивацию();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаАктивироватьЧерезИнтернетНажатие(Элемент)
	
	ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаАктивацияЧерезИнтернет");
	ТекстОшибкиАктивации	 = Новый ФорматированнаяСтрока("");
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаАктивироватьСПомощьюФайлаРегистрацииНажатие(Элемент)
	
	ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаАктивацияИзФайла");
	ТекстОшибкиАктивации	 = Новый ФорматированнаяСтрока("");
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаВыбратьДругойФайлРегистрацииНажатие(Элемент)
	
	ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаАктивацияИзФайла");
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаВыбратьДругуюУчетнуюЗаписьНажатие(Элемент)
	
	ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаАктивацияЧерезИнтернет");
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаВыбратьДругуюРегистрациюНажатие(Элемент)
	
	ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаВыборРегистрации");
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьЧерезИнтернет(Команда)
	
	СпособАктивации = "АктивацияЧерезИнтернет";
	Если Не ЗначениеЗаполнено(ЛогинИнтернетПоддержки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Введите логин';uk='Введіть логін'"),, "ЛогинИнтернетПоддержки");
		
		Возврат;
		
	ИначеЕсли Не ЗначениеЗаполнено(ПарольИнтернетПоддержки) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Введите пароль';uk='Введіть пароль'"),, "ПарольИнтернетПоддержки");
		
		Возврат;
		
	КонецЕсли;
	
	НачатьАктивациюЧерезИнтернет();
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаВосстановлениеПароляНажатие(Элемент)
	
	ИнтернетПоддержкаПользователейКлиент.ОткрытьВебСтраницу(
		ИнтернетПоддержкаПользователейКлиентСервер.URLСтраницыСервисаLogin("/remind_request"),
		НСтр("ru='Восстановление пароля';uk='Відновлення пароля'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаИнструкцияНажатие(Элемент)
	
	ОткрытьФормуИнструкции();
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИнформацияОбАктивацииИзФайлаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПорядокАктивации" Тогда
		СтандартнаяОбработка = Ложь;
		ОткрытьФормуИнструкции();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодключитьРасширениеРаботыСФайламиЗавершение(РасширениеРаботыСФайламиПодключено, ДополнительныеПараметры) Экспорт
	
	Если РасширениеРаботыСФайламиПодключено Тогда
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла.Фильтр             = "(*.zip)|*.zip";
		ДиалогВыбораФайла.МножественныйВыбор = Ложь;
		ДиалогВыбораФайла.Заголовок          = НСтр("ru='Выберите файл регистрации';uk='Виберіть файл реєстрації'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПомещениеФайлаЕстьРасширениеРаботыСФайламиЗавершение", ЭтотОбъект);
		НачатьПомещениеФайлов(ОписаниеОповещения, ДиалогВыбораФайла, Истина, ДополнительныеПараметры.ИдентификаторФормы);
		
	Иначе
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПомещениеФайлаБезРасширенияРаботыСФайламиЗавершение", ЭтотОбъект);
		НачатьПомещениеФайла(ОписаниеОповещения,,, Истина,  ДополнительныеПараметры.ИдентификаторФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеФайлаБезРасширенияРаботыСФайламиЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт

	Если Результат Тогда
		
		РасширениеФайла = НРег(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ВыбранноеИмяФайла));
		Если РасширениеФайла = "zip" Тогда
			
			ОбработатьФайлАктивации(Адрес);
			
		Иначе
			
			ТекстСообщения = НСтр("ru='Данные для активации программы должны быть в файле с расширением zip.';uk='Дані для активації програми мають бути у файлі з розширенням zip.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПомещениеФайлаЕстьРасширениеРаботыСФайламиЗавершение(ПомещенныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПомещенныеФайлы <> Неопределено И ПомещенныеФайлы.Количество() > 0 Тогда
		
		ОбработатьФайлАктивации(ПомещенныеФайлы[0].Хранение);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФайлАктивации(АдресХранилища)
	
	СпособАктивации = "АктивацияИзФайла";
	ОбработатьДанныеАктивацииСервер(АдресХранилища);
	
	Если АктивацияВыполнена Тогда
		ОповеститьОбАктивацииИЗакрытьОкно();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДанныеАктивацииСервер(АдресХранилищаДанных)
	
	// Обработка файла регистрации
	ТекстОшибкиАктивации = Новый ФорматированнаяСтрока("");
	СписокРегистраций = Новый Массив;
	ВерныеРегистрации = Новый Массив;
	Если СпособАктивации = "АктивацияИзФайла" Тогда
		
		СписокРегистраций = НачалоРаботы.РегистрацииИзФайла(АдресХранилищаДанных);
		
		ВерныеРегистрации = ВерныеРегистрации(СписокРегистраций);
		
		Если СписокРегистраций.Количество() = 0 Тогда
			
			ТекстОшибкиАктивации = Новый ФорматированнаяСтрока(
				НСтр("ru='Выбранный файл не содержит регистрационных данных. Выберите другой файл.';uk='Вибраний файл не містить реєстраційних даних. Виберіть інший файл.'"));
			
		ИначеЕсли ВерныеРегистрации.Количество() = 0 Тогда
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(НСтр("ru='В файле содержатся некорректные регистрационные данные. Получите файл регистрации на';uk='У файлі містяться некоректні реєстраційні дані. Отримайте файл реєстрації на'") + " ");
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Портале ИТС';uk='Порталі ІТС'"),,,,"https://portal.bas-soft.eu/software"));
			ТекстОшибкиАктивации = Новый ФорматированнаяСтрока(МассивСтрок);
			
		КонецЕсли;
		
	Иначе // через Интернет
		
		ДанныеСВебСервиса = ПолучитьИзВременногоХранилища(АдресХранилищаДанных);
		ОшибкаСВебСервиса = "";
		КодОшибки = 0;
		Если ДанныеСВебСервиса = Неопределено Тогда
			
			ОшибкаСВебСервиса = "Неопределено";
			
		Иначе
			
			СписокРегистраций = ДанныеСВебСервиса.Регистрации;
			ОшибкаСВебСервиса = ДанныеСВебСервиса.Ошибка;
			КодОшибки         = ДанныеСВебСервиса.КодОшибки;
			
		КонецЕсли;
		
		Если ОшибкаСВебСервиса = "Неопределено"
			ИЛИ ОшибкаСВебСервиса = "ОшибкаПодключения" Тогда
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(НСтр("ru='При подключении к сервису возникла ошибка. Возможно, указаны неверные настройки';uk='При підключенні до сервісу виникла помилка. Можливо, вказано неправильні настройки'") + " ");
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='прокси-сервера';uk='проксі-сервер'"),,,, "e1cib/app/ОбщаяФорма.ПараметрыПроксиСервера"));
			МассивСтрок.Добавить(". " + НСтр("ru='Подробности в';uk='Подробиці в'") + " ");
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='журнале регистрации';uk='журналі реєстрації'"),,,, "e1cib/app/Обработка.ЖурналРегистрации"));
			МассивСтрок.Добавить(".");
			ТекстОшибкиАктивации = Новый ФорматированнаяСтрока(МассивСтрок);
			
		ИначеЕсли ОшибкаСВебСервиса = "ОшибкаАвторизации" Тогда
			
			ТекстОшибкиАктивации = Новый ФорматированнаяСтрока(
				НСтр("ru='Неверный логин или пароль. Укажите правильные данные для авторизации.';uk='Невірний логін або пароль. Зазначте правильні дані для авторизації.'"));
				
		ИначеЕсли ОшибкаСВебСервиса = "ОшибкаСервиса" Тогда
			
			МассивСтрок = Новый Массив;
			МассивСтрок.Добавить(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
									НСтр("ru='При подключении к сервису возникла ошибка (код %1). Возможно, указаны неверные настройки';uk='У разі підключення до сервісу виникла помилка (код %1). Можливо, зазначені неправильні настройки'") + " ",
									КодОшибки));
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='прокси-сервера';uk='проксі-сервер'"),,,, "e1cib/app/ОбщаяФорма.ПараметрыПроксиСервера"));
			МассивСтрок.Добавить(". " + НСтр("ru='Подробности в';uk='Подробиці в'") + " ");
			МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='журнале регистрации';uk='журналі реєстрації'"),,,, "e1cib/app/Обработка.ЖурналРегистрации"));
			МассивСтрок.Добавить(".");
			ТекстОшибкиАктивации = Новый ФорматированнаяСтрока(МассивСтрок);
			
		Иначе
			
			ВерныеРегистрации = ВерныеРегистрации(СписокРегистраций);
			
			Если ВерныеРегистрации.Количество() = 0 Тогда
				
				МассивСтрок = Новый Массив;
				МассивСтрок.Добавить(НСтр("ru='Для учетной записи нет ни одной зарегистрированной поставки.';uk='Для облікового запису немає жодної зареєстрованої поставки.'") + " ");
				МассивСтрок.Добавить(НСтр("ru='Список поставок можно посмотреть в Личном кабинете';uk='Список поставок можна переглянути в Особистому кабінеті'") + " ");
				МассивСтрок.Добавить(Новый ФорматированнаяСтрока(НСтр("ru='Портала ИТС';uk='Порталу ІТС'"),,,, "https://portal.bas-soft.eu/software"));
				МассивСтрок.Добавить(НСтр("ru='.';uk='.'"));
				ТекстОшибкиАктивации = Новый ФорматированнаяСтрока(МассивСтрок);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если нет ошибок
	Если ПустаяСтрока(ТекстОшибкиАктивации) Тогда
		
		ОбработатьРегистрации(ВерныеРегистрации);
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Функция ВерныеРегистрации(СписокРегистраций)
	
	ВерныеРегистрации = Новый Массив;
	
	Если СписокРегистраций.Количество() > 0 Тогда
		
		Для Каждого Регистрация Из СписокРегистраций Цикл
			
			СведенияОРегистрации = Регистрация.СведенияОРегистрации;
			Если СведенияОРегистрации.РегистрацияСуществует
				И СведенияОРегистрации.ПодписьРегистрацииВерна Тогда
				
				ВерныеРегистрации.Добавить(Регистрация);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ВерныеРегистрации;
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	// Параметр АктивацияОрганизации показывает, что нужно выполнять только
	// активацию существующей организации, без возможности изменения кода по ЕДРПОУ
	АктивацияОрганизации = Параметры.АктивацияОрганизации;
	
	ДанныеОрганизации = Обработки.НачалоРаботы.ПолучитьДанныеОрганизации();
	
	ТекстОшибкиАктивации = Новый ФорматированнаяСтрока("");
	Если НачалоРаботы.ДоступенСервисАктивации() Тогда
		ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаАктивацияЧерезИнтернет");
	Иначе 
		ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаАктивацияИзФайла");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ЛогинПарольИПП = ИнтернетПоддержкаПользователей.ДанныеАутентификацииПользователяИнтернетПоддержки();
	УстановитьПривилегированныйРежим(Ложь);
	Если ЛогинПарольИПП <> Неопределено Тогда
		
		ЛогинИнтернетПоддержки  = ЛогинПарольИПП.Логин;
		ПарольИнтернетПоддержки = ЛогинПарольИПП.Пароль;
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	
	ЕстьОшибка = Не ПустаяСтрока(Форма.ТекстОшибкиАктивации);
	
	Элементы.ГруппаОшибкаПриАктивацииИзФайла.Видимость       = ЕстьОшибка И Форма.СпособАктивации = "АктивацияИзФайла";
	Элементы.ГруппаОшибкаПриАктивацииЧерезИнтернет.Видимость = ЕстьОшибка И Форма.СпособАктивации = "АктивацияЧерезИнтернет";
	
	Элементы.ТекстОшибкиПриАктивацииИзФайла.Заголовок       = Форма.ТекстОшибкиАктивации;
	Элементы.ТекстОшибкиПриАктивацииЧерезИнтернет.Заголовок = Форма.ТекстОшибкиАктивации;
	
	// Установим видимость гиперссылок, возвращающих на предыдущий экран
	НесколькоРегистраций = Форма.ДанныеРегистраций.Количество() > 1;
	
	Элементы.ГиперссылкаВыбратьДругойФайлРегистрации.Видимость      = НЕ НесколькоРегистраций И Форма.СпособАктивации = "АктивацияИзФайла";
	Элементы.ГиперссылкаВыбратьДругойФайлРегистрацииВыбор.Видимость = НесколькоРегистраций И Форма.СпособАктивации = "АктивацияИзФайла";
	Элементы.ГиперссылкаВыбратьДругуюУчетнуюЗапись.Видимость        = НЕ НесколькоРегистраций И Форма.СпособАктивации = "АктивацияЧерезИнтернет";
	Элементы.ГиперссылкаВыбратьДругуюУчетнуюЗаписьВыбор.Видимость   = НесколькоРегистраций И Форма.СпособАктивации = "АктивацияЧерезИнтернет";
	Элементы.ГиперссылкаВыбратьДругуюРегистрацию.Видимость          = НесколькоРегистраций;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПерейтиНаСтраницу(Форма, АктивнаяСтраница)
	
	Форма.АктивнаяСтраница = АктивнаяСтраница;
	
	Элементы = Форма.Элементы;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы[Форма.АктивнаяСтраница];
	
	Если Форма.АктивнаяСтраница = "СтраницаАктивацияИзФайла" Тогда
		
		Элементы.ВыбратьФайлРегистрации.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли Форма.АктивнаяСтраница = "СтраницаАктивацияЧерезИнтернет" Тогда
		
		Элементы.АктивироватьЧерезИнтернет.КнопкаПоУмолчанию	 = Истина;
		Элементы.ГруппаОжиданиеАктивацииЧерезИнтернет.Видимость	 = Ложь;
		
	ИначеЕсли Форма.АктивнаяСтраница = "СтраницаВыборРегистрации" Тогда
		
		Элементы.ВыбратьРегистрацию.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли Форма.АктивнаяСтраница = "СтраницаНачатьРаботу" Тогда
		
		Элементы.НачатьРаботу.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьРегистрации(Регистрации)
	
	Если Регистрации.Количество() = 0 Тогда
		Возврат;
	Иначе
		
		Если АктивацияОрганизации
			И ЗначениеЗаполнено(ДанныеОрганизации.Организация) Тогда
			// В информационной базе уже создана организация и форма открыта в режиме только активации.
			// Нужно найти данные для ее регистрации выполнить регистрацию.
			
			РегистрацияТекущейОрганизации = Обработки.НачалоРаботы.РегистрацияОрганизации(ДанныеОрганизации, Регистрации);
			
			Если РегистрацияТекущейОрганизации <> Неопределено Тогда
				НачалоРаботы.ЗаписатьРегистрацию(РегистрацияТекущейОрганизации.СведенияОРегистрации,
							РегистрацияТекущейОрганизации.Регистрация, РегистрацияТекущейОрганизации.ЭлектроннаяПодпись);
				АктивацияВыполнена = Истина;
				// Сохраним логин и пароль интернет-поддержки
				
				Если СпособАктивации = "АктивацияЧерезИнтернет" Тогда
					// Сохраняем логин и пароль
					ДанныеАутентификации = Новый Структура("Логин, Пароль", ЛогинИнтернетПоддержки, ПарольИнтернетПоддержки);
					УстановитьПривилегированныйРежим(Истина);
					ИнтернетПоддержкаПользователей.СохранитьДанныеАутентификации(ДанныеАутентификации);
					УстановитьПривилегированныйРежим(Ложь);
				КонецЕсли;
				
			Иначе
				
				МассивСтрокОшибки = Новый Массив;
				Если СпособАктивации = "АктивацияЧерезИнтернет" Тогда
					МассивСтрокОшибки.Добавить(НСтр("ru='Для учетной записи';uk='Для облікового запису'"));
					МассивСтрокОшибки.Добавить(" ");
					МассивСтрокОшибки.Добавить(Новый ФорматированнаяСтрока(ЛогинИнтернетПоддержки, 
																	Новый Шрифт( , , Истина)));
					МассивСтрокОшибки.Добавить(" ");
					МассивСтрокОшибки.Добавить(НСтр("ru='не зарегистрирована организация';uk='не зареєстрована організація'"));
					МассивСтрокОшибки.Добавить(" ");
					МассивСтрокОшибки.Добавить(ДанныеОрганизации.НаименованиеСокращенное);
					МассивСтрокОшибки.Добавить(" ");
					МассивСтрокОшибки.Добавить(НСтр("ru='с кодом ЕДРПОУ';uk='з кодом ЄДРПОУ'"));
					МассивСтрокОшибки.Добавить(" ");
					МассивСтрокОшибки.Добавить(Новый ФорматированнаяСтрока(ДанныеОрганизации.КодПоЕДРПОУ,
																	Новый Шрифт( , , Истина)));
					МассивСтрокОшибки.Добавить("." + Символы.ПС);
					МассивСтрокОшибки.Добавить(НСтр("ru='Укажите учетную запись, на которую зарегистрирована программа.';uk='Вкажіть обліковий запис, на який зареєстровано програму.'"));
				Иначе
					МассивСтрокОшибки.Добавить(НСтр("ru='Выбранный файл не содержит сведений о регистрации программы для организации';uk='Вибраний файл не містить відомостей про реєстрацію програми для організації'"));
					МассивСтрокОшибки.Добавить(" ");
					МассивСтрокОшибки.Добавить(ДанныеОрганизации.НаименованиеСокращенное);
					МассивСтрокОшибки.Добавить(" ");
					МассивСтрокОшибки.Добавить(НСтр("ru='с кодом ЕДРПОУ';uk='з кодом ЄДРПОУ'"));
					МассивСтрокОшибки.Добавить(" ");
					МассивСтрокОшибки.Добавить(Новый ФорматированнаяСтрока(ДанныеОрганизации.КодПоЕДРПОУ,
																	Новый Шрифт( , , Истина)));
					МассивСтрокОшибки.Добавить("." + Символы.ПС);
					МассивСтрокОшибки.Добавить(НСтр("ru='Выберите другой файл.';uk='Виберіть інший файл.'"));
					
				КонецЕсли;
				ТекстОшибкиАктивации = Новый ФорматированнаяСтрока(МассивСтрокОшибки);
			КонецЕсли;
			
		Иначе
			
			Если Регистрации.Количество() = 1 Тогда
				ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаНачатьРаботу");
				
				ДанныеРегистраций.Очистить();
				
				УстановитьРегистрационныеДанные(ПоместитьВоВременноеХранилище(Регистрации[0], УникальныйИдентификатор));
				
			Иначе
				
				ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаВыборРегистрации");
				
				ДанныеРегистраций.Очистить();
				Для Каждого Регистрация Из Регистрации Цикл
					
					Данные = Регистрация.СведенияОРегистрации.ДанныеРегистрации;
					СтрокаТаблицы = ДанныеРегистраций.Добавить();
					СтрокаТаблицы.НаименованиеОрганизации	 = Данные.Наименование;
					СтрокаТаблицы.КодПоЕДРПОУ				 = Данные.КодПоЕДРПОУ;
					СтрокаТаблицы.АдресХранилищаРегистрации	 = ПоместитьВоВременноеХранилище(Регистрация, УникальныйИдентификатор);
					СтрокаТаблицы.Представление				 = Данные.Наименование + Символы.ПС
					+ НСтр("ru='Код ЕДРПОУ:';uk='Код ЄДРПОУ:'")+ " " + Данные.КодПоЕДРПОУ;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьРегистрационныеДанные(АдресХранилища)
	
	АдресХранилищаРегистрации = АдресХранилища;
	
	Регистрация = ПолучитьИзВременногоХранилища(АдресХранилищаРегистрации);
	
	РегистрационныеДанныеСтрокой = 
		НачалоРаботы.РегистрационныеДанныеФорматированнойСтрокой(Регистрация.СведенияОРегистрации);
	
	КодПоЕДРПОУРегистрации = Регистрация.СведенияОРегистрации.ДанныеРегистрации.КодПоЕДРПОУ;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьОрганизацию()
	
	ДанныеРегистрации = ПолучитьИзВременногоХранилища(АдресХранилищаРегистрации);
	Если ДанныеРегистрации <> Неопределено Тогда
		
		Если СпособАктивации = "АктивацияЧерезИнтернет" Тогда
			// Сохраняем логин и пароль
			ДанныеАутентификации = Новый Структура("Логин, Пароль", ЛогинИнтернетПоддержки, ПарольИнтернетПоддержки);
			УстановитьПривилегированныйРежим(Истина);
			ИнтернетПоддержкаПользователей.СохранитьДанныеАутентификации(ДанныеАутентификации);
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Создание организации';uk='Створення організації'");
		ПараметрыВыполнения.ЗапуститьВФоне= Истина; // В файловом варианте ожидать выполнения ранее запущенных фоновых заданий.
		ПараметрыВыполнения.ОжидатьЗавершение = 0;
		
		НачалоРаботы.ВыполнитьРегистрациюОрганизации(ДанныеРегистрации.СведенияОРегистрации, ДанныеРегистрации.Регистрация, ДанныеРегистрации.ЭлектроннаяПодпись);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеСВебСервиса()
	
	ТекстОшибкиАктивации = Новый ФорматированнаяСтрока(""); // очищаем
	Элементы.ГруппаОшибкаПриАктивацииЧерезИнтернет.Видимость = Ложь;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru='Получение регистрационных данных из веб-сервиса';uk='Отримання реєстраційних даних із вебсервісу'");
	ПараметрыВыполнения.ЗапуститьВФоне= Истина; // В файловом варианте ожидать выполнения ранее запущенных фоновых заданий.
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	ПараметрыЗадания = Новый Структура("ЛогинИПП, ПарольИПП", ЛогинИнтернетПоддержки, ПарольИнтернетПоддержки);
	
	Результат = ДлительныеОперации.ВыполнитьВФоне("НачалоРаботы.РегистрацииИзВебСервиса",
		ПараметрыЗадания, ПараметрыВыполнения);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеСВебСервисаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	УстановитьДоступностьЭлементовОжидание(Ложь);
	
	Если Результат = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ОбработатьДанныеАктивацииСервер(Результат.АдресРезультата);
	
	Если АктивацияВыполнена Тогда
		ОповеститьОбАктивацииИЗакрытьОкно();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовОжидание(Ожидание)
	
	Элементы.Страницы.ТекущаяСтраница.ТолькоПросмотр                   = Ожидание;
	
	Элементы.ГруппаОжиданиеАктивацииЧерезИнтернет.Видимость            = Ожидание;
	
	Элементы.АктивироватьЧерезИнтернет.Видимость                       = НЕ Ожидание;
	Элементы.ГиперссылкаАктивироватьСПомощьюФайлаРегистрации.Видимость = НЕ Ожидание;
	
	Элементы.ГруппаКомандаНачалаРаботы.Видимость  = НЕ Ожидание;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьАктивациюЧерезИнтернет()
	
	УстановитьДоступностьЭлементовОжидание(Истина);
	
	ДлительнаяОперация = ПолучитьДанныеСВебСервиса();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПолучитьДанныеСВебСервисаЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Процедура ПерейтиКРегистрацииПрограммы(АдресХранилища)
	
	ПерейтиНаСтраницу(ЭтотОбъект, "СтраницаНачатьРаботу");
	
	УстановитьРегистрационныеДанные(АдресХранилища);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредупреждениеЗавершение(Результат) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуИнструкции()
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АктивацияОрганизации", АктивацияОрганизации);
	ОткрытьФорму("Обработка.НачалоРаботы.Форма.ПорядокАктивации", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбАктивацииИЗакрытьОкно()
	
	ТекстОповещения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
						НСтр("ru='Программа успешно активирована';uk='Програму успішно активовано'"),
						ДанныеОрганизации.НаименованиеСокращенное, ДанныеОрганизации.КодПоЕДРПОУ);
	
	ПоказатьОповещениеПользователя(ТекстОповещения , , , БиблиотекаКартинок.ДлительнаяОперация48);
	
	Если ЭтотОбъект.Открыта() Тогда
		ЭтотОбъект.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти