
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьДанные();
	ЗагрузитьВыбранныеСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВыбранные(Команда)
	ЗагрузитьВыбранныеСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВыбранные(Команда)
	ЗаписатьВыбранныеСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанные()
	ТабРеквизиты = Пактум_Сервер.ПолучитьРеквизитыФормы_Пактум();
	РевизитыДляВывода.Загрузить(ТабРеквизиты);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьВыбранныеСервер()
	Настройки=ХранилищеОбщихНастроек.Загрузить("Обработка.Пактум_Контрагент", "Выбранные_Реквизиты", , "Пактум");
	Если ТипЗнч(Настройки)=Тип("Массив") Тогда
		Для Каждого ТекИД Из Настройки Цикл
			Набор = РевизитыДляВывода.НайтиСтроки(Новый Структура("ИД", ТекИД));
			Если Набор.Количество() > 0 Тогда
				Набор[0].Выводить = Истина;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Набор = РевизитыДляВывода.НайтиСтроки(Новый Структура("ИД", "ViewListEDR_State_text"));
		Если Набор.Количество() > 0 Тогда
			Набор[0].Выводить = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВыбранныеСервер()
	Настройки = Новый Массив; 
	Для Каждого Стр Из РевизитыДляВывода Цикл
		Если Стр.Выводить Тогда
			Настройки.Добавить(Стр.ИД);	
		КонецЕсли;
	КонецЦикла;
	
	ХранилищеОбщихНастроек.Сохранить("Обработка.Пактум_Контрагент", "Выбранные_Реквизиты", Настройки, , "Пактум");
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	ВыборСтрок(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьВсе(Команда)
	ВыборСтрок(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыборСтрок(ЗначениеВыбора)
	Для Каждого Стр Из РевизитыДляВывода Цикл
		Стр.Выводить = ЗначениеВыбора;	
	КонецЦикла;
КонецПроцедуры