
#Область ПрограммныйИнтерфейс

// Заполняет массив структур, которые будут использованы для начального заполнения и
// восстановления начального заполнения профилей.
//
// Параметры:
// ОписанияПрофилей	- Массив
//
Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
#Область Описание_профилей_Учет_производства
	ДобавитьПрофильГлавногоДиспетчера(ОписанияПрофилей);
	ДобавитьПрофильМенеджераПроизводства(ОписанияПрофилей);
	ДобавитьПрофильМенеджераПоПереработкеДавальческогоСырья(ОписанияПрофилей);
#КонецОбласти
	
#Область Описание_профилей_Управление_ремонтами
	ДобавитьПрофильОтветственныйЗаВедениеНСИУР(ОписанияПрофилей);
	ДобавитьПрофильЭксплуатационник(ОписанияПрофилей);
	ДобавитьПрофильРемонтник(ОписанияПрофилей);
	ДобавитьПрофильПланировщикРемонтов(ОписанияПрофилей);
#КонецОбласти

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Общие

// Служебная функция. Сделана экспортной для удобства внедренцев.
//
Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля) Экспорт
	
	УправлениеДоступомКА.ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область Учет_производства

Процедура ДобавитьПрофильГлавногоДиспетчера(ОписанияПрофилей)
	
	// Описание для заполнения профиля "Главный диспетчер производства".
	// Профиль "Главный диспетчер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ГлавныйДиспетчер";
	ОписаниеПрофиля.Идентификатор = "90a9321f-a088-47f1-afd4-47b8f052ebc1";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Главный диспетчер производства';
										|en = 'Chief production scheduler'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Роли к элементарным функциям.
	
	УправлениеДоступомКА.ДобавитьРолиЛокальногоДиспетчера(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("УправлениеОчередьюЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ПланированиеГрафикаПроизводства2_2");
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхЛистовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовКлиентовЗаявокНаВозвратТоваровОтКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенияМатериаловВПроизводстве");
	
	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("УтверждениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановыхКалькуляций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазрешенийНаЗаменуМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияВозвратныхОтходов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРаспределенияПрочихЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСписанийМатериаловПоНормативам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКорректировокНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДополнительныеОперацииКорректировкиНазначенияТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНормативовЗатрат");	
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсточниковДанныхПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСценариевПланирования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхУчастков");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОсновныхМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОсновныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеГрафикаЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗначенийПоказателейДляРаспределенияРасходов");

	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасписанияРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаСписаниеПоНормативам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийОбеспеченияМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратНезавершенногоПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияПостатейныхРасходов");
	
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоступностиДляГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыГлавногоДиспетчера");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеРедактированиеСпецификацииСтрокиЗаказа");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиФормированиеЗаказовНаПроизводствоПоПлану");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДиспетчированияГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбеспечениеПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеФормированиеЗаказовМатериаловПоПотребностям");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОформленияПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаИсполнениеПланаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеДереваРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПлановойПотребности");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовГрафикПроизводстваЭтапов");
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("РазделПроизводствоПроизводствоНаСтороне");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаБюджетированиеИПланирование");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации","ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры", "ВначалеВсеРазрешены");
	
	ОписаниеПрофиля.Описание = НСтр("ru = 'Зона ответственности - производственные заказы в совокупности,
											|управление всеми производственными циклами в целом.
											|Под профилем выполняются задачи:
											|1. формирование очереди заказов на производство;
											|2. формирование графика выполнения заказов;
											|3. корректировка производственных этапов и потребностей в ресурсах по заказу;
											|4. формирование графика потребности в ресурсах и анализ обеспечения производства ТМЦ;
											|5. анализ состояния и загрузки оборудования;
											|6. управление глобальными отклонениями,оперативное диспетчирование графика производства;
											|7. формирование ресурсных спецификаций с учетом партий запуска;
											|8. контроль за оформлением заказов по оказанию межцеховых услуг;
											|9. контроль выполнения взаимных требований и претензий подразделений предприятия.';
											|en = 'Area of responsibility – production orders in total,
											|all production cycles management in total.
											|Tasks completed by the account:
											|1. Schedule production order queue
											|2. Schedule order fulfillment
											|3. Adjust production stages and resource demands by orders
											|4. Schedule resource demands and performing inventory fulfillment analysis
											|5. Analyze equipment state and load
											|6. Global variance management, operational production scheduling
											|7. Develop resource BOMs considering starting batches
											|8. Control registration of intershop service orders
											|9. Control fulfillment of mutual requirements and claims of company departments'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильМенеджераПроизводства(ОписанияПрофилей)
	
	// Профиль "Менеджер производства".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПроизводства";
	ОписаниеПрофиля.Идентификатор = "a90d907c-a823-454b-8bc0-5e5f1807c835";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер производства';
										|en = 'Production manager'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Справочники, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинЗадержекВыполненияЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводства");
	
	// Справочники, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБригад");
	
	// Регистры, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыполненныхРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасценокРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТрудозатратПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукцииРегистр");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаВыпускПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРаспоряженийНаСписаниеПоНормативам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоСпецификации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводствоТрудозатраты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПартийПроизводственныхЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковМатериаловИРаботВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихДоходовРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбеспеченияЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаСборку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПооперационногоРасписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииИПолуфабрикатовВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаЭтаповПроизводства2_2");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	// Документы, чтение.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктаВыполненныхВнутреннихРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийПродукцииИМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовМатериаловИзПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводстваБезЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСменныхЗаданий");

	// Документы, добавление.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыпускаПродукции");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыработкиСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеМаршрутныхЛистовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенияМатериаловВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОпераций2_2");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДвиженийПродукцииИМатериалов");
	
	// Обработки, отчеты.
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМенеджераПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовПоВыполнениюМаршрутныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетовОЗагрузкеРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполненияОпераций");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПереработки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПараметрыОбеспеченияПотребностей");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// Регистры, добавление изменение.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекРаспределенияЗатрат");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗначенийПоказателейДляРаспределенияРасходов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекПередачиМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПооперационногоРасписания");
	
	// Формы.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеВыполнениеМаршрутныхЛистов");
	
	// КИ.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Зона ответственности - один или несколько производственных участков.
											|Под профилем выполняются задачи:
											|1. оформление выпуска продукции и работ;
											|2. получение материалов в производстве;
											|3. оформление выработки сотрудников по выполненным работам;
											|4. отражение хода выполнения пооперационного расписания производства.';
											|en = 'Area of responsibility – one or several manufacturing areas.
											|Tasks completed by the account:
											|1. Register product release and works
											|2. Receive materials in production;
											|3. Register employees'' output by performed works
											|4. Record progress of production operation timetable'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильМенеджераПоПереработкеДавальческогоСырья(ОписанияПрофилей)
	
	// Профиль "Менеджер по переработке давальческого сырья".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "МенеджерПоПереработкеДавальческогоСырья";
	ОписаниеПрофиля.Идентификатор = "7387da79-e932-11e2-a832-c86000df10d3";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по переработке давальческого сырья';
										|en = 'Provided material processing officer'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	///////////////////////////////////////////////////////////////////////
	// Базовые права.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваУТ");
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКалендарей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоглашенийСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПартнерам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПроизводстваВПанелиНавигацииНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудованияOffline");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНоменклатурыПартнеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейКалькуляции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриоритетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПричинОтменыЗаказовПоставщикам");
	
	///////////////////////////////////////////////////////////////////////
	// Справочники, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДоговоровКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеСкладскойИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("РегистрацияШтрихкодовНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСделок");
	
	///////////////////////////////////////////////////////////////////////
	// Регистры, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистровПартий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСПоставщиками");	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКОтгрузке");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКРасходу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоваровКОформлениюТаможенныхДеклараций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянийДоставки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСостоянияЗаказовКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовКлиентовЗаявокНаВозврат");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	// Регистры расширенной аналитики управленческого учета
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыручкиОтПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураКонтрагент");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураДоходыРасходы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийНоменклатураНоменклатура");
	
	///////////////////////////////////////////////////////////////////////
	// Документы, чтение.
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитенту");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомиссионеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачМатериаловВПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДвиженийПродукцииИМатериалов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОперацийПоПлатежнойКарте");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовКорректировкиЗадолженности");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовСписанияПоступленияБезналичныхДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПередачиТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовПоПереработкеДавальческогоСырья");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокОбособленногоУчетаЗапасов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийУслугПрочихАктивов"); 
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданийНаПеревозку");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	
	///////////////////////////////////////////////////////////////////////
	// Документы, добавление изменение.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовДавальцам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыкуповВозвратнойТарыКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовДавальцев");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовДавальцам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачДавальцам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийОтДавальцев");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовКорректировкиЗадолженностиЗачетОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПорученийЭкспедиторам");
	ОписаниеПрофиля.Роли.Добавить("ЗачетОплаты");
	
	///////////////////////////////////////////////////////////////////////
	// Обработки, отчеты.
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПроизводстваИзДавальческогоСырья");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыМенеджераПоПродажам");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеВыполненияДокумента");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЭтаповОплатыКлиентом");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовВнутреннегоТовародвижения");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиЖурналДокументовПереработки");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеУправлениеПеремещениемОбособленныхТоваров");
	
	///////////////////////////////////////////////////////////////////////
	// Видимые подсистемы КИ
	
	ОписаниеПрофиля.Роли.Добавить("РазделЗакупки");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажи");
	ОписаниеПрофиля.Роли.Добавить("РазделПродажиПриемВПереработку");
	ОписаниеПрофиля.Роли.Добавить("РазделНормативноСправочнаяИнформация");
	
	///////////////////////////////////////////////////////////////////////
	// Виды доступа
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",									"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыПартнеров",							"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц",						"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыНоменклатуры",						"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации",								"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Склады",									"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен",									"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения",							"ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыОперацийВзаимозачетаЗадолженности", 	"ВначалеВсеРазрешены");
	
	///////////////////////////////////////////////////////////////////////
	// Дополнительные права.
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастройкиПечатиОбъектов");
	ОписаниеПрофиля.Роли.Добавить("СохранениеНастроекПечатиОбъектовПоУмолчанию");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеКурсаВДокументахПродажи");
	
	ОписаниеПрофиля.Роли.Добавить("ОтклонениеОтУсловийПродаж");
	
	///////////////////////////////////////////////////////////////////////
	// Описание поставляемого профиля.
	
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Под профилем выполняются задачи:
					|1. Оформление заказов давальцев;
					|2. Отражения поступлений от давальцев и передач давальцам;
					|3. Оформление отчетов давальцам о выполнении услуг по переработке.';
					|en = 'The following tasks are completed under the profile:
					|1. Registration of material provider orders
					|2. Recording of receipts from material providers and transfers to material providers
					|3. Registration of reports to material providers on provision of the processing services.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#Область Управление_ремонтами

Процедура ДобавитьПрофильОтветственныйЗаВедениеНСИУР(ОписанияПрофилей)

	// Профиль "Ответственный за ведение НСИ управления ремонтами".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеНСИУР";
	ОписаниеПрофиля.Идентификатор = "aa7f3ae5-3b21-498c-bd3a-3d9a005f2eaf";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение НСИ управления ремонтами';
										|en = 'Employee responsible for master data of repair management'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Чтение общей НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	
	// Настройка НСИ управления производством.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхМаршрутныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	
	// Настройка НСИ управления ремонтами
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассовОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоказателейНаработки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУзловОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУстановкиНаработки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщихВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНаработок");
	
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеОбъектовЭксплуатации");
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем выполняются задачи:
		|1. Ведение справочника объектов эксплуатации и ремонтной деятельности
		|2. Разработка и ведение технологической и нормативной документации управления ремонтами
		|3. Анализ существующих, доработка и разработка новых маршрутных карт ремонтных работ
		|4. Расчет производственной мощности оборудования, расходования сырья и материалов.';
		|en = 'The following tasks are performed under the profile:
		|1. Keeping of the ""Facilities"" and  ""Repair activities"" catalogs
		|2. Development and keeping of manufacturing and standard documents of repair management
		|3. Analysis, revision and development of route sheets of repair works
		|4. Calculation of the equipment production capacity, consumption of materials.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильЭксплуатационник(ОписанияПрофилей)
	
	// Профиль "Эксплуатационник".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Эксплуатационник";
	ОписаниеПрофиля.Идентификатор = "3be46362-d57a-494a-a0af-4fcf2d5268c9";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Эксплуатационник';
										|en = 'Operator'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Чтение общей НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	
	// Настройка управления ремонтами
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассовОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоказателейНаработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНаработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегистрацийДефектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНаработкиОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеОбъектовЭксплуатации");
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем выполняются задачи:
		|1. Ведение дефектной ведомости и устранение дефектов
		|2. Регистрация наработок объектов эксплуатации';
		|en = 'The following tasks are performed under the profile:
		|1. Keeping of the defect list and defect elimination
		|2. Registration of the facility running time'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильРемонтник(ОписанияПрофилей)
	
	// Профиль "Ремонтник".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Ремонтник";
	ОписаниеПрофиля.Идентификатор = "a8aa578d-c4f7-49a7-b4b2-0a19e46bce0e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ремонтник';
										|en = 'Repairman'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Чтение общей НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	
	
	// Настройка управления ремонтами
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассовОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоказателейНаработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНаработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРегистрацийДефектов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПрочихОприходованийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнутреннихПотребленийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТранспортныхНакладных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУпаковочныхЛистов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБракаВПроизводстве");
	
	// Оперативное планирование производства.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРесурсныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОсновныхСпецификаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПроизводство2_2");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	
	// Учет производства.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутныхЛистовПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыпускаПродукции");
	
	// Регистры, чтение
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДоступныхТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровНаСкладах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПотреблениеМатериаловИУслугВПроизводстве");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭтаповПроизводства");
	
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаХодРемонтныхМероприятий");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаТоварыСИстекающимиСертификатами");
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем выполняются задачи:
		|1. Ведение дефектной ведомости и устранение дефектов
		|2. Выполнение ремонтных работ';
		|en = 'The following tasks are performed under the profile::
		|1. Keeping of the defect list and defect elimination
		|2. Execution of repair activities'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДобавитьПрофильПланировщикРемонтов(ОписанияПрофилей)
	
	// Профиль "Планировщик ремонтов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПланировщикРемонтов";
	ОписаниеПрофиля.Идентификатор = "21f44963-d50c-4cf5-ba7d-4eea317974a9";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Планировщик ремонтов';
										|en = 'Repair planner'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	// Чтение общей НСИ.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКасс");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначений");
	
	// Настройка управления ремонтами
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеПланированияРемонтныхРабот");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассовОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоказателейНаработки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНаработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаРемонт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихВидовРемонтов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковЗаказовНаВнутреннееПотребление");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДефектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРемонтов");
	
	// Оперативное планирование производства.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБригад");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеГрафикаПроизводства");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДоступностиВидовРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтруктурыРабочихЦентров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидовРаботСотрудников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхУчастков");
	
	// Отчеты
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСостояниеОбъектовЭксплуатации");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаХодРемонтныхМероприятий");
	
	// КИ
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПроизводство");
	
	// Виды доступа.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Подразделения", "ВначалеВсеРазрешены");
	
	// Описание поставляемого профиля.
	ОписаниеПрофиля.Описание = НСтр(
		"ru = 'Под профилем выполняются задачи:
		|1. Разработка программ и календарных графиков ремонтных работ по предприятию и его подразделениям, их корректировка в течение планируемого периода
		|2. Осуществляется руководство разработкой и внедрением нормативов для планирования ремонтной деятельности.';
		|en = 'The following tasks are performed under the profile:
		|1. Development of programs and schedules of repair activities for the company and its departments, their adjustment during the planned period
		|2. Management of development and implementation of standards for planning repair activities.'");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
